[
  {
    "user": "Paul Klein",
    "rating": 1.0,
    "text": "The film also doesn’t feel cinematic, it feels like an extended episode of a CW style science fiction series",
    "date": "2024-07-04"
  },
  {
    "user": "Matt Lynch",
    "rating": null,
    "text": "[SKYLIN3S boasts the] commitment to a vision of sturdy, cheap thrills that's become a hallmark of DTV genre cinema, and this series continues to be one of its brightest stars.",
    "date": "2021-06-05"
  },
  {
    "user": "Laura Potier",
    "rating": null,
    "text": "An engaging, humour-filled action space romp which is sure to delight genre fans.",
    "date": null
  },
  {
    "user": "Dennis Schwartz",
    "rating": null,
    "text": "If the viewer is not a demanding one or in need of surprises, then the competently made conventional sci-fi action pic should be entertaining enough.",
    "date": null
  },
  {
    "user": "Steven Prokopy",
    "rating": null,
    "text": "Skylines knows what its priorities are-action and gooey alien stuff-and leans into them about as hard as it can.",
    "date": null
  },
  {
    "user": "Matt Conway",
    "rating": null,
    "text": "O'Donnell's sincere dedication to his world can only take the formulaic material so far.",
    "date": null
  },
  {
    "user": "Justin Harrison",
    "rating": null,
    "text": "It's a playful, tone-hopping science-fiction actioner whose quiet moments have weight and whose bold moments earn fist pumps.",
    "date": null
  },
  {
    "user": "Tasha Robinson",
    "rating": null,
    "text": "It's perfectly passable low-key science fiction, almost certainly destined for a fast trip to Netflix, where it can be taken up as an amiable evening's viewing.",
    "date": null
  },
  {
    "user": "Mike McGranaghan",
    "rating": null,
    "text": "The movie feels derivative of other sci-fi films, as it cobbles together elements that are reminiscent of Starship Troopers, Pacific Rim, Aliens, and Predator, among others.",
    "date": null
  },
  {
    "user": "Richard Whittaker",
    "rating": null,
    "text": "The aliens look better than ever, Morgan delivers just the right kind of dry-witted action heroics, and Skylines takes the trip to the stars that the franchise has been promising.",
    "date": null
  },
  {
    "user": "Peter Sobczynski",
    "rating": null,
    "text": "Even though the film as a whole is not especially good and not exactly worth watching for anyone other than the Skyline completists who are evidently out there somewhere, it does manage to liven things up from time to time.",
    "date": null
  },
  {
    "user": "Nick Allen",
    "rating": null,
    "text": "O'Donnell's sequel doesn't affirm a grandiose or interesting vision, so much as one that is eagerly ready for hire.",
    "date": null
  },
  {
    "user": "Matt Donato",
    "rating": null,
    "text": "'Skylines' sports all the same noteworthy alien designs and above-average production value, but borrows too heavily from its previous franchise entry and other famed genre sequels.",
    "date": null
  },
  {
    "user": "Mark Dujsik",
    "rating": null,
    "text": "The first sequel may not have set a high bar, but it definitely set a higher bar than this installment can clear.",
    "date": null
  },
  {
    "user": "Frank Swietek",
    "rating": null,
    "text": "A highly derivative, confusing, often risible hodgepodge, made up of bits and pieces from other, better sci-fi movies.",
    "date": null
  },
  {
    "user": "Brian Orndorf",
    "rating": null,
    "text": "Skips an intensive creative journey and simply rehashes \"Aliens,\" lifting plot, personalities, and even the title from the James Cameron masterpiece.",
    "date": null
  },
  {
    "user": "Brent McKnight",
    "rating": null,
    "text": "Wild and ambitious and free-wheeling.",
    "date": null
  },
  {
    "user": "Aaron Neuwirth",
    "rating": null,
    "text": "There's a fun spirit at the core of this Aliens-inspired action flick.",
    "date": null
  },
  {
    "user": "Edward Douglas",
    "rating": null,
    "text": "Coming across like the Riddick sequels ... the first movie of this franchise wasn't even close to as good as Pitch Black was, so why bother?",
    "date": null
  },
  {
    "user": "Josh Bell",
    "rating": null,
    "text": "At this point in the series, virtually nothing is clear, and O'Donnell spends much of Skylin3s working hard to make the narrative more tangled and confusing, when all his audience wants is some more cool fight scenes.",
    "date": null
  }
]