[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It truly makes me sad seeing all these negative reviews. Last I checked this film was supposed to be about Giant monsters, not a massive story. I'm sickened to see it get negative reviews because of this. You critics are terrible at this. go watch paint dry or something. Stop disgracing these master pieces.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great experience with perfect seating.",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Actually a great movie; maybe the one I like best in the whole series since the 2014 movie. The fact the 'Critics' don't like it just goes to show how clueless and out of touch they are in this day and age and really we should just do away with the outdated compromised concept of professional movie critics all together.",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I really liked this movie, the best of the franchise so far, I enjoyed seeing this King Kong and Godzilla duo",
    "date": "2025-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Halfway through I found myself thinking, \"I want a full 90 minute film of just Kong's adventures with zero dialogue or humans.\" That's a testament to how great the action and visual storytelling is, but probably also an indicator of how unnecessary, though not terrible, the human B-plot is. Either way, it's an absolute blast of a Kaiju film.",
    "date": "2025-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "actually I give it a 4 1/2, why there was a unexplained point in the movie which was a duh moment for me and others. Yet on the whole of the movie it was a great story.",
    "date": "2025-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "IT IS GOOD I MEAN KONG HAD NO PLOT AT ALL SO HE DESERVED IT SO GODZILLA HAD PLOT KONG ONLU HAD PLOT FOR ONE MOVIE KONG SKULL ISLAND AND GODZILLA THE OTHER MOVIES ALL TO HIMSELF AND SO KONG NOW DESERVED IT SO IN THE NEW EMPIRE ALSO A NEW VILLIAN IT IS GOOD FOR THE LAST 10 YEARS IN THE MONSTERVERSE FILMS THE ONLY OG VILLIAN WAS FROM 2014  SO EQUAL IS GOOD SO IT IS MODERATE",
    "date": "2025-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Nice special effects, but not as epic as the previous movies and the story didn’t add anything to add to the series lore.",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best Movie I saw in 2024",
    "date": "2025-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Popcorn worthy fun. The actors did what they could to give heft and volume to the titans’ presence. The monsters took centerstage, no surprise. They absolutely leveled Rio and I was engrossed by that battle lol. For sure there were thousands of off-screen deaths. It was a good time but nothing truly heart-wrenching, just big bros into destruction.",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Apart from the 3D, which I think is well done, everything else about this film is rubbish. The human characters don't have much weight in the plot, the animals are overly humanised, and the truth is that the plot seems to go nowhere.",
    "date": "2025-10-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutamente cine, simplemente satisfactorio de ver, me gustó muchísimo que salieran más mounstros y diferentes países que solo Estados Unidos, la verdad me gusto mucho la recomiendo",
    "date": "2025-10-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A Monster Epic with Heart, Heroism, and Pure Cinematic Fun\n\nGodzilla x Kong: The New Empire isn’t just the best MonsterVerse movie yet — it’s a near-perfect blend of spectacular monster action, heartfelt storytelling, and characters you actually care about. This is blockbuster filmmaking at its absolute best.\n\nKong is the emotional core of the film. His journey from lonely warrior to leader and protector is powerful and deeply satisfying, and his connection to the young ape he discovers adds real heart. The mech-arm upgrade is pure cinema — a brilliant mix of character evolution and jaw-dropping spectacle. And holding Godzilla back until the finale was a stroke of genius. His explosive entrance makes the final team-up feel earned and epic.\n\nWhat really elevates this film beyond previous entries is the human cast. Rebecca Hall gives a grounded, heartfelt performance that anchors the story emotionally. Dan Stevens brings energy, humour, and charm, making his character one of the most memorable in the series. Brian Tyree Henry is fantastic once again, adding depth and levity without ever feeling like comic relief. And Kaylee Hottle is outstanding — her bond with Kong is the emotional glue of the entire film, and her presence adds so much humanity to the story. Unlike earlier MonsterVerse movies, these characters matter — they drive the plot, make meaningful choices, and feel like a true part of the adventure.\n\nThe story itself is bigger and bolder than ever. Humans and titans working together to stop Scar King and Shimo gives the film a real sense of purpose, and the stakes feel higher than ever. The action sequences are visually stunning, wildly creative, and choreographed like epic battles from a myth. Yet beneath all the spectacle lies a story about family, trust, and unity — and that’s what makes this movie unforgettable.\n\nThis isn’t just a monster fight movie — it’s a full-on cinematic experience with heart, humour, and heroism. Godzilla x Kong is proof that kaiju films can be thrilling, emotional, and character-driven all at once.",
    "date": "2025-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie has a lot in common with Rampage (2018.) It NEVER takes itself seriously, and is just a fun blockbuster that manages to continuously gets me engaged with all the monster brawls. It’s definitely for a very specific audience, but it’s still a fun time!",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I thought GVK was a 7/10 but this new installment opened my eyes to see how bad the MonsterVerse actually is. Only movies I enjoyed were Godzilla 2014, KOTM, and Skull Island. I had high hopes with this movie, but it was really just. Kongs movie, they should just remove Godzilla from it. And speaking of which, if the next movie is more Kong focused Im completely losing hope on the American Godzilla movies.",
    "date": "2025-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "If you like Kong then this is a movie for you. If you're a Big G fan then prepare for disappointment. Acting is alright best character is trapper by far.",
    "date": "2025-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Seen original characters really opens up the world for more opportunity than just the same cause use that we’ve seen in the past. Don’t give me wrong. I do love the old kaiju but I love the originality to see new stories, new monsters on the big screen with Godzilla and Kong",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "As a die hard Godzilla fan, I very much dislike this movie. First thing, the kaiju don't have any weight when they move and this shatters every inch of immersion you can have. Interestingly, Godzilla 2014 and Godzilla King of the Monsters or something like Minus One or Shin Godzilla nailed that sense of scale, you won't see any of this here though. Not only that, but the characters are pitiful, even for a Godzilla movie, they aren't really interesting, the funny guy is annoying at best and feels really forced. So, Kong was the most interesting part of the movie, the strongest part of the movie, but it still doesn't nail that and it's really dumb to see Suko being used as a weapon. Curiously, WETA did a good work with the designs and the Hollow Earth, but it pains me to see such good artists under the absolute uncreative direction mess of Adam Wingard and not someone like Peter Jackson from the awesome King Kong 2005. Ugh, the movie is a boring CGI fest where nothing wver happens, the aspect ratio bothers me and it got way too much blur and bright lights sometimes. You could argue Godzilla movies were always that dumb thus it's fine, but even some of those Showa movies got a way more competent and funny plot than this one, they're also way shorter and not such a hollywoodian slog like this. I don't think Adam Wingard, author of the awful Netflix's Death Note, deserves to partake in the Monsterverse and he should leave as quickly as possible. Please, don't let him ever come close to any japanese media adaptation again. It's sad to see the Monsterverse in this state, meanwhile the japanese side of Godzilla is thriving with Shin, Singular Point and Minus One - all of them earned prizes due to being competent.",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Movie is fun but story is incredibly weak and brings it down",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It’s cool to get to see Godzilla and Kong back together again. but this should’ve really just been a King Kong movie. and they shouldn’t just thrown Godzilla in at the last second.",
    "date": "2025-08-20"
  }
]