[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Filme mais ou menos, o roteiro é fraco, as cenas são mais ou menos, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A nice movie to watch, not my favourite but it is entertaining.",
    "date": "2025-03-31"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "More proof thar famous people have bills to pay! Some of the worst acting I have ever seen in my life.",
    "date": "2025-01-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Our too-serious world requires bright, colourful ‘60’s style sets; time out from cynical sophistication and sarcasm. Sentimentality and an overtly emotional soundtrack are okay. If you need 24/7 drama, watch a war, Dr Zhivago or Eastern European art house cinema (they don’t do humour). You are permitted to eat popcorn and pizza once in a while and relax with Hollywood’s comedic actors being intentionally silly.",
    "date": "2024-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Una de las peores películas que he visto en mi vida. No puedo creer que es tan perfectamente mala, el cast obvio es bueno y es un desperdicio de dinero, tiempo y trabajo, está muy mal escrita, mal editada y no tiene nada de sentido. No lo digo ofensivamente, solo es una descripción honesta, me gustaría darle un 0 estrellas pero no sé puede.",
    "date": "2024-05-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I want that 1hour and 58 minutes of my life back",
    "date": "2024-05-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Combining like 10 different storylines that are unrelated. Single dumbest movie I've had the displeasure of watching. Littered with cliche bs stereotypes that would only be humorous to someone with a mental deficit, as the scriptwriters clearly were.",
    "date": "2024-01-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A surprising lack of effort on display here. Think I'll skip Mother's Day this year.",
    "date": "2023-12-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "a lot of GREAT actors but this movie SUCKED!  i did like Jennifer Anniston, she's a good actress but underrated, i think AND-what's with that hairdo on the BEAUTIFUL Julia Roberts?  and finally-seems they tried to put one of each category of people on the planet",
    "date": "2023-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It was ok overall with some touching family moments about mothers, but a cast for comedy like this, I was expecting a bit more.",
    "date": "2023-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I think this was a great movie, I haven't laughed this hard in a long time.",
    "date": "2021-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "it's another mediocre movie packed with celebs trying to tie too many storylines together, but i laughed quite a bit. it's a good watch if you're in the mood for something light.",
    "date": "2021-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "So disappointing. One would think this cast must have owed the writer of a this dreadful film a big favor! I love just about every actor in this movie, but I've never witnessed such a massive bomb. It was offensive, many racist comments, terrible punch lines and all around horrible.",
    "date": "2021-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Every now and then you watch a movie that is panned by critics that you personally enjoy. I really liked Mother's Day. I didn't go into it with a red pen handy ready to draw Xs on everything I could find to gripe about but just enjoyed it for the purpose it was made - to celebrate Mother's Day. We all have mothers we should honor and care for. This movie wasn't half as bad as the reviews portray it to be as.  Jack Whitehall stole hearts in his stand up routine with his adorable baby, caught in a situation where his girlfriend was trying to find her real mom and having to hold his baby while doing his stand up routine was touching and human. I could have done without Jennifer Roberts and that odd wig she was wearing, her character was the most 1 dimensional and under developed. I think the movie could have used with more tie-ins between the different storylines to add a sense of cohesion, and I would have preferred more on screen chemistry between Jennifer Aniston &  Jason Sudeikis. The end of the movie was less than satisfactory for where they ended up - definitely would have preferred to see that relationship develop more. But all in all? I allowed myself to feel good watching a feel good movie, and after it ended guess what? I felt good. Sometimes it's better to accept things as they are and enjoy them for what that is, rather than attempting to place our own narratives that steal joy from living life away. I laughed and was moved by many scenes however imperfectly executed in Mother's Day and it reminded me to look out for my mom more.",
    "date": "2021-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I was only happy to see Kate Hudson, if I'm totally honest. She is so beautiful and such a capable comedic actress (just like her mom), it pains me to see her at the bottom of Gary Marshall's barrel. He came up with the story but had three other people write it. And what did they write? multiple storylines and scenarios that are made up of people who are loosely connected in some way. Love Actually kind of invented it and also put the nail in the coffin to the notion that we need something similar ever again. But Mother's day is just like Valentines day, New Years eve...it's a different breed of film, and that breed is a mutt.",
    "date": "2021-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I wanted this to be better. Some laugh out loud moments but the comedy is mostly either lame or outright offensive. Did the stars read the script before they agreed to appeared in it?!",
    "date": "2021-03-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Alright viewing. Nothing worth remembering or revisiting though.\n\n'Mother's Day' has a good cast list. Jennifer Aniston is always a pleasant watch, as she is here as Sandy. Kate Hudson, Julia Roberts and Jason Sudeikis also feature. I liked all three of them, they and Aniston are certainly the strongest parts of the film.\n\nGarry Marshall staple Héctor Elizondo also appears, he is as likeable as he is in, e.g., 'The Princess Diaries'. Jack Whitehall and Britt Robertson are together in this, I found Whitehall a bit wooden to be honest. Elsewhere, they somehow make Margo Martindale unlikeable - I've only seen her in sweet roles before, but her Florence (and Robert Pine's Earl) is rather detestable. That whole 'arc' is poorly written.\n\nNot as cheesy as predicted, even if it still does feature a fair amount of cheddar. The main cast make this an OK watch, if not necessarily a good one.",
    "date": "2021-03-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A great lighthearted movie! Fun and cute:)",
    "date": "2020-12-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Mother's Day is a good movie to sleep in, it is not at all charismatic and has some forced performances. Where was my head when I saw this movie?",
    "date": "2020-12-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "without salt, horrible, he doesn't do very well with performances or script, he is bad but not so much.",
    "date": "2020-11-20"
  }
]