[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The movie is watchable , people are just hating cus they hate addison rae shes not that bad.",
    "date": "2025-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Wow Addison Rae’s Acting was so much worse than I thought.",
    "date": "2025-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The only actor good in this movie was Tanner.",
    "date": "2025-05-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved this movie although I’ve never seen the original she’s all that but this movie was amazing there were a few scenes that I was not fond of and I am usually very tough on movies like this and only like a few rom coms they chose great actors for this. I thought it was kinda weird seeing Addison Rae be in a movie but great overall.",
    "date": "2025-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "He's All that was knot  as good as Shes all that and I was excited to see it. First off they should have found A better actress to play Rachel  Leaf Cooks daughter knot some Social influenceer. Playing herself,  the story line  was flat. Also Rachel Leaf cook was knot playing her original character.",
    "date": "2025-02-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A genuine classic, thrilling, gripping and darn right entertaining. A tale as long as time with twists and turns at every angle. The horsey at the end just encapsulates the theme of the movie.",
    "date": "2024-12-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Its worse than its original counterpart. Modern twists have a bad rap for a reason.",
    "date": "2024-12-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "So go I watched this with my 61 year old Nan and she loved it same with me I love it to can't wait for part 2",
    "date": "2024-12-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Based on the film called She's All That with Freddie Prinze Jr. which I haven't watched, we have a gender swapped remake made by Netflix and Miramax called He's All That, another chick flick from another mother in which I know I'm gonna be in for another torture. In this remake of this decade, a TikTok influencer named Padgett Sawyer is in her final year of high school who lives with her divorced mother who is a nurse. She pretends to live in an upscale condo in order to hide her real living conditions from her followers and sponsors, fearing they wouldn't like her anymore. However, one day, she discovers that her boyfriend who is an influencer and an aspiring hip hop artist Jordan Van Draanen, is cheating on her with a backup dancer. Then she finds herself humiliated when a live stream of her outburst results in her loss of followers and sponsorship deals because the camera was still recording when it happened. To redeem herself, she must accept a bet to turn the school's least popular young man, Cameron Kweller, an antisocial photography student, into prom king. Here I again on my own to suffer through another god-awful chick flick which I expected to be s**t before watching it. I watched it last night and this morning I nearly had the urge to torture myself to watch this s**t again but no because I suffer through this one enough. Whenever I watch something that is awful for the first time, once is enough, and if I feel like I want to watch something again for a second time and something s**t, twice will be enough as well just in case I have to urge to review it to make it final. What's really irritating for me is that the character, Alden Pierce, who is Padgett's friend at first when there's a birthday party for Alden which is Great Gatsby-themed and then next day it all turns around when she become enemies with Padgett turning on her revealing her plan to become a prom queen alongside Jordan and her true colors as she is responsible for intentionally live-streaming Padgett's outburst in the first place. Alden, you are an absolute motherwhoring ***t. What's really surprising to me is that Matthew Lillard makes an appearance in this movie. That's right, Matthew Lillard makes an appearance as a principal. \"Surprise, Sidney.\" Wow. As it is and as a Netflix chick flick, this is the absolute worst film I have ever seen period and I felt for certain that this is probably not the most memorable review I have ever done considering that Bratz the movie is the one I ranted on last year which my rant more funnier and memorable in any way including the others I've ranted on and considering that I've seen worse movies than this, the last thing I wanna say to them is they can go f**k themselves and before they do that, they can go f**k giant b*****ds and kiss my hairy pucker. This s**t p***es me off! Netflix, or should I say Twatflix, go f**k yourselves! You made The Kissing Booth crap, you made Sierra Burgess is a Loser crap and now you made this movie, He's All That even more crap and now you all a bunch of twatty arsed, c**ksucking, motherwhoring, dog humping, tit f**king, expensive handjobbing, lip moistening pussy licking, pieces of dog s**t! F**k you! Whew, that feels so good to get it out of my system. Now as I nearly got the urge to watch it again, I feel like I don't have to anymore, I seen enough. Thank God for that! I just wish I wanna see some good chick flicks just like Pretty in Pink and Crossroads. I don't think I ever come across one of them by Twatflix because all they can think about is money. Money, money, money, money, money. Oh dear lord almighty! Out of all the films I've seen, this is the worst, the irritatingness and the whoringness. Okay. Scooby Dooby Doo. ┌∩┐(◣_◢)┌∩┐",
    "date": "2024-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "He's All That - 6/10. Let me preface this review by saying that She's All That is one of my favourite 90s teen romcoms of all time. It captured the zeitgeist of the 90s so well, along with playing to and creating the teen romcom format. So, with this remake, what I thought would be a disaster, ends up being a not so bad watch. Using the same formula as the original, the movie switches the makeover to a “loser” guy, and changes the bets reasoning a little too. With some questionable dramatic acting, the movie gets its strength from actually doing a fairly good job of playing into the dynamic the lead pair have romantically, and the silliness that comes with doing things for social media. Addison Rae is not a trained actress and it shows. But, she surprisingly does an okay job, considering this is her first big role. Its when she shares screen time with Tanner Buchanan that she really shows her possible acting abilities. Its nice to see the original star Rachael Leigh Cook in an extended role, and Matthew Lillard in a role as well. The other supporting characters are actually well performed, which helps elevate the movie from mediocrity. In terms of recent remakes, this isn’t the worst but certainly isn’t the best. Its a passable watch!",
    "date": "2024-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I actually like the movie. There were a lot of easter eggs for those of us who watched She's All That a lot. I noticed a bunch of them right away. For those who didn't like the movie, maybe you should watch She's All That and then watch He's All That and maybe you get it. Either way I liked the movie and I'm sticking to that story. LOL. BTW did you notice the cameo by Matthew Lillard??? Unless you've seen She's All That....you will know he was in that one too. By the way \"Kiss Me\" is from She's All That and that's why Padgett's mom tells her that she's heard it before. LOL.",
    "date": "2024-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best romance comedy movie",
    "date": "2024-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie was definitely relevant in an an age where everyone is trying to be someone else. The so called digital age where everyone posts on social media and compares themselves to others, pagents prom queen speech sends a very important message. Be yourself and be original I thought it needed to be said. The chemistry between the two leads was especially good. The actress playing pageant was especially good and the principal of the high school even though his part in the movie was small. The actress playing Alden  played a self entitled brat very well and was very convincing. Unfortunately not everyone’s acting was up to par especially the popular guy ( van der halen) and his mates weren’t convincing at all. Overall it not a blockbuster but it’s a feel good movie. If you want to watch a feel good movie that has a great message this is for you. I loved the fact that Cameron loved pagent for her and not what she looked like, her popularity or her social media followers. It what true love looks like, when someone loves you for who you really are sadly missing from todays world. I was very surprised by this especially in a movie made in 2021.  She’s all that was far more superficial and didn’t really have a good message.",
    "date": "2024-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "One word to describe this movie, CRINGE.",
    "date": "2024-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Probably the worst movie I've seen in the last 5 years.",
    "date": "2024-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The acting was terrible!! Also Kourtney k sounded like she was reading a diary. Would not recommend watching unless you’re under 12 years old.",
    "date": "2024-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "NO JUST NO...........",
    "date": "2024-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The acting is asscheek, the plot is stupid, and the stars have a heavy lack of chemistry. Unless you enjoy cringe don't watch this.",
    "date": "2024-03-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "silly movie for 14yo girls who admire the stupid tiktokers. I think this is the right moment for Kim Jong Un to puss the nuclear button",
    "date": "2024-03-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie is what helped me lose my girlfriend and lose my kids. 3 prsta srbija nije čvrsta movie",
    "date": "2024-03-09"
  }
]