[
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I liked his muscles. That made the movie for me.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Fantastic film ft the most humble kind big buff squared circle super star THE John Cena. I would change 1 thing. Not once did they dramatically say “and I’m a marine” missed opportunity to make it an absolutely five star banger of a film.",
    "date": "2025-09-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I just watched the movie. I don’t get the hate. I loved it like classic from 2000s",
    "date": "2025-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Seen an a recommendation of nutso action scenes and Cena goofiness, and didn't disappoint in those aspects. Enjoyable for schlock lovers. Worth seeing as a late night feature.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The Marine, starring John Cena as John Triton, is an action thriller about a marine who returns home from active duty and takes a job as a security agent. But his peaceful life is shattered when his wife, Kate Triton (played by Kelly Carlson), is abducted by a group of criminals, forcing him to tap back into his military instincts to track them down and save her.\n\nThe film has a lot of problems—especially being a WWE Studios production. WWE movies tend to lack polish, often feeling cheaply made or missing the depth and quality of traditional theatrical releases.\n\nBut I will say that, even with its flaws, I did enjoy it. It was fun enough to keep me entertained and honestly something I wouldn’t mind rewatching down the line. It’s actually a decent action film that follows John Cena pretty closely and lets him shine in a way that fits who he is. This was one of his early roles, so the director really leaned into letting the audience connect with both Triton and his wife. Unlike some of Cena’s later movies where it feels like he’s being overbooked or thrown into scenes just because of his name, this film actually gave him room to build the character.\n\nIt has its moments—some over-the-top action, a few cheesy lines, but enough tension and pacing to carry it through. I definitely recommend checking it out. It’s not a masterpiece by any means, but it’s far from a bad movie.",
    "date": "2025-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A fun and over-the-top action movie.",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "1 hour and 31 minutes of action, extended version of movie also available!!!!!!!!!!!!!!!!!! Rated PG-13 for Sensuality, Language and Sequences of Violent Action!!!!!!!!!!!!!!! Starring John Cena!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $18,800,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Filme: The Marine – Busca Explosiva\t\t\t\t \nElenco: @johncena @therealkellycarlson @ripfighter @imabigail58 @brotherparker5919 @manubennett \nModelo: #ação\nDuração: 2h\tAno: 2006\nMinha opinião: Este é o 1º filme de John Cena em 2006, onde seu papel faz de um cara sério como no filme 12 Rounds 2009. Hoje em seus filmes sempre tem seu papel cômico. Cena aqui sua interpretação é ao estilo Arnold nos seus primeiros, quero dizer é a mesma fisionomia do inicio ao fim, onde concetra tudo na ação, correria e porradaria. Um filme que gostei do enredo. Onde Cena volta para sua casa e para sua esposa Kate (Carlson). E temos em paralelo Rome (Patrick), Angela (Bianca), Morgan (Parker),.. e sua quadrilha que roubaram dimantes. E nesta fuga pegam Kate e acabam usando como refém. E agora Cena fará de tudo para resgata-la. Aí agora ação até o fim. E temos Robert Patrick que é o vilão. E existe toda uma perseguição na mata, nos rios,..... Desde esta época Cena me chamou atenção e depois de 12 Rounds gostei mais ainda. Porem depois ele deu uma sumida e agora em toda esquina vemos ele em um filme. \nRoteiro e enredo boa.\nVale apena assistir? sim\nNota: 7",
    "date": "2024-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "John Cena has more scenes of him running than he does actual lines. So action packed that there wasn’t room for actual good dialogue and plot.",
    "date": "2024-02-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "John Cena has more scenes of him running than he does actual lines. So action packed that there wasn't room for actual good dialogue and plot.",
    "date": "2024-02-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Jon Cena's 'The Marine' offers a dose of action and thrills but falls short in creating a compelling connection to the characters. While Cena's performance and the action sequences deliver entertainment, the film struggles to immerse the audience in the characters' journey, leaving it feeling more like a showcase of stunts rather than an engaging narrative. It's akin to a thrilling stunt show, providing moments of excitement but lacking the depth needed to truly captivate the audience. Worth a watch for action enthusiasts, but don't expect a deep emotional investment in the story.",
    "date": "2024-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Stupid and way too cartoony, and I'm saying as a disadvantage.  All too stupid and the PG-13 makes things dumber",
    "date": "2023-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "An enjoyable predictable dum action film that is a nice call back to silly action movies of the 1980's and 1990's.",
    "date": "2023-06-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "75/100 - these were the films in 2006. gritty. decent acting considering he was more of a wrestler at this time than an actor. action packed. some humor thrown in. its sad its rated so poorly by the \"critics\"",
    "date": "2023-03-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2022-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Not original or romantic, LOLings!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2022-04-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This should never have been made. Poor Cena...he actually did a good job, but the movie was presented as a joke with comical music and lines often from the other actors that just killed what could have been a decent movie. Spend time with your family instead of watching this.",
    "date": "2022-04-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The perfect movie to watch after a hard day of work when you just want action and entertainment. General rule of thumb for Rotten Tomatoes is that if the audience score is much higher than the critic's score, you'll likely enjoy the movie if you are a pleb like me.",
    "date": "2022-03-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Fun and useful , i like it",
    "date": "2021-03-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The Marine has to possibly be one of the worst action films I have ever seen. The whole movie was cheezy. Those action scenes were worse than mediocre. That chase scene in the police car was so bad I laughed so hard at it. And how does one simply survive like 5 explosions? Like, really? Horrible movie 1.5/5.",
    "date": "2020-09-12"
  }
]