[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "“Unhinged” is a simple yet satisfying thriller that by the end turns into full-on maniacal horror.",
    "date": "2025-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This trashy anxiety-fest completely delivers upon what little it promises.",
    "date": "2025-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The film's gaze skillfully mixes contextual projection... and knows how to avoid demagoguery no matter how well it embraces the spectacle.",
    "date": "2025-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Hope I never meet anybody like that on the road ….Dang. Thrilling movie to watch.",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Russel Crowe is the best actor ever!  He has me scared and i adore him",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Boring and worest possible ending. The plottwists are just dumb and i hated every single character exept the lawyer guy (if he did not cheat on his wife) and the police guy, no wait he did a fkn bad job! I really hate every character delete ts shi 🙏🥀💀💩",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Unhinged's story may seem simple and straightforward, but this raucous road rage thriller still terrifies thanks to Russell Crowe's chilling commitment in the lead role.",
    "date": "2025-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Screenwriter Carl Ellsworth and director Derrick Borte leave you gasping in a brutal thriller with a cynical view of the rage festering in all of us.",
    "date": "2025-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie…surprised that this kind of stuff does not happen more in the U.S because of our guy know cent ric family court system and the grape, abuse, hatred of men and fathers! And the racketeering and extortion men, ex-husbands, fathers are forced to endure…read “the boy crisis” Dr. Warren Farrell for more info!",
    "date": "2025-04-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Though the plot is definitely nonsensical, it gets its message across, uncomfortable and chilling as it might be.",
    "date": "2025-04-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The film felt completely absurd and disconnected from reality. I found myself increasingly frustrated as the plot unfolded, with numerous events occurring that lacked coherence. Additionally, the characters' actions seemed irrelevant, making it difficult to engage with the story.",
    "date": "2025-04-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movies has so many holes cant believe i sat through the whole thing..",
    "date": "2025-04-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Unhinged was truly that, a story of an unhinged maniac. Russell Crowe plays a bloodthirsty killer having a REALLY bad week. Nothing unlike other cat and mouse type crime movies Unhinged mostly delivers on its basic implied promises. Car chases, intense action, and nail biting moments, this movie ruly leaves you on the edge of your seat and gets your heart pumping. Crowe, as always plays his role excellently as he creates a believable character for you. The other acting throughout the film isn't the greatest but it's good enough to keep you immersed. The movie doesn't try and be more than it isn't and that's why I didn't dislike the film. It delivers on the genre's promise and will be a nice action movie night option.",
    "date": "2025-03-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Well shot and acted",
    "date": "2025-03-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Russell Crowe always gets into his character and you can feel any emotion the script gives. But there was NO REAL CONNECTION to the character by Caren. No emotion that showed this character’s true fear. All I could sense was “huh.. what you mean? Omgosh, really. Stop.” Russell Crowe killed his role.🎭",
    "date": "2025-03-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "What a waste on Russell to take a role for this crap.  Lack of intelligent from the female character really get frustrated to watch till the end.  And it is lawless city, what kind of message this movie wanna say?",
    "date": "2025-03-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Bloody awful. Completely unbelievable. Scriptwriter has no concept of how real people behave.  An excuse for gratuitous violence.",
    "date": "2025-03-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "So stupid! Save yourself the hour and a half. So many holes in the plot. So many stupid decisions. It did have me screaming at the screen and full of anxiety. Very unrealistic and lost the point it was trying to make by gratuitous crashes, stabbing, and violence.",
    "date": "2025-03-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Damn I didn't expect it to be that good ✌🏾",
    "date": "2025-03-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Russell Crowe is a phenomenal actor who plays the masterful role of a lunatic seeking retrobution and taking matters into his own hands. The prey is played by Caren who did a phenomenal job of cat and mouse.\n\nThis 'what would you do' scenario film will have you on the edge of your seat in suspense till the very end. Bravo bravo bravo. The film did not hold back on any of the brutal reality of a man left unhinged.",
    "date": "2025-03-08"
  }
]