[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Can’t even finish it! Halfway through and the bad acting is insufferable. Bruce is his usual but everyone around him…. Need improvement! And the storyline is a flimsy and old as it gets! Nothing to see here.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 01 hour, 36 minutes, and 11 seconds!!!!!!!!!!!!!!!!!!!!!! Ages 17 and older!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Starring Bruce Willis!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Pésima película, pésimo guion, pésimas actuaciones, desastrosa dirección.   La música de fondo es interminable, si no es música country es música incidental pero no para ni un segundo, el director definitivamente no sabe cuándo silenciarla.",
    "date": "2025-04-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Predictable. Not an enjoyable watch.",
    "date": "2025-02-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I will not hold Bruce Willis' cognitive decline or drive to work as long as he could against him, but I would advise fans who have not seen this yet to skip this and rewatch any of his great movies instead. \nAshley Greene is the only decent performance on the movie, and every other aspect of the filmmaking from writing to direction to special effects to stunts is sub-par.",
    "date": "2024-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Its so horrible I had to do a little research and it sounds like it was made when Bruce Willis was already having major issues from dementia. Many of the crew on this film and others made by the same production company (and featured Willis) have said that Bruce seemed confused as to why he was there and had to have an earpiece so they could feed him his lines. Once you learn that, its understandable why there is always a slight delay in his responses when speaking to the other characters and his reaction are a little \"off\". Like most of the other movies from 2021-2023, they were done by the same production company and Bruce was paid $2 million for 2 days worth of filming which equates to about 15-30 minutes of screen time. Then they use his image to promote the film. Kinda sad when you realize that he was genuinely confused throughout the majority of the process - regardless of how much he made. This movie is even more difficult to watch when you realize all of that.",
    "date": "2024-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "There are so few movies that are so bad they are good but this is one of them. Unintentionally (or maybe intentionally?) hilarious, the plot and writing seems to come from a bored first grader.",
    "date": "2024-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Bruce retire, you said like nothing in this one and its painful to watch so boring and not the same as before,  this was a terrible movie with you in it.... get our advice and retire you are just done , did many movies we liked and it should be enough too.",
    "date": "2024-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Top 3 worst movie I've ever watched. Bruce looks sad and confused  probably thinking \"why the hell did I agree to this\". Do not waste your life on this.",
    "date": "2024-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "We couldn't even come close to finishing it ... so bad :(",
    "date": "2024-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The people who wrote, directed and acted in this movie should be embarrassed. This was the most poorly written movie of this decade. Poor Bruce for having this on his resume. It was clear this was the first movie for the rest of the actors (except Ashley) as the acting was subpar, and that’s being generous.",
    "date": "2024-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The reviews are infinitely better than the movie. As someone else said, this “movie” is so awful that I signed up to Rotten Tomatoes to try to save people from watching this. It’s bad. Really, really bad. I’ve seen bad movies that were TRYING to be bad, look like Gone with the Wind after this mess. Did the director lose a bet or something?? If I gave my dog a camera, he’d do a better job, and he ain’t that smart a dog. I envy those reviewers that worked out how to give 0.5 stars. I wish they allowed zero stars. Does Bruce Willis owe him money? How did this car crash happen? I’d strongly advise the actors not to acknowledge their roles in this, unless they were silently protesting and actually wanting to give up acting. The 5 year old who wrote the script should be sent back to kindergarten. Unacceptable from him! That’s it from me. I can’t think of anything worse to say and I’m falling asleep. Imagine staying awake for this pile of poop and THEN knocking out. Gonna recommend it to my ex-wife. At least then it’ll give me a wee bit of joy.",
    "date": "2024-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It's an awful movie, it isn't worth watching. It's so bad that it doesn't seem like a mistake but a real purpose to make this one the worst movie.",
    "date": "2024-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Lackluster performances and lost script",
    "date": "2024-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I will start off by saying I have never written a movie review before, with that said, I just wasted an hour and 30 mins of my life watching this movie that I felt compelled to write a review. This movie had some of the worst acting, editing, graphics, and story lines I’ve ever seen. It’s worse than a B movie which is surprising because Bruce Willis was in it so we thought it would be worth a watch…but the “southern accents” and honestly complete movie was unrealistic. It was so hard to watch that we have seen some pretty B and D class movies, but this one here takes the cake…..unless you want roll your eyes throughout the movie, I dont recommend it….",
    "date": "2024-06-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It's really bad",
    "date": "2024-05-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Very poor acting and story line...one of the worse Bruce Willis movies ...don't waste your time watching it...",
    "date": "2024-02-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Wrong Place wrong film.",
    "date": "2024-02-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "And another crappy, completely idiotic Bruce Willis movie. It starts out better than most of the shitty ones he did over the last few years, but soon, and once again, like a Bruce Willis guarantee, it becomes so moronic that you skip more and more scenes till you definitely give up and change channels. 1/10 points.",
    "date": "2023-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Is a very bad movie. A lot insolities things.",
    "date": "2023-05-22"
  }
]