[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I really love this movie and it really recaptured the magic of Zag Heroez and it truly took me back to the origins of Miraculous tales of Ladybug and cat noir",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Love over evil in different story. Cute characters and awesome dialogues at many place.\n\nAlthough this lacks much storyline and most of the story is in the form of songs. Which is good at some place and boredom at other.\n\nGraphics are average and could have been better. Ending could have been much better don't know how ladybug found adrien is Cat noir.?",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Un film bon rien de bon que des comédies musicales rien de plus et en plus c'est des chansons qui cassent les oreilles",
    "date": "2025-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "IT IS A BAD MOVIE WITH A BAD PLOT!",
    "date": "2025-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Genuinely hard to watch. Frustrating for both fans and newcomers.",
    "date": "2025-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "(From sister, with consent to post) \n\nI LOVE THIS MOVIE IDK WHY PEOPLE DON’T LIKE IT’S So good I LOVE THE SONGS AND THE ANIMATION ❤️",
    "date": "2025-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This Movie is PERFECT!!",
    "date": "2025-06-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "As an old fan of the Miraculous Ladybug since season 1 of the animation series, I am grateful that this movie released. The plot was basically perfect for me, the music was spot on and the entire story is really straight forward. The attention to details was excellent, giving credits to animation series characters appeared in later seasons. All in all, this is basically my dream plot come true and became one of my favourite movies, great work on the animators and music production. I look forward to more interesting attempts on Miraculous Ladybug! (Maybe 2D animation? As planned before 3D animation of season 1?)",
    "date": "2025-05-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Who's idea was it to make it a musical, and why is Marinette 10x clumsier than in the series? They made her clumsiness too over the top and master Fu way too insane sounding. Never thought I'd have to sit through Hawkmoth singing but here we are🤮🤢",
    "date": "2024-12-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Pra mim é um grande tanto faz, ta longe de ser ruim, mas longe de ser um grande filme também",
    "date": "2024-12-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Actually the movie is soooo bad I hated the romantic scenes also they are so cringy moment and this is a movie about heroes right, so why I feel like that it's such as a Disney movie",
    "date": "2024-12-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "ruim esse filme é diferente da serie muita musica o filme muda a historia da serie a mariette se apaixona pelo adrien no primeiro segundo que ve ele no filme e  na serie eles passão um episodio inteiro pra no final ter uma cena romatica e eles se apaixonao na seria se passa 5 temporadas e o gabriel rouba os miraculous da marintte e faz o pedido a mulher renasce e ele morre mais no filme ele ve que seu o cat noir é seu filho e se entrega na serie a unica vez que ele descobriu que seu filho era o adrien o mundo voltou no tempo e no final ele nao sabia que o filho dele era o cat noir esse filme tinha tudo pra ser bom mas é muito ruim so é fa desse filme quem nao assistiu a serie esse filme deve ser outro universo alternativo igual aos varios universos mostrado no filme miraculous world paris que esse sim é um filme de verdade.\nnao recomendo esse filme pra quem quer começar a assistir miraculous so indico se voce for fa e ja ter  visto toda a serie.\ntodos os outros filmes de miraculous sao melhores.\na unica coisa boa do filme e a animaçao e os creditos de resto esse filme é ruim.\nse esse filme ja é ruim lembre se que os produtores querem fazer o filme 2 e 3 desse negocio",
    "date": "2024-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was definitely made with the fans in mind above all, but those who haven't seen the series can still enjoy it. It's fun and delightful with emotional moment that all can enjoy. The songs are bops and/or emotionally compelling, very well done with beautiful voices. Truly a lovable film with the most beautiful top notch animation that puts other bigger studios to shame.",
    "date": "2024-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It is terrible and very much offensive to every die hard fan... And who's bright idea was it to make it into a musical?",
    "date": "2024-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It's not a bad kids movie but it's not like this is better than any other super hero movie. (And that's coming from someone who loves the Miraculous Ladybug series) Also it generally sticks close to the original series but there's parts where it doesn't, but it not too crucial to the story. And the weird thing that stood out to me is the voice actor of Ladybug. She sounds close enough to the original but when she sings she sounds almost completely different and like a grown adult. And the last thing is the characters of Ladybug and Cat Noir don't completely stick true to the original characters. Theres just little things that have never been part of who they are as a character in the series.",
    "date": "2024-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I like it when they save the day",
    "date": "2024-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "As a fan of the original show, I can say that this movie is an absolute insult to it. I, like many people, had been waiting for this musical since the day it was announced, and ended up being terribly disappointed.\nThe animation may be pleasing to the eye, smooth and dynamic, but the models of the characters are a disaster. They wanted to make the main characters similar in appearance to their real age, but made them look like absolute children. The rest of the models looked slightly better, but it didn't save the movie at all.\nThe music was good at times, but by the end of the movie I couldn't remember a single song. I like musicals, but this... Not only did they change the voice actress for Marinette during the songs, which was noticeable, but I also had to wait each of these completely uncatchy songs to end every time...\nThe plot itself is incredibly boring, I almost fell asleep several times. Why did a huge part of the fandom fall in love with this musical? I can't imagine, but I will assume that the reason for this is the bright wrapper and its pleasant rustle, which are good at hiding the true face of this work from some people.\nThe original show also has its problems, but this movie did the unbelievable - it became worse than some of the fillers in the series. For this achievement I will give it half a star.",
    "date": "2024-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Some of the songs were good, but not all of them. However, there are a bit too many songs for my liking. The characters of the movie act different ly from the show, making it slightly confusing. The movie was straightforward and face-paced. It was as if the entire plot is clamoured together.",
    "date": "2024-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie had too much singing the voice actor of ladybug isn't the same person that sings. My daughter got so bored of it she decided to watch my little pony....",
    "date": "2024-06-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Somgs were decent, but the Marrinett's sining voice was not a good match for her speaking voice. It sounded good, but was a little jaring each time it shifted to singing.\nThe plot felt very compressed with little time for the characters to explore themselves, their roles, their powers, or the \"lore\" of the how everything worked. That always seems to be an issue with movies that rely on a montage of many battles to move the plot forward. But both the beginning and ending were very engaging and moving.\n\nOverall it was compentantly done and enjoyable.",
    "date": "2024-05-20"
  }
]