[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This film is about a selfish girl who makes everyone around her feel like they live on a roller coaster. \nThe cutest character (and performer) is Taylor Perez! He makes the film worth watching, even though the girl is so annoying, LOL",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "What started out as a funny romantic comedy with the first movie, turned into a depressing romance trilogy that failed on so many levels.",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The slowest film ever like we didn’t need a sad song playing over a montage every five minutes to pad out the run time.",
    "date": "2025-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Not amazing but I am still a sucker for cinge romance",
    "date": "2025-04-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "If your a fun of kissing booth 1&2 then  this one will definitely disappoint you wasn't that good didn't have much comedy in than the other 2.",
    "date": "2025-03-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It is about some teenagers who have their summer house but they are going to sell it since they will make a new construction, however it is a sequel, in my opinion it was no longer necessary to make another movie of this one since it was unnecessary, the ending was not great , it made me feel like I wasted my time watching something that no longer made sense, continued.",
    "date": "2024-03-04"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Replaying the same nonesense mistakes as the second movie in the laziest way ever. \nThe general energy is nothing and so boring. Terrible.",
    "date": "2024-01-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Plot comes and goes. There isn't satisfying  conclusion.",
    "date": "2023-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Es raro osea siendo claros me gusto el final y tomas cool pero los personajes son insoportable y tontos marco es arruinado la película es muy estúpida y escenas muy largas es un 2.2 de 10",
    "date": "2023-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "If you're after an identical trilogy of love found lost, found again, lost again etc. then go for \"To all the boys I've loved before\". It's approximately 500 times better than this nonsense",
    "date": "2023-03-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love this bitter sweet sequel!!!!!\nI think this was probably the best of the 3 films from a deep point of view. If you are looking for the classic happily ever after straight line then you'll probably hate it.\n\nI give it a complete 5 star because i can totally relate with the feeling here. Yes Elle and Noah said they would fight for each other, but i guess fighting for another person may mean letting them go and hope that fate brings you back again when the time is right. I love how much Noah is better able to contain his anger especially with Marco.\n\nI must admit i really was happy that Elle got to do her own thing cos common!! She really had been trying to make everyone but herself happy!! If She had gone to Boston with Noah, I think She would have come to regret it in a way and believe me, Lee would never have let her forget it, and If She went to Berkley, She would have missed Noah too much, caused more Drama thereby killing her friendship with Lee.\n\nI especially loved that they met after 6 years (Even though they all still looked exactly the same to me) and you can just tell that they would get back together and i especially used my imagination to get the happily ever after my romantic heart was secretly looking for.\n\nIt was a bitter sweet film for me, a perfect way to end a series that held me from the start.\n\nP. S All the other sub plots were cool also, Elle's Dad, Chole's parents etc..all just showed that Life happens and you either go with the flow, fight against it or Learn its curves and bends and just Surf with it!",
    "date": "2022-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It’s difficult to watch excellent actors having to act badly on camera. To be more specific they are over acting.",
    "date": "2022-04-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Kissing Booth 1 and 2 were great but Kissing Booth 3 is an awful storyline. They really ended the franchise with a very stupid ending. Highly not recommended",
    "date": "2022-03-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "it's a good movie IF you wanna watch a bunch of kids making stupid and irresponsible decisions instead of ACTUALLY caring for their loved ones.",
    "date": "2022-03-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This is hands down the worst and most annoying movie I've ever seen in my life.",
    "date": "2022-03-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Run time says 1:52, but that felt like 4 hours of my life I won't get back",
    "date": "2022-02-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "IT WAS SO BAD IM CRYING A RIVER AFTER ALL OF THAT DRAMA WE GET THIS ENDING 💀😢",
    "date": "2022-01-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Eu amo essa trilogia, e referente ao final que muitos não gostaram, eu amei, por que fugiu da mesmice dos filmes e na minha opinião não teria um final melhor que esse...",
    "date": "2021-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Awesome\nWhy so much hate? The story basically continues from the 2nd one. What you see is kids growing up into adults. I really enjoyed this one. The storyline is powerful.",
    "date": "2021-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The actions and motivations of the characters feel unrealistic and unbelievably immature. I suppose it's just not for me. This film perfectly falls into the stereotype of the \"Netflix Teen Comedy.\"",
    "date": "2021-10-31"
  }
]