[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "As someone who isn't Catholic this film has brought a new appreciation for me of the burden that must be felt by members of ministry all over the world. It handles the topic of how it feels to lose the \"voice\" of God delicately. My expectations of the film were that it would be dry and only saved by the two Welsh acting legends in the titular roles but it turned out to be anything but. Pryse and Hopkins were proof that less is definitely more and weren't afraid to use silence to speak. The performances of Juan Munijin and Lisandro Fiks were strikingly visceral; the director's ability to set the \"story within a story\" seemlessly within the overall picture was more than well done.",
    "date": "2025-09-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This is a well-made, feel good film. I choose to view it more as a work of fiction, because as a Catholic, I have very little respect for either of those men. However, as a motion picture, the story is great and well presented. Anthony Hopkins and Jonathan Price were fantastic in their respective roles. Fernando Meirelles did a marvelous job with The Two Popes. For me, it has replay value. Periodically, I get the urge to watch it again. I recommend this movie. \n\n92/100",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Intelligent acting brings out current tensions in Catholicism - to modernize or to stick to the old ways. Believable, humorous interactions and the glorious settings and filming combine to make this a ‘must see’ for viewers seeking more than bland entertainment.",
    "date": "2025-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The film stirs genuine curiosity about these two influential figures and the events that shaped their time in the Vatican. While it offers a thoughtful glimpse into their personalities and beliefs, I was left wanting a deeper dive into the scandals and how they confronted those challenges, rather than keeping things in broader strokes. It feels more like an introduction to the complexities of the Catholic Church—a cautious first step toward transparency that hints at the possibility of true forgiveness and perhaps even a way to reconnect with those who have drifted away.",
    "date": "2025-05-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was a touching, funny, thought provoking, and a little documentary effect, by two wonderful actors and treasures of our time. Bravo.",
    "date": "2025-04-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The Two Popes” (2019) is a beautiful film that I watched on Netflix after the death of both popes. I really liked it—I even shed a tear. I must admit that, as a Catholic, I used to admire Pope Benedict, but after watching this film, I got to know Pope Francis better. The details of his life are truly touching and dark. I also have to add that the dearest pope to me, the one I remember fondly since early childhood, is my favorite—Pope John Paul II. The Slavic pope, John Paul II, was a symbol of humble kindness and faith. In the film, Benedict is portrayed as a stubborn German, but I don’t believe that reflects who he truly was. I would rather describe him as an exception in Rome—as a German.",
    "date": "2025-04-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Good film, very powerful acting. Great depiction of events.",
    "date": "2025-04-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Brilliant acting by Jonathan Pryce and Anthony Hopkins and a fascinating look at the power of the right wing junta in Argentina.",
    "date": "2025-02-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A thoughtful and laid-back story about one traditional pope learning to loosen up and accept his more open-minded successor in this sweet little slice-of-life movie that takes a more casual lense into the inner workings of the Catholic Church.",
    "date": "2025-01-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Deep, meaningful, brilliantly acted and effective in revealing how silly the church is.",
    "date": "2024-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Ótimo filme, mostrando a história de dois personagens importantes no mundo religioso. A história contada no filme é muito boa, mas acho pouco provavel que alguns fatos do filme sejam reais.",
    "date": "2024-02-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Mostly unsurprising but Price and Hopkins make the viewing worthwhile.",
    "date": "2024-01-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie, I really enjoy it.",
    "date": "2024-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A riveting and impactful drama on the teachings and issues of the Roman Catholic Church.",
    "date": "2023-12-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I have no idea how much of this is true, but I completely enjoyed the time spent.",
    "date": "2023-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Incredible performances: just amazing to watch two masters in action alongside an interesting and believable story.",
    "date": "2023-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Meh. It is a cool idea, especially if it had been real. To know that this is based on bits and pieces of their speeches, etc. and not an actual biographical pic makes it less fun.",
    "date": "2023-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Two stellar performances by standouts at their craft. Amid all the pomp, all the sterile and the staunch, we gets sly little jokes and asides and more in this charming changing of the Catholic seat of most honor.\n3.8 stars",
    "date": "2023-02-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Touching. Hilarious. Dramatic. Shocking. This film truly is a must see, if not for Pryce and Hopkins then for its honest exploration of Catholicism in our modern society and what makes a person ‘good'.",
    "date": "2023-01-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Totally brilliant acting by the two Popes (Hopkins and Pryce). An interesting story even if one has little sympathy with the Catholic Church. Some may find it boring (no action), but the dialogue is utterly absorbing. Pope Francis' historical background under the Argentinian junta is also a major feature, adding the dimension of religion/politics. The core of the story is the friendship which develops between the two old men. Religion and faith play a role, but only as part of the mens' story, not in any evangelical way. The public scandals in which the Catholic Church has been embroiled in recent decades are neither ignored, nor emphasized.",
    "date": "2023-01-07"
  }
]