[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "As a stand alone \"Natural Born Killers\" type of film this could have worked well but as an entry in the Texas Chainsaw franchise it is a major misfire.",
    "date": "2025-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "It’s Gore to the  extreme minus a decent plot and acting.",
    "date": "2025-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I don’t recall giving consent to watch a twisted psychiatric romance about demented runaways going on a spree. (Clarice is the bane of my existence)",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Greatness version made!!! Yall dont movies couldn’t be made any better then it was smh",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie is confusing. I don't know who Leatherface was supposed to be until end",
    "date": "2025-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas de terror são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I was honestly expecting this to be way worse given the critics and audiences rating on this, I feel like a lot of views were exaggerated and made me think I was about to watch a highschool musical walking into this, but it was nowhere near as bad as that, I don't think this movie is great but I still enjoyed it, as there was a fair amount of gory scenes to remind you that you're still watching a texas chainsaw movie. I understand that this is a completely different take on the series but I think this deserves more recognition compared to all the hate it got, not terrible but idk if I would  recommend it, okay movie overall.\n\n6/10",
    "date": "2025-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "If it’s not a Texas chainsaw movie then I would say it’s a good one but it is the origin story of leatherface ha 3/10",
    "date": "2025-03-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I enjoyed the back story to the big reveal,  how it kept you guessing as to who becomes leatherface. There could of been more sick demented  kills along the way imo. The ending could of been more iconic and sadistic.  I love this franchise and thought it a good time . Enjoy",
    "date": "2025-02-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It's so awful I started an account on here just to tell people how horrible it is. There's zero plot progression & I've never been so relieved to see end credits",
    "date": "2025-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was so enjoyable, genuinely my favorite movie ever, I definitely recommend",
    "date": "2025-02-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Leatherface is an interesting addition to the franchise, on one hand, almost all of its character development is overshadowed by shock-value gore, however on the other hand, its greatest strength is cinematography. The visuals and atmosphere are gritty and oppressive, capturing the grim world of the Sawyer family and the bleak landscape of Western Texas.",
    "date": "2025-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Nothing compares to the 1st movie, a horror classic, but this wasn't terrible for a prequel. Kept me entertained and no time checks.",
    "date": "2024-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie was just horrible and not in a good way. It tries too hard to be gory and shocking but only winds up being boring. It has little to do with Leatherface until the very end when he finally uses a chainsaw. Why the hell would you call this movie Leatherface and wait until the last few minutes of the movie to show him in his \"Leatherface\"? The movie follows a group of mental asylum patients who escape and manage to snag a nurse hostage. The rest of the film is a series of gory kills that is connected to a plot about them running from the law. We are made to assume one of the group is Leatherface until a predictable twist near the end reveals who actually is Leatherface. The whole plot is just dumb and cringe. The writers created a half ass script and stamped a well known IP onto it to attempt to milk out a few more dollars from the Horror-Lover fan base. Just watch the original classic.",
    "date": "2024-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A little too much violence in comparison to the substance. The throwback feel to the movie would have made up for it if there had been a more sensible transition to the title character.",
    "date": "2024-10-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not quite what I was expecting, but it did have some very good scenes.",
    "date": "2024-06-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Após ter sua filha morta em uma armadilha armada pelos integrantes da família Sawyer, o delegado Hartman leva Jed Sawyer, um dos filhos de Verna Sawyer, para um hospital psiquiátrico. Alguns anos depois, em um levante na instituição, quatro jovens fogem, levando uma das enfermeiras como refém. Eles passam a ser perseguidos pelo delegado Hartman e seus homens, enquanto vão cometendo crimes, O que ninguém sabe um deles é Jed Sawyer e ele irá se tornar Leatherface, Depois do remake, foi feito um filme de origem para Leatherface. Aqui, é feito um novo filme de origem, tomando como base o filme de 1974 e o filme anterior. Porém temos aqui um filme mediano. Temos bons efeitos visuais (em comparação com alguns risíveis do filme anterior) e uma boa fotografia. O elenco tem bons nomes, como Lili Taylor e Stephen Dorff, mas mesmo eles não podem fazer muita coisa. O roteiro comete vários erros: os seus personagens são rasos e clichês, não despertando nenhuma empatia no público. Outro erro é o mesmo cometido no filme anterior: não há personagens pelos quais o público vai torcer. Tanto a família Sawyer quanto o delegado Hartman são psicopatas. Além de insistirem na tentativa de criarem um lado bom no Leatherface. Pessoal: Jason, Freddy Krueger e Michale Myers não possuem lados bons. Por que insistir nisso com o Leatherface?",
    "date": "2024-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Better than Chainsaw 3D. 3.9/10.",
    "date": "2024-06-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Leatherface, from 2017, lives up to its simplistic premise, building up from the success of the Texas Chainsaw Massacre's franchise: the backstory to the infamous Leatherface.\nIn this movie, we start with some quick background to Jedediah Sawyer's miserable childhood, the youngest children to a horrible family of sadistic farmers. The opening scene sets the stage for Leatherface's arc: an incomprehensible human being traumatized by his childhood. The second part of the opening sets the obvious ending too.\nNow we meet the secondary character, the love interest Lizzy. Lizzy is a new nurse at a mental institution where the Jedediah is locked in. We watch the cliché \"newcomer gets bullied by old-timers and then saved by the seemingly nice person that's not part of this mess.\" And the second cliché: facility has room for some shady methods.\nThen we get to a point where I think the movie is delusional: Verna, Jedediah's mother, wants to see her son, which she has not seen since he was taken away, apparently. I wonder if that had happened at some point, but, well, plot convenience, the same convenience that sets this story forward — yes, up until this point, we are still in the setup.\nAfter a plot point that sets us to Act 2, we are now following a group, and we start wondering: who is Jedediah in this mess? Believe it or not, this is the main arc of the story's Second Act.\nAct 2 also brings the question of what are they actually planning overall? The master plan is just plain stupid, and the explanation \"yeah, but they are mentally ill\" does not cut it.\nThis arc ends with the midpoint's plot twist, a clever-wannabe twist that dismisses everything that we've been watching so far. Acts 3 and 4 spiral into fast-paced disjointed scenes that culminate into the boring climax.\nAnd the ending seals this movie with its mediocre rating.\nThe characters are the generic plank you'd expect out of this mess of a movie.\nJackson is the nice guy fighting his ill condition with a good heart. He seems to be the reasonable person. Solid performance by Sam Strike here.\nLizzy is the naïve nurse that wants to save everybody. She is dismissible.\nBud is a huge kid with some disturbing angriness within. He is slow in all senses but seems to have a good heart too.\nThen there are Clarice and Ike, the psychopaths. They are like Bonnie and Clyde. \nApart from Sam Strike, everyone else's acting performance are meh.\nWell, there's not really much more to say for Leatherface (2017). Nothing else stands out in this movie, other than a list of bad decisions that would be too boring to add to this review.\nBottom line, Leatherface tries to leverage the weird cult success of Texas Chainsaw Massacre but it fails. The main reason is because the story itself is just trying to be clever, a \"gotcha\", \"who is Jedediah?\", for no reason. As a predecessor to everything Leatherface became, this story adds no real background to it.\nWhen we get to the ending, we feel Leatherface's motives are not really strong; he is just a pawn in this whole mess. But with a lack of a recurring character to latch itself onto, Leatherface (2017) was doomed from the start.",
    "date": "2024-04-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Leatherface is a very solid prequel to the original 1974 film. It's gritty, gruesome and very disturbing in most places, and it's all the hallmarks of what makes a TCM film good. 10/10",
    "date": "2024-03-09"
  }
]