[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Amazing cast.. interesting theme.. interesting roles played... fast paced.. the introduction 5/5..  the caos   They're a few movies like these",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A film that pretty much has everything; winning both Picture & Director seems very possible, if not likely. Disagree with criticism of how Perfidia is portrayed: Taylor's character is critical to much of what transpires on screen, and PTA makes clear which side we should be rooting for, and she so clearly lives on through her daughter (Infiniti is wonderful). Perhaps Penn's character comes off as a bit too campy, but that's the point: these men are indeed ridiculous and downright silly, but simultaneously very dangerous because they have the powerful and their foot soldiers (i.e. the US government) on their side.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thought about this for days afterwards. I am still thinking about it. I can't wait to watch it again. The nuance, the metaphor, the performances - Leo as a dad. Don't miss this,",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I don’t support that the movie was based off people who are part of a radical movement. However, the acting was good. Leonardo DiCaprio is as good as ever.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it. It had me engaged throughout. Look forward to seeing it again.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Saw it in Alaska during a visit with my son.  Loved it!  Sean Penn deserves an Oscar.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The beginning was not the best. After the daughter was of age it was good.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It’s impossible to overstate how much fun this thing is, with twists and welcome detours along the way.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Gonna go against the grain here.  This movie was over 2 hours of complete and utter nonsense.  Great cast for sure but over acted from start to finish.  It’s a movie that makes me wonder why we are subjected to ridiculous movies in the last 5/10 years.  Its hyperbolic, overly exaggerated attempt to encompass compassion with recent events was laughable.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The movie has decent music, that’s one of its positives.\n\nBut the film itself is completely hostile.\nBriefly about the plot: if you see a woman or a non-white man — they’re good, don’t worry.\nIf you see a white man — he’s bad… and if he’s a police officer or immigration police — he’s absolute evil.\n\nThe film claims that people who are in the U.S. illegally are actually good. And that they didn’t break the law because… well, it just happened, they didn’t mean to. Which is essentially deceptive.\n\nWell, anyway, I hope that the president’s administration and ICE will finish their work, and we won’t see many more films like this.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The cinematography and acting were excellent 🤩, but the pacing was poor and the dialogue was occasionally weak, leading to an overall underwhelming experience 😕. #cinematography #acting #pacing #dialogue #experience",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "One Battle After Another is easily one of the best films of the year. From start to finish, the movie delivers powerful storytelling, emotional weight, and performances that stay with you long after the credits roll.\n\nLeonardo DiCaprio is, as always, fully in his bag—commanding every scene with intensity, vulnerability, and the kind of layered acting only he can deliver. His portrayal feels lived-in and deeply human.\n\nBut one of the biggest standouts is Teyana Taylor, who continues to prove she’s one of the most versatile and underrated talents working today. She brings incredible range, depth, and raw emotion, elevating every moment she’s on screen and matching DiCaprio beat for beat.\n\nThe movie balances action, drama, and heart seamlessly, making it easy to recommend to almost anyone. If you’re looking for a gripping film with top-tier acting, this is absolutely the one to watch.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great move like in the old days",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A kinetic and often darkly comedic film about political stances and personal consequences, Leonardo DiCaprio and Sean Penn give wonderfully layered, physical and emotional performances",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Arguably the greatest filmmaker alive, at his best.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Did not enjoy this movie. Found the constant piano pinging noise so annoying by the half way point in the movie I was ready to go buy a piano just so I could smash it!",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "interesting story, superb acting",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The movie is nonsensical and way too long.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Overrated, drawn out, score is just weird. Who is giving this 5 stars",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Absolutely horrible. My wife and I turned it off after 26 minutes and those 26 minutes were a struggle to get through. Bizarre sexualization from the start with no clue where the story was going. Terrible.",
    "date": "2025-11-30"
  }
]