[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Checks every nostalgia box if you grew up playing the games.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Fun movie… high re-watch value. Jack black as bowser is epic!",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Greetings from Lithuania.\n\n\"The Super Mario Bros. Movie\" (2023) is a pure fun. It does not reinvent the wheel in any department and it is the safest film possible. Still at running time 1 h 22 min (perfect for youngest ones with a span of attention equal to a tic toc video), i found myself enjoying it mildly. It does look very colorful, and seen at home on a big TV with great HDR will blow you away in terms of colors. Story - not so much. It is basically a commercial for Nintendo's Mario games and that is it. Still, humor is there, and its hugh energy and some smart writing save it and made it very watchable.\n\nOverall, \"The Super Mario Bros. Movie\" is fun enough to see it. It is short, colorful and funny enough to recommend it.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Alright the reason why I put 5 stars the movie is so perfect EXCEPT THE PEOPLE ARE SAYING RANDOM STUFF ABOUT THE MOVIE THAT'S NOT IN IT BRUH WDYM ITS NOT FOR KIDS CUZ IT SUICIDE LIKE bro and the people who rated one star and said the perfect thing is fine BUT LIKE RANDOM WORDS YELLING OUT THIS MOVIE SUCKS And the reason? They say nothing like PUT A REASON WHY? and HOW? This movie was perfect in 2023 IN TILL 2025. I saw bad reviews on tomato and it sucks 💀 😔 like someone said this movie anit to realistic back in 30YEARS?!?!? Bro THEY TRIED MAKING A MOVIE Since that year BRO AND IT LOOKED WAY TOO BAD but this movie is finally better and also there is a galaxy movie coming AND DON'T say WoW ThIS GuY Is sO OvErReActInG well I don't care if you say something mean or flag this comment and I would wish it would be coming So I will see.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A mí me gustó muchísimo la película es una de las mejores adaptaciones de videojuegos de la historia. A demás está película muestra la lealtad de Mario al hacer hasta lo imposible por salvar a su hermano.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It’s so good I think that Nintendo and illumination should turn this and the upcoming super Mario galaxy movie into a franchise and if you’re a person who likes or is a fan of Mario and Nintendo this movie is for you",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very good very funny movie",
    "date": "2025-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The animation, sounds and effects are stunning, despite the basic plot, it touches every Super Mario Bros. game franchise fans hearts.",
    "date": "2025-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "7 out of 10 little to cringe",
    "date": "2025-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "My cousin and sister wanted to watch it badly. I told them I didn't want to because I did not like the cast choosing for the film. I felt like Chris Pratt was too white to play an Italian with a thick accent. It should've been John Turturro and his brother Nicholas Turturro as Mario and Luigi. Bowser should've been probably James Wood because his voice is silly and he usually plays the antagonist. I love the Mario Franchise (Super Mario Galaxy being one of my favorites and the movie will critically flop and I am sad they will be destroying one of my favorite games of all time), but I just found this movie bad. None of the cast fit their roles. The graphics were on point. For me this is a one time and discard film.",
    "date": "2025-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I think it deserves more than 58 tomatometers\nIt's very accurate to the games",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The Super Mario Bros. Movie has plenty of colorful animation, great characters, action, humor, and a great voice cast, making this one of Illumination’s biggest hits to date.",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Wahooo! Jack Black singing \"Peaches\" makes this movie worth it. Is it absolute cinema? No....But it's a damn good time.",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "AWESOME MOVIE! LOVED IT! Ignore the cr1t1cs, if you read some they make no sense. The movie speaks for itself.  Just watch it.",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I really liked it, the story is good, the characters are charismatic, the scenes are funny, the animation is beautiful and the references too (masterpiece compared to the 90s movie)",
    "date": "2025-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Most critics walked in to see a masterpiece, forgetting it's a kid's movie, but its great",
    "date": "2025-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best adaptation of the Super Mario Bros franchise, it nails the looks, the feels, everything that makes Super Mario Bros special and all the Easter eggs and references to the games made it even better the cast is stellar in my opinion and it stumbled a little bit but not enough to hurt it too much",
    "date": "2025-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is a comedic masterpiece that references the Super Mario Bros franchise every time it gets. This movie is a must see even 2 years later and HOPEFULLY THEY DO IT EVEN BETTER IN The Super Mario Galaxy Movie...",
    "date": "2025-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It's a very good Mario movie, but if you're not a Mario fan it will definitely be harder to get into this",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This movie is very great if 1 more 0.5 if they did a better job I would rat it 5 but its great.",
    "date": "2025-10-11"
  }
]