[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "it was cheesy, story was pretty weak, but it was entertaining. The dude playing the president Juan Pablo Raba was the star of the show!",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fantastic movie that kept me guessing, chuckling, and enthralled the whole way through.",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The critics are morons. The film was never going to win any awards,  but it does what's expected of it. A light hearted comedy action movie. If its your thing and you've had a stressful day or week and want some distraction or escape, this movie is perfect.",
    "date": "2025-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It’s a solid film for when you go into it thinking it’s gonna suck. It has an underlying narrative that is important for people to understand yet is fun thrilling action packed and not boring at all. If I were to grade the movie in terms of all the movies I’ve ever seen it would get a B- really impressed with it.",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I really enjoyed watching this movie!! Really surprised by the critics. Absolutely recommend it, it was a great feel good movie with both comedy and action. The attention to detail and production excellence was also very commendable",
    "date": "2025-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "John Cena has to really carry the humor and the action. He's given some romantic moments that fall flat, unfortunately. Freelance is a very cheap and poorly made movie. It's way too long and boring, while feeling closer to a farce. Alison Brie is sometimes funny, but she's got no character. She is very hot in Freelance though. Juan Pablo Raba is playing a goofy dictator, but the movie comes across weirdly as pro-dictator. It's so off putting. Christian Slater feels lifeless and wasted. Alice Eve acts very poorly and is totally wasted too. Marton Csokas is pretty good here at least as the villain. \n\nNowhere near enough action in this poor Netflix action-comedy.",
    "date": "2025-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Swiss cheese has fewer holes than this plot. Not quite funny enough to keep laughing and definitely not serious enough to care about.\n   Godawful comes to mind...",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Unoriginal, tedious, predictable, not funny, not scary, not anything really. Lame. Super lame.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Read the reviews after watching on Netflix, this movie is great, these critics are jokes, top notch action comedy where Cena was at his best, sit back and enjoy, all the characters were great",
    "date": "2025-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "John Cena is a great actor but the movie is lame and stupid especially the journalist carrying her phone the whole time in the jungle and under attack geesh WTF!!",
    "date": "2025-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Honestly, I didn’t expect much going into Freelance, but I ended up really enjoying it. It’s not a big-budget blockbuster or anything, but that’s part of its charm. The action was solid, there were some genuinely funny moments, and it had just enough drama to keep things interesting. John Cena and Alison Brie were a fun duo, and Juan Pablo Raba as the dictator was actually super entertaining.\n\nIt kinda reminded me of those old-school action-comedy movies from the ’90s — a little over-the-top, a little ridiculous, but in the best way. If you’re just looking for something fun to kick back and watch without overthinking it, this hits the spot.",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It has John Cenna so there's that but Alison Brie has about as much talent for this role as a bucket of paint.",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The movie is cheesy, but it is a lot of fun.",
    "date": "2025-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "John Cena, Alison Brie, and Juan Pablo Raba filled me with humor, joy, and hope seeing this delightful oddball trio fight for the good of the people through unity. Full of awesome ongoing action, it worked for me and will become a movie I look forward to watching over and over for years to come. We can be saved if we fight for truth and justice. Thank you for lifting my spirits.",
    "date": "2025-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it. Great comedy work.",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Story was above average but nothing crazy. Cena I usually couldn’t care less about but the pairing with Bree worked wonders for this film and making his character something I was invested in.",
    "date": "2025-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 49 minutes!!!!!!!!!!!!!!!! Starring John Cena as Mason Pettis!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $5,300,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Most of the guns sounded like bb pellets",
    "date": "2025-06-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This is one of the few times I agree with the critics score over the audience. Im surprised it has such a high rating.\n\nIts not a horrible movie by any means but it's probably one of the most forgettable movies iv ever watched, the movie has no original ideas and just repeats tropes done so many times over the years with nothing to make it stand out. The acting is okay, plot is basic and sort of boring...they try to add comedy in at times but nothing made me laugh out loud.\n\nIf you dont watch this your not missing out on anything but could be decent to pass time I guess.",
    "date": "2025-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Sayang oras. Napaka generic ng kwento. Action comedy sya pero wala akong matandaan na natawa ko sa kahit anung eksena",
    "date": "2025-04-03"
  }
]