[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Mikey’s Movie Review: Kinda Pregnant (2025)\n\nNetflix have been accused of late for releasing a lot of average films to meet the quota and demand for new ‘content’. For every The Irishman or Extraction there’s been an Unfrosted or Back In Action… Kinda Pregnant falls somewhere among the later category.\n\nWithout doubt Amy Schumer remains Marmite for both critics and audiences. Despite her recent and sadly short lived Disney+ series Life And Beth (a dramedy that dealt with some heavy topics such as autism, abuse and depression in a quirky, dryly funny indie film way), she has yet to find the right vehicle to change that opinion. Kinda Pregnant would seem like the perfect film for her brand of humour and real-life experiences but has so far recieved mostly negative reviews.\n\nThe film is actually OK, although very hit and miss in both its comedy and dealing with more serious issues. Though there are some zingers throughout it vears from juvenile to crass to clever (sometimes in the same scene), so it never really lands on a consistent tone. While it is being marketed as a modern ‘chick flick’ it most definitely and defiantly has one foot in the 90’s. Anyone familiar with Mrs. Doubfire and The Wedding Singer knows exactly the kinda film they’re trying to make. It just falls short… as if no-one quite knew where to grow the idea after the initial conception…\n\nShe’s assisted of course by a solid cast that includes the likes of an excellent Will Forte and Brianne Howey and some of the set pieces are mildly amusing. Plus it features another solid score from Happy Madison Productions regular Rupert Gregson-Williams. \n\nPerhaps with a few more passes at the script and a better director (seriously, who keeps hiring Tyler Spindel?) Schumer might have delivered more of a success. Still, if you’re stuck for something to watch, ignore the online hate and just take it for what it is, a silly, switch-your-brain-off romp with a handful of chucklesome moments.\n\nMikey’s Movie Rating: 3/5*",
    "date": "2025-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Wasn't expecting much but this was surprisingly funny and fun to watch... even though it was rather crude and silly.",
    "date": "2025-10-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was so funny 😭. I love the main actress in movies, she’s like another Melissa McCarthy",
    "date": "2025-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The movie was okay - there were some laugh out loud moments and admittedly this is my genre of choice (silly romantic comedy). \n\nWhile I enjoyed it, something just didn't click like the other movies but I would still note it as a movie worth a watch!",
    "date": "2025-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This has to be the most cringe film I've ever watched. Admittedly, I'm not an Amy Schumer fan. However, I figured I'd give 'Kinda Pregnant' a chance. Not a single scene pays off. It's incredibly hard to find a single redeeming quality about the main character. None of the humor hits. In fact, the further the story moves along, the more the main character becomes dislikable. Please save your time and do not bother watching.",
    "date": "2025-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "If you know comedy you'll love \"Kinda Pregnant.\" So many laughs!",
    "date": "2025-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This Movie is very Boring and Just hard to watch every scene is unwatchable this is a 0.5/10",
    "date": "2025-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Storyline isn’t great, but the acting IS and the joke writing was SO good, had me laughing out loud. Went in with low expectations, just looking forward to some laughs and this hit.",
    "date": "2025-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Horrible movie. Strained. Hard to watch. Garbage. Don't waste your time.",
    "date": "2025-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Funny movie. Amy Schumer does it again. Love her comedy sense and ability to make the strangest things funny. The movies pretty good even the wacky moments. highly recommend",
    "date": "2025-05-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "genuinely garbage. thought it might get better but no. the plot, the acting, dialogue not one bit of it saved a second of this movie.",
    "date": "2025-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "So unfunny.\nLuckily it gets 1 star for the Kiwi girl.\nShe should be the star.",
    "date": "2025-05-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Sooo hard to watch, Amy just can't act !",
    "date": "2025-05-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Schumer's humor feels stuck in 2018 (and no I don't mean in an offensive way) I just mean alot of her jokes and comedic deliveries just feel very much like 2018 and outdated.. still love her tho",
    "date": "2025-05-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Its one of those movies that sneaks up on you. You think it’s simple at first, maybe even slow, but then it plants something an idea, a feeling and it just sits there, gently growing. Definitely worth a watch if you’re in the mood for something soft, a little raw, and quietly moving. Kinda pregnant with meaning, if you let it be.",
    "date": "2025-05-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "“Kinda Pregnant” is a Rom-Com that doesn’t deliver on the romance or the comedy. While the premise is barely interesting, not only does the plot, during its ninety minute runtime, in no way justify or fulfil the thesis in any way, but doesn’t even understand it’s own weak premise as the story has no direction, paper thin character motivations and a consistent confusion about what the message of this film should be by the time we reach the indescribably bland ending which was disconnected from the premise and plot “building up” to it. Even as a movie released only 40 days into the year, it’s already a clear contender for worst movie of 2025.",
    "date": "2025-04-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I haven’t watched a movie that made me laugh this much in a while…literally kept rewinding scenes, seems like the crowd isn’t a fan but it’s definitely my cup of tea. It’s a must watch in my books!",
    "date": "2025-04-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I have ptsd from how ratchet and cringe and gross and weird this entire movie was I never found amy Schumer’s 4th grade perverted boy humor funny but even I am surprised she willingly acted in this",
    "date": "2025-04-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Reading the audience reviews was more mentally stimulating and enjoyable than watching this movie. Take from that what you will.",
    "date": "2025-04-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This was terrible. It deserves a 5%",
    "date": "2025-04-13"
  }
]