[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wow that was amazing. Must see can’t believe there is no rating yet. This has me on the edge of my seat the entire movie.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It's action drama in a box, cheap to make & plenty seasoning of dramatic and fake explosives.",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "good little movie with no real ending. action packed with twists aplenty. good acting and all is believable, you can watch this.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Absolute garbage. Typical 2025 nonsense lmfao complete waste of time",
    "date": "2025-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Look, you know what you’re getting yourself into when you watch this movie and it doesn’t disappoint. It has a refreshing take on the genre, and makes you wanna watch more of Lewis Tan.",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was one of the best movies I’ve ever seen in my entire life. I really enjoyed the action and the thriller as well for this film. I highly recommend watching this movie honestly, I can watch it over and over and over again. It’s that good.",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "honestly… WOW. This is a must see, one of my favorites of 2025. I haven’t written a review for a movie in as long as I can remember, and this is so worthy for it. Huge fan of Lewis Tan and so cool to see his brother Sam Tan acting together. Makes me want to go to LA!",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Boom—LA ambush and VP motorcade chaos grabbed me hard, then six feds trapped in a safe house with the attack signal traced inside? Instant “who’s the mole” mystery that kept me guessing with solid clues and slick action (gunfights, hand-to-hand). Loved the nuclear “football” nod after House of Dynamite—2025’s hot prop! But mid-movie slips into usual traitor tropes, nothing fresh. 6/10: tight 90-minute thrill, great for a quick suspense fix.",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I was able to watch this in theaters (where it belongs) on the silver screen with DFX quality, and the whole family took up a row! We absolutely LOVED it!!! \n\nFrom start to finish, this movie delivered on high-octane action and suspense, with a solid storyline that doesn't just bulldoze you with special effects like some movies do; but it engrosses you into it's world with the same gripping finality of a hand-to-hand combat in a life or death match. \n\nThe director, Jamie Marshall, flips the script on us in terms of the classic traitor-in-our-midst. And he paces this storytelling so well, that even during the quieter moments of the film, where the coast feels safe to have empathy for some characters, we're never left wishing the time to go fast or slower than what's playing out in front of us. The main actors each deliver their character's arcs with such a lived-in nuance it kept the traitor's reveal a surprise to the end.\n\nOne of the most amazing and notable things about this movie is that ALL the actors are doing their own stunts! No stunt doubles needed here when you have a cadre of highly-trained actors, like the underrated action star Lewis Tan, led by the renown stunt coordinator Arnold Chon. Every punch thrown, every kick snapped, and every shot fired feels like a visceral shock to the viewer's senses, and I'm glad the wall-to-wall screen of a movie theater enhanced that effect.\n\nOf note, in a time when creatives are starting to be outpaced by AI, I think this movie will set an example for years to come as the kind of action film where hands-on creativity, disciplined innovation, and deliberate storytelling will always take precedence.\n\nWell done to everyone involved in this film, and thank you for the experience!",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved this movie. Fast action. Fantastic interaction between the characters. A great mix of twists, some predictable which is kind of fun, makes you feel you're really clever because you guessed it, and some I didn't see coming. Lewis Tan as Agent Choi is awesome.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I just got done watching Safe House and I loved it. Theirs so many twists and turns and phenomenal action packed fight scenes. Incredible cast and crew. I personally give the film 100/100",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Beautiful backdrop, painful execution.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great acting, and even better action! This film is very entertaining and fun to watch if you like guns and fights. Feels like if a game of Fortnite was a thriller action drama ! Gunna watch it again soon!",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It was watchable but painful to watch around the bad acting and very bad dialogue.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Safe House is basically Among Us meets Reservoir Dogs. A group stuck in one place, no one trusts anyone, and it all goes off the rails fast. Jamie Marshall keeps it tight, tense, and stylish. The fights hit hard, the acting’s solid, and it never drags. Some twists are obvious, but it’s still a blast to watch. Great action, great cast, great direction.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wish I could have seen this on the big screen! It was intense, fast paced and well thought out. I did manage to guess the twist, but the acting, stunts and action were phenomenal, from the starring actors, but also the actors with smaller roles. Sam Tan utilised his moments on screen skillfully (he was one of the police officers in the beginning) and as for the starring actors...\n\nLucien Laviscount's performance was truly amazing and when you watch it you'll understand why. This is the first time seeing him in an action film and he really stood out for me.\n\nLewis Tan was a stand out as always. When it comes to action you can tell he gives it his all and he made every fight scene explosive, entertaining and somehow look effortless. His intense ability to lock you in during those scenes were so on point.\n\nHonestly, the action and the acting from everyone really sold this film for me, I do wish that we got to delve a bit more into some of the other characters in the beginning of the film, and I do feel like if you're quite vigilant you can guess part of the plot, so I techinically give it a 4.5 out of 5, but honestly everything else makes up for it. Throughly enjoyed this film.",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Really good, worthy of being seen on the big screen.  Well casted, well acted, unpredictable plot filled with action and suspense.  What more can you ask for in a thriller?",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1.5 hours!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Filmed in 2025 in color!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Celebrating 5 years on: October 31st, 2030!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-10-31"
  }
]