[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "WHERE IS THE 'MARY MOTHER OF JESUS' (2024) AIRING ON NETFLIX CURRENTLY, STARRING ANTHONY HOPKINS - AND WHY DOESN'T YOUR SITE PRODUCE IT ON A SEARCH?",
    "date": "2025-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Telling one of the most revered stories in human history with intimacy and emotional clarity, Mary, Mother of Jesus presents a thoughtful and reverent portrait of the woman whose life helped shape the foundation of Christianity. While many biblical films focus primarily on Jesus himself, this one shifts the lens to Mary’s journey—her faith, her fears, and her profound responsibility as the mother of the Messiah. It’s a grounded and sincere approach that immediately sets the film apart.\n\nThe casting elevates the story immensely. The ensemble is carefully chosen and works beautifully together, allowing viewers to walk through Mary’s life not as a distant historical figure but as a real mother navigating extraordinary circumstances. The film succeeds in humanizing her without diminishing the divine nature of the story, showing how her compassion, strength, and devotion shaped the man Jesus would ultimately become. It’s a perspective rarely explored with this much depth.\n\nDirection plays a major role in bringing authenticity to the narrative. The filmmaker clearly understood the importance of honoring the biblical text while also crafting a cinematic experience, and the result is a balance of scriptural faithfulness and emotional resonance. The pacing occasionally stumbles, but even in those moments the heart of the film remains intact, guided by a steady vision that respects both the subject matter and the audience.\n\nThe screenplay is surprisingly rich, demonstrating clear research and a strong grasp of the historical and spiritual themes at play. While not every creative decision lands perfectly—few religious films avoid uneven moments entirely—the writing stays focused on Mary’s personal evolution. By giving attention to her inner life, the film allows viewers to engage with the familiar story in a way that feels personal rather than purely doctrinal.\n\nVisually and tonally, the film carries a sense of warmth and reverence. It maintains a respectful atmosphere without feeling overly sanitized or distant. Moments of hardship carry emotional weight, and moments of joy are allowed to truly shine. This sincerity helps the film connect with both faith-based audiences and those simply looking for a compelling narrative rooted in history and humanity.\n\nUltimately, Mary, Mother of Jesus is a heartfelt, engaging, and surprisingly vibrant exploration of one of Christianity’s most important figures. It honors the biblical story while offering a fresh emotional perspective, and it delivers its message with care and sincerity. Whether viewed as a spiritual experience or simply as a historical drama, it’s a film well worth watching and one that carries a meaningful, lasting impact.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A beautiful movie for those of us who are believers and followers of Yeshua and such a respectful and thoughtful depiction of women from this period of time in the context of this culture. I loved this movie ❤️❤️",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "For crying out loud stop making films about Jesus and Mary whatever other BS religions",
    "date": "2025-04-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "6.4/10\n\nI've been wanting to see this movie for a while just out of curiosity...you don't see Christian Bale as Jesus Christ every day especially in a TV movie.\n\nThe plot of this movie was classic but very very fast paced to the point where I thought it wasn't going to end in the resurrection of Jesus... surprisingly it did.To tell the truth I was glad that he showed them so soon and it was no longer than two hours unlike others of similar content.\n\nIts cast as well as the soundtrack were good,nothing great but good.Her settings were classic and predictable, I don't blame her for that, after all the movie tried and relied on the Bible and the writings of the Christian religion as everyone surely knew them.\n\nIts ending is also quite predictable. In short, if anyone really wants to see a quick Christian movie about Jesus Christ starring Christian Bale in surely he can see this one, apart from that there is no other reason for anyone to see this film, let alone few people even know about it and I am not surprised by this particular fact.",
    "date": "2023-05-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Think I cried a million tears. Christian bale is amazing as Jesus. So many emotions in two hours! I could not have done what Mary did!",
    "date": "2014-04-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Batman is the son of God! Seriously, as a man of faith, this movie is really good. It dealt with a lot of issues I had with Mary.",
    "date": "2013-01-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Being a 'Star Wars' geek myself, I'm very amused by the fact that Pernilla August plays Mary who - by a virgin birth - conceived the son who was known by a religious prophecy as the chosen messiah. Not Anakin Skywalker, but rather, Jesus Christ. What an interesting film!",
    "date": "2012-01-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It is safe to say that in an otherwise bad movie, Christian Bale is the shining star!",
    "date": "2011-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Christian Bale as Jesus! Heh!",
    "date": "2010-12-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Only watched this for Christian Bale. Makes one very hot, sexy Jesus. Movie dull, but enjoyed Christian and Pernilla August.",
    "date": "2010-04-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Christain Bale can't be born and die in a movie.. and then reborn again.. It was pretty good... lol",
    "date": "2009-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Good thing I watched this before I became a big Christian Bale Fan. As watching an actor you think is hot and sexy play Jesus just is uncomfortable and plain not right. Couldn't watch this movie now. Liked it from a Mothers view back then.",
    "date": "2009-04-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Good twist of seeing things through Marys eyes.",
    "date": "2009-04-04"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Terrible, dreadful, frightful, ghastly, scary, awful and just bad.  You can not help but cringe watching this poorly written, terribly shot and horribly acted 'movie' and wonder how any of the actors got further work.  It is almost beyond imagining that 'Jesus' would later become 'The Dark Knight'!!",
    "date": "2009-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Being a \"Star Wars\" geek myself, I'm very amused by the fact that Pernilla August plays Mary who - by a virgin birth - conceived the son who was known by a religious prophecy as the chosen messiah. Not Anakin Skywalker, but rather, Jesus Christ. What an interesting film...",
    "date": "2009-01-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "ok even if your not religous",
    "date": "2008-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "interesting adaptation but clearly a made for t.v. movie with much room for improvement",
    "date": "2008-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I have nothing a priori against Darth Vader's mum also being Jesus's, though this complicates things a bit in my mind. But they managed to shoot all 88 minutes of this thing without using the word \"sin\" even once, which tells you a lot about its theology.\r\n\r\nAnother Christian Bale movie I don't like.",
    "date": "2008-05-31"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "AWFUL AWFUL AWFUL! The only reason I watched this was for Christian Bale as Jesus. Obviously. But it's so inaccurate and horrible. And cheesy on top of it.\n\nAND I feel really bad for thinking of Jesus as . . . Christian Bale.  If that makes sense.  It's just wrong.",
    "date": "2008-04-02"
  }
]