[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "You Are So Not Invited to My Bat Mitzvah shows the modern tween life, and has plenty of funny moments which make this one of the best Adam Sandler movies.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "(Spoiler Alert)This movie centers around two best friends who have a falling out over a boy before their Bat Mitzvahs. It shows how something as small as a soccer player can rock someone’s whole friend group. It was amazing how Sandler’s entire family was it this movie, playing near-identical roles as if this was real life. Teen drama, entertaining to watch.",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "As a teen this movie was an uncomfortable watch.\n\nAlthough i definitely agree that kids are becoming way too invested in topics they shouldnt such are trying too hard to be attractive (which was shown throughout the movie) it was not discouraged or even criticized, which should have been a point the movie addresses if its gonna be included. Adam Sandler movie humor when the movie features adults feels different to when the movie features kids. Some of the scenes were over the top or not really age appropriate. The message was great however there were some scenes that conflicted with the message or really were unnecessary and provided no entertainment value. Otherwise, Sunny Sandler did great with her lead role and would defmitely give other movies a try.",
    "date": "2025-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I usually enjoy Sandler movies. Not this one, very boring script. I stopped watching after half sn hour maybe the nepotism hiring his own family that were not great did not help.either.",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I think that was worthy and that we should expect a lot more from the sandler sisters",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Better than I thought it was gonna be, although the nepotism makes me sick.",
    "date": "2025-06-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It’s good and I will watch again but it’s not my favorite genre of movies and I wish it had a romantic ending",
    "date": "2025-04-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Formulaically cheesy over being routinely rite of passage whilst conflictingly focused – or that’s outwardly standardized, this Sandler family affair naturally shines with religious passion, considerate heart and hilarity. (B)",
    "date": "2025-04-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "it is a funny movie but also is a drama",
    "date": "2025-03-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "this movie tries to mimic teen relatability, but it backfires in the worst way possible. everything about the movie feels forced and predictable, with the teen cast very blatantly following a generic script. it’s obvious that the middle aged writes tried to write something that teenagers do (everything was wrong) and the poor teen cast had to follow the hot mess they were given.",
    "date": "2025-03-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Predictable but maybe on point story for YA. Pacing and content not to be recommended for anyone older.",
    "date": "2025-01-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "We expected much more from Sandlers. In moments it feels like sponsored piece with highschool acting feel. Wasted time even we tried to give it a go.",
    "date": "2024-12-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I LIKE WIN  THER FRINDS IN THE MOVIE",
    "date": "2024-12-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I enjoyed this film so much, this is my new comfort film, I mean the Sandler's family are so talented. I definitely recommend this movie for teens!",
    "date": "2024-12-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "**Review: You Are So Not Invited to My Bat Mitzvah (3/5)**  \n\nAdam Sandler is great as always, and I really liked the whole cast. Idina Menzel was awesome, and I think it was such a smart idea for Sandler to include his own daughters in the movie. It makes everything feel more real. Sure, it’s pretty cliché, but honestly, that’s what teenage life is like—messy, dramatic, and awkward. The movie does a good job showing all of that.  \n\nIt’s a decent coming-of-age story with some really funny moments. It’s nothing super special, but I still had a good time watching it. It’s not the kind of movie that will stick with you forever, but it’s definitely fun and entertaining for what it is. If you’re a fan of Sandler or coming-of-age comedies, it’s worth checking out.",
    "date": "2024-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It’s never a good thing when you see a man known as a comedic actor playing the supporting cast in a teen comedy. Particularly when it’s as bland as this one.  Let’s get one thing straight - in essence there is nothing wrong with this comedy. The acting is competent, there are some jokes and there is a plot (though that is tretching the definition a little). \nThe essential problem is that there is absolutely nothing new or surprising about this film.  Teenagers feel angst - shocker. Teenagers have crushes - good grief, really?  Teenagers manage to embarrass themselves and each other - incredible.  Add in an unbelievable rabbi who is perkier than a camp counsellor on a sugar rush, and you’re away.\nPart of the issue is that you have to be able to engage with the teen who views turning 13 as the most life changing event in her tiny little world. I found myself wanting to shake most of the people involved and tell them to get a grip (including the rabbi).",
    "date": "2024-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I have loved this movie. I have loved it so much I even watched it several times. What a pleasant suprise!",
    "date": "2024-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "An awful uncomfortable rehashing of miserable teenage years that are best forgotten. Not to mention it’s little more than an excuse to get the whole Sandler family on screen. Two hours I wish I could have back.",
    "date": "2024-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "(Assisti em 2023) Gostei muito do filme, assisti ele no ano que lançou, não acredito que a Lydia namorou com o garoto que sua amiga gostava, além de que ela deu risada quando a Stacy pulou no rio com o absorve mestruado, mas que bom que no final elas se desculparam. Basicamente seu Bat Mitzvá foi arruinado por vídeos que não eram pra ser expostos em público, além de sua ex melhor amiga estar nele. Só que a Stacy foi muito gentil de dar seu Bat Mitzvá para Lydia. E ainda deu o beijo no Andy.",
    "date": "2024-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Some of the parts were cringy but overall entertaining and pretty good acting overall. A cute story.",
    "date": "2024-07-26"
  }
]