[
  {
    "user": "Aaron Phillips",
    "rating": 8.5,
    "text": "This is the perfect film for Father’s Day, but beware of its emotional impact.",
    "date": "2023-01-16"
  },
  {
    "user": "M.N. Miller",
    "rating": 3.5,
    "text": "Fatherhood is a heartbreakingly lovely comedy. It also has Kevin Hart’s very best performance.",
    "date": "2022-10-09"
  },
  {
    "user": "Zoë Rose Bryant",
    "rating": 7.0,
    "text": "Fatherhood may follow a story structure we've seen many times before, but it's an emotional rollercoaster worth riding nonetheless, especially for the poignant performances from every actor involved, especially Kevin Hart.",
    "date": "2022-07-14"
  },
  {
    "user": "Matt Brunson",
    "rating": 2.5,
    "text": "Initially, the buffoonish shenanigans of Matt’s buddies and an overreliance on doodoo humor undermine any attempts at emotional traction.",
    "date": "2022-07-02"
  },
  {
    "user": "Rachel Ho",
    "rating": null,
    "text": "There's no denying that Fatherhood aims to be an inoffensive crowd pleaser with a lot of input from test audiences and market researchers, and that isn't necessarily a bad thing.",
    "date": "2021-09-30"
  },
  {
    "user": "Dan Buffa",
    "rating": null,
    "text": "The real scene-stealer is Melody Hurd, who portrays the young Maddy. She forms great chemistry with Hart and that makes the movie worth watching.",
    "date": "2021-07-29"
  },
  {
    "user": "Mark Meszoros",
    "rating": 3.0,
    "text": "Based on the real-life Logelin's 2011 bestselling book, Two Kisses for Maddy: A Memoir of Loss and Love, Fatherhood is as enjoyable as it is in large part due to its talented star, Kevin Hart.",
    "date": "2021-07-05"
  },
  {
    "user": "Robert Levin",
    "rating": 3.0,
    "text": "It's a story of fatherhood that treats its characters with kindness and compassion, rather than as a spectacle.",
    "date": "2021-07-01"
  },
  {
    "user": "Tilly Pearce",
    "rating": 3.0,
    "text": "Kevin Hart does a great job as a leading man, with a tremendous supporting cast around him.",
    "date": "2021-07-01"
  },
  {
    "user": "Mark Kermode",
    "rating": null,
    "text": "Not terrible, but very ordinary.",
    "date": "2021-06-29"
  },
  {
    "user": "Joshua Robinson",
    "rating": null,
    "text": "Heavy themes are explored throughout Fatherhood, but instead of really digging deep and creating a father-daughter drama around topics like the ones already mentioned, the Paul Weitz-directed film settles for syrupy cliché moments.",
    "date": "2021-06-28"
  },
  {
    "user": "Matthew Passantino",
    "rating": 2.0,
    "text": "The film, as a whole, lifelessly plods along, hitting each predictable step in its path, and by the end one can only muster a shrug.",
    "date": "2021-06-27"
  },
  {
    "user": "Anne Brodie",
    "rating": null,
    "text": "Hart successfully mines a previously unseen side of his abilities.",
    "date": "2021-06-25"
  },
  {
    "user": "Frank Swietek",
    "rating": null,
    "text": "A blandly formulaic tale of a father who decides to bring up his newborn daughter by himself after his wife suddenly dies...but while inoffensive, it's also innocuous and instantly forgettable.",
    "date": "2021-06-25"
  },
  {
    "user": "Gregory Wakeman",
    "rating": 3.0,
    "text": "Ultimately, though, Hart is the reason why Fatherhood is never able to reach the dramatic heights it is obviously aiming for, and the reason it's never tedious and always watchable. There might be a great dramatic performance in him.",
    "date": "2021-06-24"
  },
  {
    "user": "Betty Jo Tucker",
    "rating": null,
    "text": "If you love movies from the heart, you can't beat this one.",
    "date": "2021-06-24"
  },
  {
    "user": "Graeme Tuckett",
    "rating": 3.5,
    "text": "Fatherhood turns out to be a pretty decent tearjerker, with a few moments of genuine pathos and heartache to power it through the sentiment and schtick.",
    "date": "2021-06-23"
  },
  {
    "user": "Allen Adams",
    "rating": 3.5,
    "text": "It's got laughter and tears, tragedies and triumphs - all the stuff that comes with being a dad. It's got plenty of heart and plenty of Hart.",
    "date": "2021-06-23"
  },
  {
    "user": "Edward Porter",
    "rating": 2.0,
    "text": "Parenting would be easier if it was as predictable as this comic drama from Paul Weitz...",
    "date": "2021-06-22"
  },
  {
    "user": "Pablo O. Scholz",
    "rating": null,
    "text": "Neither the gags nor the sentimentality arrive. [Full review in Spanish]",
    "date": "2021-06-22"
  }
]