[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie kind of flew under the radar (pun unintended).\n\nGreat acting from Powell and Majors!",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Did we watch the same movie? Or maybe a better question—has anyone rating Devotion so highly actually seen Top Gun?\n\nWhile Devotion aims to tell a meaningful story of loyalty and sacrifice, the execution is mediocre at best. The emotional weight simply doesn’t land. There’s no real chemistry between the main characters, which makes their supposed bond feel forced and unconvincing.\n\nThe film falls back on a familiar Black vs. White dynamic but does little to explore it in a fresh or thoughtful way. It's more message than story, and that imbalance weighs the whole film down.\n\nThe biggest letdown? The aerial scenes. What should have been the most thrilling part of the movie ends up being oddly lifeless and forgettable. There was so much potential for tension and spectacle, but the final result is just… bland.\n\nDevotion isn’t a disaster—but it’s nowhere near the powerful war drama it’s trying to be. It had the right ingredients, but never manages to put them together in a way that truly soars.",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie base on a ture story.",
    "date": "2025-04-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I cried hard at the end of the movie.  I loved the story and admired the man he became in the difficult time of American history.   He was a hero.",
    "date": "2025-03-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Good but not great. A little bit slow, and we expected a little bit more excitement.",
    "date": "2025-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Racconto tratto da una storia vera ed interessante sulla \"guerra dimenticata\" degli USA in Corea.\nMolto ben rappresentato è il momento che vissero i militari che presero servizio negli anni successivi alla seconda guerra mondiale; con l'entusiasmo della vittoria e l'inquietudine di non poter essere altrettanto glorificati ed utili come la generazione precedente, i personaggi vivono l'eterno dilemma tra la sana e \"noiosa\" pace e l'adrenalina della battaglia.\nOltre a ciò viene introdotto in maniera molto più superficiale il tema della diversità di razza e con esso alcuni dialoghi abbastanza pesanti e noiosi.\nInfine le sequenze di azione e la cronistoria sono di buono spessore e portano i personaggi verso una battaglia finale in cui non tutto è chiaro ma si prende atto del solito eroismo raccontato in modo un po' troppo semplicistico.",
    "date": "2025-03-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "For those who love war movies and that this is based on a true story,  with great leads by Majors and Powell. I was very much on the edge of interest to the end. Lived the real photos at the end .the true story changed a bit but is online. \nDefinitely a MUST SEE!",
    "date": "2025-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Devotion is a surprisingly emotional movie that has a lot of things that you would not expect in this movie. It is not a typical navy or Air Force movie. It expands on lots of mental errors of being a navy pilot. I like this movie although it is very sad. Recommend",
    "date": "2025-02-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Devotion es una película que, a primera vista, parece seguir el camino de los biopics bélicos clásicos, centrando su narrativa en hechos reales ocurridos durante la Guerra de Corea. Dirigida por J.D. Dillard, la película se esfuerza en contar la historia de Jesse Brown, el primer aviador naval afroamericano, y su relación con su compañero Tom Hudner. Sin embargo, lo que podría haber sido una obra coral que explorase las dinámicas entre todos los pilotos del escuadrón, queda relegado a un enfoque casi exclusivo en la relación de estos dos protagonistas.\n\nJonathan Majors, en el papel de Jesse Brown, brilla con fuerza. Su interpretación es contenida y poderosa, logrando transmitir tanto la fortaleza como las vulnerabilidades de un hombre que hizo historia en un contexto de discriminación racial. Glen Powell, por su parte, encarna a Tom Hudner con solvencia, aunque su personaje carece del desarrollo necesario para que la relación entre ambos cobre toda la profundidad emocional que se pretende. La química entre ellos es palpable, pero uno no puede evitar sentir que la película podría haber sacado más provecho de los personajes secundarios y las interacciones grupales.\n\nUno de los aciertos de Devotion es su capacidad para capturar la soledad y el peso emocional que Brown llevaba consigo. Las escenas en las que el piloto se enfrenta a sus demonios internos son algunos de los momentos más poderosos de la película, pero el guion parece empeñado en recordarnos constantemente su heroísmo, en lugar de permitir que los actos hablen por sí solos. Este exceso de didactismo le resta fuerza a una historia que podría haber sido más sutil y conmovedora.\n\nEl aspecto técnico de la película es sólido. La fotografía de Erik Messerschmidt destaca por su claridad y belleza, especialmente en las secuencias aéreas, que logran transmitir tanto la majestuosidad como el peligro de los combates. La banda sonora, compuesta por Chanda Dancy, acompaña bien las emociones del relato, aunque en algunos momentos puede parecer demasiado insistente.\n\nLa mayor crítica que se le puede hacer a Devotion es su enfoque narrativo limitado. La Guerra de Corea y las misiones aéreas ofrecían una oportunidad perfecta para crear un drama más amplio y complejo, explorando las historias y motivaciones de todos los pilotos del escuadrón. En lugar de eso, la película se queda en la superficie, concentrándose casi exclusivamente en la relación entre Brown y Hudner, lo que deja la sensación de que había un potencial mayor que no se llegó a aprovechar.\n\nEn definitiva, Devotion es una película que emociona en muchos momentos gracias a las interpretaciones de su reparto y al cuidado apartado técnico, pero que pierde algo de fuerza al no atreverse a ir más allá de su fórmula convencional. A pesar de sus limitaciones, es un homenaje digno y sincero a un héroe olvidado, y una muestra de cómo las conexiones humanas pueden perdurar más allá del tiempo y la tragedia.",
    "date": "2025-01-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Good tribute film to Jesse Brown, and a nice period piece production. However, there was little chemistry among the actors. The sentimentality seemed forced and character development was strikingly limited.",
    "date": "2025-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "'Devotion' is a story long overdue to be told and shared. What an amazing contribution Jesse Brown made to America. I am grateful for his service.\n\nThe photography and special effects were good. Unfortunately, the acting and editing were uneven. Specifically, Jonathan Majors brought a lot of anger to the role while Glen Powell was too soft. \n\nPerhaps their depictions were accurate. I expect there was a lot of challenge within Browns' life and that he struggled with his own acceptance but Majors' seemed to have overacted the role. Powell's acting was like a soppy wet blanket.\n\nRather than watch this movie, find a good book on this story. You'll be glad that you did!",
    "date": "2024-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "One of the worst movies I have ever seen. This movie is a complete waste of time.",
    "date": "2024-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Horribly boring movie!",
    "date": "2024-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "With decent actors and fighter pilots and a great true story, I’m not sure how this movie ended up being average.  The performances are good, but it just felt like the director and writer didn’t know what they wanted the movie to be about.  So they just tried to do too much and ended up making a confusing, and at times dull, film.  Shame, as the true story behind this film is amazing!  Worth watching once.  3.5 stars",
    "date": "2024-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Dear Alfredo M: \n\nWhat's your problem with a studio's devotion to wife-beaters?\n\n-Lonestar Reviews",
    "date": "2024-06-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the most heartwarming movies in my 66.5 years of life.  Jonathan Majors and Glen Powell make the best of friends in this movie.  It is a must see. Have the tissue handy!",
    "date": "2024-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Amazing movie with an interesting cast of characters and a well written, profound relationship between them. This movie also features planes from an era that isn't often talked about or depicted on screen which is refreshing and a treat to aviation fans.",
    "date": "2024-03-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "All around good movie on all levels",
    "date": "2024-02-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Well done! Really well done!",
    "date": "2024-02-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very nice and light film. I love it even though most says it's not good. Everybody has different tastes. 👍",
    "date": "2024-01-29"
  }
]