[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, o elenco é mais ou menos, e ninguém ajuda a melhorar o filme, a história é fraca, e o filme deveria ter cenas bem melhores, e a Elizabeth banks é fraca como protagonista.",
    "date": "2025-03-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It seems the critics hate this film. It's a sure sign it's a funny movie. I've been searching for a decent rom/com that isn't formulaic Hallmark/Lifetime or where the main character isn't extremely unlikeable and the main characters hate each other but find love anyway. \n\nElizabeth Banks made her character fun, relatable and most of all likable, which so few rom/com actresses can pull off. Overall, it's an enjoyable rom/com. The situations were genuinely funny, especially as Meghan ventures home from the hood in her yellow dress. The situations are absurd, and yet the cast seems to make it work nonetheless. I had a good amount of laugh out loud moments watching this film.\n\nGave it 4 stars.",
    "date": "2024-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Doesn't deserve such a low score. It's great for a comedy movie, the plot isn't meant to be taken too seriously.",
    "date": "2024-02-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Wanna find a great movie? Go for the one the critics hate. Like this one. This was such a hilarious movie, played brilliantly by the always charming and entertaining Elizabeth Banks. Recommended.",
    "date": "2024-02-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I really enjoyed this, it was fun and a bit different. Meghan goes on a night out with her friends, has too much fun and then follows the inevitable walk of shame. Only she has to be at work, and everything goes a bit pear shaped! It's harmless fun and worth watching with pals.",
    "date": "2024-01-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Idk why people are hating on this, it was a fun time",
    "date": "2023-12-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "What is wrong with you people, this is funny and clever. wtf, Elizabeth Banks is fantastic.",
    "date": "2023-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Daring outrage comedy. I leans into a lot of simple but loaded situations.  Its funny and fun a lil dark.",
    "date": "2023-04-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "50/100 - not really good, painful to watch, its really hard to suspend disbelief of how stupid everyone is which is the only way the movie works but it just doesnt because none of the characters would be in the positions they are in if they acted even remotely close to how they act in the film. its weird. i like elizabeth banks but this was just bad.",
    "date": "2023-01-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Talented cast with a script as funny as a family funeral.",
    "date": "2022-12-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I laughed so hard! Great movie!",
    "date": "2022-04-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I always like to see these movies with low ratings on Rotten Tomatoes. They are the best. But sometimes it's bad inded, and it's so bad it ends up being a good one. A copious sample of somthing radically singular. Do you know how...(?).",
    "date": "2022-03-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Sou bem pé atrás com comédias, começou bem, achei que ia ser pelo menos divertido, mas não, a tradução tb não ajudou, algumas piadas ficavam sem sentido, não vale a pena..",
    "date": "2022-01-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Pretty funny movie, but not a good movie",
    "date": "2021-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Wow -- why are people so virulently anti this movie? It was actually very funny. At the time it came out, in 2014, I wouldn't have seen it, but 7 years later, on a bland ordinary evening at home in 2021, having it pop up on Netflix, I watched with super low expectations and enjoyed the hell out of it. It was at times truly hilarious. I hate the expressions Laugh Out Loud Funny...but it is. I can't believe critics said it was misogynist -- they didn't get it. The story is this: a woman who's a pleasant chipper flawless newscaster is in a rut in her personal and professional life, and up for a promotion at a bigger news station, doesn't get the job AND gets dumped by her boyfriend in one evening, sending her into a tailspin--her 2 partier friends convince her to go out and get trashed in an uncharacteristically skimpy outfit one of them lends her, she ends up going home with a cool artist guy, gets locked out of his loft, and has to somehow get home. Hijinx ensue. I love variations of the \"Odyssey\" narrative, because we all want to find our way back home, one way or another, whatever that means---and this one is witty, litely political, bold in terms of claiming who you are internally rather than externally, and about love, friendship, and pretty damned funny slapstick, pratfall, and misunderstanding-based humor. Give it a shot! You may be as pleasantly surprised as I was.",
    "date": "2021-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Walk of Shame is a Romantic Comedy at its core. This is cute.  I smiled a number of times.  I did not laugh out loud, but I smiled. Elizabeth Banks has some comedic chops, and the movie has a fun, less than believable plot, but it is ok.   The supporting cast is very good, especially Alphonso McAuley. This was ok to pass the time.",
    "date": "2021-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "In\"shamelessly\" loved this movie.  I had many laugh out loud moments and I thought Elizabeth had great comedic presence.  I always enjoy watching James Marsden too.  I was surprised at the low ratings but to each his own.   I haven't laughed this hard in a long time.",
    "date": "2021-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie is full of shame!",
    "date": "2021-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I think that is was actually funny and quite relatable depending on your day :)",
    "date": "2021-06-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Elizabeth Banks IS the movie And she shines in her role as Meghan Myles. Al the other characters play off of her. We watch this movie constantly ripping out the dialogue from the scenes and reuse it to amuse ourselves.  Sure, it ain't gonna win any awards but Elizabeth Banks carries this movie from start to finish and she is brilliant.\nWhen I'm down and out I just flip on this movie and laugh my ass off.",
    "date": "2021-04-16"
  }
]