[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Lots to like here, absolutely incredible 1st half, great cast too!",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "An extremely underrated addition to the franchise, and one of the better action movies in general. Jeremy Renner delivers a solid performance in the lead. He's no Matt Damon but he holds his own during the action scenes and I would've liked to see more of him.",
    "date": "2025-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A solid spin-off with strong action, but not quite the Bourne magic of the Damon films.",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent storyline, plot, and pace. Obvious excellent direction & screenplay as all characters worked seamlessly in synchronicity. Jeremy Reiner was absolutely phenomenal in this role. Didn’t miss Matt Damon one bit and that’s a tall order for sure. Fight sequences were of perfection and quite believable. Was so impressed with this movie and don’t understand why it got such low ratings.. should be in the 80s though I’d give it in the 90s or higher. 👍👍👏🏼👏🏼❤️❤️",
    "date": "2025-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Doesn’t deserve the hate. Fun movie",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "If you are into the Bourne Franchise then you will enjoy this movie. Definitely as good as a few of the Matt Damon movies. Jeremy is actually a more \"believable\" agent than Matt who does an excellent job himself. The usually \"Bourne movies\" high speed chase is thrilling. I would enjoy seeing another movie from this pair of actors. Don't believe the haters and give this movie a chance with an open mind and just know going in that Jeremy is not trying to play Matt's role but is creating a new character.",
    "date": "2025-06-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This was a nice watch. They at least should have showed a cameo of real Bourne...",
    "date": "2025-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme mais ou menos, o roteiro é fraco, as cenas de ação são mais ou menos, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom.",
    "date": "2025-05-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Jeremy Renner's worst movie in 2.25 hours!!!!!!!!!!!",
    "date": "2025-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "5 years after the closure of the original trilogy, from Hollywood “Heavens”, Tony Gilroy, the screenwriter working on the franchise, newbie career as Director, comes The Bourne Legacy, solidifying the trend of bad naming of movie sequences. In 2025, and the knowledge that this film grossed abover estimated budget, we can say The Bourne Legacy was successful; but does it stand the test of time?\nIn this film, we only get Matt Damon through flashback scenes from the previous films, instead, lead actor Jeremy Renner plays Aaron Cross (foreshadow much?), an operative deemed dismissible after the events of The Bourne Ultimatum triggers a reaction chain that puts all Black Ops in dismay. \nThe plot is alright, but nothing new from the other entries in the franchise. I guess Legacy works more as a generic conspiracy movie, you could take out Jason Bourne out of the way and it still would have had the same plot points, for the most part.\nAnother detractor is that the chemistry from characters Aaron Cross and Dr. Marta Shearing just doesn’t work. The story tries to use a lot of backstory romance to justify their subplot, but it flops. In the end, their story just feels forced, the unnatural woman in distrass falls in love by their sort-of captor. Weak.\nOverall, Legacy leaves actual bad history for the franchise, one that could just have been dismissed altogether. Without a strong premise other than just a character we don’t care much trying to stay alive, The Bourne Legacy might work as a no-brainer Sunday movie, but fails as a driver for the franchise.",
    "date": "2025-05-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's watchable. Renner and Weisz make an entertaining action-movie couple.",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The fourth entry in the Bourne series does a commendable job of expanding upon Matt Damon's escapades. Jeremy Renner does a fine job assuming the lead, and Rachel Weisz delivers a very believable performance. The idea that the spies in this film are physically and mentally enhanced through medical prowess adds an interesting and new element to the spy subgenre.",
    "date": "2025-04-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The Bourne Legacy is a surprisingly excellent and thoroughly entertaining film. Watching it now, more than a decade after its release, I was genuinely impressed—especially given the unfairly harsh reviews it received at the time. The plot is solid, skillfully expanding the Bourne universe even without Matt Damon (which, honestly, works just fine). Jeremy Renner brings a compelling mix of strength, resourcefulness and grit to his character, while Rachel Weisz shines as a feminine yet smart and capable woman who rises to the challenge in her own way. The pacing is tight, the action well-executed—I seriously loved this movie.",
    "date": "2025-04-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This is more than worthy of the bourne name , I was there were three of these. I put off watching it for years because I didn’t think it would live up to the other movies but it does",
    "date": "2025-02-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "My Favorite Bourne film.",
    "date": "2025-01-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Jeremy Renner is just a better actor than Matt Damon and it shows in this \"Bourne\" film. Great story, cinematography, good action and Rachel Weisz. It's the only film in this franchise that I've watched more than once and like Tokyo Drift, it's the best in a series and way underrated.",
    "date": "2025-01-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Not worthy of the bourne name",
    "date": "2025-01-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Well acted, great story, great action and scenes, nice change from the other Bourne movies. I don't get how it got low ratings - at all.",
    "date": "2024-12-31"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This is an incomprehesible mess. The characters lack credibility and the plot is ridiculously convoluted. The film trades on a quality brand, but in all likelihood will destroy it.\nA M.",
    "date": "2024-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I though this was an excellent movie I am a huge Jason Bourne fan. This is not a Jason Bourne movie duhhh. As a stand alone movie it as good if not Better the the Jason Bourne movies which I liked. Don’t listen to the reviews. See it yourself. I wish that had made more of them with Jeremy Rainer",
    "date": "2024-10-30"
  }
]