[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The story was the most interesting part of the movie. It was all put together pretty well and it carries the movie. Some of the reveals were very good and the surprise was nice to bring some life back to the slower film. Outside of Richard Damijo I didn't really care much for any of the other actors, which to be fair based on their missing pictures seems like rotten tomatoes doesn't either. Action was the roughest part, much of the action being laughably bad. But all in all an ok movie for the story and a sad story of what life can be like in other countries. So much of what happened was believable that I half expect it to be based on a true story.",
    "date": "2025-09-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A movie which takes an uphill climb of infusing the inexplicable experiences of the average Nigerian into cinema, doesn’t quite get to the summit.",
    "date": "2025-01-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Editti Effiong did a magnificent job. I enjoyed the plot twist and how the entire story pieced itself together. Coupled with talented actors, he told this story beautifully. I definitely recommend. A must watch indeed",
    "date": "2024-05-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This movie can be considered healthy in production but still, it's weakness to produce intriguing and uncommon storyline just places it on the same page with lots of other movies with very similar themes and plot.",
    "date": "2023-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Very slow plodding by the numbers sort of film just seems to go on and on and you hope it will get better but it doesn't \n\nBordering on boring how anyone can compare this with John wick is beyond me \n\nIt's crass and not worth suffering",
    "date": "2023-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The Black Book is one of those films with wasted potential, it has an engaging plot that suffers from an absurd number of holes. Different stories seem to enter the main story of The Black Book at inopportune moments, in the end, more confusing than embellishing the plot. I even researched if this movie was based on a book, but I didn't find any substantial information; at least it would explain the various arches, creating an architecture as clumsy as Cubism.\n\nThe plot follows Paul Edima, a former hitman for the Nigerian government, who decides to return to his roots after his son is framed to cover up a corruption scheme. Simple but effective, however, marred by a secondary plot about such a black book, a plot that appears out of nowhere in the second half of Act 2.\n\nWhen Act 3 begins, you're so confused that you end up hanging on until the end in hopes of finding some sense, but you don't. In the end, The Black Book fails to put together the pieces of the complex puzzle it has created.\n\nThis movie isn't just mistakes. The theme, given the awesome setting, is relevant and appreciable. The performances of Richard Mofe-Damijo and Ade Laoye are commendable. Too bad these pros don't save The Black Book from falling into the pile of movies with good premise but poor execution.",
    "date": "2023-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The Black Book\n\nThis Nigerian Crime Thriller sees its lead character, Paul Edima, on a revenge journey against those involved in the unlawful killing of his son.\n\nAs with many blockbusters that Nollywood has been churning out in recent years, The Black Book is star-studded, from the insignificant to the important characters. This helps the movie maintain a firm grip on the performances from the cast, but Ade Laoye and Bimbo Akintola (even with her limited screen time) deserve praise for their portrayals.\n\nThe Black Book starts with a simple plot, and the first quarter is backed by its emotional core. But as the movie unfolds it becomes complex, and the twists employed don't always help the story's progress. Some relationships are glossed over, and some characters are unimportant.\n\nEven though the plot needs refinement, the cinematography is beautiful and elevated with its choice of locations and set designs.\n\nThe Black Book can best be summed as Nigeria's answer to the American John Wick.\n\n6/10",
    "date": "2023-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I love Retribution, and cliche crap acting can cross the ocean.",
    "date": "2023-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "For the first half, I was a little unsure, the plot seemed simple, and the action rather limited, still I loved the views of the streets and the subtle moments of comedy. It was the second half that brought this picture into the realms of great filmmaking when suddenly the plot thickens, the actions are explained and a depth is reached that brings illumination and intrigue. Looking back I can think of so many things that made this film enjoyable, however, it was the mixture of great acting, feminist ideals, political observation, and good versus evil that for me made the movie stand out. This film is a top draw in an age when so many films try to portray crime and corruption this one is actually even-handed in its approach showing all the angles. We learn about the characters both innocent and not-so-innocent and we see for ourselves what one man will do to find justice at any cost.. It would be a crime to miss this one.",
    "date": "2023-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I must say that of all Nigerian movies i'v watched, this must be top 5 WORST movies of all time. Poor acting, poor scripts, poor choice of actors for certain roles, poor visual effects, poor directing. The errors in the movie where too many. Coming from a Netflix production, i wonder why this was so disappointing. The movie did not do justice to some great Nollywood actors in it. It only has 2 stars for some good actors that where unfortunately underused and overwhelmingly embarrassing",
    "date": "2023-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The Black Book (2023) is an absolutely decent watch for a crime thriller. With beautiful performances from its cast, well-layered score,  good production design, and a relatable story about loss, sins, corruption, and power but it doesn't sail smoothly till the end as it loses its track trying to chase many things/themes at once and abandons it's own setup and a rushed third act that plagues many Nollywood movies. It nonetheless holds good entertainment value as it's not bad, but it could honestly have been better.\nRATING: 7.5/10",
    "date": "2023-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Woman power. The love of a father. Stopping corrupt government officials.",
    "date": "2023-09-23"
  }
]