[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Horrible conclusion.The original series states clearly that only Jim could’ve been the trollhunter, which is contradicted with the ending of this film.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Why did steve get pregernant (Man btw)",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I truly was confused at the beginning of this movie, but after the first half hour I was engrossed in the action and excitement of the plot of this movie. The ending left me bothered, but I don't think it stopped me from enjoying this animated gem.",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Hard to follow coming in not having seen the series, but the ending was a cop out.",
    "date": "2025-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Bruh, Jim could have gone to the beginning of the movie.",
    "date": "2025-06-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "You don't know the resentment I have towards this film, I entered this universe thanks to Wizards then I saw Trollhunters and I loved it, 3Below not so much, Wizards was so-so but it gave a good base, but this film was a disappointment in all its ways there are moments in the comedy that definitely gave me a tremendous cringe like the pregnant Steve, then the forced deaths like Nomura and Strikler, Toby was good but the truth is he is not the type you would sacrifice, and of course the moment when made me cry with rage when I saw it for the first time seriously I left the house to process what I had seen because I couldn't believe it, this definitely made me hate time travel",
    "date": "2025-05-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "What do I say about this Movie decent Animation way godly , Story okay ,High stakes,Only focused on certain characters, Made Jim pretty weak ,Soundtrack was okay but the end so terrible like I was a fan of this franchise and just to see the Lore just disappear faster than thanos can snap the whole universe worth a watch but a very disappointing ending",
    "date": "2025-01-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "why didn't this franchise have a definite ending? 😟😟",
    "date": "2025-01-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Bruh all that lore was for nothing as in the end, Jim resets the ENTIRE damn story.",
    "date": "2025-01-20"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "No fixed resolution?! Come on! It's just gonna loop on and on and on...",
    "date": "2025-01-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Decent movie which is ruined by it's godawful, horrible, stupid ending.",
    "date": "2024-12-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Increíble película pésimo fina los últimos 5 minutos destruyen la saga ojalá dreamworks arreglara eso.\nTodos los fans lo esperan",
    "date": "2024-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Don't get me wrong this is one of the most underatted sagas in Netflix and the movie was great but the Ending was one of the worst possible for true Trollhunters fans like me as this ended 6 years of Storytelling \n\nSPOILER AHEAD FOR WHO HASN'T WATCHED YET \n\nToby dies and then Jim just resetting the whole timeline it's just ................... MORBID",
    "date": "2024-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "best movie to end the show",
    "date": "2024-06-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "w movie dawg animation, fights, characters, amazing franchise",
    "date": "2024-05-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I enjoyed the movie. It was so good\nI liked how they finally made it appear that everyone knows about the mythical creatures in the world. I enjoyed how it kind of mixed all three series together. But I am very disappointed by the ending. It made me feel like watching hours of this series meaningless \nSpoiler alert:\nToby is the new troll hunter??? That is not how you end a movie",
    "date": "2024-04-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "SPOILERS: Mostly just reactions to negative comments.\n\nThis was a beautiful action packed ending to a great series. \n\nFor the reviews saying that they hated Jim's outlook and the fact that he doubted himself so much don't understand how much pain Jim went through in the series before. From being earth mightiest hero, to having his amulet destroyed, becoming a troll, being stabbed in the heart, and controlled by dark magic. It weighs heavy on your mind and you soul, and it made for an amazing redemption when he finally unlocked the amulet and wielded Excalibur! All that build up for 4 minutes of glory lol To me to was very much worth it, I can relate to Jim in so many ways.\n\nFor those saying they felt like many characters were \"nerfed\" in this series like Douxie, Aya (especially her character and decision making) need to check the title of the movie again. It's the Trollhunters-Rise of the Titans. In Wizards Jim and the 3 Below cast has to take the backseat. And in 3 Below the Trollhunters had to take the backseat. I think Douxie played a great role, and Aya seeing her planet destroyed wanted to save as many people as she could. I also literally laughed out loud when Steve was impregnated, and I rarely belch out like that. \n\nNow for the negative , I personally disliked that Toby will become the next Trollhunter. I feel that will distort time in a major way and Jim is taking a huge unnecessary risk. Toby had always been happy with his role until the end of the movie when he felt underpowered and out of place. \n\nBUT the good thing about the ending is they left it open for the audience to interpret the next chapters for themselves. All in all, a great movie though the ending was a little offsetting.",
    "date": "2024-04-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie was sad I rewatched the series and forgot how 💩this movie was the other review speak for me",
    "date": "2024-03-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "There were some fairly cool parts (the Pacific Rim scene, the new amulet, making the story darker with character deaths) and most of the story was good, but the voice acting (specifically from Emile Hirsch) wasn't very good, especially in the emotional parts. On top of that, the whole subplot of Steve and Aja having kids ended up just being weird, and the ending just made everything meaningless. It was mostly fun and kinda good, but overall mid",
    "date": "2024-03-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I love this movie with its hilarity, action and story. Very sad that this is the last we will see of this universe. Hope to see more",
    "date": "2024-03-03"
  }
]