[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "11/10. The best movie ever. Did Fast and Furious ever feature BONO????",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Perfekt movie, I did not think this was possible. The music hits just right, and all the characters are explored in their own ways again. 10/10",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best cartoon ever made, period.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is one of the best movies of 2021! Johnny’s performance in the first and second movie are both my favorite, and I would not be surprised if his performance would be my favorite in the third movie. Awesome casting, AMAZING singing, and overall a great movie!",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I don't get it. Why. It's not that good. The eating is the same as the Shawshank Redemption!!!! HOW!!!!!??!!???",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "“Dear Illumination Writers: Congratulations, you’ve created a character so insufferable that she caused me actual psychological damage just by saying ‘Hey.’ Porsha Crystal is such a masterpiece of annoying writing that she single-handedly made me lose faith in PG movies and seek refuge in disaster films where at least the destruction has meaning. You spent $85 million to traumatize children and adults alike. I hope you’re proud of yourselves for unleashing this weapon of mass irritation upon the world. I rate the overall movie 3 stars, because it wasn’t that bad, but seriously, one awful character ruined it for me.",
    "date": "2025-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A very successful follow up to the original. At one point the movie does teeter on edge of going over board by going too big and losing the small stage charm the first one had, but the music and performances were so good. The fun and entertainment never lacked.",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This movie was a blast to watch",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "nothing bad to say, just very entertaining",
    "date": "2025-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "While sing one arguably has better songs, sing two has more interesting characters and story. Watch both, both are good! Love both, am not a bot, trust!!! Banger movies -Not three chihuahuas in a trench coat",
    "date": "2025-06-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "¡Excelente! un %87🍅🧊",
    "date": "2025-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Honestly not very bad! On a tier it would be an a tier! The first sing was just decent, but this one is a massive upgrade! Banging sound track too!",
    "date": "2025-06-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "great movie for granddaughters that are 5 and 7",
    "date": "2025-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love the humor in its length of 1 hour and 50 minutes!!!!!!!!!!!!! Rated PG for Some Rude Material and Mild Peril/Violence!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $162,700,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-06-04"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This was the worst waste of time in my life. If I could give 0 stars I would.",
    "date": "2025-05-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It’s a really genius sequel!! They were missing some of the characters, but otherwise it is amazing!🤩",
    "date": "2025-04-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What a gorgeous and beautiful movie. I don't care what age you are...if you can't find some kind of tranquility or peace watching a movie this good, then I truly fear for your soul.\n\nMy vote: 10/10 animated masterpiece.",
    "date": "2025-04-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "#1. When the first Sing movie came out, I found it a pleasant watch. It's one of those kids' movies that even if you’re an adult, and there’s absolutely no shame in that, you’d find yourself wanting to watch it with the whole family or even when you're alone. Then, when Sing 2 first came out, I was unsure and uninterested in watching it because sometimes movies that get a sequel don’t live up to the original and are often met with disappointment, so I didn't watch it. But later, a few years past, I was bored and decided to give it a try. You know that feeling when you come out after watching a movie that it alters your brain and attitude in some way, feeling inspired and something else you can't quite explain. That’s how it was for me. Everything was just magical from the characters, music, and visuals which in my opinion tops the first movie. There were so many things going on, but not in a bad way because it felt like the switching of scenes to the next as well as the music choices were done well that it made it hard to tear your eyes off the screen, and I couldn’t help but also sing along to the music.\n\n\n\n #2.                                Additionally, the opening scene made me wonder what was going on because it showed a dark and gloomy atmosphere, then the music was played, and everything suddenly became bright. I realized that they were doing a play, and it all made sense. This may not be important, but I feel like it's intentional so that it gets the viewers’ attention from the get-go. Another thing is the parallelism of the first scene (Buster chasing the taxi - where Suki is- on a bike) to the last scene (Suki chasing the bus), and the part where they jumped out of the window and went along with the show without completing their practice was the climax and a remarkable feat that they ended up pulling it off despite the troubles throughout. (This part will always be my favorite, and I started liking Porsha too. Her personality was not the greatest initially, but she ended up helping and she can definitely sing and dance well) \n\n\n\n#3. We're introduced again to the main character, Buster Moon. And just like in the first movie, he's an ambitious Koala who keeps aiming higher for his goal – which is to have his show/plays be seen and known by a lot of people. After a negative encounter and some self-doubts, he wanted to prove that he could achieve his long-life dream. So, with his group, each having a unique personality, they set out to the city where with their skills and some deception made their way to perform. Because of their lies, they encountered some troubles and consequences from short deadlines, unpleasant people and circumstances, and a cruel boss. \nHowever, despite the odd way of reaching their goal, you can sympathize with them, especially with the internal problems they were facing. They were also unwilling to give up despite the obstacles thrown at them, and even when all hopes seemed lost within the group, the determination of one character lifted the whole group up, and ended up doing something crazy in a fun way. In the end, everyone achieved what they wanted. After watching this movie (A couple of times already), the message I got is if there’s something you want in life, whatever obstacles you face, and whenever people doubt you, just keep going despite the difficulties you’ll face, and if you give up now, you’re giving up a possibly great future. Although it’s important to be rational with your decisions and this movie sets some unrealistic standards, the message still stands.\n\n\n#5. Again, even if you’re older than what age this movie’s for, I still recommend watching this if you’re chilling alone or with your family or you can just play it in the background which I do and probably will continue to do so.",
    "date": "2025-04-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great movie! So colerful and funny. Loved it.",
    "date": "2025-03-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Illuminations best movie yet. 10/10",
    "date": "2025-02-25"
  }
]