[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Cómo todas sus películas es una gran crítica social, una reconstrucción total de nuestra sociedad machista y opresora donde estamos tan dependientes de los medios tecnológicos que nos perdemos como persona, muy buena si no fuera porque le faltaron escenas de sexo, que en mi opinión hubiesen enriquecido a la trama.",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Molto inferiore ai primi 2 ma è 100 volte meglio del suo successore",
    "date": "2025-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Peak cinema, so bad it's good. Alvin and the chipmunks is the movie",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "David Cross is easily the best part but everything isn't half bad either.",
    "date": "2025-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was a fun time seeing it in theaters back in 2011.",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 27 minutes!!!!!!!!!!!!!!!!!!!!! The USA grossed over $133,100,000.00!, with a worldwide gross of $342,600,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I just watched it and it was full of comedy and heartwarming moments. I loved it. Awesome 3rd movie",
    "date": "2025-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It’s a pretty good kids movie to be honest",
    "date": "2025-05-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I was obsessed with the first two movies so I expected to like this movie when I first saw it. Not really it went in a total different direction, I thought compared to the first two. I rate this one good. It can’t compare to the first two movies. The first two were awesome.\nSpoil Alert\nThey go on a boat. Alvin causes problems of course. Dave punishing them of course but doesn’t work really. They fly a kite and accidentally get separated from Dave. The chipmunks and girl chipmunks get stranded on an island having to learn how to survive. Simon turns into a romancer for Janette. Along the way meet a lady. They all become friends with her until later on Dave and Ian find the Island. The lady’s true colors comes out when she sees gold that’s the whole reason why she came to the island. Chipnapping Janette to get gold for herself. With the help from Alvin Janette is free. Everyone gets off the island before the Valcano explodes. Janette forgives the lady. Then they go perform.",
    "date": "2025-04-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Boats and hoes boats and hoes",
    "date": "2025-04-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Poor David Cross, stay away from this movie, fellas.",
    "date": "2025-04-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "i love the way janette moves her body. Theodore is the cutest little guy i’ve ever seen i want to put my face in his belly fluff. Alvin is a really good singer. uncle Ian is awesome! BMS",
    "date": "2025-03-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "So do they come up with the pun first and just develop the movie around that? \n\nCheck out my longer review:\n\nhttps://youtu.be/4BAhhbkexfc?si=9gDVR9yyIp71pZIT",
    "date": "2024-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing movie t hey got chipwrecked",
    "date": "2024-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Would be better if alvin started acting like p.diddy like in the first movie",
    "date": "2024-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The best of the series",
    "date": "2024-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This movie killed my will to live, except Ian he was great (3 stars because third movie)",
    "date": "2024-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It is just Castaway but instead of Tom Hanks it is annoying chimpmunks",
    "date": "2024-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent movie would 100% recommend. I love all of the chipmunk movies but this one is by far the best. Masterfully crafted story, very intense with increasingly high stakes compared to the other movies. Incredible action and beautiful script, I could talk forever about how good this movie is. Acting is also extremely impressive and the humans interact splendidly with the chipmunks. Love this movie 😜",
    "date": "2024-04-22"
  }
]