[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I’d never heard about this young, brilliant man whose life ended way too early and in such a horrific way. His story was at once inspiring and tragic. Each of the actors in this film were excellent. This film moved me to tears, although there were many scenes that made me smile. I thoroughly enjoyed watching this movie and I highly recommend it.",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Brilliant. A film we will watch again & again. Tragic. Relatable. Many teachable moments. Unforgettable. Loved it.",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "1 hour and 59 minutes based on a true story!!!!!!!!! Rated R for Drug Content and Language!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $374,700.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This is a gripping true story and one I was really glad to learn more about. This is a tale of extreme potential, but life’s perceived commitments holding someone back. I was rooting for Rob every step of the way. If you know the title of the book this film is based off of you know what happens. I did find it to drag on a bit and would have been a better, more clear, concise film if 20 minutes or so of time was cut. Overall a good watch.",
    "date": "2025-03-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very well done and moving.",
    "date": "2024-12-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Ridiculously unrealistic. Extremely loosely based on a true story but nothing made sense.. No financial aid?  People get locked in jail information without trial? Blatant violation of speedy trial...?  And how would someone on jail not have access to medication and needed his son to pay for medication?  Ridiculous plot awful dramatization far from a true story",
    "date": "2024-12-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Don’t watch unless you want to be disappointed with real life bad choices and squandered opportunities.",
    "date": "2024-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "\"Rob Peace,\" a film that premiered in 2024, was one I regrettably missed in theaters, but I was able to catch it on Netflix. The movie features the talented Mary J. Blige in a key role.\n\nFrom the moment I started watching, I was captivated by the story. It revolves around a father who stands trial for murder, while his exceptionally bright son seeks a way to secure his father's freedom as he navigates college life. However, the father’s frustration grows, as he yearns for release sooner than his son's efforts can deliver.\n\nThe narrative centers on the young man, named Rob—short for Robert—who faces significant challenges as he strives to earn his degree. Along the way, he discovers a knack for chemistry, which leads him into some difficult situations.\n\nIn general, the film was an engaging experience. However, it felt overly lengthy; there were about 20 to 25 minutes that I found myself skipping, as they contained excessive dialogue that didn’t contribute meaningfully to the plot or character development. It felt like filler that unnecessarily extended the film’s runtime.\n\nThe film’s conclusion is quite emotional and difficult to watch. While I had anticipated Mary J. Blige to play a more substantial role, she delivered her performance well, showcasing her talents as both an actress and a singer.\n\nNow, regarding the lead actor, I found his character to be well-crafted, but his portrayal leaned too heavily into a stereotype. While I don't mean to sound harsh, he came across as overly tough or \"thuggish,\" which detracted from the character’s genuine struggles. I believe he could have better represented someone emerging from a challenging background trying to improve his life, rather than fitting into a gangster archetype. This casting choice made it harder to connect emotionally with the character's journey, as it overshadowed the depth of his struggles throughout the film.",
    "date": "2024-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Really beautiful movie!",
    "date": "2024-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Chiwetel Ejiofor brings to life the tragic story of Rob Peace. Even with a few imperfections in the production, Ejiofor navigates rough waters well with the help of good performances and ultimately the legacy Rob Peace.",
    "date": "2024-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "As always, I feel compelled to leave an audience score because the critics on this site have only gotten worse over time.\n\nThis is a beautifully told true story about someone who, despite success after success, could never quite reach the light on the other side. For every achievement, there was always something pulling him two steps back. Yet, in the process and unfortunate passing he left behind a legacy—perhaps unintended and not the one he truly wanted, but remarkable nonetheless.\n\nThis is the beauty of storytelling and theater. Forget the critics—I think this was absolutely worth watching.",
    "date": "2024-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Beautiful movie.  74% from professional critics? F. Y.",
    "date": "2024-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Well cast, good real life story. Loved this film.",
    "date": "2024-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It was a sad movie , Robert tried to help the community and his father and it kind've backfired on him. It's an awesome movie .",
    "date": "2024-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "well written, well cast, and a great watch, recommended for all",
    "date": "2024-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie has strong acting.  It is a story that pull you in.  And leaves complex issues complex.",
    "date": "2024-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This production radiated pure excellence from beginning to end! The fact that it was based on a true story made it one of the most impactable films of its genre I have seen in years. Bravo!",
    "date": "2024-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The actors in this are outstanding.",
    "date": "2024-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "What a waste of a valuable human being.",
    "date": "2024-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I am left with the feeling of being in front of a fairly entertaining film, never too heavy, that invites us to follow Peace's life beyond a life full of complications that offers an authentic portrait of a person destined to fight against the constraints of a place, of moments, of decisions and of a complex life from the beginning.\n\nA conventional, well-made drama, which has its high points and its low points, but which in its final sum ends up leaving the viewer with more sweet than bitter feelings.",
    "date": "2024-09-20"
  }
]