[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best action movie all time?",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Love this movie. Want a good SCI FIE flick this is one to watch, its consistent and keeps with the narrative. Well done. I keep rewatching it. It will not let you down,",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie has an interesting premise, great actors, moments of tenderness, moments of humor, a lot of heart stopping action, and thought-provoking moments that make you wonder if you would have the mental fortitude to do what he did. Thankfully, this happened to a physically fit guy so he could train without having the benefit of time to bulk up. Would be interesting to see how it would play out with someone who wasn't a soldier or a fit dude. 🤔",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is so much fun to watch. Emily Blunt is amazing and Tom Cruz brings his A game. If you're interested in sci-fi action movies then this your movie.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "An interesting ride indeed",
    "date": "2025-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I got really interested in it after he started to wake up and redo, can’t wait for the second film. This was a good movie and the type of action I like.",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is in my personal top 20 of all time for sure. Acting was amazing, visuals amazing, and the writing was amazing. The alien creatures were also really cool, but suffers from the “hive-mind” cliché, but the time travel attribute makes up for it.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Very good story kept me entertained until the end. Was a bit confusing at times, but overall a great movie!",
    "date": "2025-10-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie. A fun idea that's pulled off marvelously. Keeps you on the edge of your seat till the end. After seeing it over and over it is now my go to \"in the background\" movie while cleaning the house.",
    "date": "2025-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I am not a big fan of this type of story but it was well done and kept me interested to the end",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Not usually my cup of tea, but pretty good for an action/sify",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Rewatched this recently and noticed more detail about the story then I have before and now I’m hoping they make a sequel to this awesome sci-fi action flick.",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great entertaining movie. Love these groundhog day style of movies where the characters has to repeat the day. I think it was well done, combo of action and some humor. Hope they do a second one.",
    "date": "2025-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Me encantó y al que no es retrasado",
    "date": "2025-10-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Filme mais ou menos, o roteiro é fraco, as cenas são mais ou menos, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom, e as cenas de ação salvaram o filme.",
    "date": "2025-10-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It's no Matrix--but it's no B movie either. Just a solid sci fi action flick. Snappy with a crisp plot.",
    "date": "2025-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Surprisingly fun action film! Tom Cruise is in his element and backed by a strong cast of seasoned British actors and some incredibly effective CGI monsters. Turn off your brain and enjoy an above par alien/apocalypse  film.",
    "date": "2025-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Creative story and great execution. They tried something out of the ordinary, that's what I wanna see baby!",
    "date": "2025-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Not bad adaptation of the manga version of Live Die Repeat and the cast are really spot on and is actually fun, entertaining, and funny sci-fi version of Groundhog Day.",
    "date": "2025-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Good movie, good cast. Although I was confused a little at the end.",
    "date": "2025-08-22"
  }
]