[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "1 hour and 56 minutes based on a true story!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated PG-13 for Suggestive Material, Language, Thematic Elements and War Violence.",
    "date": "2025-05-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I'm definitely inspired by true stories and this movie did not disappoint. What an amazing story (great script writing and casting not sure if they embellished) but I really enjoyed it.",
    "date": "2025-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What a great movie. Developed the characters well, great acting, and excellent producing. There were enough humorous parts to lighten the mood, all while staying true to the reality of deployment and post war struggles.\n\nAs a dog person...the only flaw I did sense (and it wasn't to a large degree) was that, at times, it seemed she was not strongly bonded with the dog, or that she was not strong enough personality-wise to be his handler. \n\nOverall a solid watch, well worth my time.",
    "date": "2025-04-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Never got me to believe in what I was watching.  Had to turn it off.",
    "date": "2025-03-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A pretty good film regarding the true story of a marine soldier and her dog.",
    "date": "2025-02-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Released in 2017, \"Megan Leavey\" tells the inspiring true story of a determined and resilient military woman as she dedicates herself to serving and protecting her country. Her commitment is evident from the moment she enlists in the armed forces.\n\nThis film is a remarkable piece of storytelling, skillfully directed with a focus on Megan's journey without overwhelming the audience with excessive dialogue or unnecessary subplots. Gabriella Cowperthwaite’s direction allows the narrative to shine through, keeping the audience engaged with its authenticity.\n\nKate Mara, an actress who often flies under the radar, delivers a standout performance in this film. While she may not always be front of mind, her portrayal in \"Megan Leavey\" is powerful and memorable. Her earlier work in the \"Fantastic Four\" may have clouded her talent in the eyes of some, but in this role, she truly shines. Mara draws the audience in, making them feel every emotion throughout her character's journey. The initial choice of her for the lead may have seemed unconventional, yet it ultimately proves to be a brilliant decision, showcasing her skills as an exceptional actress.\n\nThe screenplay deserves recognition as well, as it complements the director's vision. It avoids the pitfalls of overcomplicated dialogue and extraneous storylines, concentrating instead on the core narrative of Megan’s experiences as a soldier. This focus makes \"Megan Leavey\" a film worth watching repeatedly, each viewing revealing more depth to the story. I wholeheartedly recommend this powerful film, which captures the essence of courage and loyalty beautifully.",
    "date": "2025-01-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie and true at that.",
    "date": "2024-12-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very entertaining. Good story.",
    "date": "2024-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "not a complicated movie, but definitely pulls some heart strings, especially if you're a dog lover",
    "date": "2024-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Brilliant, touching tribute to the Marines K9 unit. Kate Mara plays Megan in this touching movie. She nailed it.",
    "date": "2024-04-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "On my first watch of the movie, I think the story is kind of cliche to other dog/military movies.  The story pacing went too fast like it had 1.5× story speed.   Arguably, the worst thing in the movie is the cinematography.  Throughout the entire movie, there was a constant camera shake with every single shot and movement.  I don't think the camera shake had a purpose.  It's like they used a handhold camera in the entire movie.  Have they not heard about a tripod?  Also.  I realized Draco Malfoy was in the movie as the Sergeant.  I didn't particularly care about any of the character due to a lack of a consistent or in fact any character development.  The acting is subpar, and the dialogue is flatter than a flat earther's view on the earth.  That is my honest review.  The only good quality of the movie is that it has the ability to pull on a person's heartstrings and has a touching story.",
    "date": "2024-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Kate Mara is great in this movie not to mention she looks 10 years younger than her actual age. Good true story movie! The bond between owner and dog is like no other. If you two are on the same wavelength it's like you know exactly what the other is thinking. Rex and Megan obviously had that connection and he saved her life on and off the battlefield. Glad they let her take him home to retire. True heroes.",
    "date": "2024-04-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love movies based on true stories. Most of all movies involving dog's. I laughed and cried but most of all I really loved this story. Megan Leavey you and Rex are a true heroes and Thank you for your service. RIP Rex!!!",
    "date": "2024-04-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "As a dog person I loved this story, and as a man (albeit old) I could not help being charmed by how cute Kate Mara looked in her marine uniform. \n    The directing/acting was top notch. \n     The story was great, although I could have lived without her cuddling with her boy friend. Am I just jealous, or was this thrown in to establish her orientation. \n      Worth watching. Go for it!",
    "date": "2024-04-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I had a hard time taking a movie seriously that made a huge mistake almost tight at the start:  when asked a question by an instructor, the response is, \"Yes, sergeant!\", it is NOT \"Aye, aye, sir!\"  That response is to an order from an officer, not a question from a sergeant!\n\nIf you're going to base a movie on a true story, at least have the decency and respect to get obvious details right.",
    "date": "2024-04-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A great job of capturing a glimpse of our war fighters, human and dog. A team saving lives and risking their own to do it. We are blessed to have these special people and animals to protect us and our families.",
    "date": "2024-04-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Nah this story is boring. Like what even happens in the movie? We have Meagan that joins the marines cuz she's angry at her parents. By the time she gets out she is still angry at her parents with no change in her attitude. She has ptsd and left to do what after the marines? Who knows. They didn't show any meaningful bond with the dog but she really really wants the dog. After who knows how long she finally gets the dog. This movie was boring and there are so many better military stories than some girl who really wants her dog. Hard pass",
    "date": "2024-04-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Not my usual movie fare but really enjoyed the performances of Kate Mara and Ramon Rodriguez Well worth seeing.",
    "date": "2024-04-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "An incredibly lackluster movie intended to tug at your heartstrings but never manages to engage you enough to do so.  Characters are flat, the plot turns are predictable, and the pace is choppy.",
    "date": "2024-04-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "As my wife says, \"a great movie between the tears\".",
    "date": "2024-04-14"
  }
]