[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is a movie where they have one character that’s supposed to be funny but is just so annoying  that you’re just getting extremely irritated while watching.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It is not a Master Work but it is definitely better than the Critics make it out  to be. It is funny and easy watching. Perfect, after a long day of work with a beer when you just want to relax a bit and don't think to much. Not really sure why everyone is hating so much on Melissa, but i think she is funny and playing the mean Fat Girl really suited her.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Way better than the scores here - this is 60% at least",
    "date": "2025-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Why Netflix is spending money to have this dreadful movie on the platform is beyond me.",
    "date": "2025-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great laughs for the entire family! A unique plot.",
    "date": "2025-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I thought this movie was very funny.  I have no idea what the reason for the low ratings is. The movie's funny, and Jason Bateman and Melissa McCarthy are great! Recommended!",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 51 minutes!!!!!!!!!!!!!!!!!!! Rated R for Sexual Content and Language!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed $134,500,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This is one of those movies I’ll always stop and watch when it’s on. It’s hilarious and never gets old. It’s a new classic. Love Melissa and Jason—awesome comedy duo!",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Saw this yesterday I believe. It was good fun.",
    "date": "2025-06-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This was alright for a one time watch...",
    "date": "2025-06-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "i searched this movie to see where it was streaming then saw all of these low reviews. i’m so shocked. this was one of my favorite movies as a teen. it’s hilarious & will definitely have you laughing the entire way through. i used to watch this every other week when i needed a laugh. don’t listen to these reviews if you wanna laugh. it’s a ridiculous but very funny movie not worth the bad ratings. there are maybe 1 or two jokes that were offensive that i never caught onto as a teen that i do now as an adult but i never found those specific jokes funny anyways. nevertheless, good movie for those who like the humor in this movie.",
    "date": "2025-04-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Pretty good little dramatic but good",
    "date": "2024-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I put off watching this because of the bad reviews.  I'm so glad I watched it anyway.  This deserves far better reviews!",
    "date": "2024-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Melissa McCarthy and Jason Bateman save this movie. Unfortunately, there are several unbelievable scenes that stick out during the production.  The movie is worth a watch if you have time.",
    "date": "2024-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Melissa McCarthy is hilarious in this road movie with Jason Bateman along for the ride!\nPlenty to keep you entertained and laughing the whole way!",
    "date": "2024-06-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is the best! I love watching it! All Melissa McCarthy movies are amazing!",
    "date": "2024-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Any movie with Melissa McCarthy deserves the lowest rating she's not funny she's just a fat girl that's trying to be funny and over acts and she just sucks.",
    "date": "2023-10-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A few good laughs but mostly a big stretch on the plot - felt like they worked too hard on making it funny",
    "date": "2023-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Lame. Lame. Lame.  Melissa McCarthy is as terrible and annoying as always.  Jason Bateman deserves so much better.  Annoying, predictable, lame.  Untrue stereotypes and BORING.  Avoid this at all costs.",
    "date": "2023-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Would have to be one of the most pathetic movies made",
    "date": "2023-07-23"
  }
]