[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Decent movie, the reason the whole war between them started was a bit corny, but other than that not a bad script. Jason Statham was good & I thought James Franco was excellent.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Such a good movie, good acting and good story",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I am giving it away to a charity.",
    "date": "2025-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Home front was okay. I believe it had good standing actors but the plot could’ve been better. Jason did a great job as usually. I don’t think there will be sequels. I would recommend this watch.",
    "date": "2025-05-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Far from great but not bad either, Homefront is a straightforward action thriller with some corny writing & gripping action.",
    "date": "2025-05-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Home Front\" is a tense, adrenaline-fueled thriller that will keep you on the edge of your seat from start to finish.  \nThe film's strongest asset is its well-crafted storyline, which expertly balances action, suspense, and drama. The script, penned by Sylvester Stallone, is intelligent and engaging, with well-developed characters that add depth to the narrative.\n\nJason Statham delivers a solid performance as the rugged and principled Phil Broker, bringing a sense of gravitas and intensity to the role. James Franco, on the other hand, is chillingly effective as the unhinged Gator Bodine, bringing a level of unpredictability to the film's tense confrontations.\n\nThe action sequences are expertly choreographed and intense, with a notable showdown between Statham and Franco that will leave you breathless.",
    "date": "2025-04-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I had good reason to into this film with high expectations. The film has action movie legend, Jason Statham, along with great MMA action fighter, Frank Grillo. Combine that with Sylvester Stallone as a writer. Don't laugh. Stallone is an Oscar winning writer. He has written 5 of my favorite movies. Yes, all five of those were all for the same underdog boxer, regardless, with this combination, I had every reason to be excited for some good fun action. Sadly, what I got was a little too sloppy in execution to be considered fun.\n\nWhat Stallone excels in as a writer is simplicity. Setting up characters we like, and having them overcome advisories we don't like. And when the movie is focused on this, it can be fun. When the characters are allowed to just be characters, there are some legitimately good moments.\n\nThe story let's these characters down. The instigating event of this movie is just stupid. The idea that all these problems happen because of this little thing, is just so dumb, the quicker the movie gets away from it, the better. There are action scenes that fell like they were written first, and then they hastily tried to get our characters involved in them. A character literally asks 3 different characters, \"Why are you even here?\" and we the audience are wondering the same thing.\n\nSome usual action movie problems are present here as well. You have Statham and Grillo fight but cut the scene to death so no one can see what's going on. There are some explosions that would kill any one besides the main character, but their plot armor is to thick to present any danger. The movie also feels like it is incomplete, like it is setting up a sequel that is never going to happen.\n\nNot a complete mess, but overall it is just sloppy.",
    "date": "2024-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Homefront is a dumb fun action movie and you can tell this is Sylvester Stallone movie which he's not in it and dialog and the writing are dumb and silly and bad editing and the cinematography felt like a direct to video.",
    "date": "2024-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The conutryside is not always a quiet place.",
    "date": "2024-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Its no surprise that the standout performances in this one came from James Franco and Kate Bosworth, both of whom always seem to bring their A game... no matter the role. Basically another generic Jason Statham action/thriller with a simple, yet decently engaging plot. The pacing was fine and there was enough story building, action and explosions to hold my interest through out.",
    "date": "2024-04-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I found the movie very entertaining. No dragging, great plot!",
    "date": "2024-03-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "When i saw this was written and produced by Stallone, and right in the begginning, there is an interaction between Statham and a town cop, i thought this was going to be a First Blood type movie. Unfortunately it wasn't; but it's still a decent watch, if you turn off your brain a little bit.\n\n If you like old school type movies, you will enjoy this.",
    "date": "2024-03-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "James Franco miraculously goes in the basement and directly to a box with classified info?  I stopped watching it then.",
    "date": "2023-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I find it interesting how this has a rotten score and the consensus is \"adds nothing new to the genre\". I often find action films get a low critic's score unless they do something that makes them wholly unconventional. The problem with that bar is I do not seek unconventional when I'm in the mood for a decent action flic. I want great actors, a believable premise, a capable hero, a titillating bad guy, a good story, and a whole lot of kick ass. I prefer not to see a lot of circumvention of the genre if it takes away from these basic elements. This story was great, and if anything, the end might have been BETTER if it stuck to a more predictable convention. However, the ending allowed for some serious acting displays from the sympathetic bad guys James Franco and Winona Ryder, and I am here for it. If you want an old school action film with great acting, real stakes, and a lot of kick-ass, this is simply an ideal choice. Critics need to step aside if they are not action film connoisseurs. To please them may have required a less formulaic, and thus less cathartic action thriller.",
    "date": "2023-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "a better than average action thriller with a good cast.",
    "date": "2023-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Lots of good actors supporting the movie. Very entertaining. A few holes in the screenplay, thanks to Sly Stallone, who also produced the movie. Climax in the movie was when Jason S says, \"are you smelling the wood burning\" and \" are you connecting the dots now?\" Worth watching.",
    "date": "2023-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Enjoyed this action thriller. Has a pretty decent storyline.",
    "date": "2023-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This one is a personal favorite of mine i think Jason Statham is just awesome in this and James Franco is just a lunatic and despicable villain in this.\n\nYeah to some it's just a standard action film to me it's one of my favorite Jason Statham Movies.",
    "date": "2023-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Jason Statham is an awesome action movie star. The movie starts with him almost unrecognizable with very long hair, so that part/look was kind of funny. Action packed movie, as you would expect. The plot is a typical action movie plot, not something very deep, and with some plot holes. For an action movie, the plot was solid enough. Unlike most of Jason Statham's movies, it takes place in a rural setting, but it's still engaging. Predictable but satisfying ending, especially the last scene. Overall, it's an entertaining and enjoyable action movie- in a small town setting.",
    "date": "2023-03-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Great action movie. The acting isn’t incredible but still entertaining and statham is again a bada**",
    "date": "2022-12-12"
  }
]