[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Even CHATGPT could write a better script! Shittiest movie I ever watched! “Hideaway Productions” better hide it away …as it’s hideous!",
    "date": "2025-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "In this heartwarming hallmark Christmas film we have a lovely adoring couple that take 3 years to get together with twists and turns along the way you never knew where the plot would go the film has actors writers and directors that did their job. The acting was done to get paid and I would recommend to anybody 6 feet under xx",
    "date": "2024-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I much rather watch paint dry.",
    "date": "2024-12-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It was kinda looking like a kids film bad script",
    "date": "2024-12-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie was the worst film I have watched in a while. It was so hard to keep watching and you could tell how it would end. My baby sister could script a better film with her eyes closed. I do not recommend it. The acting was alright, but the way it was set up was like a kids show",
    "date": "2024-12-20"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Worse Hallmark Christmas movie ever acting is abysmal and the plot of the movie is telegraphed from the first few scenes",
    "date": "2024-12-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This film was the worst Christmas movie I've ever seen and definitely in my top 5 worst ever films made. It was as though the writers, the director and the actors just couldn't be bothered. The same utterly lame plot repeated 3 times. Acting more wooden than the worst am dram performance you ever saw. There should be a criminal offence of making a movie as bad as this and anyone associated with this should do time. Save yours and pick another Christmas movie",
    "date": "2024-12-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Exactly what I expected. Easy to watch, all a bit shallow with total predictability throughout. Still left me feeling a touch more Christmassy. Wouldn’t plan to watch it ever again but have seen worse Christmas films",
    "date": "2024-12-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Like a lot of people, my family watches these Hallmark-style Christmas movies not because we expect something great, but because we want the warm, familiar cheesiness. Even with that in mind, this movie is garbage. If it doesn't do it justice to say it's \"predictable\": every word that comes out of the characters mouth is the most situationally-appropriate and obvious thing they could possibly say in that moment. As a result, all characters have exactly the same personality. Another reviewer said it's like the script was written by ChatGPT, which is just what I said to my son halfway through. Skip!",
    "date": "2024-12-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Ive never left a review before. This movie was BEYOND horrible, literally a waste of time",
    "date": "2024-12-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Even with the low and easygoing expectations I have for a Christmas movie, this was unbearably bad. I feel like we are being spoofed and it was written by chat GPT.",
    "date": "2024-12-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Mostly, just awful. Awful awful script. Some poor acting but largely blame the script writers, actors can only do so much. Old fashioned fade editing. Dated, obvious Xmas score all over it, though not essentially bad it's just so cliche. Absolutely no tension throughout. The most benign, schmaltzy story that took forever to create the inevitable romance that finally rushes to appear in final 5min, with absolutely no fanfare or climax or tension and resolve. It's literally like the entire time the writers just went, that'll do. Print it. Put Christmas in the title. Boom. If you want easy, boring background watching, go for it, otherwise do not waste your time...",
    "date": "2024-12-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Filme: Uma Mensagem Antes do Natal\t\t\tAssistido: 5-12-24\nElenco: @trevordonovan @merritt_pattrsn Jayne Eastwood, @peytonboulley @marisammcintyre @robstewarofficial \nModelo: #natalino #romance \nDuração: 1h 23m\tAno: 2024\nMinha opinião: Um filme de romance natalino, com um estilo diferente, onde um casal só se encontram no Natal. James (Donovan) e Addie (Patterson) e claro que tem uma mãozinha da Maybel (Eastwood) mãe de James. Que Maybel procura uma mulher especial para James. Mas se passam 3 natais entre namoros de um para o outro. Até o momento que Addie vai mudar para Australia e James para a Jamanica, será que não ficaram juntos. Parecendo aquele namoro do ginásio? Um filme bem mamão com açúcar e bobinho, mas existem aqueles momentos que pensávamos que não existia isso. E existe. Mas é claro o Espirito Natalino prevalece.\nRoteiro e enredo tudo simples e bem feito. \nVale apena assistir? Sim recomendo neste momento natalino.\nNota: 6",
    "date": "2024-12-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Very predictable storyline, bad acting and a lot of moments that have you cringe.",
    "date": "2024-12-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Christmas movies are usually fairly ordinary, but this one was above average and reasonably entertaining. The only complaint was the woeful Aussie accent of the potential employer.",
    "date": "2024-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Heartwarming and pleasant, but acting that gives you splinters. Even by the standard of the genre there are too many moments that have you sighing  “Really?”",
    "date": "2024-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was amazing and feel good. Anything with Trevor Donovan is worth watching, his presence is magnetic and he's so charming.",
    "date": "2023-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Just watch this on great American family and it was really good. Highly recommend it James Welch, Henderson, Arkansas Oct 28, 2023.",
    "date": "2023-10-30"
  }
]