[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "An interesting story, but often confusing because of the many dream/fantasy/hallucination scenes.",
    "date": "2025-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Thoroughly enjoyed it.",
    "date": "2025-05-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved it. Heartwarming. Mixed storytelling movie with documentary clips. Outstanding!",
    "date": "2025-05-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What the lovely movie",
    "date": "2025-04-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very good movie, excellent pace, great acting, true story, flashes to real life witness commentary, happy ending-what more can you want.",
    "date": "2025-04-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I actually thought this movie was boring. For what it could have been I would expect to be completely gripped by such a movie but I thought it only scratched the surface of what it could have been. It should have focussed solely on the boy and showed almost every intricate detail of his daily journey. We don't get that, we get a surface level insight into his journey and a surface level insight into their family life. It's actually boring and didn't commit to either. The documentary footage was the most compelling which makes you wonder that probably a documentary would have been better",
    "date": "2025-01-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "PC BS, No boy mocked his hard working Dad during the Depression. No kid Disrespected their Father like this. No Dad took his kids on an outing after they were rude ingrates. I knew him. He lived up here in Newport and spoke on this in Bangor for decades. Hollywood twisted this. Gentle parenting? Revolting",
    "date": "2025-01-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie touches the heart and moves the soul. After viewing the movie, parents of children of all ages will discover the greatest need and deepest desire of a child,  the gift of time with their parents where the strongest, life-changing connections are made and a foundation is built by the bonds of love, peace and what really matters in life.",
    "date": "2025-01-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie made me cry and I haven't cried in decades. F these critics, this is a great story",
    "date": "2025-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It had some great effects which added to the movie. Would definitely watch again.",
    "date": "2024-12-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The acting is incredible. The movie had us drawn in from the start. An amazing story that brought us in and made us feel like we were there. 10/10.\nLove Angel Studios",
    "date": "2024-12-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fantastic movie! Must watch!",
    "date": "2024-12-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A inspiring tale that provokes a conversation on boyhood, masculinity, and the intimate nuance between fathers and sons. While at times predictable and likely because of the source material, Director Andrew Kightlinger fuses adventure, myth, and a rocky (pun intended) father son dynamic to tell a compelling, touching story that pits innocent angst against patriarchal pride that’s timely today to remind us just how important the balance between work and family truly is. \n\nMoreover, the film is worth a watch for its technical elements as well, which prove that $5M indie dramas still have a place against the saturated visual effect spectacle. Cinematography feels real, especially at the treacherous summit, which effectively highlights that you don’t need high budget VFX to create emotional anchoring. \n\nLastly, the indigenous elements while interesting and certainly central to the film’s catalyst moment could have been further explored throughout the film a bit more to build more suspense and heighten the stakes even further. Despite this, Kightlinger proves his empathic and collaborative approach to filmmaking that’s so badly needed for our American film industry. \n\nSave this one for Father’s Day.",
    "date": "2024-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great job - acting, sets, feel, pace and adaption were all excellent.",
    "date": "2024-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was a very pleasant surprise.  Not only did it lead me to think about the story themes in my life now, but also my own lessons learned, regrets, and joys  growing up.  So much of life seems sensationalized these days, but Mr. Kightlinger resisted the obvious with this event and allowed us to experience it up close, so we could go beyond the overt.",
    "date": "2024-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great character development and well acted. I know the story and still felt wrapped up in every moment on the screen. Such an amazing story and the actors and crew did an excellent job of bringing it to life on the big screen.",
    "date": "2024-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "We loved this movie, excellent!  The music was also very beautiful.",
    "date": "2024-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "“Lost on a Mountain in Maine” tells the remarkable true story and deserves to be among the classic American coming-of-age films, right alongside “Stand By Me.”  Luke David Blumm does a fantastic job portraying the complex experience of 12 year-old Donn Fendler lost alone in the deep wilderness of Mount Katahdin.  Donn emerges nine days later a different person, and no longer the boy he was. It is to the director’s great credit that Donn’s growth feels organic and unforced; the transformation is subtle, believable, and beautifully embodied by Blumm, whose performance is riveting.  And it is not only young Donn who is changed; the adults in his life, and his relationships with them, are also transformed.  In particular, Donn’s father’s (Paul Sparks) love for his sons mellows from a tough-love inspired by life during the Great Depression, to an unconditional love and appreciation of both his child’s vulnerability, and undeniable grit.  This will be a great movie to watch over and over as a family, as a holiday tradition, and as a reminder of the strength of children and of love.",
    "date": "2024-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wonderful movie about a Maine family and one boys adventure that thankfully ended well!",
    "date": "2024-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I'm a Mainer, so I've heard this story many times as it is a part of most kids' school curriculum growing up. But this film isn't primarily interested in the survival aspect of Donn's story. What it seems to truly be after is painting a wonderful and complicated image of a father and son relationship. While this means that, in the end, you will be drawn to tears, it also means that this movie feels much slower that it should have been. Better pacing with a greater urgency would have propelled this movie into five star status. However, it is absolutely beautifully shot, well acted, and has a very moving, if subdued score. In the end, Donn's story is done a tremendous amount of justice, and I am glad to know that his tale put to film will inspire millions of kids outside of our great state. Read the book!",
    "date": "2024-11-07"
  }
]