[
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Por vezes pensei ser mais um documentário como a Bruxa de Blair. Não é ruim, mas acho que a edição é bem cansativa.",
    "date": "2025-03-31"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I feel genuinely dumber for having watched this. I'm a fairly big believer in the supernatural but the things they are trying to convince you of in this are  freaking ridiculous.",
    "date": "2025-01-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Enjoyable throughout, but definitely leaves way more questions than information (maybe that's the point though). Enjoyed some of the cinematography choices, shot framings, the reenacting, and real audio over actors voices, wish there was more of that. Not knowing this story before hand, I wish they had focused a little more on the character that is actually the one on trial per the namesake rather than the kid. The kid's story was important but I didn't expect it to be Arne and was just kinda like \"oh, that guy's who this is about?\" and felt like I didn't know almost anything about him.",
    "date": "2024-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A bad mix of b movie horror aspects and true crime case study. Save yourself the first 55 minutes, google who Ed and Lorraine Warren are, don't look at the articles yet keep it handy, then watch the final 20-30 minutes of ACTUALLY insightful details. It's literally all you need to know about this, avoid the trap of feeling sorry for this family(mostly the mother) and the two cons that had them play out this nightmare. A documentary on the Warren empire, and charlatans similar to them, would be much more enjoyable and appropriate in this day and age of over stuffed content and tired rhetorics. GIVE US FACTS AND AWFUL TRUTHS, we have enough side shows as it is.",
    "date": "2024-06-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "\"The Devil on Trial\" certainly puts the 'mock' in mockumentary. While it promises to delve into the eerie world of demonic possession and a shocking murder, it falls flat on its face. The film seems more like a hastily assembled collection of reenactments and home videos rather than a true documentary.\n\nThe only thing truly possessed in this production is a lack of depth. I was hoping for some profound insights or new revelations, but it felt like a rehashed storyline we've seen in countless horror movies, including \"The Conjuring 3.\" In fact, it seems like \"The Devil on Trial\" could be a direct sequel to that film with its eerie reenactments.\n\nWhile the concept is intriguing, the execution is lacking, leaving you with the feeling that you've wasted your time. It's a devil of a disappointment, making you wonder if the devil made them do it, but it should be put on trial for masquerading as a documentary.",
    "date": "2023-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Documentary gives some background into the disagreements about what happened as far as the family was concerned. But if you're looking for proof of possession - you won't find it here.",
    "date": "2023-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I thought it was quite interesting.  Curious true tale.",
    "date": "2023-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Sadly this movie was more of a documentary to mock the Warrens and not what it was supposed to be about. I was hoping for a little more detail about the house from the Warren's prospective. Not worth it.",
    "date": "2023-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Se cercate brividi e \"prove dell'esistenza del demonio\" non perdete tempo a guardare questo documentario che testimonia una dolorosa catena di relazioni disfunzionali, per me più terrificante di qualsiasi fenomeno soprannaturale!",
    "date": "2023-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "What a pointless documentary! Did quite enjoy Loraine and Ed being exposed as the con people they were!",
    "date": "2023-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thought it was good. I agree with the Glatzel brother, the whole entire story was fabricated with the help of the Warrens. No demon made Arne kill that man. It was a story used for a few to make money.",
    "date": "2023-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It's chilling and dark also sad a family no longer  speaking  with each. Other whether  the Warren's were  frauds remains  to be seen",
    "date": "2023-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Um, no. Lol Even if you believe this stuff is real, it's pretty obvious this case isn't. What redeems the documentary is Carl's side of the story.",
    "date": "2023-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "é um bom documentário, mas poderia ter explorado ainda mais a questão do charlatanismo do casal warren",
    "date": "2023-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It was believable until the oldest brother, Carl, told his side of the story. At 23:35, when the Warren's were recording David, while his mother was telling him to Stop it, the father came out, slapped David and told him to \"get over there (pointing to the couch) and sit down\". And, guess what??? David walked over to the couch, and sat his \"possessed\" butt down. That was the debunking that it deserved.\nThen the book deal that the Warren's got from this...jeez, what a crock the story turned out to be. The family got 4500 dollars, while the Warren's collected over 80 thousand. Well, this wasn't the first time that they played a family like this.\nThe whole travesty of the film, and the story, is that Arne actually murdered a man and got away with it with a manslaughter charge that he was sentenced to 10 to 20 years, but only did three to four. He should have got the first degree murder and did 25 to life\nIt was a good scare in The Conjuring 3. But, it's about as true as Jason, Freddie, and Michael Myers. 🤣🤣🤣",
    "date": "2023-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The only reason I gave this 2.5 stars is I at least found it interesting. However, Ed and Lorraine Warren were in my opinion, complete fraudsters that took advantage of people. Listen to the recordings of the boy featured in the film, it's absolutely his voice, unaltered in any significant way whatsoever. The whole thing was BS and that family was led by the Warren's as to what to say, do, and how to act. And the guy who ends up committing the murder, doesn't remember anything because he was drunk, not possessed, but nice try. He got what he deserved, possibly not enough.",
    "date": "2023-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "At last, someone dared to expose the lies of Warren family. As a big horror fan and historian, I probably watched everything about them. They are Oscar-worthy frauds. Thanks to Chris Holt, I have hope for the future.",
    "date": "2023-10-17"
  }
]