[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Another movie with The Rock in a jungle looking for a jewel and falling in love with a wokan twice as small as him. I loved the corny jokes The Rock put on, I will give this movie a 7.9/10.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "\"I was pure as snow,then I drifted\"",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Dwayne Johnson and Emily Blunt are great in this movie, but it's too violent and scary for children, a little too campy for adults.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I thought the movie was entertaining and fresh, although having some predictable Indiana Jones vibes. Funny, vibrant and with good acting. Of course, a feel good movie at the end, where the story wraps up in a quite expected way.\nNot a masterpiece, but a good family movie to recommend for good laughter and tasting the excitement of adventure!",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I LOVE JUNGLE CRUISE IT'S FUNNY & FULL OF ADVENTURES. I CAN'T WAIT TILL PART 2",
    "date": "2025-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "wish i could give no stars. walked out. rock sucksssss",
    "date": "2025-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best Live Action Disney films, whenever on TV, I will watch",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Better than the third Jumanji movie, but still not on the same level as Gore Verbinski's Pirates trilogy.",
    "date": "2025-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Non è certo un film perfetto, ma il suo ottimo cast, la trama simpaticissima ed entusiasmante e i suoi personaggi costruiti molto bene fanno un film molto divertente e soddisfacente.",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "such a funny and exciting stories but it is 30 minutes too long",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Jungle Cruise is a colorful, entertaining ride.. but one that feels all too familiar. Loosely based on a Disney theme park attraction, the film leans heavily on well-worn adventure tropes, blending the vibes of The Mummy, Romancing the Stone, and Pirates of the Caribbean. Dwayne Johnson delivers charm and cheesy jokes as the riverboat captain, while Emily Blunt brings energy to a plot centered on a magical cure-all tree. Despite its fun spirit and lively visuals, the film lacks originality and mostly coasts on the momentum of better movies before it. A fun diversion, but not a groundbreaking journey.",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Well if it worked for Pirates of the Carribean why not try it for Jungle Cruise? Well the results this time are mixed at best. For what it's worth it's a half decent family adventure. One of those things you take th ekids to and their entertained for a few hours but it's not something like Toy Story or Coco that they'll remember for the rest of their lives. It does it's job. Everything isn't bad here and it's consistently entertaining for the most part. The first half is better than the second. This has TONS of production value. The special effects aren't bad and are better in the first half. the second half things get way too dark looking and the CGI suprisingly goes downhill quite a bit. It flat out looks terrible at times. It's so inconsistent. Blunt & Johnsons aren't bad but the dialouge and humor weigh it down. The villians are super forgettable and lame. One of them is basically British Hitler and the other is the villians from Dead Men Tell No Tales. The first 30 minutes are the best thing shere showing off all the bells and whistles the production value has to offer with tons of action and fast pacing right out of the gate. It's so concerned with showing off everything that it feels more style over substance. The plot twist with Johnson isn't bad and could work better I think if it would've had a more consistent second half. It also feels like stuff just happens at certain points alng the river, bouncing between the British villian which feels like a seperate story, and better execution in general. Also plenty of plot expose dumbs as well. It's a pretty standard adventure flick for what it's worth that has it's moments but nothign of particular uniqueness that sets it apart like Curse of the Black Pearl did. If your looking for a movie to put on with the family to kill time or are a big fan of any actors in this than give it a watch sure but there is plenty of better stuff they've done and much better family adventure flicks.",
    "date": "2025-05-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Funny action must see",
    "date": "2025-04-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A fun family movie nothing groundbreaking, especially in the performance department, yet definitely enjoyable, if you have kids they will like it a lot (and there may even be a thing or to for the parents to enjoy).",
    "date": "2025-03-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I liked a lot actually, probable my love for Emily Blunt talking lol, but the movies was decent enough, had adventure, romance, fun, action and was family friendly, definitely worth rewatching. Also the jaguar 10/10",
    "date": "2025-03-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Filme com atuações medianas, mas roteiro e vilão são estremamente fracos.\nA química entre Dwayne e Emily é fraquíssima. O filme é repetitivo com relação a outras histórias, o que acaba fazendo com que o filme seja extremamente previsível. \nAlém disso, final do filme e o plot envolvendo o Dwayne são tenebrosos de ruins.\nA representação pobre do Brasil, sua cultura e uma visão esteriotipada do país acabam estragando o filme, que, apesar de tudo, tinha um potencial bom.",
    "date": "2025-01-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A surprisingly great movie",
    "date": "2025-01-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A fun and exciting adventure movie with enough charm and charisma with its leads and visual set pieces to override the familiar storytelling conventions.",
    "date": "2025-01-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Jungle Cruise - 8/10. Disney has been searching long and hard for a Pirates Of The Caribbean successor in terms of the live action department. Though not on the level of the original trilogy of the Pirates films, Jungle Cruise serves up as a possible film to take the mantle. Full of fun and excitement, and charismatic performances, the movie is definitely some of the most fun you'll have during this summer season. Jaume Collet Serra directs this film with a great sense of adventure. It feels like a throwback to some of the better action adventure films of yesteryear. Though, its not on par with an Indiana Jones or other films of that nature, the movie does a fine job of taking you on a fun journey. The locations are spectacular and the CGI is awesome. The story is predictable, but its buoyed by fun performances from Dwayne Johnson and Emily Blunt. Johnson feels like he's doing a variation of his Jumanji character, but does a good job of creating something new once his character's twist is revealed. Emily Blunt feels more like the driving force for the film, and has a great presence that helps give the film a boost. This is definitely a fun movie, and I'm interested in seeing where this film will branch off to for a possible franchise. We shall have to wait and see, but one things for sure: this possible series is off to a great start!",
    "date": "2025-01-04"
  }
]