[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I only stuck this out because I'll watch Nic Cage in anything and it was so god awful I couldn't look away! Nuff said",
    "date": "2025-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Nothing happens in this movie, for me it didn't even create tension, it felt poorly written, there's no much of a story, plot, character development or even character building, it is just poorly made, its not even a creative concept, it's just bad.",
    "date": "2025-04-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "First of all, this is supposed to be set in Grand Isle  Louisiana , in that case their accents are totally wrong . \nEverybody wears white rubber boots down there , where are they ? Oh my gosh was this unrealistic.",
    "date": "2025-02-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Unfortunately 1:34 hours lost trying to find where Nicholas Cage and Kelsey Grammer could have left their qualities of great actors in this boring Grand Isle production. Impossible to do that. The whole movie is a nonsense puzzle. What a pity!",
    "date": "2024-06-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I found this movie on DVD, and decided to give it a watch. The story was ok, and the acting similarly on par. It has a few surprises, and was scary enough to keep my interest, without giving me nightmares, so it was pitched about right for my taste in this genre. The main problem I found with the film was that most of the scenes take place indoors at night during the hurricane, which inevitably leads to poor lighting and difficulties seeing what is taking place on screen. I am not a fan of this approach to movie making, and I think many directors adopt it to save on the budget, under the guise of creating an atmosphere! That said, the film was no worse than many others in that regard, so I would rate it about average overall. It's worth a look if you stumble across it.",
    "date": "2023-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "While the story is not bad, the slow pace brings it down.",
    "date": "2023-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Well, what can I say?! It's mainly a three person psycho drama which tries to be a thriller, but never really makes it all the way there. There is a certain small of suspense without ever making it an actually tense flick. Though not boring, it has little to say, and completely ruins its mediocrity taking it down crap lane with the most idiotic and senseless of endings that one can or cannot imagine. 3 1/2 of 10 points. Without this moronic ending it could have nearly been a 5. What were the script writer and the director thinking??",
    "date": "2023-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Love Nic Cage...but...wow. This movie started out pretty strong for the first 20-30 minutes. It was gripping and intriguing. At about 40 minutes, it sputtered and peaked. It was too good to be true. From there it went straight downhill. It became a series of chaotic scenes culminating in a disappointing  and nonsensical ending. It's like the writers decided to wrap up the whole movie during their lunch break or something. Nicolas Cage and KaDee Strickland did a great job though, despite a poor dialogue and script.",
    "date": "2023-02-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Almost everything is bad, but Kelsey Grammer with an inexplicable \"southern\" accent is by far the worst part of this mess.  Just a deplorable performance.  Cage is loose and wild as usual, nothing new.  Script is less than 50% believable and makes sense less than 50% of the time. A total bomb, an awful effort in film making.  Second half begins to make less and less sense until you just don't care anymore.",
    "date": "2023-01-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Mais um bom filme do meu amado Nicolas Cage, um ritmo muito lento, praticamente arrastado, mas eu gosto desse clima de tensão, na expectativa a cada minuto, de que vai acontecer alguma coisa, que demora eternamente para acorrer, adorável... Umas situações abjectas, o jovem idiotamente aceitar \"conhecer a casa\" com a esposa do cara que já colocou na mira, e depois ainda subir com o cara para o sótão, oi?!?!? Mas esse ano situações bizarras tudo é muito adorável… E o plot twist seco e frio fazem valer a pena a espera...",
    "date": "2022-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Awful, pointless, unbelievable and full of errors.",
    "date": "2022-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A young man needs some money for his wife and newborn child, but gets stuck at his job in the middle of a storm. Lucky for him the people he is staying with will give him a night he or we will never forget.",
    "date": "2022-04-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I don't what Cage uniform is, but it's DEFINITELY not A Marine Corp uniform.  Just because theirs a USMC emblem on one side, is totally out of place.  It's a bad wardrobe for even an Army uniform.  Person responsible for wardrobe needs to be fired.",
    "date": "2021-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Movie was entertaining, but I have the uniform Cage wears in the end is an army uniform, NOT a Marine Corps uniform.  Sticking a shiny Marine Corps emblem on it doesn't change that.  I can't believe they couldn't be bothered to spend 3 minutes researching \"USMC Vietnam ERA Class A Uniform\".  It is disrespectful.  I realize Hollywood has no respect for the armed services, but they could at least attempt to be accurate.",
    "date": "2021-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "What could have been a truly shocking southern-gothic erotic thriller, is let down by bad direction and a clumsy script. Still; the cast is compelling, (especially Benward), and it’s a fun enough ride with Cage in tow. It’s not as fun as Cage’s other B-Film fare, and the execution is clumsy - but “Grand Isle” is far better than it should be, thanks to an overqualified cast.",
    "date": "2021-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "More silly than anything else, _Grand Isle_ is Southern noir with a cartoonish script and a distinct lack of cleverness. Nicholas Cage doing a fakey southern accent is bad enough, but Kelsey Grammar doing it is just outright laughable. As to Kadee Strickland's accent, I don't know if she's from the south, but I highly doubt it.\nThe whole movie is underwhelming. Even the so-called category 3 hurricane is no big deal. \nThis is one of those amusing bad movies in which you know you're slumming. I lost count of the unintentional laughs. So just take it for what it is.",
    "date": "2021-04-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A great movie about nothing.",
    "date": "2021-04-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Nicolas Cage and his sultry wife lure a hunky young man into their home during a hurricane. All manner of suspicion and seduction ensues. The narrative unfolds via flashback interviews with a local detective (Kelsey Grammar unintentionally hilarious doing his best Tennessee Williams character). The Byzantine plot keeps trying to surprise, but the inevitable encounters are mostly predictable. Cage is acting like crazy (pun intended) and the others do fine. The direction manages to squeeze some mild tension here and there, but not nearly enough to make it worthwhile.",
    "date": "2021-03-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Nick Cage unhinged in a hurricane, it's a win! The storyline is good, the characters are likeable and interesting and it builds readily to the climax. Definitely worth a watch if you like suspense and mystery.",
    "date": "2021-03-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I liked it.  I like most movie Nick  Cage does.\nIf you listen to cage analyze his movies on Youtube he'll bore you to death about the meaning and motivations of all his characters.  Fact is he's movie making machine and  the rolls and themes are usually superficial and not exactly great cinema.\nWhat was in the basement was a huge part of the story but not much time devoted on screen presumably since the camera had to stay on Cage mostly.  Cage is 57, the uniform fitting, the era denoted by the cars did not make any sense.  The hero's wife bailed out on him throughout the movie, wants to take it a day at a time at the end like water under the bridge and there's only one answer to that.  Take a hike. \nJust one of those deals where the movie is about something simple with not real thought to how the details mesh when it comes to the final cut.\nNo not a cinematic gem but pure Cage and entertaining.",
    "date": "2021-03-22"
  }
]