[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The problem this movie has is that it's categorized as a \"comedy\".   Audiences in this generation expects non stop comedy and this movie failed to do this.   Idk if comedy and drama would be better so viewers know what to expect.    I really enjoyed the movie because I enjoyed watching how after a parent(s) raises their children what to potentially expect as that child becomes an adult.    I really enjoyed his aspect of the movie.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Peacock Pasta Yummy!!!!",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Funny easy watch, solid",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A lighthearted and fun film that doesn’t take itself too seriously. Robert De Niro is the engine that propels it forward, and has great interplay with Leslie Bibb and Sebastian Maniscalco. The rest of the supporting cast (in somewhat predictable and stereotypical roles) provide fodder for them to bounce off.  While there won’t be much in the plot that will surprise you, there’s real sweetness in the journey.  The laughs come from situational awkwardness and Maniscalco/De Niro interactions.  The father/son dynamics are well written and playfully acted.  De Niro pulls out all the stops in a too-short scene that got me misty, and in a light-hearted romp of a film, that’s quite an accomplishment.  I had about a dozen laughs (above average these days) and left happy.",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It was okay, some lol moments in this familia soap.",
    "date": "2025-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved it. The clue to what it is really about is that the crucial action takes place on the 4th of July. This movie is really about political polarization and the human understanding, compassion and humor that are required to move beyond it. That it ends with a Christmas card picture is a nod to the need for a spiritual revival to grease the wheels of understanding. I loved that such a profound message was couched in so much silliness.",
    "date": "2025-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "So bad I couldn't finish it...",
    "date": "2025-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Good Movie, with excellent casts. But roles are a little off making the movie a bit boring. Sorry but in my own opinion, the daughter looked same age as the mom in the movie cant stand it. Also, they could have picked another actor to play the role of Sebastian, he's a good actor, not just a good fit. There are movies that makes you feel connected and interested, not this one.",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Humorous but mostly touching.  Enjoyable film with fun characters. DeNiro is amazing.  Great performances by all.",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Robert De Niro is a legend of cinema, known for his transformative performances in intense dramas and gangster films. Seeing him in a comedy is always a curious shift, and this film provides an opportunity to explore his lighter side. While it may not reach the heights of his dramatic work, it offers a charming, quirky, and surprisingly enjoyable experience.\n\nThe story centers on the intersection of two families—one with Sicilian roots and the other more assimilated—whose lives collide under humorous circumstances. The cultural clash, combined with misunderstandings and exaggerated situations, forms the backbone of the film’s comedy. De Niro delivers his performance with the same precision he brings to his more serious roles, grounding the film with a steady presence while allowing the chaos around him to unfold naturally. Supporting characters complement him well, contributing memorable comedic beats and enhancing the dynamics between the families.\n\nThe screenplay, while not without its flaws, is generally effective in balancing humor with character development. Certain scenes lean heavily on exaggerated jokes and slapstick, which can feel overextended at times. However, these moments are offset by clever dialogue, situational humor, and strong chemistry between the cast. The film’s pacing occasionally falters, but the overall narrative arc remains cohesive, carrying the audience through its comedic journey with ease.\n\nVisually, the film is well-executed, with settings that feel authentic and relatable. The attention to detail in both family homes and everyday locations adds depth, supporting the story without overshadowing it. These grounded environments enhance the absurdity of the comedic situations, allowing viewers to invest in the characters while enjoying the humor.\n\nUltimately, this film succeeds as a lighthearted comedy that showcases Robert De Niro’s versatility. It may not redefine the genre or his career, but it delivers enough charm, humor, and memorable moments to entertain. For audiences seeking a fun, engaging film with a strong central performance, this is a worthwhile watch.",
    "date": "2025-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it - funny, wonderful story, values and amazing acting by two of the greats.  I liked that they tackled the important question of whether a tough or indulgent upbringing is better.  I also loved the portrayal of Ellie's younger brother, Doug.  His \"woo woo\" persona was part of the comedy, but he was treated very kindly by the parents, and Doug's approach was shown as ultimately helpful.",
    "date": "2025-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Ok- even if you're a fan of Sebastians, and I am, this is kinda mundane. \nIt's a real interest5ing movie but nothing hear is going to make you do anything more than smirk and it's done in the old sit-com style of teaching a moral lesson. I don't mind that- we don't have any morals now b/c they AREN'T taught anymore. I'm glad I watched it but I'm not gonna keep it for my collection. Still worth a spin though.",
    "date": "2025-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Sebastian e o seu pai, um imigrante italiano, são convidados por Ellie, namorada de Sebastian, a passarem o feriado do 4 de julho na casa dos pais dela. Sebastian irá aproveitar a oportunidade para pedir a mão de Ellie em casamento, porém a aliança da sua família está com seu pai e ele só entregará a ele, após avaliar Ellie e sua família. É uma comédia baseada em choques culturais. De um lado, temos uma família muito rica, que tenta a todo custo minimizar as tensões, para passar uma boa imagem, permitindo tudo a seus filhos para que não passem por adversidades. Do outro lado, temos a família de Sebastian, que como toda família de imigrante, teve que passar por uma série de dificuldades econômicas e aprenderam a valorizar o dinheiro, economizando o mais que puder. Além disso, temos o conflito entre Sebastian e o seu pai, movidos pelo que o mundo já mostrou aos dois. Robert De Niro repete aqui pela milionésima vez este personagem ranzinza que várias comédias o utilizam. O que é pouco para alguém como ele. Do lado da família da namorada, Kim Cattrall, como a matriarca da família, e Leslie Bibb, como Ellen, são os que se destacam. O maior problema desse filme está na direção, pois o roteiro até entrega boas piadas e conceitos cômicos, mas a direção leva tudo de maneira desleixada. E sinto que o elenco apenas diz as falas. Apesar disso, há alguns momentos interessantes, como a sequência inicial com um De Niro de rabo de cavalo e a cena onde Sebastian e Salvo estão enterrando os restos de um pavão morto e Sebastian diz que Salvo está fazendo aquilo como se já estivesse acostumado (claro que é uma associação com os filmes de máfia que De Niro normalmente está relacionado).",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I absolutely loved this movie! I went in knowing nothing about it—other than the fact that I’ve always enjoyed Robert De Niro’s films—and decided to give it a try. I was pleasantly surprised by how funny and heartwarming it turned out to be. At first, I expected a typical storyline, but it quickly stood out with its refreshing kindness and genuinely likable characters. It was exactly the feel-good movie I needed, leaving me smiling from start to finish. I loved every character, so much so that I watched it twice in a row! Now I’m inspired to rewatch The Intern for that same uplifting vibe.",
    "date": "2025-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I usually cannot stand the hacky comedy of Sebastian Maniscalco, but was intrigued by this great cast. This isn't the best crafted script, the emotional elements weren't really developed to make it super touching, the humor was safe, and the plot elements moved clunkily along. BUT it was surprisingly warm and entertaining, I really liked that the times the humor could go in an extreme and crude direction it didn't, and was refreshing that they didn't indulge in being offensive for shock laughs. There were some genuine laughs and really good performances. Sebastian was fine enough to convincingly carry this out, he didn't move much from his one dimensional Italian stereotype shtick, but he was surprisingly likeable. Glad this wasn't about the rich people being so entitled they were prejudiced and unlikeable, they were good people, just in an entitled bubble. Overall this is a very likeable, comfortable film.",
    "date": "2025-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Another Feel good family movie with Robert Dinero.   How many more can he really make.  My Favorite part was Anders Holm (Workaholics), just Hilarious being himself.   It also was a tear jerker at the End.",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Its a cute movie to run in the background while you're doing something else.",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The movie was really fun. Felt very akin to Adam Sandler movies so if you enjoy the goofy fun of those you will love it, if not then it won’t be your cup of tea.",
    "date": "2025-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I don’t think I laughed but one time. Kind of a waste of time- I tried it out but I will never watch it again. There would have been many opportunists for unique laughs but it fell very flat.",
    "date": "2025-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Lousy story and not funny at all",
    "date": "2025-05-28"
  }
]