[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This film was very inspiring, and I love the animation style! This was a very cool first film to see from kuku studios. I hope to see more in the future. P.S Chad is the goat!",
    "date": "2025-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Unique story line. Tons of laughs. A few tears. Absolute masterpiece! Well done",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Everything about this movie is spectacular. I laughed, I cried, I was completely enamored from start to finish. The plot has enough complexity to be familiar and relatable without being predictable. The animation is beyond anything I've ever seen before. Truly something special, absolutely worth the watch.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "How this movie is rated PG? It could be rated R for showing a private part in the movie, so I hate this movie",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Hilarious and heartfelt. Visuals were amazing. Animation was phenomenal. Loved the themes. Felt like peak-Pixar",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Meh, es bonita pero predecible",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Warning! This movie is NOT safe for kids struggling with parental separation. It opens topics but does not offer much to facilitate resolution of issues. In fact it features strong emotions and scary imagery which can scare children without offering hope. I so regret watching this my 8yo and 10yo kids. Irresponsible filmmaking at its worst.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Lots of humor and heartwarming.  My little girl loves it",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "like predictable ai hallucination",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Me parece una película buena, realmente te lleva a viajar a lo más apreciado de ensueños, no solo una energía y aventura sentimental, sino una cordura bastante avanzada.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "“In your dreams” is the best example of mediocre.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie with an amazing theme for both children and adults",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The movie has new characters and it's so simple and family friendly.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Thoroughly enjoyed watching this with a few other adults! The lighthearted dad jokes and clever references made it incredibly relatable. I was also really touched by the dynamics between the siblings and the family as a whole. Beyond the great story, the animation was just flawless. I'd highly recommend it for families to watch with their kids, but as we proved, it's also a genuinely enjoyable for a bunch of grown-ups as well.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "i’m barely 20 minutes into this movie and it is already annoying AF. Once again, we are adultifying young girls, requiring them to hold the family together while the mother is away. The fact that the mother tells her daughter that she is \"in charge\" while mom goes away on a weekend trip is terrible parenting. Why isn’t the father in charge? Oh that’s right— it’s because the mother is fully aware that she married a child man. Why can’t we raise adult males who actually take care of their children? We keep making these tropes, pretending they’re funny when they’re not. The little girl should not be in charge of her little brother; she should be living a life that is her choice. It is making a terrible imbalanced sibling relationship and creating resentment. The father is A child an adult clothing who has never grown up. He cannot get over the fact that his music career is a failure and The talent actually lay in his wife. He doesn’t want to admit that he needs to go out there and actually support his family in someway rather than sitting at home dreaming of past glory all day. Why do we keep creating boys who cannot support their families? Because we keep allowing them to live their entitled privileged little dreams, way far into adulthood. He should be the one supporting the family over the weekend not his daughter. don’t get me started on the little boy who is allowed keep his side of the room in a disgusting state. Baloney on the floor? The fact that the parents do nothing to discipline him and treat him like he is a golden child who can do no wrong is even worse. We expect so much of our girls and so little of our boys. If the girl came home with less than A’s, the parents would probably freak out. Yet the boy can strive for C level grades and that’s OK? The little girl feels so much pressure to keep the family together and the little boy coasts because \"boys will be boys\". I am so tired of media making these things OK. We have been laying the blame for all of society’s ills on women for so long. It’s creating a terrible society. Boys need to grow up into men. We have generations of men who are nothing but little boys.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "If you’ve been waiting for an animated feature that captures the emotional intelligence of early Pixar but delivers it with a fresh, distinctively modern visual language, Netflix’s In Your Dreams is the wake-up call you didn’t know you needed.\n\nDirected by Alex Woo and Erik Benson, this film is far more than a standard \"save the family\" caper. It is a masterclass in visual storytelling, using the limitless logic of the dream world to explore the very real, very messy dynamics of a family on the brink of change.\n\nA Colorist’s Playground For those of us who live in the grade, In Your Dreams is an absolute feast. The filmmakers didn’t just use color to make things look pretty; they used it as the primary narrative engine. The film establishes a brilliant visual dichotomy between the waking world—grounded, slightly muted, naturalistic—and the dreamscapes, which explode with saturation and intentionality.\n\nThe transition into \"Breakfast Town\" is a standout sequence, bathed in warm, syrup-gold hues and vibrant primaries that feel nostalgic without being saccharine. But the real genius lies in the film’s darker moments. As the dream curdles into a nightmare, the grade shifts aggressively. The palette doesn't just dim; it desaturates into cold cyans and bruising purples, draining the \"life\" out of the image in a way that feels visceral. \n\nHeart Over Hype Narratively, the film rests on the shoulders of siblings Stevie (Jolie Hoang-Rappaport) and Elliot (Elias Janssen). Their journey to find the Sandman to \"fix\" their parents' marriage avoids the cloying tropes of the genre. Instead, it offers a surprisingly mature look at how children process grief and instability.\n\nThe supporting cast is electric, particularly Craig Robinson as Baloney Tony. In lesser hands, a talking stuffed giraffe could have been the film's \"Jar Jar,\" but Robinson imbues him with such genuine warmth (and perfect comedic timing) that he becomes the film’s beating heart.\n\nThe Verdict In Your Dreams manages to be that rare thing: a technical marvel that never lets the tech overshadow the soul of the story. It is a film about the necessity of nightmares—how the scary stuff helps us process the waking world.\n\nVisually stunning, emotionally resonant, and beautifully paced, this is a film that demands to be seen on the biggest screen (or the best-calibrated monitor) you have.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "We just finished In Your Dreams!!  Soooo good!!!!  Creative, witty, full of subtle Asian stuff.  Actually a movie all 3 kids (ages 9-14) loved and laughed together with.  A memorable family movie night thanks to a story that captivated all of us and inspired ideas of what sibling relationships can look like.  My son said, \"mom, i cant wait to go to sleep and dream tonight!\"  Deep & meaningful.  ❤️❤️❤️",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Fun and imaginative, but also delivers an emotional experience. There are plenty of laughs throughout, but also some moments that could make you a little teary-eyed.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "My children and I have watched In Your Dreams several times. It gets funnier every time we watch it. I laugh, cry, and laugh some more. It is great for all ages. I think the message of sibling love is really the theme of the movie. I also really like the music in this. It is a must watch. It is one of our favorite family movies.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Had the privilege of watching this fabulous animated film and was blown away by its uplifting and relatable story. Amazing music, spectacular animation, lots of laughs and tears! I’d recommend this movie to anyone.",
    "date": "2025-11-24"
  }
]