[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A reasonably interesting case but like all Netflix crime docs, it is unnecessarily bloated. Could have been covered in an hour. Watched on Netflix.",
    "date": "2025-05-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Engaging but felt like it was missing a lot of insight.",
    "date": "2025-03-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "El caso de Jennifer Pan es una historia cruel que me impactó. Desde el primer acto vi a Jennifer culpable, no fue difícil de suponer con una postura de muchos nervios e incoherencia en sus declaraciones, que aumenta a medida que avanzan los interrogatorios.\nMe gustó el inicio, con un ritmo calmado pero que me mantuvo atento, a pesar de, no lo sentí aburrido. Me gustó la puesta en escena de la directora y algunos de los aspectos en el montaje, es lo que más destaca en toda la película.\nEl guión es su punto frágil, el tercer acto es realmente voluble, un clímax sin intensidad, no transmite sensación de resolución, me produjo más dudas que respuestas.\nEl desenlace es realmente intrascendente, lo que produjo una sensación de que pude haber encontrado esta información en cualquier otro lugar, no hubo un cierre que me hiciera pensar, reflexionar, o cuestionarme, solo un cierre de una historia.\nHabría estado genial profundizar más en los aspectos psicológicos de Jennifer, algún testimonio de un forense, contextualizar más en el lugar de los hechos o evidencias, así como los padres, o el velorio del cual Jennifer también forma parte, sin necesidad de caer en morbo.\nAlgunos de los entrevistados son realmente innecesarios, ya que la información que sus testimonios no tienen gran relevancia en el desarrollo de la historia.\nPercibí el cierre muy apresurado y general, sobre el juicio y participación de los medios no hay mucho que decir, prácticamente nada.\nEs una película que puedes ver sin problema, si te gustan los documentales de crímenes reales y todavía no lo has visto, no es mal plan para cerrar un domingo tranqui en casa.",
    "date": "2024-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "\"What Jennifer Did\" is a true crime film that dives into the chilling case of Jennifer Pan, who calls 911 to report her parents have been shot, only to become the primary suspect. As a true crime enthusiast, I appreciated the film's commitment to authenticity, particularly its use of real interrogation footage, which added a gripping layer of realism. Watching Jennifer's demeanor shift under questioning was a fascinating glimpse into the psychological intricacies of the case.\n\nHowever, despite its compelling start, the film falls short in terms of unpredictability. The narrative unfolds in a predictable manner, lacking the shocking twists or noteworthy revelations that often define the genre. The storytelling felt linear and straightforward, which made it easy to foresee the film’s key developments. As a result, it didn't quite deliver the suspenseful experience I look for in true crime stories.\n\nOverall, \"What Jennifer Did\" is a solid watch for those interested in true crime, but it doesn’t break new ground. It offers an intriguing yet unsurprising look into a well-known case, making it worth watching for the real footage but not necessarily for the narrative depth or unexpected turns. I’d give it three stars.",
    "date": "2024-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I view this as a sad psychological drama.  The pressure this girl grew up under is a form of abuse, in my opinion.  She had few options, from her standpoint.",
    "date": "2024-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "using AI generated results to pass as facts? might as well have AI generated the interviews and the documentary script, and have it AI edited.",
    "date": "2024-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I wish there was more info not found online. Reading Wikipedia tells you the entire story.",
    "date": "2024-05-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "S’alright. Bit bland and monotonous, with it being pretty clear from the outset what we’re expecting the outcome to be. In many ways, it would have served the documentary better if the team waited until after the new trials had been completed",
    "date": "2024-05-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Interesting documentary made more compelling by all of the real police interrogation footage available.",
    "date": "2024-04-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I enjoyed it. I've realised that I won't make a good detective thou as the ex played innocence so well I believed him.",
    "date": "2024-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "An interesting story delivered in a mundane way",
    "date": "2024-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "AI generated garbage. I'd give it 0 stars if I could. This should be illegal to call a documentary.",
    "date": "2024-04-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Documentary with little information and development. There was a lack of more research into the case and the family.",
    "date": "2024-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I feel sorrow for the others, especially Jennifer's deceased mother, for looking upon to this god-awfully melodramatic documentary; a \"mockumentary\" to say with heart.",
    "date": "2024-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "A compelling story, given the rush documentary treatment.  So much could have been done with this;  to know the characters, players, family, expectations et al.  So many subjects to work with, and yet they manage to turn it into such a boring, long, story, you can’t wait for it to end.",
    "date": "2024-04-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Truly the worst true-crime documentary ever made - and that was before it was outed as using fake-AI images in flashback. Horrid work all around!",
    "date": "2024-04-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This \"true crime documentary\" used AI to create fake photos of the people involved to \"create a more engaging narrative\". Even worse, they chose not to disclose this, even in the credits. Using AI to create fake photos of people involved in a real life tragedy is deplorable.",
    "date": "2024-04-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Shouldn’t use Ai generated images in films",
    "date": "2024-04-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Google her interrogation video and you'll basically have this documentary",
    "date": "2024-04-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Creepy, mundane, pointless story about a heck of a lot of pathetic individuals.",
    "date": "2024-04-17"
  }
]