[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A comedy mixed with a bit of drama, honestly I loved it. It was one of the best movies I've ever seen in my life, great to watch with the family. I loved it, but contradictorily, some parts confused me. For example, when there's the deal with the guy with the wig, and we only find out halfway through the movie. I loved it.",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Pra mim fecha a franquia com chave de ouro ,é engraçado e emocionante do jeito ideal que um último filme do shrek deveria ser !!! 🤩",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Shrek Forever After (2010) is a rather disappointing film. I honestly think there shouldn't be a fourth Shrek movie; I'm sure the fifth one will be awful.",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "An improvement over 3. It tries to get back to the heart of the first 2, and... kind of succeeds? Not as good, but still a fine conclusion. The story is deep and emotional, love the medieval vibe in it. Though the alternate reality thing is not that great, because Fiona's growth in 4 is just completely erased after Shrek gets back. Those characters we were with the whole film are just... gone. Overall, it's fine.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Great movie, it's very well written and conveys a very good message!",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Shrek Forever After is just as funny as the first three and has a good plot and villain.",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Don’t know why this underrated sequel has such low ratings!",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Very sentimental but had some humor. Not terrible",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I honestly think this is an underrated gem",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Este também é um BOM filme para assistir, mas Possui alguns defeitos. Em compensação, um Ótimo Vilão e uma Linda mensagem por trás do filme",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Shrek Forever After gives the series a heartfelt farewell. Love it that It balances humour and emotion nicely, making for a satisfying conclusion to the saga. Hopefully the next one will not disappoint.",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Eu não gosto de \"Shrek Para Sempre: O Capítulo Final\" porque é horrível! O Roteiro é bagunçado, personagens sem graça, dublagem: mais ou menos! Filme Horrenda! Não faz sentido o filme!\n\nObs. Ele é pior que \"Shrek Terceiro\". \"Shrek Terceiro\" é mais legalzinho.",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I hate shrek 4 because it terrible in my opinion",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It’s definitely one of the weaker entries of Shrek, but it’s still decently good",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I thought Shrek was a kid’s movie, it isn’t inappropriate but can bore a child to death. It was way too serious. And I laughed twice in the whole movie.",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Not as good as the others but still good.",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The fourth installment in the Shrek franchise, Shrek Forever After, takes the series in a different direction — and while it’s not a bad film, it definitely doesn’t reach the same heights as the first three.\n\nOne of the biggest positives is consistency: the original cast stuck around not only through the main films but also through the shorts and side projects, keeping the voices and personalities we’ve grown to love intact. That loyalty to continuity is something DreamWorks deserves credit for, because it keeps the world of Shrek cohesive and familiar.\n\nStory-wise, however, this one leans heavily into the alternate-universe concept. The focus on Shrek’s midlife crisis and his longing for freedom from the responsibilities of fatherhood sends a strange message at times, almost suggesting that parenthood is a burden rather than a joy. I understand what they were going for — starting with Shrek’s personal growth, then Fiona, then marriage and pregnancy, and now children — but instead of centering the story on the kids as you might expect, the children are sidelined.\n\nRumpelstiltskin serves as the villain, and while he’s serviceable, he doesn’t hit nearly as hard as Lord Farquaad, Prince Charming, or the Fairy Godmother. He’s mischievous and manipulative, but he lacks that truly menacing quality that made the earlier villains iconic.\n\nThe real problem is that this film strips away too much of Shrek’s lovable grumpiness and instead paints him as bitter, resentful, and outright hateful for a good portion of the runtime. That shift makes it harder to root for him or even enjoy his journey. It feels less like a fairy-tale parody with heart and more like a midlife crisis comedy wrapped in fantasy packaging.\n\nThat said, it’s still worth a watch, especially if you’ve followed the franchise this far. It keeps the storyline complete, and there are moments of humor, heart, and cleverness sprinkled throughout. But compared to the first three, it feels like the magic got bogged down in the swamp.\n\nWould I rewatch it? Probably, but not nearly as often as the others. It’s more of a “completionist” entry — good enough to see where the story goes, but not essential in the way the earlier films are.",
    "date": "2025-09-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's better than 3 but such a downgrade still from the first two. It's not bad overall. Animation wise it's the best looking out of the four for sure. It starts out really fast and setting everything up and is defintely the best part. Than once the new reality happens it just slowly gets bogged down. First off it keeps throwing nostaglia at you with locations, characters, and scenes from the first mostly that just make you wish you were watching the first. Second the whole plot in the middle with Fionna as a rebel leader against Rumpelstiltskin is just...kind of bizarre. It feels almost like a post apocalyptic world than anything Shrek related. And finally it pretty much follows the exact same beats you think it's going too. Rumpelstiltskin starts out a cool villian but the more it goes the more over the top, annyoing, and cliche he becomes it feels like. Just another 007 villian he becomes. Than it has everyone pretty much just following the smae arcs they did in the first save for Shrek. And it all just feels like a combinaton of muddled, beats we've already hit, things that are out of place, and nothing that special. It makes perfect sense though. The humor is a bit flat but not terrible at the same time. Overall, it's a better note to end things on. If your a hardcore fan of any voice actors in this or the franchise give this a watch especially if you sat through 3.. But most woud be best served staying with the first two classics.",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "schaffrillas moment real",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Not that goot really!",
    "date": "2025-08-04"
  }
]