[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "“ I think about Fred, therefore I am. He’s a dude, he’s a guy, and he only has one eye. * deep breath* FRED FRED FRED FREDDY FRED FRED FRED!!!!” In all seriousness this movie is amazing! Hilarious, heartwarming, heartfelt, and heartbreaking.In my opinion this is also mckenna grace’s best performance of her career so far. 10/10, must watch!",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Boring and stupid premise. Chris Evans feels wasted in this drama, as he had some dramatic chops here.",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie was so cute. \nBut the fact he adopted all 3 of those cats so they don’t get euthanized made my heart explode 😭😭😭",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "“He loved me before I was smart”",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "At times it shines bright.Other moments give you the reason to watch movies with heartfelt moments.Not perfect,but a good watch.",
    "date": "2025-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Just what I needed on a cold rainy day, home sick from work.   Great characters and quirky banter along the way, this feel good, extremely well acted story unravels to draw you in.   I laughed and I cried, and I felt all emotions.  Great family movie!   Loved this !",
    "date": "2025-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Genuinely a beautiful film",
    "date": "2025-05-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was an absolutely fabulous movie. If you want a nice surprise, then take the time to watch this movie. There is something very touching about it and the acting is fabulous. The casting was excellent.",
    "date": "2025-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This is really an excellent movie. It really begs the questions that every parent, family member, or aspiring leader should ask themselves and others. Plus, the story is pretty dang cute. Chris Evens does a fantastic job. McKenna Grace was absolutely perfect for this role. Heck, even Frank was incredible.",
    "date": "2025-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Wonderful movie....!!!",
    "date": "2025-04-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A genuinely lovely movie, full of heart and  compassion. It got very emotional at times but thoroughly enjoyed it.",
    "date": "2025-04-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "(CASTELLANO) Hay pelis que te dejan con una sensación de 'qué mono todo', ¿sabes? 'Un don excepcional' es de esas. Marc Webb se aleja de los superhéroes y nos trae una historia sencilla, pero que te toca la fibra. Un tío normal y corriente, Frank, se hace cargo de su sobrina, Mary, que resulta ser un cerebrito de las mates.\n\nLo mejor, sin duda, la química entre Chris Evans y la niña, Mckenna Grace. Es que se nota que se llevan bien, que hay feeling. Evans se olvida del Capitán América y se mete en la piel de un tipo normal, con sus rollos y sus miedos. Y la niña, ¡qué decir! Es un prodigio, pero no de esos que te dan repelús, sino una cría normal y corriente, con sus gracias y sus rabietas.\n\nLa historia es de las de pañuelo, no te voy a engañar. Pero no es de esas que te meten el drama con calzador. Es más de sonrisas tontas y de 'qué bonito'. Sí, el debate sobre si la niña tiene que ir a una escuela especial o no se queda un poco en la superficie, pero a mí me dio igual. Yo estaba más pendiente de ver cómo se llevaban tío y sobrina.\n\nVamos, que si buscas una peli para pasar un rato agradable, para desconectar y para salir del cine con una sonrisa, 'Un don excepcional' es tu peli. No es una obra maestra, pero es de esas que te dejan con el corazón calentito.\n\n(ENGLISH) You know those movies that leave you with a \"how cute\" feeling? Gifted is one of them. Marc Webb steps away from superheroes to bring us a simple yet heartfelt story. A regular guy, Frank, ends up taking care of his niece, Mary—who turns out to be a math genius.\n\nThe best part? Without a doubt, the chemistry between Chris Evans and the young Mckenna Grace. You can tell they genuinely get along, that there's a real connection. Evans completely forgets about Captain America and plays an ordinary guy, dealing with life’s ups and downs. And the kid? What can I say! She’s brilliant but not in an annoying, precocious way—just a regular girl with her quirks, tantrums, and all.\n\nIt’s definitely a tearjerker, I won’t lie. But it doesn’t shove the drama in your face. It’s more about those little moments that make you smile and think, \"how sweet.\" Sure, the whole debate about whether Mary should go to a special school or not doesn’t go too deep, but honestly, I didn’t mind. I was more invested in watching the bond between uncle and niece.\n\nSo, if you’re looking for a movie to unwind, something that leaves you feeling warm inside, Gifted is your pick. It’s not a masterpiece, but it’s one of those films that make your heart feel just a little bit lighter.",
    "date": "2025-03-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very heart warming film that asks lots of difficult questions about responsibility.\n\nIn a film with math as part of its plot device, that for viewers there is more than one reasonable resolution is apt.\n\nFinally. Great cast and a live wire of a young actress who steals every scene she is in.",
    "date": "2025-03-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Um filme fraco e sem alma que se sustenta em ótimas atuações. (avaliação: 4/10)",
    "date": "2025-03-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Nicely portrays the dilemma many parents must experience between how hard to push a child academically, and letting them grow as a child. Great acting from all especially McKenna who is definitely gifted in this role. Enjoyed all the way through and a happy ending.",
    "date": "2025-02-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It’s a good movie in some aspects, some bad in another, but really good in a few. Especially at portraying how easy school is when you’re that smart. The bits in the movie that are sad or dramatic are pretty good, but everything else is decent. I’d say it’s worth a watch!",
    "date": "2025-02-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Rating: 7/10. 73/100",
    "date": "2025-01-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "he wanted me before i was smart",
    "date": "2024-12-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Tem um ótimo diretor e roteiro é impecável",
    "date": "2024-12-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Good acting from the Main Characters.  Story was just, okay.",
    "date": "2024-10-30"
  }
]