[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I don’t know why the scores are so low on this movie because I became big fan of these movies after I saw the 1st movie & I love all the sequels Beyond Skyline (2017), and Skylines (2020) & a 4th skyline movie is coming out. It’s called Skyline: Warpath & it is in development so that’s why I don’t get all the low scorers. The movies obviously did well enough to make 3 movies and working on a fourth movie.\n\nEvery movie is connected to each movie so you have to watch them in order for it to make sense and if you did watch them in order and you still think the movie was bad then I don’t know what to tell people because it is really good and I know other people that I’ve seen them and think the same thing I can’t wait for part 4",
    "date": "2025-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie to pass the time, great acting and well executed for a low budget film. Lindsey Morgan was great as always. Definitely my favorite of the Skyline series.",
    "date": "2025-05-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Hopefully the last of the girl boss era films. No less thanthreeof them at the finale. The cgi and plot is straight to Netflix quality, not good. I missed the middle of the trilogy and do not plan on filling the gap.",
    "date": "2025-03-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Despite being the best of the Skyline \"trilogy\" - and with a hook for a 4th installment - it still didn't rise above the \"meh\" level, though Lindsey Morgan gave it her \"The 100\" best. Plus, the Mom, though pretty powerful, wasn't quite as deadly at the original Alien bad girl.",
    "date": "2024-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The series reverting back to its phony acting and shoddy effects work, Skylines will have viewers wondering if an end is somewhere over the horizon.",
    "date": "2024-04-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Suspense, action, good story, and characters.",
    "date": "2024-02-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Has some plot holes in it but is a fun movie to watch",
    "date": "2023-12-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Decidindo se eu gostei um pouco ou razoavelmente... A trama deu sequência aos dois anteriores, em um futuro distópico Aliens e humanos convivem harmonia, ou não tão harmônicos assim, boas cenas de ação, personagens relativamente cativantes... Um bom filme de sequência alienígena, razoável...",
    "date": "2023-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Overall, Skylines, as a third instalment, delivers what I generally expected.  It is a brainless sci-fi film with cheesy characters, cheesy dialogue, and predictable outcomes. Having seen all three films, this is undoubtedly a pleasing instalment thanks to the new and expanded plot and story. Sci-fi effects and visuals are positive, and I am confident that many fans of sci-fi will enjoy this feature. The plot is quite different when compared to the other two movies, and I am also thankful that the director was able to aim for something different to make this film stand out from the rest, along with continuing the story. Naturally, this is recommended for those who enjoyed the Skyline series and other B-grade sci-fi films.",
    "date": "2023-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Os efeitos prático desse filme é MT bom, assim como foram nos outros.\nEfeitos especiais 7/1.\nO roteiro é meio burro, personagens sem sentido, a atuação deixa a desejar.\nMas o filme é divertido, só que é um tipo de filme que vc só vê uma vez na vida.",
    "date": "2023-04-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It wasn't awful but it wasn't good either. It's an ok \nB sci-fi movie.",
    "date": "2023-03-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "While newcomers might find it a little hard to follow, fans of the previous Skyline movies will probably be satisfied with how Skylin3s concludes the franchise, at least until the studio decides to release a fourth instalment.",
    "date": "2023-02-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Super dumb but it passed the time.",
    "date": "2022-12-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Really, the best thing about all three of these Skyline movies were the outtakes and even they kind of sucked—Actors just aren't spontaneously funny. The addition of Lindsey Morgan's smile to this cast was the only bright spot in an otherwise completely derivative mess of ripped off Sci-Fi tropes.",
    "date": "2022-04-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Bad writing. Mostly bad acting. Cliche after cliche. About the only bright spot is Lindsey Morgan as some eye candy.",
    "date": "2022-03-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Another fun continuation to this low-budget, but impressive looking sci-fi/action series. It doesn't add much new to the story, but it's a good time. It's funny how much the two sequels surpass the original, when that's the one that had soo much potential...",
    "date": "2021-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I love Sci-fi, so I’m stoked anytime one comes up. The opening is awful. Power through it and the movie gets better. It’s a 3 star the rest of the way. Entertaining, but nothing special. If you don’t love sci-fi’s, you’ll probably not like this movie.",
    "date": "2020-12-21"
  }
]