[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The filme is an innovative and visually stunning animation that brought new possibilities to the superhero genre.\nMiles Morales story is exciting, Fun, and Full of personality, addressing themes such as courage, identity, and responsibility. The filme stands out as a creative and inspiring work and is certainly onde the best spider-man movies",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolute masterpiece",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Easily one of the top pieces of Spider-Man",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "BEST. ONE. EVER. WATCH IT. NOW",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Pretty good spiderman movie",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Animation has never been the same after this.",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the greatest marvel movies of all time",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Art. \n\nIn this age of endless animated movie releases from the multi-million dollar big studio production to the straight to streaming budget slop I can see why so many people think of cartoons as simply a child's medium.\n\nBut animation when done right is Art. Art that can invoke emotion and leave you breathless. Though this movie needs to be a comic book origin movie the WAY they decide to approach it when it would have been SO MUCH EASIER to make it \"just a cartoon\" shows care, skill, and yes, artistry. \n\nThis movie had scenes that I would put on my wall, a story of growing into your destiny, of fathers and sons, all rolled up together with fun fight scenes and jokes and just plain fun.\n\nThis is my favorite Spider-Man movie. Even including the live action work that has come before and since this movie captures the essence of Spider-Man. There's so much more to say about it so just watch it for yourself.",
    "date": "2025-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing Movie great",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Visually stunning and endlessly creative, with heartfelt storytelling and sharp humor",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It awesome  I love it",
    "date": "2025-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "MARAVILHOSO ROTEIRO INCRÍVEL ANIMAÇÃO INCRÍVEL DIREÇÃO INCRÍVEL AINDA 9/10",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Critics Consensus:\nVisually groundbreaking and emotionally resonant, Spider-Man: Into the Spider-Verse isn’t just the best Spider-Man movie—it’s one of the best animated films ever made. Bursting with energy, heart, and innovation, it redefines what superhero storytelling can look and feel like.\n\nShameik Moore shines as Miles Morales, a relatable and inspiring new hero whose journey of self-discovery captures the essence of what makes Spider-Man timeless. The film’s dazzling animation style—a kinetic blend of comic-book art and cutting-edge technique—creates a visual feast unlike anything seen before. Phil Lord and Christopher Miller’s witty, heartfelt script blends humor, heartache, and heroism with effortless precision.\n\nEvery Spider-person—from Jake Johnson’s weary Peter B. Parker to Hailee Steinfeld’s confident Spider-Gwen—adds texture and warmth to this multiversal masterpiece.\n\nInto the Spider-Verse isn’t just a love letter to Spider-Man—it’s a love letter to creativity itself. Bold, beautiful, and bursting with soul, it’s pure cinematic magic.",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The best spider-man film. Beyond being funny, creative, and wonderfully animated, it truly has an understanding of the character of Spider-Man.",
    "date": "2025-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The story is pretty great and the animation is fantastic. The characters are great too!",
    "date": "2025-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A great origin story with groundbreaking animation makes Spider-Verse one of the best animated movies anyone can watch.",
    "date": "2025-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "If you havent watched it WATCH IT. its one of the greatest movies of its time.",
    "date": "2025-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Uma das melhores animações da história, não atoa ganhou o Oscar de melhor animação de 2019.",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Into the Spiderverse was a rollercoaster of a movie. The voice acting and storytelling were compelling, and the visuals made me feel I was actually inside of a live comic book. I had no idea that these stupid Spiderman Fanfiction-like characters that look like something I’d draw for a project in elementary school would make me cry my eyes out. I have absolutely no critiques for this movie because it was absolutely perfect. Fun for kids, fun for teens, fun for adults, fun for seniors. Fun for everyone.",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It’s really good and takes full advantage if the medium.",
    "date": "2025-09-22"
  }
]