[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A tedious circle of the same story with no redeeming reward for your time and attention. Give it a miss.",
    "date": "2025-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I enjoy nearly everything this director creates, and this film is no exception. From start to finish, it keeps you on the edge of your seat, pushing you to question whether this could be a glimpse of our own reality on day. In the end, it leaves you with a powerful reminder: no matter what position of authority we hold, we are all just human—with the same beating heart —praying the life decisions we make are the right ones.",
    "date": "2025-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Ritorno dietro la cinepresa di Kathryn Bigelow, mai banale e come sempre predisposta a toccare argomenti complessi e di attualità.\n\"A house of dynamite\" racconta di un potenziale attacco missilistico sconosciuto dall'oriente e del tentativo estremo di difesa del governo americano, visto da diversi punti di vista.\nSenza dubbio, pure in un delicato e complesso meccanismo di protocolli da seguire e di task force, il messaggio chiaro ed evidente del film è come, anche una grande potenza mondiale, si trovi in grandissima difficoltà anche contro un solo missile lanciato verso una delle sue città.\nTornando alla qualità del film, senza dubbio i primi minuti con una ipnotica come sempre Rebecca Ferguson, sono quelli che inchiodano lo spettatore alla poltrone facendogli sudare il palmo delle mani nel vortice di eventi che portano il missile sempre più vicino al suo obiettivo.\nLa stessa vicenda, ripresa dal punto di vista degli altri protagonisti, seppur aggiunga sempre ulteriori dettagli e spunti; non riesce a tenere altrettanto alto l'interesse e soprattutto la tensione; proprio perchè gli unici elementi che vengono aggiunti non sono fondamentali e non danno sviluppo decisivo alla trama.\nFinale interessante ed anche l'unico modo per venirne fuori in maniera pulita e serena.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It’s crap. Ending sucked. Bad. Talk about ruining a decently started movie. Fart noises 💨",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "F this movie\nAngel Reece?!",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Great build up, disappointing ending. The directors choice not to give us some kind of ending and letting us figure it out ourselves is just pure laziness on her side. I want my 90min back.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I’m so pissed after watching this movie. They build it up and then just stop without finishing the story. They can kiss my ass. Don’t fall for this movie.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie is just awful. I would give 0 stars if I could. The replaying of events from different perspectives is not engaging at all. Hour and half of people acting out chaos and crying. That is the plot. Just a very bad movie.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It builds you up helping to be a great movie then get stupid repeating the same things over and over and over (literally).  Then you don't know what happens at the end it just stops",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Wasted two hours of my life. Movie was great, was really invested and no ending. Imagine if the last chapter of every book was removed or the last 15 minutes of every movie was cut. It’s infuriating.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie is amazing until the third iteration of the same events. Stop making the audience guess on an ending and just give us one. This was supposed to be a movie about a nuclear reality and they somehow left it up to complete imagination. It the bomb had dropped or it was a dud, this would have been 5 stars. But alas, it's a waste of time.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Well acted and directed thriller that’s is as scary as the best horror movie due to its plausibility….",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Boring watch. Thriller? Pssssh. Dumb political watch. We need action. Nuke to land and people to die for it to be exciting. Just boring talk back and forth and calling people. Boring.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie jumped back in time so many times it was redundant! The director bounced around so much they didnt know if they were coming or going. Then the ending. Ridiculous!! \"Makes you think\". No, watching a movie to see the outcome. Total BS. If i could give if 0 stars I would.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Had all the potential to be great, but you watch the same scene over-and-over from different perspectives and at the end... nothing. Absolutely zero answers. You learn nothing more than you knew at the 30 minute mark. Last hour and 10 minutes were a complete waste of time.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Give me a freaking ending.  Wasted two hours of my life…",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "They always keep you in suspense until the end…",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Watched it because of the hype. Glad I saw it on Netflix so I could hit the skip button. This could be a short film. If it was a first year media students effort would be ok. Labored point and repetitive. Don't bother",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Wasn't a terrible idea and story line, complete waste of time knowing what the ending was, you give us all that build up and nothing. Would never recommend this movie to anyone",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This film is a masterclass in how to build tension only to drop it down a bottomless pit. The entire story hangs on one question — \"Will the bomb explode?\" — and the filmmakers seem to forget they even asked it. Just when the plot should ignite… the credits roll like someone yanked the plug from the projector and ran. It’s not a cliffhanger — it’s a narrative hit-and-run. If cinema is supposed to reward curiosity, A House of Dynamite punishes you for caring.\n\nIn short: all fuse, no boom.",
    "date": "2025-11-29"
  }
]