[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Charming, but very generic movie.\n\nThe story has too much sideplots going on, feels like 3-4 screenplays condensed into one: the makers try to mix some classic Karate Kid references with modern, fresh ideas, with a former boxer who tries a reboot of his past successes, with a Chinese boy in an alien country, a new school and with new acquaintances, and you get quite a nostalgic recycling of an all too well known and predictable story taking place at the Big Apple of 2025. \n\nDespite all the known ingrediences and rushed plot developments, this movie is still quite entertaining. \n\nFor fans a one-time watch.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I really enjoyed the movie! The fighting scenes were mind-blowing! The story was great.. It was interesting to watch how the protagonist's motivation evolves from self gain to fighting for the tree!\n\nThe final battle had a scenic battle arena!\n\n\nNew York you beauty!!\n\n\nThe story definitely has a slight fresh take alongside maintaining the core charisma of the Karate Kid legacy.\n\nLooks like the critics are fatigued.. they promote bad movies and pull down good ones..\n\n\nFinally audience matters! And the audience has loved this one!",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "trash, just more hollywood slop as expected from 2025 Hollywood",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "From the moment it was announced, my expectations were sky-high; the hype was basically pulling double shifts. But once I sat down to watch it, reality hit me with a clean \"crane kick\" to the face: the movie is a straight-up disappointment.\n\nThe story recycles the same old formula without adding anything new: new kid in town, predictable romance, stock bully, rushed training arc, guaranteed win. Nothing wrong with the structure itself, but they tried to squeeze everything into just an hour and a half, leaving the film shallow, jumpy, and with zero emotional payoff.\n\nThe big selling point the crossover between the two worlds— had real potential, even if nobody actually asked for it. I bought into the idea… until the execution made it fall apart. The movie opens with a quick explanation to connect both timelines, but Mr. Han vanishes after the first five minutes. From there, we jump straight into the protagonist arriving in New York, struggling to adjust you know, the usual. Nothing surprising.\n\nThen, after a full hour of lukewarm buildup, the movie suddenly tries to deliver the BIG FINAL FIGHT… in the last 25 minutes. And yes, Daniel LaRusso drops in during the final twenty like a last-minute firefighter trying to save the plot. It feels forced, like a desperate attempt to inject excitement that never shows up.\n\nHonestly, the 2010 \"Karate Kid\" had far more emotion, development, and charm. This one works only as light background entertainment but falls way short of the hype it created.\n\nFinal takeaway: the movie disappoints. It’s fine to kill time, but nowhere near strong enough to carry the legacy or the expectations it promised.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "As far as sequels in this franchise goes this is probably the best one but by no means is it good. It has the same problems all the other ones had but it functions enough as a overall story. The editing is ok. It certainly gets creative at times with it's transitions out of nowhere at times. Overall the biggest problem lies in the fact it has way too many subplots going on just like the others and retreads the same water of the first one. His subplot with his Mom feels pointless. The romance, moving to a new place, the tournament all feels too familiar at this point. The big chunk of the first half is him training the Dad and it feels like it takes too much focus off of him. And why woud he need to learn but be trained in the scond half? I get he's super talented already but still it just feels weird. The bully, Jackie Chan and Daniel showing up all feels forced in as well. The film up until the point Daniel shows up actually has some rhythm and flow but he feels so forced and it just goes downhill. Than they mix the training montage with the tournament as well so it feels jumpy a bit and by that point were just coasting. It doesn't really justify Daniel being there. Everything else though isn't bad for what it's worth. The new setting is nice, the direction is decent, and the fights aren't bad. They feel a bit too over the top at points like were watching Crouching Tiger Hidden Dragon and not Karate Kid though. All the characters are likeable enough but it's everyone we've already seen before and nothing really new at all here. If you've seen any of the others than you've seen this one. But I will say it is more grounded in reality than some of the others. The villians aren't as cartoonish, and they are all likeable. But still skip it. I don't really know where they go from here with this. Wasn't needed and nothing is needed after.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Kinda sucks so.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "We have a wonderful plot, and a good strong character base, why make it a short movie??? You have Jackie Chan in your film. \n\n1.) Everything needed more depth, the mother son relationship, the kid and girl relationship, the larusso and shifu relationship, the villain backstory. \n2.) Its in NY and theres about 8 characters in the whole movie hahaha what???? Its NY!!! There needs to he friend groups and touching a little bit on who they are, and seeing actually move around the city, I mean the carnival scene??? 10 seconds lol, like there should be tension, drama \n\nThe whole movie is scenes that almost touch a climax and quickly rushes through it, why???? We have the cast, we have an excellent story with a lot going on, lets get into it! It worth watching, but I wouldn't recommend it, its background noise as best, shame on Sony",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Enjoyed this movie! I just wished the film was at least 2 hours longer and didn’t feel rushed.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "What starts off fairly strong quickly devolves into a fairly pointless bit of fluff. Yes, the nostalgia is there, albeit in a muddled sense, the characters carry none of the charm or interest of the original, we have a meandering subplot with very little payoff and ultimately the action edns up being more goofy and far too video-game like. It also doesn't help that they've basically just rehashed the original plot",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "would love a sequel, also hope johnny gets a little more screen time if theres a sequel.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This movie is consistently entertaining, delivering dynamic fight sequences right from the start. The story gains an extra layer of appeal through the nostalgic presence of Jackie and Ralph, whose roles help bridge the film back to the spirit of the original Karate Kid era. Their involvement adds genuine emotional weight. Overall, the movie is engaging and will easily capture and keep your attention.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Not the best outing for karate kid. The action and story are much better in the series like Cobra Kai but I guess they have a lot more screen time to work with. Overall, pretty simple story and okay action. The bully wasn't very well developed or the bad guy but nice to see nostalgia with Jackie Chan and Ralph macchio and the ip still going.",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I can say after seeing this movie the think that hut this the most was the story. They kept bringing back old characters and plots that have already been used to much.\n\nThe cast and acting was 5/5 and Ben was outstanding.\n\nHere is how I would have written the story.\n\n1) kid has a foundation in China, but loosing his brother made the family want to move on to America and Li lost his shot at qualifying for the big tournament there.\n\n2) they move to America (Los Angeles)but the mother and father struggle financially and cant make it.(throw in drama along the way) \n\n3) Li finds a tournament to help them financially but needs to train (bring in Mr. Hahn) but during the qualifying process looses a big match. At the same time he becomes united with Daniel Larusso at that match. \n\n4) Larusso and Mr Hahn connect and reunite how Miyagi affects thier lives and they train Li together.\n\n5) Li parents get evection notice and really start struggling. But you see them working hard and demonstrate family unity. \n\n6) tournament begins and Li getsa win.",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "As a huge fan of the Karate Kid/Cobra Kai franchise, I was super excited when this movie was announced after the success of the TV show. Once the trailer was released, it looked like a fun movie that starred both Jackie Chan and Ralph Macchio with a new Karate Kid in Ben Wang. Unfortunately, once I actually got to watching this movie, I was very disappointed. Throughout the whole movie, it felt like something was missing, things that made the first few movies memorable and charming. The editing was trying too hard with fancy transitions, trying to cater to younger generations. The real big thing that was missing was the development of characters, which I found was pretty much non existent. There was no real moments where we saw the characters grow and have heartfelt moments. The jokes fell flat, unlike the great moments we saw in Cobra Kai. I don't think any of this has to do with the actors, but more so to the writers. I do have to give the choreography some credit, because some of the stunts were quite incredible, although feeling a little unrealistic. To me, this movie was a missed opportunity, not capitalizing on the amazing job they did with Cobra Kai. The best scene in the whole movie was the ending where William Zabka made a cameo appearance at the end, and made a few jokes. This may have signalled that the formula and franchise of the Karate Kid may be on its last legs.",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great Movie it was what I expected. I do wish the speed at which the movie progressed went slower I would have liked it to be two movies to add more depth.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Fun movie like every other karate kid. It is a bit different and it kinds lacks the connection to the original karate kid. But i am satisfied. For those who watched the whole karate kid series i recommend.",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "So, this was a completely unnecessary movie. This Karate Kid, like several other remakes before it, has recycled trope per trope the essence of the classic 80s original, that you PLEASE should watch that instead than this total slob of Hollywood cash grabbiness. Souless, lazy and without any heart - a young boy moves to an unfamiliar place and gets mentored in martial arts to stand up to their bullies and get the girl. Every plot point was so predictable and bland, that I don’t have to watch it to know where it starts, goes and ends. The villain is incredibly one-note as a vague debt collector crew that also does karate and starts fights and also is in an on and off again thing for our love interest… Even a freaking SAT tutor is somehow a bestie, or the mom character suddenly announces speaking English in a predominantly Mandarin household and upbringing just because they are moving to New York. Nothing makes sense, every little thing is micromanaged to get the most bang for your buck, and I am sick of it. I didn’t get any goosebumps from the fights, archs, really anything… thankfully I was with other people to laugh and make fun. This contributed a NEGATIVE score to my viewing catalogue, and I wasted my time. We shoe in Jackie Chan and Daniel-San to be mentors for the 150th time with random jargon and no build up to any camaraderie at all. The only interesting dynamic that REALLY could have been the movie was Joshua Jackson as this lovable former boxer dad and our main protagonist coaching him for the tournament - now THAT could have been a different and intriguing angle that hasn’t been done before.   If the film had no relation to the Karate Kid franchise, just had the trio from the first half as the stars, and tightened up its foundational storytelling, this could have been a serviceable film with decent cinematography. But nope, don’t bother and please move on.",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Oh for goodness sake do I need to start writing movies myself because apparently no one out there has any original ideas anymore.  Same old story again and again.  Odd characters that don't really gel so casting need to have a word with themselves.  Didn't even finish the movie because I could predict it . Not entertaining.  Don't bother.",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's a cool movie. The characters are great and are the best part.",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great addition to the franchise!",
    "date": "2025-10-25"
  }
]