[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Very good movie! Melissa was fabulous with all the range of emotions, and the funny bits made me laugh out loud. It’s poignant and real. Worth watching!",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great movie, once again the professionals (critics) got it wrong as they mostly do. Well worth  the watch",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is a hidden gem . Highly recommend",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The critics are so wrong about this movie. Sure the cgi birds are a little janky but the acting is phenomenal. This movie is sad and emotional but not heavy. I cried and laughed. That is what a movie is supposed to do, make us feel, immerse us in the character’s experience.  Melissa McCarthy is such an amazing actor, her performance has such depth. It is a bit melodramatic but not overly so. I loved it 🥰",
    "date": "2025-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thought this movie was darling.  It was moving and emotional. It was thoughtful and at times it made me chuckle. In also a sucker for a happy ending.",
    "date": "2025-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This is a movie about how couples can process grief so differently. Mostly it’s typical of men to be selfish just like jack was and never thought to consider how lily was feeling and handling the loss of her baby . The movie had its deep emotional moments and funny moments mostly of course because Mellisa McArthy is a great comedian and actress . I recommend to watch , but just be aware it’s a movie about sensitive subject of losing a child and I thought the bird part was funny and enlightening. I actually had a similar situation with those birds in my backyard . So it really hits home to see it’s a common occurrence with those birds lol",
    "date": "2025-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I saw this movie while looking for something to watch on Netflix and wasn’t expecting much but I clicked because I love Melissa McCarthy. This movie really surprised me, I cried and laughed so much. Very sad movie with happy and funny moments. I recommend this movie.",
    "date": "2025-06-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This film is a hidden gem—layered with poignant drama, moments of quiet introspection, and a depth that resonates with anyone who has faced loss. While it carries a steady emotional weight, its message unfolds with clarity, sometimes in the most unexpected ways. Tears are inevitable, woven into a story brought to life by a cast delivering performances on par with some of the finest in the genre. Melissa McCarthy balances her signature charm with raw vulnerability and just the right touch of eccentricity, while Chris O’Dowd takes viewers on a deeply somber yet profoundly human journey through the complexities of grief. By the time the credits roll, there’s a sense of healing—but only for those willing to fully grasp the sacrifices this couple endures in the name of love.",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "As good as I hoped.  Better than I expected!",
    "date": "2025-03-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "One of the stupidest, dreariest films I've seen, despite the presence of Chris O'Dowd, Kevin Kline and Melissa McCarthy. A woeful dirge clearly written by someone who has never watched starlings in their life.",
    "date": "2025-03-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I see the bad reviews. And sure, it's not the best movie I've ever seen but it is one of the sweetest.  Sometimes I just want to feel a little sad and then a little happy. Melissa McCarthy is always so appealing. It's alright and I've seen a lot worse.",
    "date": "2025-01-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I went into the movie thinking it wasnt going to be much of anything and i was absolutly blown away, the birds cgi looks fairly bad when it interacts with anything but its easily overlooked once the movie gets going and the story starts to unwind and really shine",
    "date": "2024-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I was truly touched by this film. It was a sad story because you could feel everything that each character was experiencing but, it brings ease to you at moments.",
    "date": "2024-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I lost my husband suddenly and tragically a little over a year ago. I have been a lot like Lily's character. I appreciate that the movie brought out the fact that the main characters were already the way they were when faced with the loss of their child. I also liked that they didn't say there were \"answers\" to grief. Mental fog is a real thing too. That was one of the scariest things to deal with, especially returning to my job just one week after my husband's death. Thankfully, my errors were not as significant as some of Lily's. I liked how the vet continued to use his therapeutic skills to help his clients. So needed. I appreciated the interactions between all the different characters that showed the complexity of human experiences. It's a really good film to cause one to think, feel, and develop a heart of understanding and compassion for others.",
    "date": "2024-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Man these critics are wrong just watch it",
    "date": "2024-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Not a turkey a Starling... Very touching loved it",
    "date": "2024-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I can't tell how many times I've watch this movie. It helps me comfort so much when I was dealing with emotional breakdown and sad. This movie is wonderful and truly represents how we feel when we're depressed and it brings tears of joy to see this beautiful and wonderful story of these two couple and also it portrayed everything in a perfect way.",
    "date": "2024-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Why do treasures like these not get watched more often???\n\nThis movie was wonderful.\n\nLife has profound meaning, and few movies illustrate that as well as this one",
    "date": "2024-01-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love everything about this movie. We are currently starved for content this good. Performances by Melissa McCarthy, Chris O'Dowd and Kevin Kline were pitch-perfect. Moved to tears and laughter that were genuine. Critics are cynical a**holes",
    "date": "2023-05-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This was a touching movie about grief.  I liked that they used a not well-liked bird, a Starling, to demonstrate love & partnership.  Glad that the plot helps the audience learn an important life lesson.",
    "date": "2023-03-18"
  }
]