[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thought it was a really good movie, good concept, but it reminded me too much of hard rain with Christian Slater and Morgan Freeman.\nBut it is a good movie to watch good action, good chemistry with all the characters",
    "date": "2025-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "\"The Hurricane Heist\" is not a good movie by any real measure. The acting and dialogue are pretty bad, and the action scenes are bonkers and repetitive. The movie just becomes boring to watch at a point, and I didn't feel invested in the heist element, which is pretty important in a movie like this. I do think there is an element of the movie that is so silly that it is fun for a bad movie night, as I enjoyed the experience of watching it with friends. Overall, that being said, it is a movie that is bad on every technical level, so it is hard to find any other real reason to watch it, especially when there are so many better heist movies out there.",
    "date": "2025-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A disaster movie in three senses, the flat plot, the pathetic acting and the embarassing direction.",
    "date": "2024-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I'm not sure if the writers know what a hurricane even is? Because they seem to think it's a giant tornado. And no amount of the crummy acting, script, and the distracting color grading could get me invested back into the film. 1 star for drinking game efficacy.",
    "date": "2024-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Its one of those movies that I can recomend to everybody. Dont ask me why .. Just watch it.",
    "date": "2024-04-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I watched this on DVD recently.  It's much better than the reviews would have you believe.  It's well made with decent acting, special effects, and soundtrack.  The story's pretty good too, but reminded me of other similar films.  The main problem is a hurricane is hardly the ideal weather for filming, so the film is predictably grey and wet.  Perhaps one day we'll get a \"Heatwave Heist\" movie with nice sunny scenes?  Back to this, there's nothing to dislike really, and it deserves a recommendation.",
    "date": "2024-02-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Big dumb and not especially fun.",
    "date": "2023-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "If you like disaster style movies with a twist you will like this, good action and enjoyable",
    "date": "2023-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Lousy, but somehow managed to be entertaining. Overdone caricature-like Southern accents. So many plot holes you could fit elephants through each one. Dialogue and script were amateurish and lame. Acting was well below average. That said, special effects and visuals were kind of ok. Although the movie was not really boring, the storyline was a messy heap of total nonsense and ridiculousness.",
    "date": "2023-03-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "One of those not so great movies that at least will keep your attention. Despite the lack of surprises.",
    "date": "2023-02-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Minha opinião: Os americanos gostam bastante de filmes de tornado , furacão, mas aqui eles fizeram uma somatória deste estilo de filme e roubo de dinheiro, que seria para descarte. Neste filme temos a a atriz Maggie Grace (da triologia \"Busca Implacavel\" com Liam Neeson) gosto do estilo dela, mas até hoje não teve aquele grande destaque nas telas. Ela faz o papel de uma guarda de segurança do local do governo para o descarte de cédulas de dinheiro. Um local onde os ladrões onseguem invadir com uma facilidade. Há vezes que vemos aqueles filmes que mais da metade é so para tramar uma invasão e temos todo um esquema milaborante, aqui eles chegam e invadem com uma facilidade incrível. E Toby Kebbell que é caça tornado e seu irmão Ryan que não tem nenhuma formação militar e encaram um bando inteiro de ladrões preparados que invadiram com uma facilidade o órgão do governo e apanham para este 2 irmãos. Sabe quando a estoria é forçada. E temos de engolir a seco. E o eles vão eliminando todos os bandidos de forma incrível, até os policiais da cidade. E o gran finale, com um MEGA TORNADO NO RABO DELES, e mais os bandidos, eles vencem tudo e saem com um caminhão de dinheiro. Kkkkkkk\nRoteiro e enredo forçado de mais, que voê tem que engolir a seco.\nVale apena assistir? Se você gosta o estilo bem mentiroso, assista.\nNota: 5",
    "date": "2023-02-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Non si può certo dire che il film manchi di coraggio, di idee e di effetti speciali.\nAnzi, ogni tanto si finisce per eccedere nell'impossibile, anche laddove si sarebbe potuto trovare soluzioni alternative.\nIl finale poi pecca totalmente di credibilità; abbandonando ogni parvenza possibilistica per sfociare nella più pura fantascienza.\nPeccato perchè il resto del film, seppure ai limiti, non si poteva ritenere totalmente impossibile da verificarsi.\nNumerosi personaggi molto diversi tra loro rendono interessanti i dialoghi e gli schieramenti, nonostante il poco spazio dedicato (comunque buona idea per non spezzare il ritmo).\nDavvero un peccato per il finale.",
    "date": "2022-06-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "A so bad its good, but then also loops back to being bad again. A TV grade movie with a forgettable plot and stupidly bad looking VFX. Why my friends wanted to go see this film I do not know, and why I'm still friends with them after the fact is also a mystery.",
    "date": "2022-05-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The Hurricane Heist Is an Fun action movie WIth a Hurricane on them I like the whole cast in this movie The very beginning of the movie is the best part of the whole movie The ending is pretty neat there is no much is just a lot of fun it is like a taco bell movie to me the score is nice I liked it So I give Hurricane Heist An C",
    "date": "2021-02-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "was not good but really wasn't that bad either",
    "date": "2021-02-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This is a film with an incredible, and talented cast that is simply let down, by the writing, and lack of direction. This film doesn't know what it wants to be. I wasn't sure if the hurricane was the main plot, or the heist. As it flopped back and forth the more confusing it got. Turn off your brain, grab some popcorn and enjoy the action of this film.",
    "date": "2021-01-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Entertaining action movie. However the eye of the storm bit was just ridiculous.",
    "date": "2021-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Decent enough movie, the title says it all I suppose about plot and story. I found it really difficult to feel connected to any of the characters so didn't really care what happened to any of them, that said I thought Maggie Grace and the two 'Rutledge brothers' did a very good job at making it better than it would have been otherwise.",
    "date": "2020-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "“Pretty good action thriller, however the graphics seemed a little bit unreal at times.”",
    "date": "2020-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It made no sense, really.  But it was a fun ride.  really!",
    "date": "2020-07-31"
  }
]