[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Locked In tries hard to be a psychological thriller, but what begins with a bit of promise quickly spirals into a sluggish, uninspired mess of clichés, wooden dialogue, and characters so thinly written they might as well be shadows on a wall.\n\nDespite its attempts to build tension, the film mistakes slow pacing for suspense and confusion for complexity. The twists are clumsy, and by the time the credits roll, the only real mystery is how this ever made it past the editing room.\n\nA forgettable watch, best left unwatched.",
    "date": "2025-06-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie is such a drag I couldn’t even force myself to get past the first 40 minutes. A complete waste of time that I’m assuming leads to a predictable ending. Don’t waste your time with this one.",
    "date": "2025-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "An interesting mystery with some fun twists and turns!",
    "date": "2025-05-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The cast isn't horrible but the dialogue is overall quite boring. The chase was pretty exciting until they dragged it out by constantly switching back and forth in time, which normally, I don't mind but in this case, it was just way too long. The story is all over the place, you could easily predict it was Robert who hit Katherine, but you just didn't know why, the motive for Jamie's murder was there, but the characters just aren't those kinds of people. Some things in this movie just don't make sense, I still don't understand why the nurse is so involved in what happened, all she needs to know is why Katherine is in the hospital and then take care of her. Why she got hit by a car isn't any of her business yet she tries to force the story out of Lina completely, as if she thinks she's a detective. And why Robert wanted Katherine instead of Lina all of a sudden. Maybe when he figured out that Lina wouldn't sell the house, so he wanted to get rid of her thinking that Katherine would become heir to the mansion? I don't know because the movie doesn't tell us.",
    "date": "2025-01-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The film itself is shot beautifully and the acting isn't awful - fundametally, the plot brought the film down. It started off rather promisingly however started to decline midway through with twists contradicting each other. Ultimately, this left you feeling a bit confused and underwhelmed by the ending. With that being said, the film kept me gripped and it was an easy one to watch.",
    "date": "2024-12-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "**The Anatomy of a Good Movie**\n\nMovies, as a form of art and entertainment, have the remarkable ability to captivate audiences, evoke emotions, and leave a lasting impression. While personal tastes may vary, there are certain qualities that contribute to the greatness of a film. A good movie is more than just a sequence of moving images; it is a carefully crafted work of storytelling, cinematography, and performance that resonates with its audience on multiple levels.\n\nFirst and foremost, a good movie has a compelling narrative. Whether it's a gripping thriller, an epic adventure, or a heartfelt drama, the story serves as the foundation upon which everything else is built. A well-written screenplay keeps viewers engaged from beginning to end, with well-developed characters, intriguing plot twists, and meaningful themes that provoke thought and discussion.\n\nIn addition to a strong story, the visual elements of a movie are equally important. Cinematography plays a crucial role in creating the mood and atmosphere of a film, using lighting, framing, and camera movement to enhance the storytelling. From sweeping landscapes to intimate close-ups, every shot is carefully composed to evoke emotion and convey meaning.\n\nMoreover, a good movie is brought to life by talented actors who embody their characters with authenticity and depth. A convincing performance can elevate even the most ordinary of scenes, drawing viewers into the world of the film and making them care about the fate of its protagonists. Whether it's a seasoned veteran or a newcomer making their debut, the actors' dedication to their craft shines through, leaving a lasting impression on audiences.\n\nFurthermore, the audio aspects of a film, including the score and sound design, contribute significantly to its impact. A memorable soundtrack sets the tone for key moments, heightening tension, stirring emotions, or providing moments of levity. Meanwhile, meticulous sound design immerses viewers in the world of the film, whether it's the roar of an explosion, the whisper of wind through trees, or the subtle rustle of clothing.\n\nLastly, a good movie leaves a lasting impression, lingering in the minds of its audience long after the credits have rolled. Whether it's a thought-provoking message, a breathtaking visual spectacle, or a poignant emotional moment, the best films stay with us, shaping our perceptions and enriching our lives in ways both big and small.\n\nIn conclusion, a good movie is a multi-faceted work of art that excels in storytelling, cinematography, performance, and audio design. It engages audiences on an emotional and intellectual level, leaving a lasting impact that transcends the boundaries of time and space. From the classics of Hollywood's golden age to the latest blockbusters of today, the power of cinema to entertain, inspire, and move us remains as potent as ever.",
    "date": "2024-12-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It's a pretty boring movie.",
    "date": "2024-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Very predictable. Ending is meh. Sorry",
    "date": "2024-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I actually liked it. I was interesting to me and kept my attention.",
    "date": "2024-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It wasn't bad, a bit predictable but Alex Hassell with glasses is hot as hell so whatever.",
    "date": "2024-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Absolute time-waste. There was absolutely no crazy plot twist to make it a thriller, you can see the whole plot from far away.",
    "date": "2024-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "#NotRecommended 4/10",
    "date": "2024-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The topic is interesting, but well-known; the plot is interesting, but predictable; the acting is interesting, but not exciting; the lighting is good, though.",
    "date": "2024-06-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Probably the worst movie I’ve ever see. Predictable plot, dreadful dialogue, ridiculous situations. Just awful all round. Like a really bad high school production.",
    "date": "2024-06-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Truly, truly appalling. \n\nA great cast saddled with the worst script AND plot in history.",
    "date": "2024-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Movie was terrible probably one of the worst ones i’ve watched in my life Plot couldn’t have been dumber Cheat on her crippled husband multiple times then kill him then go to kill you adopted mother and then kill the mistress",
    "date": "2024-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "As the years go by, the puffier Famke Janssen's eyebrows get. But seriously, this movie is a hard pass.",
    "date": "2024-05-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Encerrei o filme Um pouco receosa, temendo pelo seu futuro incerto, numa quase certeza que seria uma grande bomba, entretanto foi ganhando bons contornos, e tornando-se até convincente, a temática não é inovadora tão pouco se diferencia muito dos que abordam tal tema, Mas é bem gostosinho de assistir, ficamos na expectativa pelo plot Twist para descobrirmos quem são os mocinhos e os vilões, nada muito surpreendente tá um pouco enfadonho... Vence e até convence... Bom, gostei...",
    "date": "2024-04-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "If you can work out the plot let the director know...",
    "date": "2024-03-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Despite all the critics reviews, I actually enjoyed the movie. Having only seeing the trailer, I think it actually worked well. It kept me guessing with unexpected twists and turns. It was slow paced with hints of fast action you wouldn't expect.",
    "date": "2024-02-23"
  }
]