[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A pretty entertaining film, Winona and Jenna really shine in this one, both amazing actors. 7/10",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "nice to see old friends",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It was not nearly as good as the first one, it was pretty good. \n3.0",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Honestly doesn't deserve a star. Way too cringey and not resemble the original at all. Michael Keaton should've stuck to his original acting style for beetlejuice instead of being a sell out. Jenna Ortega is not a good actress, just as overhyped as Pedro Pascal. Both not good at all. 0 stars for me",
    "date": "2025-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This movie has some fun to it. The visuals are great, no real complaints about the acting either. It's just the plot that doesn't make sense. \n\n\nSPOILERS: Beetlejuice's ex-wife just does not contribute to the story at all and is a complete waste of time. The boy that swaps life with Astrid has a complete letdown for the resolution. What they needed to do was just focus on one of the 2 characters instead. The plot doesn't need to be specific due to the nature of the movie, but this is just ADHD writing with no real direction.",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "After the cult original from 1988, Beetlejuice 2 turns out to be a major disappointment. Tim Burton’s direction feels surprisingly uninspired, even tired. Where the first film burst with anarchic humor and creative energy, there’s now little left to discover.\nTechnically, the film is polished — cleanly shot, slickly produced — but it doesn’t come anywhere close to the witty anarchy and twisted charm of the original.\nJenna Ortega spends most of the film acting like a sulky diva, pulling a grumpy face for the first 25 minutes as if she’d rather be somewhere else. Justin Theroux is bland and silly, which doesn’t help the already thin characterization.\nMichael Keaton, thankfully, still enjoys himself in the role of the chaotic antihero and remains the film’s one real highlight. But even his infectious energy can’t rescue the uninspired direction and lifeless script.\nIn the end, Beetlejuice 2 is a technically competent but artistically hollow sequel — a polished echo of a once brilliant classic.\nTechnically sharper, spiritually emptier. Beetlejuice 2 proves that you can’t technical reconstruct anarchy.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it ,funny great time",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "waited too long for this remake",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great seeing the old characters and some classic Tim Burton storytelling.   Fun movie and a worthy sequel.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It's pretty weird, as you would expect from Tim Burton. But it's a fast-paced entertaining sequel that doesn't just copy the formula of the original. It actually explores new themes and conflicts.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The Beetlejuice sequel is a delightfully spirited revival of the original classic, reimagining its quirky, macabre world with energy and style. While it doesn’t quite capture the same groundbreaking charm as Tim Burton’s 1988 film, it succeeds admirably as a fun, modernized reimagining that honors the tone and wit of its predecessor.\n\nThe cast delivers consistently engaging performances, balancing comedic timing with moments of genuine heart, and their chemistry helps ground the film’s more fantastical elements. Visually inventive and narratively playful, the sequel revitalizes the beloved universe while maintaining a sense of nostalgic familiarity. For fans of the original and newcomers alike, it is an entertaining, well-executed continuation that proves the spirit of Beetlejuice remains delightfully alive.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "First, there has only been one sequel in the history of sequels that MAYBE was as good or eclipsed the original installment: \"Godfather 2\". And why? Because the novelty of the first no longer exists in a sequel. You simply cannot capture the newness, the discovery, the thrill of the unknown of the first in a film sequel. SO, especially for a film like \"Beetlejuice Beetlejuice\", where the world we're first introduced to in B1 is SO unique and creepy and funny and macabre, I give the filmmakers a LOT of credit for even trying to capture the magic of B1 in B2, in the first place. Because they came close, and in no small part because they were smart enough to compensate for the lack of \"fresh\" by making sure they had plenty of story. And the story, with all it's twists and turns and funny, kept me firmly attached. \n\nEveryone turned in excellent performances, pitch perfect for the material, and the look of the film was tried and true Burton.  Kudos to him and his crew. \n\nThe film was absolutely entertaining. The reason why my rating was 3.5 is simply because this isn't the sort of material that will have a profound impact on the viewer for years to come and because, it's a sequel. But if you want a couple of hours of some good fun, I certainly recommend BB2.",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Boring, stupid, too many things happening. It wasn’t at all what I expected.",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The long-awaited sequel to Tim Burton’s first command performance, basically with the same cast, just thirty years later. The potty-mouth comedy, once funny in early 2000 is no longer funny, and the whole thing turns into an eye-roll fest led by Michael Keaton's character. You might watch this film without complaint if you're a die-hard Tim Burton fan, but nothing about this film resembles a Tim Burton film to me, regardless of the impeccable Danny Elfman score.\n\nIt’s just sophomoric and charmless, lacking the pure whimsy and guileful mischievousness of the first film.",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Here's the thing about the sequel to Beetlejuice: Expecting the film to rival or surpass the original movie puts it at an unfair disadvantage. It's almost an impossible task, although the Broadway musical has done a good job in its interpretation of the source material.\n\nNow, there are numerous fun callbacks to the original film that make it an entertaining watch. Plus, the plot line revolving around Jenna Ortega's character is excellent. Exploring her character more and dropping some of the other non-essential storylines would have been more of a step in the right direction.\n\nIt felt like they were trying to work with so much material that it ended up working against itself.\n\nMichael Keaton still manages to stand out as the title character, which is a testament to his acting ability, given that it's been 36 years since the original. Keaton is 73 years old, but he somehow makes it feel like no time has passed since he last played Beetlejuice.\n\nIf you're a fan of the original, it's one of those movies you'll want to watch out of sheer curiosity. For everyone else, tread lightly if you watch it and enjoy it for what it is.",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Only good for the nostalgia factor, since I’m a 90s kid. Other than that, it was ultimately disappointing.",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's a perfect Halloween movie for the entire family. Funny, campy, colorful! I never saw the first movie, maybe I will watch it later but I didn't felt like an outsider. I had fun.",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "There were too many story threads to tie it all together without feeling rushed.",
    "date": "2025-10-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Abosulte cinema really enjoyable and I loved it in cinemas",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Michael Keaton is the only reason this is getting more than 1 star",
    "date": "2025-10-21"
  }
]