[
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It's a hard to get your head around what makes this movie the rough ride it is. Coming from Falling Down just the year before The Client is a big step down for Schumacher, despite a cast that should be able to make any directorial ambitions come to life. It is in fact Sarandon's effort that makes me put up with cartoonish mobsters and a script that doesn't know where it's going.",
    "date": "2025-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Great actors paired with an interesting story is always a great match for a crime drama. This movie is exciting to watch, but falls short of other courtroom movies.",
    "date": "2025-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Started off decent got really stupid and really boring absolutely garbage of a movie wouldn't reccomend this movie to my worst enemy, seriously I'd rather watch paint dry..",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Interaction between Reggie and Mark made the movie for me as  well as Jones as Foltrigg.",
    "date": "2025-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Filme mais ou menos, o roteiro é mais ou menos, as cenas são mais ou menos, o elenco é mais ou menos, mas ninguém ajuda a melhorar o filme, a história é mais ou menos, os personagens sao mais ou menos, e o filme deveria ter cenas bem melhores e relevantes para fazer o filme ser bom.",
    "date": "2025-05-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Compare this movie to anything in the theater today and it would win best picture...",
    "date": "2025-04-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Meu gênero favorito precisa de suspense e mistério para me conquistar e esse filme cumpre muito bem esses requisitos. Ágil, voraz é inteligente, sabe como levar o roteiro sem perder o ritmo e a lógica. Excelente, perspicaz e emocionante.",
    "date": "2024-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Watched this right after The Firm which is 10 times the movie of The Client. Read the book many years ago and don't remember it being this bad. Great actors given a bad script with bad directing delivers a real dud. First half hour gets your attention, but by the end you feel really bad you wasted your time on this.",
    "date": "2024-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The Client, though not the best of the John Grisham books brought to the screen, wins on the levels of 1. The acting from all involved. Tommy Lee Jones delivers one of his Top 5 performances. His cocky and arrogant Reverend Roy is perfect for this story. Susan Sarandon is on point as always with her down to earth performance as a former alcoholic and a cheap but smart, talented lawyer. The late Brad Renfro gives a great performance as a first timer in a film loaded with talent. He able to keep up with them all.\n2. The story gets a bit melodramatic but the storyline mixes the mob and the courtroom together very well. Joel Schumacher does it once again after giving us The Lost Boys and St. Elmo's Fire and would eventually bring another Grisham book to life with A Time to Kill does his best with the script that was given to him. This is definitely a great watch and the dialogue is a joy to listen to. There are several scenes that I have played over many times but I will say that the first scene between Sarandon and Jones is one for the books. Have yourself a Grisham weekend and start with this one, then A Time to Kill, The Firm, The Pelican Brief, The Rainmaker and finish it off with The Chamber.",
    "date": "2024-01-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie the way the characters interact with each other. Definitely a must to see!!!",
    "date": "2023-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This film is bad. The plot is OK but the execution is poor. The characters are annoying and stupid and the acting from everyone is mostly bad. It starts off as a decent thriller but then very quickly turns stupid in the same scene, by the 1 hour mark I was bored so stopped watching.",
    "date": "2023-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A fair, good written drama thriller.",
    "date": "2023-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The chemistry between Tommy-Lee Jones and Sarandon ... they just don't make films like that anymore!\nReally excellent cast and what a child actor, a debut Performance no less :-)",
    "date": "2023-06-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "One of my all-time favorites. Susan Sarandon is great, as always, and 11-year old Brad Renfro as a smart and smartass kid is phenomenal. Tommy Lee Jones hams it up perfectly as a slick and slimy U. S. Attorney.",
    "date": "2023-03-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Susan Sarandon is amazing in this film. But that is no surprise. I think that she is the best american actor ever. Also the kid did a good job.",
    "date": "2023-01-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "AWESOME FLICK.  LITTLE BRAD RENFRO WAS OUTSTANDING.  REST IN HEAVEN BUDDY.  TOMMY LEE AND SUSAN SARANDON BOTH PLAYED GREAT ROLES.  GREAT PLOT, GREAT ACTING.  GREAT HEARTFELT ENDING.  ONE OF MY FAVORITES.",
    "date": "2022-12-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Great performances from everyone involved in this underrated Joel Schumacher film.",
    "date": "2022-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It is rather a fun trip to the lawyer's office which you don't see everyday",
    "date": "2022-05-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "\"The Client\" is truly one of the best legal thrillers I've ever seen, I have no words to describe it, Joel Schumacher's duology is really fascinating.  Another important point is Susan Sarandon's versatility, which shows that she is an Actress with a capital A.",
    "date": "2022-04-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Anchored by John Grisham's compelling story and Susan Sarandon's commanding performance, The Client is definitely worth watching. It's impressive to think that this was Brad Renfro's first film role, and he does a good job as the central character. Coming in at just under two hours, this adaptation captures the essence of the novel without including all the details.",
    "date": "2022-02-02"
  }
]