[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I can't understand that it took me such a long time to finally watch this movie.  I guess it just escaped me because the title in Portuguese is identical to another older movie which I simply didn't care to watch again. Thus said, I finally had the chance and I was flabbergasted. It's a masterpiece which leaves everything pretty open till very close to the end, and even then it has a surprise up its sleeves. Though it starts out like so many other court cases, it is in fact a thriller about how to manipulate one and illegally force the decision one way or the other. Gene and John are just perfect, and the ending is way better than one could ever imagine. 8/10 points!",
    "date": "2025-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I gave it this score solely on the strength of the actors. The story, while good is Implausible in this day and age.",
    "date": "2025-05-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Runaway Jury has a solid amount of courtroom suspense and the premise is interesting. The cast is great and there are some great performances across the board, particularly from John Cusack.\n\nThere were a lot of characters that seemed underutilized (i.e., the opposing attorney, the jury consultant for the plaintiff, etc.). The twist was strong and I enjoyed the end of the film, but there were a few loose ends I would have liked buttoned up (Marlee's mom).\n\nBest Character: Nicholas Easter\nBest Quote: \"If you're relying on testimony to win this case, you've already lost it. Fella.\" - Finch\nBest Scene: The Verdict\nBest Piece of Score: \"Runaway Jury\"",
    "date": "2025-05-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "At first I thought, this is a John Grisham story.  How great?!  And then I looked up Brian Koppelman.  I didn’t realize I was also a fan of his writing.  Not bad to have a good screenplay writer adapt a good writer’s book.\n\nCast was great, acting just ok.  Maybe just rushed, I’m not sure.  Directing and producing not strong.",
    "date": "2025-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great cast and acting in another movie made from. Grishman novel. The king of courtroom dramas",
    "date": "2025-03-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "3.5 stars; I really love John Grisham's books (should have been a lawyer). For the most part, the movies captured the spirit of his books, as was the case with \"Runaway Jury.\" For its time, it introduced all the sophisticated technology that went into jury selection for most successful lawyers. Director Gary Fleder converted the story into an action-suspense movie, for the most part successfully. I guess the biggest complaint about the movie was that, for an all-star cast, the acting effort did not satisfy. Up to a point, I can agree with that. However, that did not detract from the suspense that was generated. The technology, while somewhat dated by today's standards, was pretty awesome for the early 2000s. I enjoyed it!",
    "date": "2025-03-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The familiar debate on the free carrying of firearms feels light, and the plot, reduced to near-comedy level. And that's its biggest flaw, as it doesn't make the most of Dustin Hoffman and Gene Hackman (RIP).",
    "date": "2025-03-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "A lot of potentially great (or at least fairly decent) actors wasted when put to work in a flashy, down right stupid story.  Lawyers who watch may vomit. For the really dumb and gullible only.",
    "date": "2025-03-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not a bad movie. But, Dustin Hoffman, a great actor, did an awful job with his southern accent and sounded like Dorothy Michaels from Tootsie.",
    "date": "2025-03-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The best scene of the film was the Hoffman and Hackman argument in the bathroom. The rest of the movie, however, was a chaotic mess in need of a better script. I did like how the film was political. That was captured well. Overall, the film was good. The film could have been better had it focused more on Hoffman and Hackman characters.",
    "date": "2025-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I watched this movie in hearing about the passing of Gene Hackman.  I stopped watching John Grisham movies after being disappointed by the film version of The Firm.   This one has an all star cast and is very good.  Hackman is really good, as always.    John Cusack does a great job as the suave and manipulative juror with an agenda.   Dustin Hoffman is not his best, but good, as the honest, country lawyer seeking justice for a gun death client's family.  This one varies from the book, but I never read the book, so I am not jaded.   The story is unrealistic but it doesn't matter.   This is a good courtroom, and behind the scenes, drama.",
    "date": "2025-03-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The performances are solid and the twist is sublime.",
    "date": "2025-03-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Based on the novel by John Grisham, this intense legal thriller follows a high stakes trial against a gun manufacturing company whose weapons were involved in a workplace shooting 🔫\n\nDustin Hoffman plays a lawyer who goes up against a shady jury consultant, played by Gene Hackman, who use unlawful means to stack the jury with people sympathetic to the defense😬. However, a cat and mouse game begins when one of the jurors reveals they’re able to sway the jury to deliver any verdict they want. 😮\n\n🎞️This movie was Gene Hackman’s penultimate film before his retirement from acting, and he gave one of his strongest performances, along with Dustin Hoffman and John Cusack.",
    "date": "2025-03-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A great legal thriller filled with great performances. Loved the ending. Tim Treakle",
    "date": "2025-03-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Gene Hackman is awesome. Really exciting movie",
    "date": "2025-03-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of my favorites, watched a few times. Acting and story are great!",
    "date": "2025-03-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Watchable. Both cliche and fanciful. Still, the acting and weight of the subject make it engaging.",
    "date": "2025-03-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is an excellent film. It's both entertaining and educational, and it's got an excellent cast. It also has a satisfying array of good and bad guys and an ending which ... I'll stop right there. No spoilers in this review.",
    "date": "2025-03-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "There's enough to admire in this fast-paced courtroom thriller, but aside from the good acting and interesting premise, there's too much going on that it's often all over the place.",
    "date": "2025-02-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I love this movie, from the moment it came out til this day, the only John Cusack movie I would ever recommend someone to watch, a stellar cast appear in this completely unrealistic but entertaining film",
    "date": "2025-01-30"
  }
]