[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best movie sofar I enjoyed every second of it",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Sayang oras. Tipikal na teen vampire horror movie. Napaka predictable",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Uma surpresa bem gostosa este filme. Primeiro pq o ator principal é muito carismático (além de bonito), e mesmo que pareça um bobo muitas vezes no filme, faz termos simpatia por ele e sua passageira affair. O roteiro é bem construído e sabe manter a tensão com cenas bem interessantes, fotografia e iluminação modernos e um bom trabalho de arte. Ainda o roteiro transforma o clássico fazendo o virgem ser um homem, e as vampiras serem mulheres, algo já cantado por Léo Jaime.",
    "date": "2025-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Started off ok but just fell apart in the end",
    "date": "2025-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It’s not awful but it kinda is at the same time. I’m not gonna watch it again but I don’t regret watching it. It’s fun but Benny had very poor survival instincts. I know it’s just a movie but ????",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I really enjoyed this movie.  It is a simple plot line and not too gory.",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "So Vampirscheiß ist eigentlich überhaupt nicht meins und die Story war eigentlich Nonsens! Trotzdem war der Fim durchaus fesselnd, gut erzählt und die mir gänzlich unbekannten Schauspieler haben einen wirklich guten Job gemacht! Ich bin nicht eingeschlafen!",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The idea is great, but simple, and the movie is well made. It has a certain vibe to it that is very cozy and warm. Acting is good, script is alright, lighting is very nice, the nighttime-dark gives a great atmosphere.",
    "date": "2025-06-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A good funny movie. But very interesting.",
    "date": "2025-04-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This was a very interesting movie with just enough coas and horror/violence with a case of romance..it was all around great I couldent keep my eyes off the screen a solid 4 stars for me. Great picture quality too.\n(Dohdoh certified 💫",
    "date": "2025-01-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Aunque la premisa es buena y tiene un lore interesante el humor y los personajes me detiene de disfrutarla fuera del personaje de Benny y el de den y ryan todos los personajes son molestos no la recomiendo ni para masturbarme sirve",
    "date": "2024-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I honestly don't get the bad reviews. This was a fun uncomplicated and well acted movie. I def recommend it -- engaging, unusual, filled with great character defining moments. Fast paced and filled with details. \n\nSure, it's simple, sure it borrows on some tropes, but it uses all of them well to create a complete package in the time of a single film. Something rare in today's world of neverending series. Honestly wish it had a p.2, but also just as honest, we all know that sequels don't usually hold up as well.",
    "date": "2024-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The writing seemed like it was going somewhere but got caught up in the vampire love trope versus adding more to the plot giving an actual story. It was a good idea but I feel like the writers kinda got stuck. If you enjoy art and effects definitely worth the watch. The way they used neon colors to add mood and emotion almost made up for the writing. Def watch if you are high and need something to watch",
    "date": "2024-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "For me its a very good movie a must watch from me.... waiting for its sequel soo badly....",
    "date": "2024-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "La idea no estaba tan mal, el problema es mas que nada la ejecución. La historia creo que se podía ejecutar mejor como una película de accion o incluso de terror pero no hace ni una ni la otra, se queda en el exceso de diálogos y violencia muy mal ejecutada (básicamente de fondo o en desenfoque). No es mala, se deja ver pero no seria un film que recomendaría o vería yo de vuelta.",
    "date": "2024-05-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Achei a estética do filme perfeita, é perfeito para assistir foi uma ótima experiência cinematográfica e todos sabemos por que a crítica detonou o filme",
    "date": "2024-04-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Better than I expected!",
    "date": "2024-03-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Different, fun, keeps you engaged. Loved it.",
    "date": "2024-01-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A very slick ,cool and sexy film. Turn the volume up and enjoy this movie. Soundtrack is awesome.",
    "date": "2024-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It may not be groundbreaking for plots or making any new ground in the world of vampires, but it's still a very fun adventure, very easy to follow and the visuals always look amazing.",
    "date": "2023-10-21"
  }
]