[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "AQP II is a very solid sequel building on the franchise in all the right ways.\n\nEmily Blunt, Cillian Murphy and their your young co-stars deliver impressive performances to add to the incredible tension and plentiful action sequences.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A solid if more underwhelming entry into this little franchise thanks to the leads, and still outstanding effects.",
    "date": "2025-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Feels alot more like an \"Episode 2\" more than a sequel. Same as the first, scare factor was lost on me.",
    "date": "2025-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie does everything you want a sequel to do, it goes just a bit further than the original. There is more action than the original and it is a lot of fun just not quite as scary as the first one. Great performances from everyone involved, well paced, and a good story. The sound compliments well just like the first film. I highly recommend.",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Its nice to follow a story line so this is just a big 4 hr movie if you count the first one. Not bad",
    "date": "2025-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "even better than the first one. this franchise have so much potential. Just keep going, i need more of this.",
    "date": "2025-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Worse than the first part, but still a successful sequel. It’s suspenseful again and entertaining, even though not much happens in terms of plot.",
    "date": "2025-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "La primera parte estuvo bien pero esta segunda parte me impreciono, no pude soltar la película hasta su final. Obviamente ahora necesito una tercera parte para saber que va a pasar con los protagonistas.",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "👍🏻👍🏻👍🏻👍🏻👍🏻",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I watched this with keen interest and anticipation, and it didn't disappoint. Good story, nice scenery and lots of suspense.",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Entertaining but not as good as the original. Was really missing the John Krasinski star factor. He really made the first one.",
    "date": "2025-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1 hour and 37 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated PG-13 for Terror, Bloody/Disturbing Images and Violence!!!!!!!!!!!!!!!!! The USA grossed over $160,200,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely amazing, not like every other movie.",
    "date": "2025-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "While not reaching the same levels as its predecessor, Part II is nevertheless a great continuation.",
    "date": "2025-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "O segundo filme desta impactante saga retoma a narrativa a partir dos personagens previamente apresentados — agora, desamparados da figura paterna. Esta, que outrora simbolizava proteção e segurança, já não está presente. Com sua ausência, o legado de ser o alicerce da família recai sobre a mãe, que até então assumia os papéis de tutora e provedora. Essa mulher, que já nos fora apresentada no primeiro longa, é aqui um verdadeiro espetáculo. Sem dúvida alguma, uma das personagens mais *badass* do cinema contemporâneo. Demonstrou uma força singular — e, mais do que isso, uma força que não nasce de seu físico, mas sim de sua alma e determinação. Im-pe-cá-vel. Uma personagem verdadeiramente extraordinária, com um arco bem delineado, marcada por defeitos e fragilidades que a tornam ainda mais humana e fascinante.\n\n   No que diz respeito à construção de personagens, todos estão incrivelmente bem trabalhados. Destaca-se, sobretudo, a atual protagonista que, apesar de eu ter falado tanto da mãe, é, na verdade, a filha.\n\n   A ambientação permanece intensa, e a tensão ainda funciona de forma admirável. O roteiro é habilidoso ao entrelaçar a trama principal com duas subtramas, mantendo o interesse do espectador em todas elas — sem jamais provocar a incômoda sensação de ter sido retirado de algo empolgante para algo secundário e irrelevante.\n\n   No entanto, é urgente destacar a primorosa composição de imagens e de som. Aquilo, sem exagero, é de outro mundo! A mescla das narrativas paralelas, feita com tanta maestria, é impossível de não se notar. Especialmente no clímax do filme, quando os dois filhos se revelam bravios, cada um em seu respectivo plano, enfrentando as criaturas de frente. Tudo em perfeita harmonia com a mixagem sonora. É impossível não notar a minuciosidade e o zelo empregados na lapidação do produto final.\n\n   Foi um deleite conhecer todos estes personagens — todos gigantescos, bem construídos, com histórias próprias e com seus inevitáveis “poréns”.\n\nAgora bora pro spin off",
    "date": "2025-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Scarier than the first, but stands up. Simmonds gives a stellar performance as Regan & I didn’t even recognise Murphy initially who does what he does so well. Blunt is Blunt and gives as much as she gets from the part, the script & the cast. Kudos to Jupe as well especially as he argues with his sister about what she wants to do and his actions, both their actions at the end. Sometimes sequels lays eggs, this is one sequel you can’t miss.",
    "date": "2025-05-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas de terror são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom.",
    "date": "2025-05-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Damn. I thought the first one was bad, but this is on whole another level...",
    "date": "2025-05-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Emily Blunt is stellar in sci-fi horrors, really showcases her specific talent of seriousness, vulnerability, strength. The story of this movie does not disappoint either, a fun adventure this time instead of being stuck in the house.",
    "date": "2025-03-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely 💯 💯 💯 💯 💯 💯  brilliant. We want more please 🙏.....not only 🙏  that it could 🙏  actually  happen 🙏?",
    "date": "2025-03-04"
  }
]