[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What have I actually just watched! Unbelievable how a mother could do that to their own child as well as other peoples. I don’t feel that Kendra had anywhere near any type of explanation at all. Great watch but very sad and shocking.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Felt like there’s information being left out to make Kendra more sympathetic",
    "date": "2025-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "As someone studying cyber security, I found this documentary quite interesting yet disturbing. It's crazy how social engineering has evolved into such a hard case to crack.",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Scary - there are obviously too many nutcases without medical help roaming the planet. The culpable stalker will surprise you. In the end I'm simply glad that none of the victims commited acts of self-violence or even suicide.",
    "date": "2025-10-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Shocking and eye-opening in so many respects, with the candidness of those that participated in this documentary perhaps being part of that. Food for thought for psychologists and more.",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This was a well done documentary about a really cringe story. When they did the reveal near the end of the doc I was absolutely shocked. It was just a sad, sad story, and with a documentary like this I kind of wonder if this was good for anyone involved. I mean it kind of seems like these families need to heal from this ordeal.",
    "date": "2025-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Unknown Number is an intriguing true-crime story with a shocking resolution—my jaw was on the floor by the end, and I was left simmering with frustrated disbelief long after the credits rolled. The documentary is executed with impressive precision, and it’s remarkable how much participation the filmmakers secured, including both the victims and the perpetrator. By presenting all sides of the story, it delivers a gripping, fully rounded account that’s as unsettling as it is fascinating.",
    "date": "2025-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Just-terrible. Spoiler here-the “loving”, “concerned” mom-is the actual perpetrator? She sent messages to her own daughter telling her to kill herself? She sent disgusting messages to her daughter and boyfriend. And-she is portrayed as someone who had “past trauma\n-as if that somehow excuses her reprehensible behaviour? No-sorry-this one doesn’t fly for me. I feel like I just spent all this time allowing a sociopath to explain herself (deceptively). This one should never have been aired.",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I was not bored and for that it gets one star. Otherwise, Netflix completely drops the ball on this one by making the heinous perp out to be a sympathetic character, and their terrifying manipulations in the interviews as some kind of reasonable explanation. At least that's how I read it. Ugh.",
    "date": "2025-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "If you haven't already been exposed to spoilers - watch this documentary. Wow. Just.... wow! I did not see that coming.",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "THE TWIST. Sickening and she has no remorse for it and tried to downplay it. Can’t believe she has no consequences other than jail for it cause her main victim forgave her. How can she live knowing she made her daughter and several other KIDS suicidal and told her own child to off herself.",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I wish I would not have poisoned my mind with this.  I can’t believe that the vile mom was treat sympathetically by the person who interviewed her and the edit team included her ‘tragic victim back story’ excuse for emotionally abusing her daughter and the other children.   There is no justification for any adult to behave this way.",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I am SO confused by this documentary. You literally told your daughter to kill herself, you told her the world would be better off without her. You sent graphic disgusting texts to children……and yet she gets away with it and is able to say oh we all do things we shouldn’t everyone’s done something illegal….wtf?! She is such a vile, disgusting woman and I don’t know why she gets any screen time for being abusive.",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very intriguing story, kept me thoroughly entertained. I hated that the mother seemed to get off so easily and that people were mad at Lauryn, the actual victim in the story. Too many unanswered questions.",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Not interesting enough to warrant such a lengthy docuseries.",
    "date": "2025-09-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Extremely and unnecessarily long.   This documentary could easily have been 5 minutes.",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The documentary crew chose to tell this story like a thriller with twists and turns rather than what it is - a disgusting act of child abuse. \n\nA mother cyberbullies her own daughter (and her daughter's boyfriend, among other CHILDREN) for over a year to the point of mental breakdown and suicidal ideation. But rather than paint her with her true colors, the documentary crew decided to interview her as if she were just a passenger along for the ride, instead of the perpetrator. The mother messaged incredibly vile, and sometimes NC-17 messages, to CHILDREN and yet she was given the benefit of the doubt and never pressed for a reason or what was going through her clearly sociopathic mind. The attitude read like, \"no big deal, it's in the past.\" Why they decided it was in good taste to give this monster a platform is beyond me. \n\nIrresponsible reporting at its finest. Would recommend steering clear of this one and reading more accurate, unbiased articles online. Shame on you, Netflix.",
    "date": "2025-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This documentary is a ride and a half plus some. Unfortunately, with the popularity of this movie, I had the big reveal spoiled for me before I ever watched it. Maybe that soured my view of it as I watched. However, the details behind everything, and the perspective of the antagonist is pretty intriguing. Although, the creative direction and showcasing of the story this film is describing is not handled very responsibly, and doesn't leave you with as unsettling of a feeling for the criminal as I feel like it should given the circumstances.",
    "date": "2025-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Netflix’s Unknown Number was shameful. It downplayed child abuse, centered the abuser, and silenced victims. Emotional abuse IS abuse.",
    "date": "2025-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "80%. 9/2/25. Knew who it was so took out some of the juice of the revelation. Super weird that the mom is interviewed early in the doc knowing it was her. Crazy in her defense she said a lot of people commit crimes and do things like drink and drive, she just got caught. Nuts comparison. Really weird too with the cop footage of them confronting the mom and the dad is most worked up about her lying about her job and not tormenting their daughter and telling her to kill herself. Seemed like the Mom was jealous the girl was prettier than her, was weirdly into her bf, and wanted her to need her. Such a strange story. 3/5 rewatch",
    "date": "2025-09-14"
  }
]