[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It was nice and providing great information. The only problem was the repetitiveness. It could have been shorter. Also, I am wondering if the families of people who died wanted to comment on days before the journey (or if the documentary crew thought about this)",
    "date": "2025-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Well documented and well showcasing how blinding arrogance and idealism can be. Would have appreciated just a tad more coverage on the final tragic day.",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "With first-hand accounts, an accurate dissection of a tragedy is made; a tragedy in which the main ingredients were arrogance and negligence. 109 minutes that are well worth the risk.",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "People leaving negative reviews wanted morbidity to be at way higher level and focus on the implosion and the whole tragedy and this documentary is not showing that because WE ALL seen it already.",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "One of the best, if quite devastating documentaries. Truly showed the issue of people with deep pockets doing whatever they want with no regard.",
    "date": "2025-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "engrossing, and a genuinely sad story. most CEOs downfalls are resulted from blind ambition, and this documentary is a tale as old as time.",
    "date": "2025-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "76%. 6/22/25. Really paints the CEO in a terrible light. He ignored so many  of his employees' reservations and just kept pressing on. Sad story.",
    "date": "2025-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "An in-depth (pardon the pun) look into the insane events leading up to the titan disaster. A mission that was doomed to fail from the start. The final few minutes are chilling. Worth watching at least once.",
    "date": "2025-06-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The story behind the Titan sub disaster is tragic and definitely worth telling, but this doc drags more than it should. It’s competently made and covers the basics; Stockton Rush’s ego, ignored safety warnings, and how preventable the whole thing was, but it just doesn’t stay engaging the whole time. I felt like I got the point about 45 minutes in, and then it kept going.\n\nThat said, I really feel for the families. The doc does make you sit with the human cost, which matters. I just wish it had been tighter and less repetitive. It’s solid background if you don’t know much about the incident, but not something I’d rewatch or strongly recommend.",
    "date": "2025-06-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This disaster documentary was great. The entire crew did a great job on telling this story about the OceanGate disaster that killed five people in a submersible that was created to see the Titanic underwater. It's a story about a man obsessed with fame and ignoring anything that could jeopardize it. If you haven't seen this documentary yet, check it out sometime. It's worth watching.",
    "date": "2025-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It skips the most important part, the actual implosion, what happened that day? No footage at all from the day of the incident. The company didn't record anything from the last dive? that is impossible. How were the people on the surface experienced the implosion, how did the passengers arrived in the ship, interviews with them, how they entered the titan? etc.. there should be tons of material available but we didn't see any of it.",
    "date": "2025-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I'm not sure how Stockton ever got that popping sound out of his head because I for darn sure cannot.",
    "date": "2025-06-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Fascinating tale of tragedy due to one man's narcissistic dream of manning a deep-sea vessel designed to travel 4,000 feet to the ocean floor to see the Titanic wreck!  Despite the warnings of engineering experts, he plowed ahead with his doomed plan killing himself and 4 others trying to achieve this goal.",
    "date": "2025-06-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A very illuminating watch, which goes back a long way before the events of 2023. The dreadful arrogance that led to the tragedy could inspire a Hollywood disaster movie, but this documentary approach is better and more respectful to the victims. The silencing of naysayers and whistleblowers over several years is both shocking and numbing but brings a kind of explanation to it all.",
    "date": "2025-06-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "\"Here's a list of safety concerns based on data during the dives\" - \"you're fired\"",
    "date": "2025-06-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Very surprised to see negative response to this work. its detailed, informative and a pretty emotional watch. It's a documentary about a tragedy. Not to be viewed as a blockbuster summer flick, but as an engaging history lesson. Really enjoyed the research, narrative, and tone of the doc. It is verry fitting to the tragedy it represents. Definitely Recommend!",
    "date": "2025-06-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Netflix should really stay out of the business of making documentaries. Every single doc the make follows the same lousy script: interview a few ppl (this is the core), throw in as much emotion as possible and drag it, jump all over the place and feed the audience pieces of facts delivered incoherently. Is this the new Gen Z way of making “documentaries”? I binged many youtube videos and other sources when this tragedy unfolded, this “doc” left out many interesting details, conversations and technicalities. It barely even covers the last dive and search operation. It really feels like a lazy presentation of this story all done by the interviewees and close to 0 created by the makers doing further research. I also just finished watching the Astroworld doc, which is just as poorly made.",
    "date": "2025-06-16"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Disappointing. \n\nI was genuinely excited to watch Titan — I remember exactly where I was when the story was unfolding in real time. But what a letdown. The documentary drags on with a long-winded buildup and barely scratches the surface of the most critical part: the implosion itself. No details on the last communications, how the surviving surface crew was reapinding when the vessel went missing, or how the wreckage was actually found. It skips over the most tragic, intense, and revealing moments. Why make a documentary like this and ignore the heart of the story? Sadly, this was a waste of time.",
    "date": "2025-06-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This tale of the inner workings of internationally infamous OceanGate evokes validation of the sentiments of the working class attitude towards “the 1%,” or “us vs. Them” working class hero vs. rich tyrant that was at a fever pitch before the 2016 election. While it sheds light on the mysteries of the event that captivated the world for about 5 days, it really is a compelling, cautionary tale stranger than fiction that shows the pitfalls of hubris, the comfort of generational wealth and the invisible hand of fate. \n\n“Aerospace engineer” Richard “Stockton” Rush. Seemingly buys his way through college and one day decides he wants to be the next James Cameron or Elon Musk and use his wealth and “engineering background” to philanthropically “open the ocean to humanity” with a for-profit tour company open only to those with means equal to his own. All the while showing the mindset of anyone with means and an ego to match. Narcissistic, manipulative, crooked and vindictive, Rush will let no one and nothing get in his way until he is literally crushed under the weight of his own hubris.",
    "date": "2025-06-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This movie was a cliche of a documentary and can be shown as an example how to take an extreamly interesting topic and make an extreamly dull documentary of it. It is chaotic, without any merit and forcing cheap emotion. There are way better videos online made by a single youtuber. The worst part there is not even really any good information what have happened? There are just bits and pieces that are not coherent. I think this topic deserve way way more.",
    "date": "2025-06-15"
  }
]