[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I don’t understand why this story has only received 80% rotten tomatoes. It is a critically important story for every family to watch. These families are incredibly brave to tell their stories. This also happened not far from where I live in Georgia. Huge blessings to these families as they navigate their new normal. Jacoba, you are awesome and so is the reporter! (I apologize for not remembering her name).",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This man is sick. Donald Cline is in The Quiverfull movement church primarily focuses on the marital relationship between one man and one woman and the blessing of children within that union. and there\nis no biblical or theological basis for a man to have children with multiple women!!! There's no biblical or theological basis within mainstream Christianity, or the Quiverfull movement itself, to justify a man having children with multiple women outside of marriage, and certainly not through deception or without consent.",
    "date": "2025-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Insane man, and unbelievable what happened. His 'donor' daughter is so courageous.",
    "date": "2024-02-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "THIS DOCUMENTARY WAS ABSOLUTELY CRAZY. WHAT THIS MAN DID WAS DISGUSTING. I'm GLAD THIS DOCUMENTARY WAS MADE, BECAUSE IT OPENS OUR MINDS AND SPREADS AWARENESS ABOUT THINGS LIKE THIS THAT HAPPEN. THIS DEFINITELY IS POSSIBLY STILL HAPPENING AROUND THE WORLD. AND It's SICKENING. THIS IS A MUST-WATCH DOCUMENTARY. DEFINITELY, ADD IT TO YOUR LIST OF THINGS TO WATCH.",
    "date": "2023-03-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Depressing. Quick way to feel sad in 1hr37m.",
    "date": "2022-12-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Increíble el relato de cada hermano.",
    "date": "2022-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Really interesting and well made",
    "date": "2022-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I feel weird calling this Awesome when it is such a challenging story and the topic is hard. I did feel the unfolding of the total story was a bit dragged out but I was captivated by the full details as they were revealed. It was worth watching.",
    "date": "2022-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It was an well-made documentary about a somewhat interesting topic that was occasionally heart-breaking. In the end, I don't think the story was as compelling as the filmmakers wanted it to be.",
    "date": "2022-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Riveting documentary about an unethical, disgustingly evil man who used his position to ruin the lives of 100’s of ppl.",
    "date": "2022-06-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very well put together. Impeccable. Nice editing throughout! The subject matter is so shocking and disturbing, it will incline you to fully quiver.",
    "date": "2022-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I did not enjoy this documentary. Somehow it does a poor job of making the doctor a bad guy. The people being interviewed a biased to the point where they lose credibility and this is terrible because it takes away from the evil that occurred.",
    "date": "2022-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A disturbing documentary about a doctors obsession with procreating. Another example of religious beliefs being used distructively.",
    "date": "2022-05-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The fact that this movie has only 67% audience score tells us about the america we live in. Read and weep, I guess. \n\nAbsolutely, a great documentary!!!",
    "date": "2022-05-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Definitely must see in order to know how far male entitlement can go.",
    "date": "2022-05-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Poorly made documentary, with little investigation and vague explanations and nothing deep",
    "date": "2022-05-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wild gut wrenching story. Definitely recommend.",
    "date": "2022-05-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "i do feel the same as a few other reviewers in that they tried to make this documentary more of an actual horror film of sorts - which, sometimes added to the eeriness, but overall i think took away from the reality of what was being said. i also felt like it was very repetitive for the most part; could've been shortened by a pretty substantial amount of time, but i understand the want for creating drama. it's an incredibly disturbing thought to think something like this happened and it sounds like still continues to happen in some areas. makes you really question the professionals you're supposed to be able to trust.",
    "date": "2022-05-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very moving and downright despicable.. the fact that the doctor isn't in jail for life is purely sickening. I went into watching this without really a clue about anything it was about, and in the age of cell phones and social media it was one of those times where \"i didn't pick up my phone once.\" You immediately feel for the siblings and families featured here and leaves you dumbfounded about the way our laws work. A must see for anyone who loves a compelling documentary.",
    "date": "2022-05-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A stunner. Will shock and satisfy.",
    "date": "2022-05-18"
  }
]