[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A very uneven mix of violence and comedy, but quirky.",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Cold Pursuit (2019) is a story about a father who wants revenge against a criminal who killed his son, but the humor that completely ruined the story fails to deliver anything innovative. Revenge was quite lost throughout the film, I believe the director didn't understand what he wanted to convey.",
    "date": "2025-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1 hour and 58 minutes!!!!!!!!!!!!!!!! Rated R for Sexual References, Drug Material. Some Language and Strong Violence!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $32,100,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Actually one of the worst movies I’ve ever seen. Enjoy every Liam Neeson movie so assumed it would be like the others. This movie is utterly garbage. Worst acting ever, terrible development of the base plot, and the director should never make a movie again in his life. Biggest waste of my time ever.",
    "date": "2025-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "If you are sensible and don't like dark humor, is definitely not for you.\nI never have laugh so much with a movie before.",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "For the type of movie it is, it’s actually really well-made.  The characters are well-delveloped, the scenery and shots are great, and the plot is just complex enough.  Acting is surprisingly good, with the little kid’s character being pretty unique.  .",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Brilliantly bonkers in the best, most addled way. Excels at inappropriate laughs and whacky tangents - but the real strength of this film is in its pure adrenaline and substance fueled verve. A fever dream of violent goofiness.",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Pretty good Liam Neeson thriller",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "a very morbid movie at the start, however it moves into a comedy with a built in kill count. The ending is very funny.",
    "date": "2025-05-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "this is a phile you bingos",
    "date": "2025-02-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Needed more Gurty and Truck Truck Truck. Son gave an Art-filled death performance. \n\nLiam ambling his ass off.",
    "date": "2025-02-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "If you're after entertainment in your movie watching Cold Pursuit fills the bill. Best Neeson movie since Taken.",
    "date": "2024-12-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Best things about Cold Pursiut: Cast\nStarting with Emmy Rossum which since Shameless really has't been in anything decent.  It's kind of sad because she totally was the whole anchor for that TV show which is still one of the best tv shows i think ever.  So nice to see her still getting roles. Though I find the directing here a big stiff, and while there is so much I like about this film, including the location, as I live in that area of north America where it was shot, and I have to say, it's nice to see the area portrayed, especially in winter.  But sadly despite wanting it to be great because of that alone, i found it totally lacking something often.  A feeling of orginality on some levels, and then on others it feels totally fine.  There is so much potential in that everything seems to be done professionally, from the cinematography, to the cast, it feels like an expensive shot movie, though I bet it didn't cost as much as it appears on screen.  But the main issue is the dialogue at times feels totally flat, and while there is defintely moments of humor, i can't help but feel in the hands of a better director the scenes would have come across so much more natural.  LIke the scene where gets tired punching the guy, and they have a laugh, that entire scene feels forced. But yet the blueprint for a great scene is in there, it just didn't land, perhaps to a large degree because of timing maybe?  We know Emmy Rossum has the chops to pull of comedy, she did it brilliantly for countless seasons on Shameless.\nAnyway, it's not horrible, and there are definitely some nice looking frames of cinematography in this movie, that almost make it worth watch for that alone. But then there are so many moments where nothing is happening, and perhaps because it is different enough in some areas from the cookie cutter action stuff now that it makes it worth a watch on a lazy afternoon...",
    "date": "2024-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Looking at \"Cold Pursuit\" it is easy to have this fall into the vast sea of Liam Neeson action flicks. Enough so, that when I saw the cover of this, I legitimately had to double check that I didn't already watch this one. Although the cover and description doesn't separate it from his other films, the characters and execution do. You can solidly categorize this film as one of Nesson's \"good ones\".\n\nThe story seems like your basic revenge flick that has been done to death. But this time, Neeson does not have a particular set of skills. He is just some guy. He's a simple snowplow driver. And this aspect is shown in the movie. He doesn't know what he's doing. He's not an idiot, but he is clearly out of his element. They also don't shy away from his age, he does get winded, he feels vulnerable and human. This makes his action scenes more brutal and suspenseful. And, as per usual, Liam does a good job acting in the movie. It is a typical role for him, but there's a reason he is cast in these roles, he is very good at it.\n\nThis movie has a unique style to it. It is set up like an action flick but is edited almost like a dark comedy. There is a scene where two bad guys get into a snowball fight while they are staking out a location. It reminds me of an Eastwood film where minor characters will be given a lot of extra detail to really make them shine. This is a movie where there are no small parts, everyone from the main villain to the receptionist at the hotel, all are entertaining.\n\nI won't give away the different twists, turns and jokes that the film does, but suffice it to say, this is not your typical Liam Neeson stuff. This is a cut above the rest.",
    "date": "2024-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Where to begin.\n\nWhen the main characters are incidentals; a child and a psychopatheic Asian wife steal the show, you have issues in the script, the cinematography and well, everything else.\n\nIf you thought Darkness was an inconsistent mess, remember that it was two different messes. This shiteshow is a singular dung heap.\n\nIt's not funny. It's not a thriller. It showcases what a meme its lead actor is.\n\nSeriously, how the hell does something like this get funded?",
    "date": "2024-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A great strong story, a few loose ends , very well made.",
    "date": "2024-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Possibly the worst action film I have ever watched and couldn't wait for it to end. Stupid storyline and one dimensional characters you couldn't care less about, slow and so boring save your time and watch something else or just go for a walk",
    "date": "2024-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great dark comedy.  The timing was spot on.  This was not supposed to be Taken, the remake.",
    "date": "2024-06-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Decent waste of time.  Does't take itself to seriously is a plus.",
    "date": "2024-04-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Not a bad action flick with ole ambling Liam, but I have to give it a 1star review so a 5 star podcast can review it.",
    "date": "2024-03-10"
  }
]