[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Horrible movie nothing like the original. By the way NO WHITE WAYER RAFTING WAS CONDUCTED DURING THIS MOVIE",
    "date": "2025-06-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "If I could give it ZERO STARS I WOULD!!!!\n\nI thought the original was bad from a whitewater standpoint, but this one was infinitely worse. Did they even bother to frame their shots or look at the background. Roads are seen in multiple places. Kayak skirts magically appear in the middle of rapids. Drops happen out of sequence. But the story was even more unbelievable.  And the acting was…. Well at least there were the BAD whitewater scenes.",
    "date": "2025-05-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This is a ridiculous story.",
    "date": "2025-01-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Someone owes me 2 hours of my life back. Before we sat down to watch this movie, I guessed that it was going to be a bunch of people making horrible decisions. It was that compounded. This movie is terrible. Not only is the writing bad, there's just lacksadaisical shortfalls in the main parts of the scene of the most important scenes. The majority of the movie is centered around terrible or no decisions. We had to sit down and watch this movie in two parts and for each part I was standing and yelling. It's probably the worst movie I've seen all year. If I could give it zero Stars I would. The acting was a two at best but the movie itself was atrocious. That may be being generous. We should have watched The Minions. Mind you we have no children. If there's one thing I could leave you with, itis \"don't watch this movie\".",
    "date": "2024-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I will start off with the positives. For a \"remake\" the film does try to do its own thing, despite having a similar setting the characters and motivation are different. The camera work for most of the shots is also pretty good. Now that the positives are out of the way, let's get into it.\n\nThis movie feels like a studio realized that the rights they had to film was about to expire and they wanted to squeeze out something from it to make some money. So, they dusted off an old script that happened to take place on a river raft, kept the budget as low as possible and slap the recognizable title on it.\n\nThe movie takes its sweet time getting started. The main conflict of the story doesn't show signs of starting until about the 30-minute mark. For an hour and a half movie, that's 1/3 of the movie where nothing is happening but exposition.\n\nThese characters are the very example of what people talk about for stupid characters in a horror film. They're the kind of characters that make idiotic decisions that no one in real life would make, but they do it so the movie can happen. It makes you want to just pick up the screen and shake the characters, telling them \"No, don't do that!\"\n\nI guess one other benefit is that the movie is short. I will take its lead and keep this review short as well.",
    "date": "2024-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie has awful writing. Full of cliches and ultimately baffling decisions made by the characters multiple times. Had me yelling in frustration. Absolutely terrible. No clue how this made it through production. I want my time back. Netflix should reimburse me for having to see this genuinely terrible movie.",
    "date": "2024-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Acting was good, but the story was lacking. I mean the \"bad guy\" went from friend to foe to complete psychopath in one day? And the fight scene the girl just like dipped on him and then after her friend was shot she comes running back.. it had potential but ultimately failed in my eyes.",
    "date": "2024-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I thought it was a very good movie, well acted and beautifully filmed. Great music by Tristan Clopet.",
    "date": "2024-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Considering this is the age of the pointless remake because this generation of hollywood has precious little to say, I have to say this is a pretty good movie. Meester is a good actress, Brody is good in everything. It's well shot and paced reasonably tense moments. There are plenty holes in the script and incredibly odd decisions by characters but its solid. Doesn't touch Kevin Bacon's original, now that's a movie.",
    "date": "2024-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Half a\nStar for keeping the movie short and another half\nStar for lovely scenery. Didn’t like any of the characters. Lot of dumb scenes. At the end didn’t care if anyone survived or not.",
    "date": "2024-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The plot is a familiar one, while competently executed, nothing much grabs attention early on and nothing much stands out later on.",
    "date": "2024-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Just watch The River Wild with Kevin Bacon ..,\n\nIt’s concerning that nobody can come up with an original idea anymore or if they do a remake they can’t do that right either.\n\nCinema is done for",
    "date": "2024-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Another example of remaking a good movie due to lack of ideas and piggybacking on someone else's work.  Per usual a significant downgrade.  When will this stop?",
    "date": "2024-05-04"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It's okay besides one moment that just made me hate this movie. When girls are getting themself untied, 2 dudes are fighting. When girls get out, instead of helping another guy and get the gun away they just ran away and guy get shot. Absolutely idiotic move. Ruined the entire movie",
    "date": "2024-02-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "After seeing this movie and seeing a 77% tomato score, I'm never never consulting this site ever again. It's been off a lot lately but this one takes the cake.... such an intensly bad remake",
    "date": "2024-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie was awful! It was just death followed by more death. I would give it 0 stars if I could",
    "date": "2024-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This remake still came with thrilling suspense.",
    "date": "2023-12-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "One of the worst movies I've seen in my life.",
    "date": "2023-12-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Neeeaaahh it was alright.",
    "date": "2023-12-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A thin plot was covered well by a lot of intense action.  The acting must have been difficult in such cold water.",
    "date": "2023-11-21"
  }
]