[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "J’ai toujours été fasciné par les shows aériens. La précision, la concentration, la confiance de ces pilotes envers leurs coéquipiers, le talent, toutes ces qualités qui permettent de construire ces shows à couper le souffle. Ce documentaire permet de découvrir l’envers du décor et l’engagement nécessaire pour faire partie de cette élite. Très intéressant.",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Incredible documentary on the 2023 USAF Thunderbird class",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I agree with some other reviewers... It had a lot of potential however the narration and dialogue was not the best. The camera work was superb however I wasn't as engaged as The Blue Angel's documentary on Prime Video. As a documentary it was directed and put together better.",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This Air Force documentary was great. The entire crew did an excellent job on making this documentary about a group of combat pilots who are committed to putting on an air show for people that they'll love. It was very interesting to see what these pilots do and how hard it is to achieve. If you haven't seen this documentary yet, check it out sometime. It's worth watching.",
    "date": "2025-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "As a former Naval Aviator I was looking forward to watching this documentary. The aerial footage was nothing special, there was too much emphasis on crashing and it did a disservice to one of its members by focusing on his inability to perform one maneuver. The background stories were interesting and the decision to include the parents of a deceased (crashed) team member was respectful but just added to the angst being created by all the talk about crashing. The Air Force is always a day late and a dollar short when they try to compete with something the Navy produces pertaining to aviation. You would be better entertained by watching The Blue Angels (2024).",
    "date": "2025-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved every minute of this documentary!! So proud of every single one of these brave, brilliant American pilots!",
    "date": "2025-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "\"Air Force Elite: Thunderbirds\" is a documentary that initially seemed to hold a lot of potential and appeared poised for success.\n\nHowever, as I watched, I found myself quite disengaged. The narrative and documentary approach didn’t resonate with me. I struggled to grasp many of the Director's choices, as the direction felt disjointed rather than focused.\n\nThe storyline took unexpected turns that I wasn't prepared for. While it's commendable to see historical events depicted in a documentary format, it's essential to have a strong narrator and a captivating storyline, along with engaging visuals, to truly captivate the audience. Simply attaching a well-known name isn't enough to guarantee appeal. Although that was initially what drew me in, the overall presentation came across as quite dull and uninspired.",
    "date": "2025-05-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Style over content.",
    "date": "2025-05-26"
  }
]