[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I do not understand how people think this is a good heartwarming movie. The editing looks like it was done in a moving car, and there were no rewards for watching this sad movie with cliches that don’t even lead to anything good.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Thought I was in for a good baseball movie with one of the guys from The Sandlot in it, but now I’m terrified of tumours.",
    "date": "2025-02-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Couldn’t finish it, so many cliches and predictable plot lines. I had to walk away from it.",
    "date": "2025-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Like Bad News Bears with another lovable team of Little Leaguers - but grab a tissue. Had me in tears at the end. Highly recommend watching along with your little leaguers",
    "date": "2025-02-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Loved it! The best part about this movie was that it all really happened.",
    "date": "2025-01-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I wanted to believe, but found myself questioning- did I watch a different movie than the other audience reviews? I wanted to like this movie, however the editing was jarring, the cinematography was stylistically odd, and the baseball moments rushed. These elements would have been forgivable if the filmmaker had a clear vision of what he wanted this movie to be. Unfortunately, much like the ham-fisted dramatic vomit scenes, the themes were all over the place- so much so that none of it hit home. Even the title betrayed how the movie played out. You gotta give us a reason to believe.",
    "date": "2025-01-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "As a movie, it’s ok and follows the story line of many similar movies. If you know the actual story, there’s just too much that doesn’t seem accurate. I highly doubt the team wasn’t how it was portrayed, with kids who couldn’t hit or catch in the beginning. I remember watching them play in 2002, it was made up of talented baseball players and that’s why they were so successful at the LLWS. Walker Kelly was also left handed and not at all like the goofy uncoordinated kid in the movie. He was a great pitcher, who I believe went on to play in college.",
    "date": "2025-01-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Horribly depressing despite an inspirational story.",
    "date": "2025-01-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The videographer made me want to kms with the baseball scenes. Some of the worst I’ve ever seeen.",
    "date": "2025-01-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie with appropriate time period dialogue in Fort Worth, TX. I appreciate the movie was different from the typical sports movies.",
    "date": "2025-01-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The bunt heard around the world will always beat this movie out. I know it's based on a true story but still. They made it about cancer and phased out A LOT of baseball!",
    "date": "2025-01-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "If I wanted a real life ending, I wouldn't have turned on the tv",
    "date": "2025-01-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A great story with all of the tear jerker elements - baseball, perseverance,  grit, fight, and overcoming the odds. The problem is they just fell short of bringing it all together. The movie struggles to bring the depth needed to the characters to make us feel connected and really cheer them on.",
    "date": "2024-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Little league team dedicates their season to a dad (Luke Wilson) that has terminal cancer. Good to still have A list actors take part in family, hope-filled films.",
    "date": "2024-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I can see it wasn't a well made movie, but it was still enjoyable anyway.",
    "date": "2024-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Ashley Emerson was amazing!! A star in the making ⭐️",
    "date": "2024-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "We saw movie with 11 year old baseball team was not expecting a tear jerker. All the parents were crying in this movie.",
    "date": "2024-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Such a good movie!  A kind and gentle movie the whole family will love!",
    "date": "2024-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "True story of a Ft. Worth, Texas little league team, who was awful, but when one of the coaches and player’s father got cancer, the team rallied, eventually going to the Little League World Series (2002) and won runner-up. Lots of emotion, cheers, and competition to keep you watching and wondering.",
    "date": "2024-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Good movie but save your money & see it at home.",
    "date": "2024-09-26"
  }
]