[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The movie was a very exciting adventure from start to finish",
    "date": "2024-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Perfect prediction of Ai",
    "date": "2024-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Mindblowing movie 🍿scared a little bit from AI",
    "date": "2024-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It’s terrifying to see A.I like this. Imagine if its happens in reallife. The movie team really did a great job!",
    "date": "2024-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "It's actually an old, old question... Robopocolypse...Real threat or imagined? Robot Innovation...Good or bad?  Is Man vs machine a real scenario in our future?  My view is...Not really...Because robots are even more vulnerable to environmental breakdown than we are...So robots won't take over at any point in the future...The NEAR future anyway...I mean...who knows?  And this movie does investigate this possible with frightening vivedness and clarity...and frightening credibility.  It's definitely something to think about ...And this documentary presents the problem as frighteningly and as realistically as anything I've seen actually.\n\nOverall: Thumbs up. 👍",
    "date": "2024-04-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very thought provoking.  I can think of many many ways A.I. technology can eliminate ones need for war.  Like looking through a cone.  The tiny visible point is exactly the opposite of the big picture.  Flip the cone.",
    "date": "2023-12-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Interesting glimpse into the potential future of warfare where developing AI replaces humans on land, sea and air.  Skynet 1.0.  ;)",
    "date": "2023-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It is very well produced and brings the right awareness, in my opinion. The only reason why rating it low is because I work in the space of AI in IT, and I know most of what's presented there already, so it was a bit boring to me.",
    "date": "2023-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I think it is quite advanced for someone who is not working in a related area. However, if you are someone working in a related area, then it is quite futuristic and possibly incorrect in a lot of aspects. Still though people should talk more about ethical issue behind this new and possibly very dangerous technology.",
    "date": "2023-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The 'Unknown' series on Netflix continues with 'Unknown: Killer Robots'.\n\nSYNOPSIS: 'A look at artificial intelligence in military applications, following military-funded scientists racing to build this technology and ethicists scrambling to awaken the world to its apocalyptic potential.'\n\nAI is in the news every day now. It's everywhere in modern day life, and can seemingly do anything and everything. \n\nIf you weren't scared about AI before you probably will be after watching this documentary.\n\nHow far AI can go seems limitless, nothing appears unimaginable, which is precisely why it is so frightening.\n\nFascinating and unnerving.\n\n7/10",
    "date": "2023-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "oddly bland for the topic of discussion.  There was the one woman speaking out about why maybe we ought not do this so fast, and everyone else is like 'this will be cool when we can kill a bunch of people real quick.'  Yeah, it is dual-use, until we are not longer the user.  This whole topic scares the c**p out of me way worse than whatever next gen ebola they cook up in a lab.",
    "date": "2023-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Solid documentary on an important topic.",
    "date": "2023-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "How so very disappointing. What I learned is that these \"Robots\" are about as smart as an RC car. ONLY difference is that the people with the controller were taught to use bigger words that mean nothing. I am not sure if \"Intelligence\" is the correct word for \"AI\". Appears that AI is just the same dog and pony show as everything else in America. Nothing really here to see. All just a lie and manipulation of words. All in all, just basically drones and rc cars with cameras. Whoo hoo we've come a long way huh?",
    "date": "2023-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Next race is here stumbling struggling to walk on surfaces flying discreetly sensing the heat temperatures and using lethality to complete an assignment. Excellent visuals in drawing a clear picture of what's at stake in a world where more and more competitors joins the neverending race of achieving absolute supremacy. Interviews gave an opportunity to actually focus the issue on it's real roots. Documentaries such as this is needed more and more and plays a key role in reminding every human how fragile the balance of every element is. Great use of audio and visuals. A short educating documentary",
    "date": "2023-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "is not a film, is a documentary",
    "date": "2023-07-10"
  }
]