[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Inside The Mind of Cat is a captivating documentary ideal for cat lovers, offering insights into feline psychology, habits, and their bond with humans, though it only lightly touches on the actual workings of a cat’s mind. Visually engaging, it features adorable cat moments, playful animations, and cinematic techniques like slow motion, supported by fitting music to enhance the viewing experience. Expert commentary from various countries adds depth, while clear illustrations help explain the science, making it both informative and enjoyable for audiences of all ages.\n\nRead the full review here: (Indonesian version : alunauwie.com)",
    "date": "2025-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I found myself purring.  Since living abroad in two different countries and traveling alot - I have been living with a cat - and SO miss it. \n\nThis film makes me see just how much I LOVE cats, and how much love there is between feline and human friends.",
    "date": "2025-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "It's a good film that learns about cats! I love it!",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is my favorite movie of all time! Amazing documentary, and most importantly, stunning cats. I have watched it 7 times this year!",
    "date": "2025-04-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Ho hum … a documentary requires scientific evidence based educational  exchange … this had none. While there was some subjective information it appeared to be Just another group of semi/non professional\n“Cat”people  incapable of quantifying the virtues and””mysteries”..of their pets without making smug negative references to dogs… Unnecessary and essentially boring  Case in point “mysterious”and “independent”  (overused and unnecessary as their usage promotes the myth that cats are inscrutable and  of course much more discriminating in sharing themselves and therefore superior to dogs  apparent cretins that  will love anything that isn’t dead.. and of course that is what  the folks that put this waste of time together intended. no one bothered to mention that dogs’ readily apparent social responses to humans have  their origins  rooted in evolved pack behavior  .. No nothing that erudite or illuminating One vet commented on the fact that cats have amazing ( which they do” spatial references such that they always land on their feet.. and if you push a dog off a couch it will not have the same facility ( he was a cat vet)….hilaaaaarious video of someone pushing their  dog off a couch to prove the point. I\nThis was an unscientific representation of owners and alleged experts aka dog haters  who lacked objectivity and I would imagine any scientific education cooing and oozing over there charges while providing  little didactic educational material that didn’t demand a reference to dogs lol…lack of objectivity appears to be an ongoing thing with cat lovers \nTotally boring.. I learned as much about lions watching  The Lion King.. however i do know that if a cat falls off a couch it doesn’t always land in its feet… Hope I didn’t break any hearts lol and fyi I am a vet tech… I like both species and we need more documentaries which are actually educational and highlights attributes of both species without negative references to the other … because without that a presentation including this one lacks merit and cannot call itself a diocumentary",
    "date": "2025-03-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved this so much thank you everyone!! ❤️❤️❤️🙏🙏🙏😊😊😊👍👍👍🇰🇭🇰🇭🇰🇭🇺🇸",
    "date": "2023-12-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "\"Inside the Mind of a Cat\" (2022 release; 67 min) is a documentary that examines cat behavior and aims to explain how cats think. There are a number of talking heads that walk us through these issues, but the real stars of this documentary are of course the cats themselves. Along the way, we learn and appreciate a number of aspects about our furry friends.\n\nThis documentary is written and produced by Andy Mitchell, who has a long track record of documentaries with/about various animals. If you are, like me, a long time cat lover (I've had cats for well over 3 decades), this documentary is almost certainly going to please you and entertain you, even if you're really not learning anything revolutionary or new as such about cats. One of those \"revelations\" is that cats pick up on our feelings, and if you love them, they almost certainly will love you back. Really? I could've told you that 30 years ago!\n\n\"Inside the Mind of a Cat\" was recommended to me by Netflix based on my viewing habits. I really enjoyed this, certainly more so than \"The Secret Life of Pets\", which I also watched recently. If you are a cat lover, I'd readily suggest you check this out, and draw your own conclusion.",
    "date": "2023-02-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very cute and insightful. I enjoyed listening to what all the different experts had to contribute.",
    "date": "2023-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Brilliant and interesting documentary. I have 13 cats and it really helped me to consider things from a cat's perspective. It also helped me to understand that they have different personalities like people and that they need to be treated accordingly. The cat experts were amazing.",
    "date": "2022-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Great movie with many insights about cats.  If you're not someone who likes cats, it may not be for you.  But really interesting nonetheless.",
    "date": "2022-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Minha opinião: Eu tenho um gato chamado Miguel, e tentar compreender os gatos é um desafio grande, pois eles são muito diferentes dos cães. Assistindo a este documentário da Netflix me ajudou a exclarecer um pouco mais ou melhor a fimar suspeitas que eu já tinha. Um documentário que passa com especialistas de várias partes do mundo, EUA, Japão, europa. Tanto no Japão existem café de gatos e em quantidades enormes, onde quem não pode ou não estrutura para criar um #pet vão a estes cafés e interagem com eles. Aqui no Brasil pude ir na cidade de Sorocaba – SP. E passam também que é possível adestrar um gato. Foi legal em ver o documentário com feedbacks de vários especialistas que se não me engano na totalidade era mulheres. Será que elas tem uma interação maior que os homens?\nVale apena assistir? Sim para quem quer compreender melhor seus bichanos e quem curte pets.\nNota: 7",
    "date": "2022-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Documentary with little scientific work. Your script can be taken in 5 minutes by browsing the internet.",
    "date": "2022-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Decent - really wish people who make documentaries wouldn't refer to the idiocy of 'evolution' -  educated people highly reject the mathematical impossibility of evolution - could go on for days.    Back to piece - can't say this was really educational  - was interesting how much more timid cats are in Japan - cultural?  definitely.  The Istanbul situation was pretty cool.",
    "date": "2022-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great film for cat lovers.  Learned a few new things about cats and their mysterious ways.",
    "date": "2022-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Required watching for all cat lovers.",
    "date": "2022-08-19"
  }
]