[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Decent enough suspense/action flick if you're ok with some ridiculous plot points.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "What a terrible movie! Just watched this - story + plot are so rubbish that it beggars belief. What a waste of Liam Neeson and Julianne Moore.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It was entertaining to watch, but the ending was a bust.",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I thought it was excellent; edge-of-your-seat stuff!  A must see for Liam Neeson fans.",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A very silly all action thriller with Liam Neeson losing and slipping through the plot holes. It’s mildly entertaining and a whodunnit but nothing worry returning to. Saw it on DVD.",
    "date": "2025-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Improbable nonsense. Good for a laugh but little else.",
    "date": "2025-06-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Fun as hell, a must watch for fans of action flicks. 7.5/10",
    "date": "2025-06-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Successful action movie in 1 hour and 47 minutes. Rated PG-13 for Intense Sequences of Violence/Action, Drug References, Sensuality and Some Language!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Gripping, probably should not watch on a plane",
    "date": "2025-05-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "An absolutely excellent film to watch while sitting in front of the TV eating dinner.\n\nThe suspense and tension I felt literally had me sweating all over the first time I watched this, it still happens whenever I view even a short clip on YouTube actually.\n\nThe final twist is beautifully-written and I wish I could watch it for the first time all over again.",
    "date": "2025-02-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "3.5 stars; I'd say this was a little above the average Liam Neeson action movie, and that's not to demean Liam Neeson action movies. Yes, it has all the thrills, suspense, and tension you get from his films. What I liked about this film was that it threw in a good dose of mystery as well. Liam has found his niche and does a very good job at it (like John Wayne). He plays the superhero without being \"super.\" I like how he underplays the role until he rises to the occasion when all is on the line. In the end, he is always underappreciated.",
    "date": "2024-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Liam Neeson movies are my guilty pleasure,  This one's not bad, with a caveat or two: the motive for the villain is really dumb, and the movie never explains how the bad guy knows so much about Neeson's character.  I liked it anyway.",
    "date": "2024-12-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A good movie. Pretty suspenseful and not as cliche as I would have thought. A tad over the top at the end. But better than I expected.",
    "date": "2024-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I think this movie is exciting and you especially feel as if your in that very moment in the movie. Very exciting and always has you on the edge of your seat. Good acting from Liam Neeson and all the other actors. Highly recommend the movie.",
    "date": "2024-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Fairly entrataining. The twist on the perp was underwhelming and like the title, the Non-stop sadness from the failed potential that was the twist will haunt me",
    "date": "2024-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Interesting collection of passengers.",
    "date": "2024-09-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Can't believe I didn't know about this movie until today. It was a good movie with plenty of twists and turns. Kept you on the edge of your seat. I enjoyed it very much. Great acting and story. Give it a watch.",
    "date": "2024-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Now, we're all familiar with the whole Liam Neeson action thriller. This one just happens to take place on a plane. Why Juliaane Moore decided to accept this thankless role as a concerned passenger is beyond me. It's not terrible...its just not terribly good.",
    "date": "2024-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This film is prefect example of an impossible meeting possible. Giving your connection to the characters on an emotional level using the realism of airplane travel. All different people from different walks of life. You know not one person is the same so you can have more possibilities to shape their stories to make your own. Finally, the movie leaves you thinking this idea can happen in real life. But after watching this I would probably be more inclined to take the train.",
    "date": "2024-06-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very enjoyable movie. Liam Neeson delivers.",
    "date": "2024-03-02"
  }
]