[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I think the point of this was to show the difference between being pranced around as a pony to show off for political purposes vs being soldier but honestly if it isn't that, than I have no idea what the point of this really was. It never builds tension but never gets convuluted. It's focused but has no pint and meanders at the same time. Everything is pretty unremarkable about it. It covers PTSD, family issues, commitment to your country, being a hero vs being a solder, the love amongst your brothers in arms, but what it never does is make it all work together into something. It just feels like all the stuff like the movie deal, his Sgt that was killed, his sister, cheerleader relationship which wsa probably the best thing, and the rest of the stuff just happens and doesn't really have a point to anything. I can think of lots of other war movies from American Sniper to The Best Years of Our Lives that cover these same subjects in a cohesive manner with engaging fully developed characters aong the way. This really doesn't do either of those ever. Billy is your typical soldier dealing with typical things vets deal with. Everyone else is so forgettable save for Tucker and Martin who were good. (Maybe the cheerleader to) The flashbacks to Iraq felt like a seperate film also. I don't know nothing is broken but everything is so middle of the road the entire time with some nice shots here and there. Nothing terrible but I just don't get what the point of this was. Skip It. Just....It's there and something that exists. Wish it was more.",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I enjoyed the book, a smart funny look at a complex story that hates glorifying war but loves soldiers. The trailer for this film makes it look like exactly the kind of mindless patriotic military-worship the book openly mocks. Worse yet, the film is about nothing at all, sure to disappoint everybody. After watching this I listened to the audio book (free on the Libby app with my library card) and I recommend doing that very much. I can only recommend the movie to those building a case against Ang Lee as a good director. Joe Alwyn does a good enough job with the lead. Steve Martin delivers none of the malice his character shows in the book, but I blame the toothless script. Kristen Stewart could have done a great job with her role as described in the book, but the movie doesn’t give her much to work with. They shouldn’t have shown the battle scenes or the Shroom character at all, and having Vin Diesel phone it in just undercuts his role in the story.",
    "date": "2025-06-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Joe Alwyn was AMAZING",
    "date": "2024-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The movie was a very exciting adventure from start to finish",
    "date": "2024-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Nobly grasped whilst also towards the attempted immersion next to being thematically retained, with an empathetically appealing cast, Ang Lee's lesser form may seem dated by contributive sense in its jointed commentary being minimally focused irrationally. (B-)",
    "date": "2024-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A very  good film.   I don't understand why it has a low rating.   I'm a fan of Ang Lee and I think this is  one of his best films.   Joe Alwyns lead  performance is excellent.",
    "date": "2024-02-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Having read the book when it was first published, I am glad I got around to watching the movie. I see mostly critical reviews, but I enjoyed the movie a lot. The presentation of shallow citizens with no clue about combat probably angered many people, but I saw it as accurate and perceptive. It's not a feel good movie, unless you feel good about combat brotherhood, but it IS a good movie and I highly recommend it.",
    "date": "2023-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I don't know if this was glorifying the military or making a joke of it.  It's as if it glorified this particular type of story with no good reason for it to be glorified AND also made a joke of it that wasn't all that funny.",
    "date": "2023-06-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It wants to honor the troops but has absolutely no idea how to go about doing it.",
    "date": "2020-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I could not get through it despite having a great cast, talented director and a great trailer. That should tell you something.",
    "date": "2020-06-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I feel like Ang Lee was trying too hard on this one. It got kinda boring after a while, despite the flashbacks and etc.",
    "date": "2020-04-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Probably the worst movie I have ever seen. What a load of rubbish.",
    "date": "2020-01-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Becoming Ang Lee's signature. Make it pretty and do nothing else.",
    "date": "2019-10-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I wasn't really looking forward to this. I read the book, and the trailer was terrible, so I expected the worst. It ended up not being bad. I thought Garrett Hedlund was really good in this. It does a decent job of interspersing the present day stuff with the Iraq scenes. I lost interest a little toward the end where it felt like it got too speechy. Overall, it's not bad.",
    "date": "2019-06-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This ridiculous, pro-war and pro-American hegemony abroad propaganda piece, is clunky and disengenuous. All this flag waving amidst an invading US army ignores the obvious fact that we are invading sovereign lands based upon a lie perpetrated by the Bush administration. Wrapped in the flag, fireworks, pomp and circumstance, the ugly immoralities of war are transformed into a tear wrestling, heart warming bowl of camoflauged bile, masquerading as righteousness. HARD PASS.",
    "date": "2019-03-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Loses at least 2 stars for the bad framerate images.",
    "date": "2018-12-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Billy Lynn's Long Halftime Walk is a clean, colorful, and vibrant movie about the disconnect between war and the home front, fantasy and reality, but trips up in the execution. Its much-praised frame rate of 120 frames per second (twice the previous record) isn't really justified by the film's simplistic plot, and in some ways it looked like a film school project. Its stereotypical portrayal of soldiers undermines what it gets right about the relationship between soldiers and civilians. Overall, it's entertaining enough to watch but not something you'll come back to again and again.\n\nBilly Lynn's Long Halftime Walk is based on a novel of the same name by Ben Fountain, a 58-year-old writer from North Carolina. I haven't read the book, so I can't comment about it in relation to the film. While I was watching the movie, however, I couldn't shake the suspicion that this story wasn't written by either a former soldier or someone who served in the Iraq War. \"This is what a Hollywood screenwriter thinks soldiers sound like,\" I thought as I listened to the dialogue. Turns out my suspicions were correct, which explains why the soldiers were so painfully stereotypical. A writer often falls back on stereotypes or popular tropes when not informed by personal experience.\n\nThe film's portrayal of the disconnect between soldiers and civilians, however, is very insightful. It's hard to describe the oddity of being involved in something like the military, especially if you have been deployed in a war zone. Everyone has an opinion about it, even though they have no direct knowledge or experience. Even comments from someone who supports the troops and the war effort can seem awkward and embarrassing, and this film captures that beautifully.\n\nThroughout the film, civilians approach members of \"Bravo Squad\" to ask questions or make comments, and the encounters inevitably turn painful as it's revealed the civilians are clueless about the soldiers' motivations and experiences. It becomes clear the pageantry and praise for the soldiers is more about the civilians' own feelings than it is honoring the soldiers' bravery under fire.\n\nNorm Oglesby (Steve Martin) comes closest to an antagonist in Billy Lynn. Oglesby is the fictional owner of the Dallas Cowboys who agrees to finance a movie about Bravo Squad's experiences in Iraq. What he offers to option the movie, however, is much less than what the squad expected to receive. After a brief argument, Billy Lynn and SGT David Dime (Garrett Hedlund) turn down his offer.\n\nBilly then has to decide whether to leave with his sister and go AWOL, or return with his squad, who will inevitably be redeployed to Iraq. He decides to stay with his squad. Then, in a twist ending, it's implied he was shot and killed in Iraq, and the whole movie had been a fantasy in his dying mind of what it would be like to go home a hero (kinda shitty, actually).\n\nOverall, the technical aspects of Billy Lynn were not as much an asset as advertised. While filming at 120 frames per second offers finer quality and detail, and I appreciated the movie's bright, vibrant colors, it's difficult to justify its high frame rate. Only a handful of theaters on earth are capable of showing it at its highest quality. Apparently in order to film at this frame rate, the director couldn't afford to do multiple takes. Sacrificing \"getting a scene right\" in order to film at a frame rate higher than most theaters can even project doesn't make sense.\n\nIn one flashback, Billy Lynn (Joe Alwyn) and his sister, Kathryn (Kristen Stewart), catch up at home. The scene is shot in over-the-shoulder perspective. When Billy speaks, the camera focuses on him and blurs out Kathryn. When Kathryn speaks, the camera focuses on her and blurs out Billy. It goes back and forth for the whole dialog. Simplistic scenes like that, combined with settling for the first or second take, makes Billy Lynn look like a student film.\n\nDespite these deficiencies, Billy Lynn's Long Halftime Walk was visually impressive and featured decent performances by veteran actors Vin Diesel and Chris Tucker. Arturo Castro, who got his start in short films and plays SPC \"Mango\" Montoya, was a bright spot among an otherwise lackluster cast. Overall, Billy Lynn is worth seeing, but not on par with Iraq War films like Green Zone (2010) and American Sniper (2014).",
    "date": "2018-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Good story providing insight  into the Iraq War and the brave soldiers who have fought in it.  The acting was acceptable, in fact, very good at times, but  not always coordinated.  Not enough attention to the PTSD, which certainly has taken its toll on many of these brave veterans.  A movie worth watching, though not the best in its class.",
    "date": "2018-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This was a one of a kind movie as far as being shot in the up close personal perspective, the cinematography was great. I also really liked the ensemble cast, they were very believable. Hats of to Ang Lee for his pioneering of this unique film, salute to our troops.",
    "date": "2018-09-25"
  }
]