[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Still on a mission to find movies that I enjoy as much as I loved this one 🙄",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A paramedic (Anthony Mackie) dying of cancer realizes a new designer drug is able to send him thru time.\n\nBefore their new career as MCU directors, Benson and Moorhead created several low budget but critically regarded sci-fi films.  I viewed one and was underwhelmed.  However, I think at that time I was less forgiving of low budget films.  After their MCU work and this, I want to go back and revisit that film as well as see the others.\n\nThe crisis Mackie's character experiences is layered into the time-travel conceit.   Sadly, the time-travel isn't as tight as the best such movies portray.  But the emotional weight given to Mackie makes this an emotionally grounded and thought-provoking work.\n\nWiki says this film is in the same world as Resolution, The Endless, and Spring.",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "An intriguing premise with excellent and compelling visuals which ultimately fails to deliver. Mackie does the best he can with what he’s given and turns in a fairly good performance, but much of the writing is uneven and heavy-handed. The film can’t manage to balance its two protagonists - in my opinion, they ought to have focused on Steve’s story and relegated Dennis to a side character (which they basically do anyway apart from the fact that the main problem of the film has to do with Dennis’s miscast daughter). The pacing flags desperately in the latter half of the film, losing all urgency from what ought to be a dire situation. The comic moments, again delivered well by Mackie, just don’t land. Ultimately not worth the watch past the first 30 minutes.",
    "date": "2025-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Synchronic is about two paramedic friends who encounter the ups and downs of friendship while maintaining their job. In the course of work they discover disturbing patterns of foul play in murders across their city. But when a crime hits home it effects everybody involved and leads one man down a path of discovery and what it means to be a true friend.",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Extremely boring movie! I think Rotten Tomatoes is not trustworthy anymore. Bad actors, low budget movie, the plot is good but poorly executed. Don’t waste your time.",
    "date": "2025-06-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Film was truly awful.  One of the worst I've ever seen.  The writing was spectacularly bad, the acting was sub-par, and the special effects were laughable at times.  No idea why it is rated so highly, but the high ratings are undeserved.",
    "date": "2025-05-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Mackie and Dornan do their best with the material, but the story moves along with a repetitive lull with unlikable characters until the story starts off way past the midpoint of the film. The script needed a ton of reworking to get the story rolling much earlier and to write characters that you actually care about. The premise was interesting, and I can appreciate the low-budget aesthetic, but for goodness sake bring in a script doctor to turn it into a properly paced story that establishes the story early on before annoying us with cheaply done character building between two whiny unlikable guys.",
    "date": "2025-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "La trama es alocada y arranca bastante lento pero que puedo decir, me encantan este tipo de películas de ciencia ficción con algún momento emotivo. Si tengo que decir algo malo es que (no se porque realmente) el presupuesto no acompaño y se nota, salvo alguna escena se ve bastante barata, aunque así y todo igual vale la pena.",
    "date": "2025-02-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "O filme é uma viagem dentro de uma droga muito louca, numa viagem muito louca (deu até vontadinha de experimentar) de terror e ficção científica, sobre uma droga sintética que distorce a percepção de tempo da glândula pineal, fazendo o usuário a viajar no tempo, voltando ao passado aleatório naquele mesmo local (?!?!?!) cheio de furos, mas quem se importa, a tentativa de drama ficou simplória, e o tom cômico perde o tom, mas ainda sim diverte e entretém, gostei mais do que a qualidade entregue..",
    "date": "2025-02-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Emotional exercise in time bending. Expertly written and visually framed beautifully. Stand out performance by Mackie, but lack of confidence and/or experience by his supporting cast leads to unfortunate breaks in immersion from this highly imaginative reality.",
    "date": "2025-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very moving and a great buddy film",
    "date": "2024-12-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Contrived story that meanders and slows to an unclimactic conclusion of cheesy acting and a clique death. Please never waste your time on this joke of a movie.",
    "date": "2024-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great movie, with solid acting and original plot! I definitely recommend watching!",
    "date": "2024-02-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Mi aspettavo meglio...",
    "date": "2023-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Muy buena película, una cinta que me sorprendió mucho y la considero infravalorada. No esperaba mucho de esta cinta, la vi porque la trama parecía interesante pero no sentía que me iba a gustar tanto. Desde el primer momento te engancha debido a su alocada trama, y buscas respuestas desde la primera escena ya que no estas entendiendo que es lo que pasa. La ambientación de la ciudad me parece esplendida, todo muy oscuro y con un soundtrack genial que acompaña mucho a generar esta sensación extraña. La trama la considero bastante original, y todo lo visto, que si bien es complejo, se explica de una gran manera. Sin embargo, siento que podrían haber aprovechado mas toda la historia contada al punto de quizás hacer una serie, ya que a mi parecer cierra de manera muy abrupta y se podrían haber contado algunas cosas mas. Por otro lado, las actuaciones son brillantes, principalmente las de Jamie Dornan, Anthony Mackie y Ally Ioannides. En conclusión, una muy buena película de ciencia ficción, de las mejores de los últimos años a mi parecer, y eso que no escuche a mucha gente hablar de esta cinta, siento que se la debería valorar mas ya que cuenta una muy buena e interesante historia con una ambientación brillante. Muy recomendada.",
    "date": "2023-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A truly imaginative story. Very good acting. I would have liked a bit less obvious 1/3 of the film.",
    "date": "2023-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Trippy sci-fi style film. Dark. But a great watch if you are a fan of confusing and creative cinematography.",
    "date": "2023-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Mackie & Dornan deliver powerful performances but the audio is so strong in places that the dialogue is muffled and unclear. I had to turn on subtitles. The storyline is predictable and contrived. More character development was needed to feel empathy for major and minor roles. Dornan's character arc was too much of a leap in its creation and completely unfair to Dornan's brilliant acting ability. One of the first scenes he wants to sleep around whereas the end he's begging his wife to talk to him. Nothing much inbetween, leaving the audience indifferent to what happens to him. The only thing that saves this movie are Dornan and Mackie's incredible acting. Too bad the storyline couldn't support them.",
    "date": "2023-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Really enjoyed this movie. Good characters and well written story. Good Sci-Fi. Enjoyable to watch.",
    "date": "2023-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A good fiction film that captures your attention with its curious premise of time travel caused by an experimental drug.",
    "date": "2023-09-10"
  }
]