[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Glenn Powell seems to shine in these roles. A well paced and eventfull movie with acceptable performances from its cast. A good watch.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The ending is unpredictable - and very stupid.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "“Hit Man” is a sharp, stylish, and surprisingly funny ride. The movie blends action, comedy, and a bit of romance in a way that actually works, and Glen Powell carries the whole thing with a ton of charisma. The plot is clever without trying too hard, and the pacing keeps things moving without dragging. It’s not a perfect film—some moments feel a little over-the-top—but overall it’s entertaining, smart, and way more fun than I expected. Definitely worth watching.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The story might have been a little predictable, but this was still a wildly entertaining movie to watch. Glen Powell gave an amazing performance, showing multiple personas throughout the entire movie. I definitely recommend it for comedy and drama fans!",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved this hitman. Not the video game version",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A well-executed comedy that gets mileage from hilarious montages.",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is literally the worst movie I have ever seen. The messaging is terrible and lame. The romance was stupid. The dialogue between characters was cringe. Super boring, not funny or worth any amount of praise. They definitely paid for people to give this movie good reviews because this movie is trash.",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Twisting turning thriller that asks some deeper questions about what “self” really means. Worth a watch",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A fun 120 minute romp through a tight plot with decent dramedy performances.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Really funny and entertaining",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I really really did NOT enjoy this film.",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Powell shines as a costume wearing moon-lighting hit man fake that has a day job of being a professor. One of his almost arrests becomes a love interest - and when she gets in hot water, the scheme to go down together.",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is the first time I’ve been mislead by a 🍅 score. This is truly the worst movie I’ve ever seen,.. it was embarrassingly bad.",
    "date": "2025-10-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I was expecting better based on the reviews here.  Meh",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The most Netflix movie ever! Audition tape for the main character in a bunch of costume changes. Female lead was not provided with any characteristics. Can’t believe Linklater did this.",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I worked in the locations department for this one, see if you can spot my cameo! WHAT AN AMAZING CAST AND CREW TO WORK WITH. LEGENDARY",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Slow Moving. BORING Dialogue. Wanted to like it but couldn't get through it.",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Very slow film, going undercover to arrest people hiring what they think is a hitman. Incase that's too much for the viewer to take in all at once, the same thing happens over and over again relentlessly until about 40 mins left which was also the time I gave up and left!! the tv to switch itself off with the motion sensor!!! Lots of questions get asked, lots of creepy smiles and a man gets angry in the street. Half star is incase the ends good but I doubt it. 1 star for just a random 10 minute segment of the film",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I made this account to leave this review.\nthe actors are attractive and that is it. \nThe movie pretends it is some genius insight into morals and ethics and falls flat doing it with no actual soul to the movie. \nThere is no weight given to choice, life or death. \nLying cheating winking man is hot, murder is not just fine but completely inconsequential, woman need saving. \nNo one like a loser with a conscience.",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The cheesy theme of a fake hitman playing dress ups for police stings then meeting the love of his life (who is prepared to have her husband murdered) lacks any real world sensibility. \n\nIt makes world championship wrestling look like real wrestling. I’m amazed it gets such a high approval score.",
    "date": "2025-08-20"
  }
]