[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Para mí es una gran película de humor y una de las grandes películas de culto",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Most misunderstood movie of the 21st century.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best comedy ever made.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Absolutely awful: cringed for the whole 20 minutes that we watched",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Yeah I Wouldnever put this on to my kids",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "a embarrassing movie such as mike myers was so bad in this he was a embassessment to look at, also a terrible plot, terrible story, most of all no good acting in this entire movie, you can give 0/10 in which i am giving, mike myers worst movie",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best movies ever created, if you enjoy Shrek and say you don’t enjoy cat in the hat, you are a paradox.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie was horrible.  Made me cringe.  Unfortunately I was not able to finish it.  This is one the worst movies I've ever seen.",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Bad, with some fun scenes.",
    "date": "2025-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "It’s hilarious, but the character designs are hideous and it doesn’t feel like Dr. Seuss",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Well, you get enjoyment out of some parts…BUT MY GOSH! This movie ruined me and it’s kind of my childhood trauma, especially Thing 1 and 2 THIS MOVIE IS BAD",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "One of the worst movies ever made. Even as a kid I hated it. The film so bad, Dr Seuss's widow banned anymore live action adaptations of her late husband's beloved work.",
    "date": "2025-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "very funny, i love this movie XD",
    "date": "2025-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The movie is great and a good interpretation of what a live-action Cat in the Hat is capable of, with slapstick humor and great acting by the children and step dad it also shows how things might always come to light, as seen with how the stepdad treated the kids and how the Cat in the Hat helps get rid of him. The movie is great; I hate all the negative reviews. The movie shows how things might always come to light, as seen with how the stepdad treated the kids and how the Cat in the Hat helps get rid of him. The movie is great; I hate all the negative reviews.",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Es una muy buena película me encanto",
    "date": "2025-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Seppur Mike Mayers riesce un pò a salvare questo disastro per la sua recitazione il resto del cast è penoso, le battute non fanno ridere neanche i bambini, il cattivo è mediocre, ma soprattutto il design del gatto era da film horror, veramente una pessima trovata per riportare in vita un vecchio brand degli anni 50, Il Grinch di Jim Carry perlomeno era divertente.\nDr. Seuss a saperlo si rivolterebbe nella tomba.\nEvitate questo film se potete, è un incubo per bambini, adulti e fan di Seuss",
    "date": "2025-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "UNA PESADILLA ECHO REALIDAD",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I always watched this as a kid and i loved it and I still love it!",
    "date": "2025-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I used to love watching this movie as a kid <3",
    "date": "2025-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a pure cinematic masterpiece that puts everything else to shame. Bo Welch shows his genius in the making of this film. These actors were snubbed of Oscar’s by the academy.",
    "date": "2025-08-02"
  }
]