[
  {
    "user": "Matt Brunson",
    "rating": 4.0,
    "text": "No Country for Old Men is a delirious drama that often echoes such classics as Psycho, Touch of Evil, and Chinatown.",
    "date": null
  },
  {
    "user": "Brian Bisesi",
    "rating": 5.0,
    "text": "The folksy characters typical of the Coens’ work are perfectly juxtaposed against the ruthlessness of Bardem’s incomparable performance. Both the landscape and soundscape are simultaneously barren and rich, mirroring the understated yet powerful dialogue.",
    "date": null
  },
  {
    "user": "Aly Caviness",
    "rating": null,
    "text": "Whether the Coens have made better movies is subject to opinion but there is something incontrovertible about No Country’s status as god-tier filmmaking. Repeat viewings do nothing to lessen its staggering power.",
    "date": null
  },
  {
    "user": "Joshua Stevens",
    "rating": null,
    "text": "The Coens capture that chaos in a controlled, commanding movie, the best of their career and one of the best of the century.",
    "date": null
  },
  {
    "user": "Aaron Neuwirth",
    "rating": null,
    "text": "No Country for Old Men is one of the best films of the 2000s, one of a few Coen masterpieces, and one that will easily stand the test of time when considering what it has to say about the way of the world, dark as it may be.",
    "date": null
  },
  {
    "user": "Rudie Obias",
    "rating": null,
    "text": "No Country For Old Men is a great film from two great directors.",
    "date": null
  },
  {
    "user": "Danielle Solzman",
    "rating": null,
    "text": "No Country for Old Men is in the top tier of the Coen Brothers filmography and is among the best films they have ever made.",
    "date": null
  },
  {
    "user": "Wendy Ide",
    "rating": null,
    "text": "Roger Deakins’s cinematography is as much a star of the film as any of the cast.",
    "date": null
  },
  {
    "user": "Sean Axmaker",
    "rating": null,
    "text": "A model of simple, strong, evocative storytelling pared down to the bone, 'No Country' is filled with richly-drawn characters and an enthralling story that builds merciless momentum.",
    "date": null
  },
  {
    "user": "Mark Johnson",
    "rating": null,
    "text": "Filled with violence, suspense, and the dark comedy that has made the Coens famous, No Country remains a deeply profound look at how time passes us all by, and no matter how hard we try, we can’t stop what’s coming.",
    "date": null
  },
  {
    "user": "Keith Garlington",
    "rating": null,
    "text": "The violence is startling, the pacing is perfect, and there is just the right amount of dark comedy. You’ll wince in one scene and laugh out loud in the next one.",
    "date": null
  },
  {
    "user": "Alex Saveliev",
    "rating": null,
    "text": "The two-hour runtime flies by as the Coens shame bloated blockbusters with sheer craft.",
    "date": null
  },
  {
    "user": "Mike Massie",
    "rating": null,
    "text": "Relentless in method, challenging in presentation, and unforgettable in execution.",
    "date": null
  },
  {
    "user": "Leigh Monson",
    "rating": null,
    "text": "No Country for Old Men draws its characters as broad representations of human morality, which makes them all the more compelling.",
    "date": null
  },
  {
    "user": "Richard Propes",
    "rating": null,
    "text": "The greatest films are such a force of life and death, love and hate that once the closing credits begin to roll, the film's cinematic life has just begun.",
    "date": null
  },
  {
    "user": "Fico Cangiano",
    "rating": null,
    "text": "The Coen brothers deliver one hell of a modern western, with themes that resonate and characters that won't let you forget them. [Full review in Spanish]",
    "date": null
  },
  {
    "user": "David Lamble",
    "rating": null,
    "text": "The Coen Brothers honor McCarthy by reproducing whole chunks of dialogue from the book, and judiciously trimming plot. Jones' plaintive mourning for a country that's become too complicated to police is enough for us to know why he's packing it in.",
    "date": null
  },
  {
    "user": "Micheal Compton",
    "rating": null,
    "text": "With very little dialogue, Bardem is an imposing, evil presence who makes every scene he is in a white-knuckle moment.",
    "date": null
  },
  {
    "user": "Ben Rolph",
    "rating": null,
    "text": "The Coen Brothers' vision was quite simply visionary, and still is.",
    "date": null
  },
  {
    "user": "Mattie Lucas",
    "rating": null,
    "text": "An unexpected sucker-punch of a movie - raw, gritty and deeply humanistic.",
    "date": null
  }
]