[
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The Characters Are Good But The Animation And Storytelling Is Decent. For That, I Can't Recommend It.",
    "date": "2025-04-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This is a decent kids movie when thought about completely separately from its source material. Young kids should enjoy it. With that said it is really disappointing from the perspective of its source material. This movie simplifies and distorts the original story where it is really quite difficult to even recognize the book it was based on",
    "date": "2025-01-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Good Movie The animation is good The history too\n\nOnly i think that can be better \n\nBUt a good movie",
    "date": "2024-05-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Dragon Rider is the most incredible book I have ever read in my life. An unimaginable, incredible, glorious masterpiece of literature. A grand tale of epic proportions. When I heard this book would be getting a film eventually, I had so many incredible ideas and visions. This movie is none of the things I wanted or imagined. What could have been an epic live action tale of a deadly dragon conqueror and the glorious bond between a silver dragon and a human boy was squandered by this childrens film. This had great potential. Potential to become one of the most epic dragon tales of all of cinema history, battling even Dragon Heart, but it fell short in almost every way. A true disappointment.",
    "date": "2024-03-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This movie feels like a discount \"How To Train Your Dragon\".  Which isn't a bad thing.  And I liked most of it except for two characters.  But they do get better as the movie goes on.  Overall, it's fun and entertaining.  Worth checking out for dragon fans.",
    "date": "2023-02-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The story is better good, and the characters are likeable and understandable. Some problems, with pacing though",
    "date": "2022-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I don't know how popular the books by Cornelia Funke are in other country but here in Germany it is pure nostalgia for so many of us. That's why I was so exited to finally get a filmversion of the book we all used to love as kids. I normally wouldn't write such a long critique but I didn't find an existing critizising the things I just don't get about this film. First of all I think it is pretty much a disaster. Ben, a loveble kid with nice backstory and desperat for a family, became an unlikeble character and thief with no real plotrelevance. He's just there. The Humunkulus (I'm not ganno use the name since I don't know how he is called in English) is just shoved into the movie, because they couldn't leave out another character (R.I.P. Lola, Gilbert, the monks etc.) and to give him some reason to exist Nesselbrandt (bad guy) has a Tinderprofile(sounds as weird as it is). Instead of actually caring about the point of the movie the developers rather made another overused \"You can do it! Spit fire! Yay, you finally did it and defeated the bad guy!\" plot.  I'd rather have a 2hour and over long movie that gives the original readers the feeling the book had rather than this catastroph of a film. If you haven't read the books yet I would really recommend it. They are translated into many languages and way better than this. \nTl;dr: A society criticising  but fun to read story became daft and boring. A book with so many loveble characters and scenes became a film with unfunny jokes and unimportant characters. A great (maybe one of the best) book for adolescents became a disaster for toddlers. If you don't wanna be disappointed don't watch this calamity  of a movie.",
    "date": "2022-02-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It was a good movie not a great ending really wish he would have shown his fire to the others",
    "date": "2022-02-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I enjoyed this family-friendly adventure story about a dragon searching for the rim of heaven which is the promise land for his dragon friends who are being pushed out of civilization by the advancement of man on the earth. Nice cast of people for the voices as well",
    "date": "2021-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I was excited to learn of this movie, as I greatly enjoyed the book as a child. The movie is nothing like the book leaving out key scenes from the book that perfectly set up the adventure. Weird character designs and personality choices threw off a lot of the movie. References to \"Match\" and \"Skype\" just ruins it even more. Not worth watching for fans of the book but might be worth it for children who never read the book.",
    "date": "2021-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It gives off that How to Train Your Dragon vibes, only that one is cooler than this. Sorry but it's not the type of movie I would recommend.",
    "date": "2021-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Dragon Rider was one of my favorite books growing up, so when I saw there was finally an adaption of it, I was excited. However, moments into watching it, I realized how bad this movie was actually going to be.\n\nFirst and foremost, in an attempt to \"modernize\" the plot and make it more comedic, they removed several of some of the most interesting elements in the book and replaced them with lackluster alternatives that hurt the movie more than it helped. In the books, Sorrel and Firedrake must first find the mapmaker Gilbert Greytail to attempt to find some direction to the Rim of Heaven. It's here that they meet Ben, an orphan boy roughing it out at the docks who was genuinely interested in helping them and aided in hiding them from humans! Lola, Gilbert's niece who was a pilot and also the one who aided in his mapmaking, was likewise removed. Burr-Burr-Chan, another brownie who aided them in their final fight, was removed. In the books, Nettlebrand communicated with Twigleg through bodies of water and had an army of red-eyed raven spies. Only one raven appeared, not at all intelligent, as just a mount. All of these elements were instead replaced with the Internet and... Skype.\n\nSecondly, let's talk about the complete revamps of some of the characters that were most definitely for the worst. I've already mentioned how Ben was in the books, but in the movie, he is incredibly selfish, greedy, and antagonistic pretty much the entire time until the very end. It's a weird and unnecessary departure from the books and I honestly have no idea why they decided to make Ben so insufferable when his character, motivations, and personality were much more compelling and interesting in the book. In the movie, they also took away the fact that Firedrake and the dragons could only fly at night, as the moon is what gave them their power. You can see him blatantly flying during the day, with pretty much every scene taking place during it. The sea serpant is only mentioned offhandedly as being dangerous and aggressive, despite being ambivilant and taking them to the dracologist in Pakistan who would aid them on their journey.\n\nThe dracologist deserves her own section. In the books, she is deliberatly referred to as a dracologist and called Dr. Zubeida Ghalib. She is a cool character who greatly helps the quartet (as Twigleg at this point of the books had been discovered but was feeding false information to Nettlebrand) in locating the Rim of Heaven and giving them a way to circumvent only being able to fly at night. In the movie however, she is replaced with a racist caricature of an Indian mystic woman named Subisha Gulab. This entire scene was uncomfortable, filled with stereotypes and carcicatures, and had an overall incredibly racist undertone to it that was incredibly unnecessary and unneeded for an already poor movie.\n\nLastly, many scenes and concepts were changed for some reason or another. In the books, they discover that Nettlebrand was created to kill dragons so the alchemist who made him could take their horns, which was necessary for him to transmute things into gold. The Rim of Heaven was a valley, where the dragons had been turned to stone as they had refused to leave their cave in fear of Nettlebrand with the sole exception of Maia. The main cast discovered brownie spit and dragon fire could melt Nettlebrand and so convinced Gravelbeard to shine his scales in brownie spit, tricking him into thinking it was polish. Some portions of the movie I can understand changing due to the interest of time, such as the sea serpent, the group of archeologists they meet in Egypt that Greenbloom is apart of, even Burr-Burr-Chan to an extent. However, some parts were lengthened for no real reason or new scenes added that could've been replaced by actually interesting scenes: the beginning sequence with Spinecrackle and Bottleneck, the idea the humans were destroying the valley for factories instead of simply going to flood it, Ben's introduction sequence with the odd How to Train Your Dragon reference, the dating site scenes with Nettlebrand, the sub, the weird conflicts between Ben and Firedrake, the scenes of Ben's \"Dragon Rider\" powers showing them where to go, the djinn fight where they change the question they ask for no real reason...\n\nThis movie is one of the worst adaptions of a book I've ever seen. At least with How to Train Your Dragon, they made unique plots and simply took the character names and world for their films. This, however, took the characters and plot and made them worse for no real reason. If it was based more accurately on the book and dealt less with the constructed conflict and weird racism and modernization, it would've actually been a decent movie! The book had interesting concepts in it and they just refused to use them for reasons that is beyond me. It was incredibly disappointing. The only saving grace for this movie is that the animation is nice, though when it came to writing the plot and script, it felt as if all the budget went to the star-studded cast.",
    "date": "2021-09-19"
  }
]