[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1.75 hours!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated R for Violence!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Both Washington, and the films cinematography are dazzling to watch.",
    "date": "2025-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A very well-made movie, but one that I can’t bring myself to say is good",
    "date": "2025-04-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Good cinematography and acting, i personally found it helpful in understanding the Shakespearean dialogue to watch with subtitles, and I muted it so I could really focus on the language, made it much easier to understand.",
    "date": "2025-02-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A high school drama is more entertaining than it.",
    "date": "2025-01-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Perhaps a little too long, but a great adaptation of one of Shakespeare's greatest works. A cinematically well done work with an able cast overall.",
    "date": "2025-01-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "\"Macbeth: A Tragic Downfall of Ambition\"\n\"Macbeth\" is a profound Shakespearean tragedy that delves into the dark recesses of the human psyche. The play's strength lies in its exploration of unchecked ambition. Macbeth, a once-honorable warrior, succumbs to the alluring whispers of power. His transformation from a valiant hero to a tyrant is both chilling and captivating.\nThe vivid and poetic language used by Shakespeare heightens the intensity of the drama. The soliloquies of Macbeth offer a window into his tortured soul as he grapples with guilt and paranoia. Lady Macbeth's role is equally complex. Her initial determination to drive her husband towards the throne leads to her own moral deterioration.\nThe supernatural elements, such as the witches, add an eerie atmosphere and a sense of fate's manipulation. The play's themes of power, guilt, and the corrupting nature of ambition are timeless. It makes the audience reflect on the consequences of overreaching. Overall, \"Macbeth\" is a masterful work that continues to resonate, leaving a lasting impression of the tragic consequences of straying from the path of virtue.\nI usually use these two sites for more free movies and short dramas.If you have a better website, please recommend it to me. Thank you\nhttps://omnishort.com/？utm_source=rottentomatoes\nhttps://nightgod.tv/？utm_source=rottentomatoes",
    "date": "2024-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This is visually excellent. In that respect alone, it is a striking rendition of the Bard's Scottish Play, however it is wildly miscast. It is a Scottish Play, and here we have to swallow an Irish King, a whole host of English characters  most ridiculous of all, a mixture of American actors. Denzel Washington is an astonishingly unconvincing MacBeth is is his wife. I'm pretty sure contemporary Scottish Warlords tended not to resemble middle-aged American gangsters as we have here.\n\nI can forgive the American witch(es) to some extent but it all sits poorly with me. Hearing this cast pronounce Cawdor in some sort of \"Game of Thrones/Lord of the Rings\" style  complete with elongated vowels \"Kawwdawwr\" was just too absurd to bear and I felt like screaming after 10 minutes. \n\nNow, I admit I'm Scottish and I'm really fed up to hearing American and English actors butchering Scottish accents and so I don't imagine I'd have been happier hearing this cast trying harder to sound authentic but this whole cast was just a big \"no\" for me and was all the more irritating due to the excellent filming.",
    "date": "2024-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The witches (Kathryn Hunter) and Denzel slayed. I love soliloquies and I like the way it was shot - v smooth transitions while also being visually intriguing via minimalism, shadows, contrast, and absence of colour.",
    "date": "2024-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Excellent cast.  The scale of the set is impressive also.\nFor Macbeth, it would have been good to have at least one, just one Scottish actor.\nMy only other criticism is that a number of the actors appear to be reading without understanding of the text.",
    "date": "2024-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I appreciate Shakespeare, but I guess I don’t really enjoy it. The immaculate production design and cinematography did most of the heavy lifting during my viewing experience.",
    "date": "2024-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I do not know why Mr. Coen asked his actors to underplay the beginning of the story so much that the first act is incomprehensible. However, once Fleance enters, things pick up, and from the moment that Mr. Washington asks, \"Is this a dagger which I see before me?\" it is one helluva show.",
    "date": "2024-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was undeniably one of the best movies of this year. The tragedy of Macbeth is already so powerful on its own, but put in this type of texture, it was a really all-involving experience, especially in theaters. Frances and Denzel were remarkable. Kathryn Hunter blew me away. If you are a fan of Shakespeare, this is the one you want to see! Stunning.",
    "date": "2024-06-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Coen perfectly toes the line here, his adaptation both finds new and exciting things while always being mindful of the text itself, especially the language. Both Washington and McDormand (and the rest of the cast) are nothing short of spectacular.",
    "date": "2024-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "One of my last A24-distributed films to see, Joel Coen's \"The Tragedy of Macbeth\" is definitely one of the more interesting films I've seen from him. It definitely feels like a Coen film, and stylistically it looks great. Washington and McDormand also give great performances in this as well.",
    "date": "2024-02-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Coming from another high-school theatre enthusiast & somebody who's actually seen an American Shakespeare production, as well as read his novels and literatures in English classes; this has got to be , if not the best or \"most accurate\", definitely most surreal interpretation of greed in the vividness that is a medieval memory. Though false studio staging is obviously kept in tradition of a \"theatrical play\" aesthetic, this film offers a portrayal in a very \"chess-boarded\", audience's P.O.V sort of style that really puts the filmmaker's vision into perspective. Although dialogue heavy and a rather complicated clustered structure to follow, I am pretty sure that is what the director intended entirely . This being an Apple film & obviously the first commercially successful project without his brother ; the optional theatrical release only solidified Joel Coen as one of the greatest directors of our time. This movie will catch on…",
    "date": "2024-01-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I’ve never understood Macbeth more than I have now after watching Denzel play this character. Amazing acting. I thoroughly enjoyed feeling like I watched this story for the first time and also realized how much of a mental break Macbeth’s had",
    "date": "2024-01-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "How can you mess up Macbeth???!! \n\nThe Tragedy Of Macbeth is written and directed by solo Coen brother Joel Coen \nand it tells the iconic Shakespeare story in new lenses.\n\nThe performance from the witch is probably the best out of all the cinematic storytellings related to Macbeth as she was really good and one of the saving graces of the film.\n\nHowever what was Joel thinking with this???! I get that he's trying to appeal to a newer audience but I can't recall any of these Americans in the book!\n\nAs a reader of the book/script myself the deliverances of the lines were cringeworthy because of their stupid American accents!!!\n\nLike, they didn't even attempt Scottish accents and it seems like they don't want to refer to any resemblance of Scottish heritage and at least the one before had no Americans whatsoever even though this one was released 6 YEARS LATER WITH HIGHER RATINGS ARGHHH!!...\n\nOverall would not recommend this just watch the earlier films about it as they are far better and aren't riddled with inaccuracies.\n\nEasily the worst Macbeth film ever, Joel Coen more like Uwe Joel.\n\nGrade: D+",
    "date": "2024-01-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Gave up after 20 minutes of trying to understand the boring medieval dialogue, I couldn't understand the plot.",
    "date": "2023-12-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Worth watching, even just for Denzel's chilling and original take on a character that one would otherwise think has already been played in every possible way",
    "date": "2023-11-20"
  }
]