[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "All those who like the movie, tell me if it should get a sequel.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It’s just fun and goofy",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Such a fun movie def recommend 🙏",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Um filme mediano, mas BOM. Efeitos deslumbrantes e trama inusitada, este filme tem potencial!",
    "date": "2025-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The film is very good, the familiarization of pet-human is very cool since the person who watches the film feels it, although the only thing that seems absurd to me is the competition between a snail 🐌 and a professional Formula 1 racer.\nSantiago de los Ríos",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is soo good it made me cry everywhere. I see turbo more than my familly. I hear the words \"WOW THAT SNAIL IS FAST\" more than i love you. My music taste is the turbo soundrack. I have lost count of how many times i have watched this movie but since ive watched it everyday 5 times since it came out is suspect in somewhere in the bilions, yes i did the math. My life has gone more than up since i watched this movie, quite frankly my life STARTED when i watched this for the first time. Everytime i see a snail in real life i scream WOW THAT SNAIL IS FAST and begin crying all over the place because it reminds me of the thing that makes me truly happy... Turbo 2013",
    "date": "2025-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 36 minutes!!!!!!!!!!!!!! Rated PG for Thematic Elements and Some Mild Action!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $83,000,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Happy 12th anniversary!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was hilarious and shows how the smallest things can achieve greatly",
    "date": "2025-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Probably the most okay movie I've ever seen. It's just base level, but acceptable",
    "date": "2025-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This seems to be the best animated movie about racing.\n\nThe concept is very distinctive: a snail (snails tend to be slow) who wants/dreams to be the fastest racer yet. And he left, dodging what was going to hold him back & catches attention with bigger friends who truly believe in him.\n\nI was very keen on the casting: Ryan Reynolds portraying Theo/Turbo (who is often portraying the outspoken protagonist who is easy at making you laugh (i.e: Deadpool)). And Guy Gagmé was like no other animated role that Bill Hader has ever had.\n\nAnd another meaning is that \"you should not always meet your heroes in person\" when Theo/Turbo was inspired by Guy Gagmé who said \"No dream is too big, no dreamer is too small\". Then, Guy Gagmé turns be the narcissistic antagonist who never thought about others being successful & win all the time - he turned out not believe in the snail.\n\nThis is truly better than Pixar's Cars or Disney's Wreck-it-Ralph. DreamWorks is the best.",
    "date": "2025-06-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolute banger of a movie...",
    "date": "2025-06-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the all-time greats",
    "date": "2025-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "peak",
    "date": "2025-05-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "\"Snails go slow, but what happen if they go fast!\" A drunk person probably said at DreamWorks, then they took that and made the worst DreamWorks movie",
    "date": "2025-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Turbo is not a terrible movie. it's just really boring. the villain was bad, and the message felt like it came straight out of a Pixar movie. the animation wasn't that bad, i liked it. overall, 5/10.",
    "date": "2025-04-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The greatest snail movie!!! ts is amazing!!!!!!!!!!!!",
    "date": "2025-04-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I dunno why, but I just LOVE this movie. Something about it is just so... good. Sure, call the \"twist villain\" a bad villain, call the plot derivative, call it mid, but I think \"The Snail Is Fast\" is enough to bump it up to an A Tier.",
    "date": "2025-03-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Looks like Pixar cars",
    "date": "2025-03-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "In my opinion one of dreamworks best films loved the charachters and Reynolds voice acting of turbo the story was well written and loved the dynamic between all the charachters sure the twist villain felt forced but other than that it’s still a great animated film from dreamworks that should have got a best animated feature Oscar nomination.",
    "date": "2025-02-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "snal slow booooo sanl fast yayyy",
    "date": "2025-01-07"
  }
]