[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Story is interesting with a hint of fun",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Idk why people are hating on this movie so bad my family and I really enjoyed the watch. I even watched it a second time . Funny the action scenes were ok could have been better but not bad. To the people saying there’s no storyline to follow maybe you should watch it again",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Wow this was bad.  Pathetic script with typical Hollywood climate change preaching and a DEI cast.  The sub crew looked like rubber suited gimps.  Cartoonish CGI.  The snappy banter was a impotent attempt at comedy. Not one good thing to say about movie other than it could end the Aquaman franchise.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Nice movie....!!!!!!",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "They put A LOT of money into making this movie suck",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A movie so bad it gave me diabetes. I'd rather have that for my life than watch this movie again.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Awful movie. A funny way to end a terrible DCEU as well",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Forced to watch it 4 times on a flight, the fish were cool tho",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The special effects and visual appeal is up a notch. Story lacks a little backbone and originality but captivating nonetheless. Lots of action, suspense, drama, twists, oddball humor and intrigue. Jason Momoa shines in character as usual, rest of cast also convincing and capable. James Wan did good bringing this to screen. Entertaining and very DC feel to it",
    "date": "2025-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The film delivers a passable dose of spectacle and a few genuinely interesting visual flourishes, yet ultimately falls flat. It lacks the conviction and narrative grip necessary to be truly immersive. Jason Momoa, unfortunately, seems to have shed the infectious swagger and charm that defined his performance in the original, leaving us with a lead protagonist who frequently borders on the ridiculous. The antagonist is equally underdeveloped, an utterly forgettable presence. While there are a handful of amusing lines, the film as a whole is instantly disposable. Crucially, the director appears to have forgotten that he is helming a blockbuster about a key member of the Justice League.",
    "date": "2025-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Aquaman 2 was released in theatres in 2023 and stars Jason Momoa in the title role, Patrick Wilson as the brother, and a bunch of other actors whose names I don't remember. Aquaman is the king of Atlantis and he's married with a son. Black Manta still wants revenge against Aquaman for killing his dad and is now searching for artifacts. He finds a magical evil trident that possesses him and he attacks Atlantis so he can steal some power McGuffins that cause global warming or something. To find Black Manta Aquaman breaks his brother out of of jail, have lots of weird fight scenes, and eventually wins. Atlantis then joins the United Nations for whatever reason and the movie ends. So to sum up, this movie's script wasn't very good, some of the CGI was decent while some was terrible, but I did like Momoa. Most of the jokes fell flat for me and honestly I felt bored for the last half of the film. If you really like Aquaman then this could be for you, if not I'd pass.",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Words can’t describe how I felt. Just imcreadible",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I loved the brother dynamic, but the movie overall is ok, nothing new. Willem Dafoe's absence was felt.",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Praise sexy amber heard",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Liked the first one better. Momoa is easy on the eyes.",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Bad script. Obviously actors had wrong direction while shooting or multiple shooting gave different feel and tone to the movie. Some dialogues feel like it wasn’t the best take. Would have been a great buddy movie with Orm and Arthur trying to reconcile and fighting their differences from the beginning. Took 4 years to meet ? That sounds unlikely. Movie makes too much attempt at forced humour that doesn’t land well. Set pieces look less grandiose than in first movie, here we got more CGI while first movie had actual scenes out in the real world. The  Island toward the end feels too much like Lost World, and the whole sequence is useless. The consequences of the bad guys on the planet’s climate change etc is not shown at all, only exposition done by the tv newscasts. As a bro man, Arthur fell flat. Nothing in his upbringing actually hinted of him being a surfer dude cliche. Wasn’t he train by Vulko? Having a somewhat grounded and stable dad ? This movie feels like it’s missing some events. At some point DC probably didn’t care much about it since they had already signed for a new DCU future…DCEU was flawed and destined to fail for wanted to appeal too much to a corporate formula and giving creative control to incompetent people.",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Simply too much CGI and very little to cate about. Mamoa is good but even he seemed to call this one in",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Terrible production quality and completely predictable. Super generic and boring. Foul language could have been left out.",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It was torturous having to sit through this nonsense. First one was very entertaining, too bad sequel didn't do it. The silly morality at the end really put the lid on its coffin and buried with all the other silly morality nonsense.",
    "date": "2025-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "When i thought superhero movies can't get any more boring, aquaman came up to save the day and hit a new rock bottom, the rock bottom of the ocean. it's just same thing you have seen many times by now in a different wrapping.",
    "date": "2025-07-06"
  }
]