[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Really good movie. Pace kept going at a good speed and a lot of what is in the movie is what happened. Little sexual scenes in the beginning but other than that it was a clean movie.",
    "date": "2025-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Good acting, good plot, good movie",
    "date": "2025-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The plot goes at a good pace up to the moment when Laura Dern begins to believe the story of Tod, and after a good detective/attorney good things show up in the horizon. Very well directed and performed…",
    "date": "2025-03-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A well told tearjerker by a American filmmaker, Edward Zwick, who rarely gets the praise he deserves.",
    "date": "2025-03-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "We’ll done, but so sad and upsetting it’s hard to watch.",
    "date": "2025-03-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "We’ll done, but so sad and upsetting it’s hard to watch.",
    "date": "2025-02-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Trial by fire was a good movie. I did not know this was based on a true story. I think the movie was quite interesting especially because I took a class on the dead penalty. I like how it highlighted what days on dead row could feel like. I enjoyed the humility aspect through the eyes of “criminals”. I would recommend this movie to anyone interested in drama , real life or crime.",
    "date": "2025-02-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Sad story about the brutality of our justice system.",
    "date": "2025-02-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This story and movie was intense. The cinematography,  the perspective of Todd's thoughts. The people who believed him..... It reminds me of why America is trash and broken.",
    "date": "2025-02-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "My husband and I enjoyed it. I’m not sure why it got bad reviews. Based on a true story.  Love Laura Dern and McConnell.",
    "date": "2025-02-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Very good good story",
    "date": "2025-02-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It’s a good movie but unless you’re ready for a very sad ending, don’t watch. I was bawling at the end. I didn’t realize it was a true story until the end either. Very sad and needs to be told, but wish I would have known going into it.",
    "date": "2025-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Acting and story was over embellished to the point of unbelievable. Lost interest after 45 mins.",
    "date": "2025-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "“Trial by Fire” recounts the harrowing true story of a man from a disadvantaged background who suffers the unimaginable loss of three children in a tragic fire. He is unjustly accused of deliberately setting the blaze that claimed their lives. Jack O’Connell stars as Todd, a role that may not have been familiar to many, yet he delivers a powerful performance.\n\nThe director masterfully weaves together the film's narrative, steering clear of romantic clichés and instead crafting a gripping thriller that keeps viewers emotionally invested in Todd's plight. Laura Dern portrays Elizabeth, who serves as a pen pal to the wrongly accused man, adding depth to the story.\n\nFrom the outset, the audience is aware of Todd's innocence, yet we witness the brutal reality of the judicial system as it subjects him to mistreatment and manipulation. The film exposes the corruption within the legal framework, highlighting how the district attorney resorts to unethical tactics, including bribery, to serve his own interests. This starkly illustrates a system that is rigged against those with fewer resources, leaving them without a fighting chance.\n\nUltimately, the film presents a chilling commentary on the state of justice in the United States, where the presumption of innocence has been replaced by a presumption of guilt, especially for those without financial means. Todd’s fate, dictated by speculation and a lack of proper investigation, underscores the deep flaws in the system.\n\nThe poignant conclusion of Todd's journey and struggles leaves a lasting impression, particularly knowing that it is based on a true story. It’s a powerful film that I wholeheartedly recommend for its compelling narrative and emotional depth.",
    "date": "2025-02-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This had so much potential but REALLY sad. Perhaps it is a true story that needed to be told but unless you want to cry for days. Maybe skip it.",
    "date": "2025-02-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was a powerful movie.  In recent years I've reversed my position against the death penalty.  I stopped believing in Christian values.  I realized that other people don't live by them.    And that humans need to kill.  And that there are people so evil minded that they can't be contained.  But this movie makes me think I was right before.  On death row he yells that he wouldn't treat a dog like he's being treated.  \n\nHe was innocent and they couldn't get the Governer to read new evidence.",
    "date": "2025-02-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Good acting on  a based on true story is with no doubt a great movie that will engage you emotionally. Fortunately this movie had a really bad bad bad acting. I give it 3 starts because it’s still a good story and keep me watching to find out the unexpected ending.",
    "date": "2025-02-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Laura Dern as Erin Brockovich in the Democratic fight against the Texas penalization system.",
    "date": "2025-02-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Inquietante rappresentazione del sistema giudiziario americano in questa storia vera in cui tutti gli elementi sono costruiti in modo tale da rendere il più evidente possibile l'ingiustizia compiuta e la pericolosità della pena di morte come condanna.\nJack O'Connell non sfrutta a pieno l'occasione, la sua interpretazione è buona, soprattutto quando può sfogare la sua voce, mentre resta più impalpabile ed impenetrabile quando si entra nella psicologia: stesso discorso per Laura Dern, buona samaritana a cui però manca il guizzo di simpatia.\nMancano in maniera abbastanza evidente le testimonianze o almeno qualche fotogramma dei veri personaggi e del vero evento.\nVista la propensione del film a rendere il più visibile possibile l'ingiustizia compiuta, qualche spunto della vera faccenda avrebbe aiutato.",
    "date": "2022-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "You can comment on the production values, you can comment on the quality of the dramatic performances and to be fair, they are good. However, an hour in all I can see is a left wing, do gooder moral tale of; the death penalty's is wrong. There is no drama, no real story, no suspense, it just plods slowly along to any eventual conclusion that is designed to convince you that the death penalty is wrong.\nThat's not entertaining that's propaganda.\nIf you want to be preached to and listen to a morality tale, fine. If you want drama, intrigue, drama, suspense, entertainment, an kind of story, pretty much anything that doesn't make you feel like an idiot, well, watch something else.",
    "date": "2021-03-27"
  }
]