[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "If you want a feel good movie and have 90 minutes or so to spare then I can't recommend this film enough.\n\nRuby, the titular dog, played by Bear, reminded me of my last dog, Sasha. Like Ruby and Bear, Sasha was a rescue, and became my companion for 12 years. Like Ruby and Bear there was a lot of work needed.\n\nFor those thinking of getting a dog, watch this film. There is no such thing as an untrainable dog, if you are willing to give them time and get to know who they are. Rescue dogs often carry past traumas that you'll need to work through, but once you learn who they are, and build that bond, you'll never have a more loving, faithful and dedicated partner.",
    "date": "2025-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Emotional movie for sure. Absolutely loved this movie .",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "GRANT GUSTIN SO FIVE STARS",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "For someone who has worked with K9’s as a Security Officer for almost 9 years. This film was not only emotional but hit hard in my heart, I always felt like I was Grant Gustin in this Film.",
    "date": "2025-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Was a great family film.  Rooting for the underdog team is always fun and this one will not let you down",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "SImples e objetivo, faltam filmes assim atualmente, tudo tem que ser tão extraordinário e vem um filme assim e trás uma linda história e incentivo a adoção, perfeito gostei muito, ótimo pra uma noite de sábado.",
    "date": "2025-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Garbage. Absolutely trash. Worst movie ever made.",
    "date": "2025-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The story it was based of is nice, but god the acting and the way the story unveils is cringe and unrealistic. I had facepalm moments through the movie thinking how idiotic must someone be to do such things, and how everything seems like it’s blatantly engineered to fit the underlying story. An awesome story wasted.",
    "date": "2025-05-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Such a heartfelt and beautiful story. The actors were amazing, both human and dog actors. If you love dogs and a good, happy story, this is the movie.",
    "date": "2025-04-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Hermosa, entretenimiento sano para toda la familia. Buena historia, no me esperaba que estuviera tan bien. Ideal para pasar un buen rato.",
    "date": "2025-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fantastic movie for everyone, especially animal lovers!",
    "date": "2025-03-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Rescued by Ruby tells the uplifting true story of a state trooper and his unlikely bond with a shelter dog, Ruby, as they both strive to overcome their challenges. Starring Grant Gustin, the film captures the emotional journey of both human and animal, with a focus on perseverance, loyalty, and second chances. While it follows a predictable formula, its sincerity, warm performances, and feel-good moments make it an enjoyable and inspiring watch.",
    "date": "2025-02-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A great watch. Amazing that it's a true story.",
    "date": "2025-01-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Great story, but so hard ro watch this movie because they tried soooo hard to do the accent.  Not only did they not get a Rhode Island accent (which by the way is closer to the Bronx than it is to Somerville) they didn’t get it in New England.  The. movie would have been so much better if they had just ignored the accent and let the scenary place it in Rhode Island.",
    "date": "2024-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "My dog gets so excited when this movie comes on! He loves Ruby. My kids like it too but we get the most joy from watching our dog as he watches it.",
    "date": "2024-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I was disappointed in it.  The true story is amazing but the film about it wasn’t.",
    "date": "2024-05-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Everyone loves this movie. The critics ratings were 100%. But… there were no top critic reviews nor was it rated on Ebert.com. There are very very very few good “dog” movies and unfortunately this one isn’t good either. It was like a Hallmark melodrama. The true story is an amazing story to tell but it could have been told much better. Bear who plays Ruby is delightful and he is beautiful to watch. I was disappointed by the movie and mislead by all the hoopla and acolytes given to it.",
    "date": "2024-05-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Si Rescued by Ruby funciona es gracias a Grant Gustin, regala una actuación honesta llena de matices en la que por medio de las inseguridades de su personaje expone su arco argumental, creando un paralelismo con Ruby, dos personajes a los que se les ha estigmatizado por ser diferentes, sólo necesitando una oportunidad que pruebe su valía, objetivo que \"Daniel\" busca en toda la película, no por subir un puesto en su trabajo o por el incremento de paga, siendo para probar que es capaz de superar lo que otros no ven en él. \n\nEsta película tiene todos los componentes para funcionar dentro de su sub género, es inspiradora, es agradable de ver y tiene un mensaje de autoaceptación muy importante y reiterativamente muy bien expresado por Grant Gustin. No es una película que pretenda ser más de lo que es, con una trama línea y con un desarrollo narrativo circular, personajes carismáticos y empáticos dentro de una trama de superación basada en hechos reales que funciona; Argumentalmente sustancial y cinematográficamente correcta.",
    "date": "2024-03-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I watched it twice in a week. You wouldn't believe the ending if you didn't know it was based on a true story",
    "date": "2024-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Grant Gustin is still the GOAT and it was very sad in some parts. Amazing acting and directory. Great movie to watch with family and if you like dogs.",
    "date": "2024-03-11"
  }
]