[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "É fraco, tem bons momentos mas no geral falta peso pra narrativa.",
    "date": "2024-12-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I was a late Power Rangers fan, (I was born in 2013) and my first show was Wild Force. But from what I've seen from MMPR, this special definitely is worthy of being the 30th anniversary for the show.",
    "date": "2024-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Great for nostalgia, but pretty terrible lol\n\nStayed true to the original\n90's show 🙏🏼",
    "date": "2024-02-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Power Rangers: Once & Always is a Mighty Morphin Reunion for the passionate Mighty Morphin fans who were able to find comfort, joy, entertainment, and an escape within the show and overall the Power Ranger franchise. This reunion and celebration stars David Yost and Walter Jones as Billy Cranston and Zack Taylor who have aged and are way older since the last time we've seen them, and Rita Repulsa has returned in a robotic form, killing Trini Kwan. The Power Rangers have to team up and stop Rita from executing her plan to end the Rangers. I first want to start this review off by stating how much this special feels like the original power rangers with the tone, the story, the editing, the fight choreography. It all just brought me so much comfort and had me actually tear up a little because of how much it was missed. This special also tries new things with modern camera work, they use CGI for the Zords and ultimately the Megazord, and I think the improvements enhanced the story and made it feel like a modern story with these original characters. This did not feel like a cash grab like some of these reunions do, this one really felt like there was thought, passion, and love for this franchise. Now with all that being said, this is still Power Rangers. Just like the old show, this special has bad written dialogue, the acting is not grounded or is in anyway believable, it is all cheesy, cringey, and everything that a Power Ranger fanatic will eat up and that's how I saw it. The acting could have been better, the writing could've been better, but if it was, it wouldn't have felt like the old Power Rangers show. Overall, Power Rangers: Once and Always is a heartfelt and really a passion project from David Yost coming to life that delivers what Mighty Morphin fans have missed for so long with an emotional tribute to Jason David Frank and Thuy Trang that definitely made me emotional. Mighty Morphin Power Rangers: Once and Always gets a B-.",
    "date": "2023-12-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I don't understand why this special is getting poor reviews, I loved it. It felt like a brand new episode of the original series and it was done very well. Yes, the effects during the Megazord battle are awful, but were they great on the original series? Of course not! I've seen a lot of reviews focusing on that. It was great to see David Yost and Walter Jones back in a Power Rangers special as they have never returned (aside from Jones doing voices on different series of the show). I really wish Austin St. John, Amy Jo Johnson and Jason David Frank had returned, but maybe we can get St. John & Johnson for a 35th anniversary special? Regardless, this special was a lot of fun, they recreated the morphing sequence a couple times that was cool to see and they recreated the opening of the show for the end credits which was also really cool to see. I also wish Bulk & Skull had been included (you do see them on an advertisement for a restaurant (I think) they own, so at least they were included in some way). I think having their characters may have made it too silly so I get it.",
    "date": "2023-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very good performance",
    "date": "2023-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I really love this special. It really felt like a true epilogue to the original series. Gave a proper sendoff to the characters. It is nice seeing Billy and Zack again after all these years. Rocky and Kat came to their own in this special. I really enjoyed them as well. Despite the criticisms, It doesn't bother my enjoyment. I am glad people are talking about it to this day. I like the CGI Megazord scene in the final battle. Way better than the 1995 movie.",
    "date": "2023-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Definitely a nostalgia overload for any Mighty Morphin Power Rangers fan from the 90's. The non stop action as we know. The characters and the writing definitely make it feel like you are watching an episode from the 90's. Weather you're young or old, this is a fun family film to watch. Keeping the feel of the original series was a joy.",
    "date": "2023-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Nostalgic, very true to the first version that was broadcast on TV. A tribute to their legacy!",
    "date": "2023-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "When all is said and done, Mighty Morphin Power Rangers: Once & Always is an average special that could have, and should have, been great for long-time fans. Outside forces may have dampened a lot of things and made it more difficult to put the special together, but better planning and creative choices could have compensated for that. Not having some of the actors that played roles in the original Mighty Morphin Power Rangers show really drags down the impact this special could have made to celebrate the legacy of the series. And the corners that were glaring cut because of that were very poor decisions that stand on the edge of being disrespectful and lackluster. It's great to see Billy, Zack, and some of the other Power Rangers morph once again, but hopefully, this isn't the last special celebrating Mighty Morphin Power Rangers that everyone can go out on. Such a thing can definitely be done a lot better.",
    "date": "2023-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Después de 30 años, los Power Rangers que iniciaron la franquicia y que formaron parte de nuestra infancia regresan nuevamente por el 30 aniversario desde que se lanzó la serie por primera vez. Esta película es una secuela que trae de regreso a los Rangers y a Rita, pero lastimosamente solo 4 miembros del elenco original pudieron regresar. Está claro que no pudieron traer a todo el elenco de regreso y más tomando en cuenta la muerte de quienes interpretaron a Trini y Tommy. Incluir la muerte de la Yellow Ranger original fue algo útil para esta nueva historia y para presentar a su hija para continuar el legado. Tratándose de un proyecto que se hizo con un presupuesto moderado, lo bueno es que respeta el espíritu y la esencia de la serie original al mantener el estilo tokusatsu combinado con efectos digitales, lo único malo es que eso limito a que se pudieran incluir a más Rangers de otras entregas para hacer de esta película algo épico. Aun así, logra revivir el nostálgico recuerdo hacia la serie original al punto de hacer derramar lágrimas. Esta entrega de Power Rangers es un melancólico regalo para aquellos crecimos con la serie original y nos hace recordar con mucho amor y nostalgia otra parte entrañable de nuestra infancia. Mi calificación final para esta película es un 9/10.",
    "date": "2023-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It felt like old times revisiting my childhood heroes and seeing that the producer kept the essence.",
    "date": "2023-06-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This shocked me. Nostalgia accompanied with cheesy and tacky ridiculousness that you can always expect with power rangers. But I have to say reuniting the cast one last time after almost three decades was long overdue. The originals were recasted, they should NEVER have altered the cast for one reason or another. The truth was after the first three seasons of mighty morphing power rangers the ones to follow just weren't handled well and the new cast and the new versions just died out because it didn't work. The shows got more and more ridiculous and far too audience friendly. As for the movies well they were even worse. \nThis movie though includes almost all of the originals that brought us so much joy back in the day. The problem started with the first part of the movie. The fight scenes, the dialogue and the execution were worse than the whole updates series if that's possible. Should they do a sequel they MUST get things right. No flicking a bad guy for him to explode, no teenage wannabe being surrounded in a gym where only one hits her at a time. Just everything screamed cheesy. Don't take the Micky out of your audience. \nThe movie lacked a blockbuster quality of the original movie, lacked conviction from the cast members apart from Billy and Zack who stood out, lacked an earlier inclusion of Kimberly and Tommy and hurt me to see how terrible it was. But I've given a decent enough rating because the idea was there, we got to see the cast reunite and we got some entertainment.",
    "date": "2023-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love that Netflix special. It's fun to watch and to rewatch as many times as you can. It's like the \"Star Trek: Picard\" and the \"Cobra Kai\" of the \"Power Rangers\" rolled into one, but in a pretty darn good way. My thanks to the cast and crew for three decades of morphinominal adventures. May the Power protect you all.",
    "date": "2023-05-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wow, Go Go Power Rangers. This was an amazing representation of all things power rangers! Power Rangers fans everywhere enjoyed seeing the 90s heroes return to an action-packed blast from the past battle between a familiar face. 5 stars.",
    "date": "2023-05-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was amazing. Thank you for 30 years of adventures, Power Rangers. And may the power protect you all.",
    "date": "2023-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's a love letter to Power Rangers fans, I loved the style of the movie although the rest is very mediocre. It's just 55 minutes try to watch it, it's a great time.",
    "date": "2023-05-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Un especial a full nostalgia, imagino que la idea siempre fue que se sintiera como uno más de la serie original del '93 y lo lograron, solo que se sintió tan fuera de época como volver a los capítulos de la serie original en la actualidad y ver lo mal que actúan esas personas que en 30 años no han mejorado.",
    "date": "2023-05-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I found myself down nostalgia memory lane . I grew up with the original rangers as a kid . I found the story to just be ok though.",
    "date": "2023-05-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Good movie! Nostalgia factor was a plus!! Megazord battle looked clunky but was styled after the old TV show so not a complaint!",
    "date": "2023-05-04"
  }
]