[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Such fun. Loved it.",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 57 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated PG for Thematic Elements, Some Language and Exaggerated Bullying!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!! Filmed in 2022 in color!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Starring Emma Thompson as Miss Trunchbull!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Irresistibly and unabashedly truthful",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I used to be obsessed with this movie cuz it was just so good and I love the songs in it!!",
    "date": "2025-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I wish it was more accurate as the original",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fantastic musical! Definitely watch!",
    "date": "2025-06-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best children’s horror movie I’ve seen in a while. Had a hard time sleeping for a week after I watched this. Main girl is positively insidious, the rest of the children are consistently dark and spidery.",
    "date": "2025-04-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This movie is alright, I love the songs especially at the last song which was Revolting Children like that’s just a banger but yeah it’s a sort of good",
    "date": "2025-03-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Truly a masterpiece of a musical movie. It makes you love all the characters and the music makes it even better than the original. There are some surprisingly emotional and really dark moments and it makes the movie even better! My personal favorite part was Emma Thompson as Mrs.Trunchbull. While everybody did amazing, Trunchbull stole every scene she was in!!&",
    "date": "2025-02-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Daftly choreographed and filled with catchy songs, Roald Dahl’s Matilda the Musical is a lovely adaptation to the beloved book.",
    "date": "2025-02-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's a fun movie for kids.  My daughter loves it!  One thing I think some of the people who have reviewed don't understand is that this is not a remake of the 1996 film.  This is an adaptation of Matilda The Musical, hence its name . . . Matilda the Musical.  The musical numbers and dances are (mostly) adapted from the Broadway musical, though there is one song that was added for the film - and a few that were cut.  If you're not into Broadway musicals, then you should probably skip this.  I personally love them, so I find this film quite enjoyable.  If you don't like Broadway, but your kid(s) (under the age of 12 at least) are bugging you to watch this, just grab your phone or something and suffer through it.  They'll love it!",
    "date": "2025-02-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "They caught the feel of the original movie. I love this movie almost as much as I do the first. The songs are wonderful and the headmistress's character was awesome not to mention the execution. The only thing I didn't like is how in the original, Ms. Trunchbull actively swung around while holding Amanda from her pig tails and the whole scene was long and drawn out and showed Amanda in active danger which really added to how threatening the Trunchbull is. But this one, it was so short and no drawn out action. Just a single swing and she's off. Other than that, great movie and great songs.",
    "date": "2025-01-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The whole film feels a little flat, the songs aren't amazing and the script isn't great. I think the concept of Maltida the musical is a good one, but I think it was poorly executed. I found that the end result is that the film is a little bit boring.",
    "date": "2024-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Absolute  garbage. Ruined with horrible acting, singing. Mitilda looks possessed by a demon instead of having powers. She looks demonic. The rest of the cast were woody and the whole movie is a car crash that never got out of first gear.  If you've watched the original from the 90's, then this night and day.",
    "date": "2024-12-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Didactic and humourless, this core of this film has been remodelled away from the silliness, bite and timing of Dahl to preach simple sentimentality, clichéd morality and victim culture. It has some charm and visual presentation but no one watching it laughed out loud.",
    "date": "2024-12-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I am a massive Roald Dahl film and the 1996 version is one of my all time favourite films.\n\nI absolutely hated this. Musicals on film can always be tricky and as much as this might work as a theatre show it really didn't work for me as a film. It was confusing in parts and incredibly hard to follow the story even though I have watched the original at least 50 times. \n\nIf you grew up with the 96 version I would avoid this at all costs 🤣",
    "date": "2024-12-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It's like someone filmed a terrible school production version and you can't leave because your kid is in it.\n\nIf you want overbearing bland unmemorable songs screeched at you for a few hours and to see all your childhood memories of the 1996 movie adaption trashed then go for it.",
    "date": "2024-12-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "From the lead Alisha Weir to the spectacular Emma Thompson to the dazzling Lashana Lynch, the musical adaptation hits high marks throughout. The youthful talent was AMAZING. I really enjoyed everything about this.",
    "date": "2024-12-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Não é horrível, mas é inferior ao original, com uns personagens avulsos a trama que sem eles não ia mudar porcaria nenhuma.",
    "date": "2024-12-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Alisha Weir is Excellent she has being a Bigtime actress written all over her, looking so forward to seeing more of her, and yes the movie in general was very very entertainng, ..",
    "date": "2024-11-23"
  }
]