[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The Life List premise intrigued me and I wanted to like it but I could smell the plot, overarching story and character a mile away. It dragged on and on.",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Easy watch, tells the story what it says in the tin really. A life list of things a young women was given by her late mother by year end in order to get a house as her inheritance.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The acting was appalling",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Fun, light, heartfelt. Enjoyed the cast",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Cute . Ha. Good cast .",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Don’t even watch. Horrid movie. Portrays glorified cheating with zero character development. 2 hours you will never get back. Go spend time with your family instead.",
    "date": "2025-09-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Nothing groundbreaking and fairly formulaic but not everything has to be super complex and profound. This was quite an enjoyable journey to the exact end we knew was coming. Sadly, though, I might have given up on Sofia Carson being more than a Netflix rom-com actress. Her performances continue to be fairly wooden.",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I don’t know why this got such bad reviews.  Is it super complex? No.  But not everything has to be complex to be enjoyable.  I thought it was a great watch.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Rich white helicopter mom, controls daughter even after dead",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is not your typical romcom movie. No cheesy dialogues which I like. Didn't bother to check the trailer and check what's in store to see but I'm surprised that it felt good after watching the whole story. It didn't disappoint me. A must-watch!",
    "date": "2025-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie has the potential to be soo good but lacks the emotional depth in dialogues. \n\nSome of the interactions between the characters feel forsed and unnatural almost like it was put in just to get the movie to be over an hour. There are alot of good scene's with amazing diologe and acting but there are more scenes that lack just that. \nIt's as if the Actors got tired of each other as they where filming it and then the diologe feels so one dimensional almost like a student with English FAL wrote it for a creative writing peace. \n\nIf this movie was executed better would have been a cinematic mast piece because the cinematography is so good but the dialogue lacks depth and the acting lacks realism.",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "You know how sometimes you see a professional critic's score that's low, and then you see the viewer's scores that are higher? That's usually how I judge whether to watch a movie or not. If the real viewer's score is much higher than the pros, I'm in. And you know what? They were right. This is a terrific movie. In fact, this movie deserves a much higher score than both gave it. This is not your usual romcom or whatever category they've put it into. The writing is superb, the dialogue witty, the characters are well developed, the storyline is not your typical fare, and the actors are all superb, especially Sofia Carson. Wow. The editing is also very very good. There's no corny dialogue, no pandering to the viewers and yes, sue me, but I love a great family/love story that doesn't have a tragic ending like so many do these days. If you want to laugh, maybe cry, maybe feel some nostalgia for your own childhood and growing up issues and experiences, you must watch, \"Life List\".",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I know a lot of people didn't enjoy this movie, but as someone who has lost their mother - within the past few years, it made me laugh, cry, and everything in-between. It definitely had me in my feels. If you like Romance/Comedy, give it a try.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Dull. Messy. Charmless",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I think its a lovely film - what confuses me is why they always get her to fall in love so fast with no story before it happens. Its like she has to automatically fall in love. She barely knew the teacher and thats it... anyway still a nice film with a nice story.",
    "date": "2025-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I consider myself quite generous by rating this movie at 1.5 stars! I watched it till the end... (almost!) had to skip to the last part when I was approaching the end. It's the kind of film that you figure out what happens next! Another thing that bothered me was the fact that it was too damn long! never ending, in fact! This could have easily been a 1.3 hour movie. There was nothing superb regarding the acting, either. Sadly, movies like this make me question if I should keep justifying my Netflix monthly subscription.",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "An unexpected winner. I loved everything about this story. The relationships, drama, humor, and relatability. So glad we took a chance with it.",
    "date": "2025-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely loved this film. Very real, moving and inspiring. A film that inspires you to go after your dreams and to do what really matters in life.",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Ugly cried! Loved the videos… very P.S. I Love You- esque.",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I don’t understand why this is so lowly rated. We really enjoyed this gentle comedy with well defined characters and sensitivity.",
    "date": "2025-07-20"
  }
]