[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "On of the best dog movies ever.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It is one of these movies that goes straight to your heart. Yes you can see the storyline for a mile away. But it is beautifully portrayed, well acted, and recognisable for all dog owners.",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A great and emotional movie, a good dog and a good acting performance, I was sad and wished that his wife did not die of cancer, I was very sad the feelings are indescribable.",
    "date": "2025-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "My 8 year old daughter chose this for our movie night and I just thought it would be another talking dog movie that I’d half-heartedly watch. I couldn’t have been more wrong. I found this film brilliant. Very well shot. True to life (if dogs were to talk). It tells the story of the dogs life from when he gets adopted, until the end, in his words. He has such a great life with his family. There is a tragedy in the movie which struck very close to home for me- I will give nothing away. Had I have known about this in the movie, I wouldn’t have watched it as I knew I would have been a blubbering mess. I was a massive wreck. My poor child was worried for me having never seen me watch a ‘sad’ film. However, I’m glad I watched it. I loved it. Yes it’s sad, but it’s also happy. Life happens. Life is sad at times. It’s also happy. But life always goes on the way it should. The ending is good, lovely twist and happy. \n\nWell worth a watch. But have the tissue ready.",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I am so glad they made this film!! Unbelievably beautiful, truthful and so simple. I didn’t expect this. It is rare to see films like this, it had a profound impact on me.",
    "date": "2025-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "If you love racing and dogs you will enjoy this movie. Crying my eyes out but it was worth it. All the references to the racing sport and Formula 1 in combination with the voice of Enzo was great.",
    "date": "2025-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Not a lot of movies are able to touch my heart like this movie did. I never read the book but I will after watching this film. It’s a masterpiece that’s able to balance the heartfelt emotions this film has. Must watch.",
    "date": "2025-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "THE MOVIE WAS REALLY REALLY GOOD. WE ENJOYED IT.",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Seen this movie a few times and its incredible!  Really easy to follow but it has so many hidden  messages and its great to hear Costner as Enzo's voice.  Being a dog person and car racer this leaves me in a state of emotional heart break for the last hour or so.  It's a unique film with a bespoke approach that makes a refreshing change from the garbage often produced by Hollywood nowadays.  Although I'm not sure how many more times I'm able to watch this film before I'm an emotional wreck! 😂",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing film, definitely hit close to home as I have my own golden. Absolutely loved Enzo’s perspective. Tugged the heart strings and made me sob. 10/10 definitely going to watch this again and again!",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Beautiful movie, told from the perspective of the dog. Tugs at the heartstrings, so keep the tissues handy.",
    "date": "2025-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Dogs and cats!!! Great year jerker.",
    "date": "2025-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Film ruffiano, scritto con mestiere per commuovere utilizzando una trama scontata e una sceneggiatura che al giorno d'oggi potrebbe scrivere chatgpt, a tratti di un irrealismo imbarazzante di cui non si può rendere conto solo chi non sa niente di corse e di Ferrari, immagino che gli Statunitensi siano svantaggiati nel capirlo. Dopo tutto il miele profuso durante tutto il film, il finale è la goccia che fa traboccare il vaso.",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I had not read the book and was surprised that the storyline turned out to be rather philosophical and quite sad, however it was heartfelt, beautiful and one that absolutely reminds you to treasure the important people/animals in life and live in the present moment. Definitely requires tissues - especially if you’re an animal lover.",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Old fashioned tear jerker dogster with a few more takes. Never share a screen with a dog of course. So Costner doesn’t. He plays the dog. Hollywood ending par excellence.",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Many thanks for writing and making this film. I loved it.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This film is overly enthusiastic in it's attempt to guide the publicum but it deserves a 50% because of the strong storyline which ultimately ends up carrying the over all family film experience. This is a sentimental film which delivers what it promises concidering the young audience it's trying to reach. 2 and 1/5 stars out of 5.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This movie is freaking sad. It made me sob definitely recommend as the story is tragic but also sweet",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "made me cry twice. 2md time rewatching",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "my big reccomendation",
    "date": "2025-07-27"
  }
]