[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loooove this movie.... for different reason... i also looove the scrat and scratte scenes! they're so funny!",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "F Art\nD Entertainment\nF Overall",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fu il primo film che vidi al cinema, Buck è un ottimo personaggio, le scene tra Scrat e Scratte sono fantastiche e Sid ha avuto un ruolo molto più importante rispetto ai film precedenti. Ma manca il cattivo, o meglio compare e agisce esclusivamente alla fine del film",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is favorite ice age movies out of all",
    "date": "2025-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Good movie, nothing too special about it. I think Buck is the best part of this movie.",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Aqui, a franquia tem seu primeiro tropeço. A aventura é empolgante, a animação continua linda e a comédia ousada segue sendo um dos grandes acertos da série, especialmente com a inclusão de Buck, o personagem mais divertido de toda a franquia. Porém, os problemas superam os acertos. A Era do Gelo 3 apresenta a ideia mais interessante de toda a saga — um novo universo habitado por dinossauros — e até consegue explorá-la bem em alguns momentos, mas não o suficiente para corresponder ao seu potencial. O filme desperdiça tempo que poderia ser usado para desenvolver essa narrativa com cenas e subtramas inúteis. Além disso, não encontra motivações consistentes para todos os personagens: Diego, por exemplo, fica perdido no enredo com um arco que não faz sentido frente ao que havia construído nos filmes anteriores. A trilha sonora é apenas competente e, no fim, todos os acertos já foram feitos de forma melhor nos longas anteriores. No geral, A Era do Gelo 3 diverte e empolga, mas está muito abaixo do que a franquia é capaz de entregar. Nota 6/10.",
    "date": "2025-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Definitely the best ice age that has been made.",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Super buena la peli %87🍅🧊",
    "date": "2025-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Ice Age: Dawn of the Dinosaurs is the best of the 3 films! It has a character named Buck and he was hilarious, and the story in my opinion is actually very engaging! The characters were also likeable, but for Crash and Eddie, screw them! But overall, the third installment of the Ice Age franchise in my opinion is absolutely one of the best movies Blue Sky Studios has put out there!!!",
    "date": "2025-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The beginning is awful and boring. The baby side plot with scrat is dumb. And the whole baby part is so bad. Also the actual dinosaur part is pretty boring. But the ending was alright at best.",
    "date": "2025-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom, só o esquilo ajudou um pouco no filme.",
    "date": "2025-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Il terzo miglior film dell' era glaciale",
    "date": "2025-06-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Another exciting instalment to the franchise, centred around another extinct species, dinosaurs.\n\nIt does get different from what other Ice Age stories bring out: it is sad that Diego was plotting to leave when Ellie was about to have her child. But soon, the story gets crazy when Sid takes 3 dinosaur eggs to look after as his own & is taken by the mother dinosaur into the lost world of dinosaurs, now that is the most adventurous Ice Age movie.\n\nAnd another unique story was that Scrat had forgotten about the nut & fell for a female (Scratte) who also wanted a nut too.\n\nWe are also introduced to a popular Ice Age character, Buck Wilde, who was enemies with Rudy since he broke out his tooth & Buck lost an eye.\n\nThe best line was when Manny said \"I LIKED YOU GUYS BETTER WHE YOU WERE EXTINCT!\" since there is not so much sense that dinosaurs existed at the same time as animals of the Ice Age. And speaking of Manny, it was lovely to see their daughter, Peaches (sweet, round & covered with fuzz) being born. CAUTION: When you thought that the franchise should have ended there, you are forgetting the one scene in the first movie that shows the next 2 were happening in general.",
    "date": "2025-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love this movie!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-05-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "\"Dino! Cool!\" 5 year olds say",
    "date": "2025-05-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A significant improvement over 2. The characters move the plot, the villain is actually set-up and 100 more intimidating. Sid finally gets some emotional moments with the dinos. Manny, Ellie and Peaches subplot is beautiful. The comedy is actually great, and Buck is an amazing addition, the possums aren't as annoying as in any other installment. This movie is actually decent!",
    "date": "2025-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Actually it is my favourite ice age part. It made the series a little more interesting by introducing Peaches. I would recommend the entire franchise to anyone.",
    "date": "2025-04-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "New character, Buck was funny.  Great to see some dinosaurs",
    "date": "2025-04-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I’ve now seen this more than 10 times. My 3 year old grandson asks for it all the time….Ice Age Dinosaurs. The Sloth is hilarious and my grandson says “he’s a boy he can’t be a mommy he’s a daddy”. Smart kid. Anyway lol at least a dozen times highly recommended",
    "date": "2025-04-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This was a good final! Oh wait there’s more, ok….. but on a more series note, this movie was good.",
    "date": "2025-03-26"
  }
]