[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It has Michelle so I gave something but otherwise falls flat like a cardboard box. Kept expecting a twist or maybe something but no.",
    "date": "2025-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It’s my first time seeing this movie in the end of 2024 and it’s really heart melting , the idea of losing a kid every parent’s nightmare. however, i was focusing on the big brother feelings , the kid and teenager actors were more than perfect",
    "date": "2024-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is amazing I’ve seen some of the comments and as a movie buff for 40 years please have a heart because a lot don’t. This is an excellent movie and the title makes sense with the film. The Deep end of the Ocean references losing their son and the hard times they went through until being reunited again. It’s a parents nightmare and this film shows that. Good job to all the actors/actresses. Michelle and Treat made the perfect couple in this movie. I still watch it 25 years later.",
    "date": "2024-12-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Almost all the adults sucks, they never really thought about the kids. Mostly the characters are unlikable. But the the female detective is unbearable, \"we'll find your son\" 9years later \"oh it's my fault, I should've done this very basic detective work but please comfort me bec I failed\". I wish they focused on the other aspect of the story.",
    "date": "2024-02-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Intriguing premise. An abducted son is raised by a stranger and he doesn't want to return to his birth parents. The film focuses on estranged brothers rather what was, at least to me, more interesting - the dynamic between the biological parent and the \"foster\" parent. Great start, depicting the despair of the birth parent but the rest of the movie felt shallow. Like it was afraid to tackle the parenting issues so it settled on the brother dynamics (even though it has a reason for it).",
    "date": "2024-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I found this movie dull, slow and depressing. It's well made, and the acting is good, but why would anyone want to watch it? I got bored after the child's disappearance, and then it felt like I was being emotionally tortured for the rest of the film. The background music is so sad, it just makes the whole experience worse. I did make it to the end for my review, but I really struggled, and almost switched off several times. It's definitely not my idea of entertainment and I do not recommend it.",
    "date": "2023-12-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "For its brilliant performances and resonant story, The Deep End of the Ocean is too dramatic even for a sad drama. Nevertheless, it remains a film worth watching.",
    "date": "2023-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I always liked this movie as a comfort Michelle Pfeiffer movie.  She is one actress that can carry a movie and then some.   Johnathan Jackson too-they should have given him more to do, because he's got this amazing subtlety from playing General Hospital all his life.   It's like someone dropped the ball in this movie but it's hard to say-script? Editing?   Still, worth watching at least once, if you are a fan of Michelle or Johnathan Jackson-who should have been a big star.",
    "date": "2023-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A very sad story but a must see movie.",
    "date": "2023-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "you start to watch it, there are kids involved, there's some twist. you can finish it without a lot of pain.",
    "date": "2023-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Um bom filme, apesar de no gostar desse gnero de filme.\nOu talvez no esteja no vabe do gnero.",
    "date": "2023-05-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Predictable. Not a feel good movie.",
    "date": "2023-05-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Another waste of time movie.   Whoopi was mis cast, she should have never been in this movie. Drug this movie down.  Poorly written and terrible acting.",
    "date": "2023-05-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Such a beautiful movie, Michelle perfect as always and the whole concept just make You wanna cry with that happy ending.",
    "date": "2022-01-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Shite.   \n________________________________________",
    "date": "2020-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I've decided to watch it mainly because there was the gorgeous Michelle Pfeiffer in it but half way through the movie her acting was so bad I was wishing it was any other actress playing the part instead of her. I always thought of her as being great, she played the best catwoman ever after all, and snatched 3 Oscar nominations over the years. But she's so wooden and unconvincing in this movie that it made me really question if she's really a good actress or has been overrated for her whole career because of her beauty, charms etc..",
    "date": "2020-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The story is powerful and Michelle Pfeiffer is great.",
    "date": "2020-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is such a great movie! I don't know how it doesn't have a higher ratings.",
    "date": "2020-01-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Michelle Pfeiffer stars at Beth Cappadora, a grieving mother of three who struggles with spiraling depression following the disappearance of her three-year old son. Nine years after the incident the family moves to Chicago and encounters a neighborhood boy who bears a striking resemblance to her long lost son. \n\nThe movie is a bit campy at times and never really feels authentic. The actors do well to inhabit their roles, but the music rarely matches the scene and the plot simply unfolds rather than the characters actually driving it. \n\nWhoopi Goldbergâ(TM)s character could have been cut completely, and more time should have been devoted to fleshing out the relationship between John Kapelos and the Cappadoras.  With a runtime of only 108 minutes, it could have easily been extended by half an hour to add a few more scenes with some real drama. Stephen Schiffâ(TM)s dialogue also needed some serious work.\n\nDeep End works, but only barely. Itâ(TM)s worth catching on television, but wonâ(TM)t make anyoneâ(TM)s list of favorites.",
    "date": "2019-04-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Heartbreaking. I couldn't imagine what this would be like. Great movie.",
    "date": "2017-06-10"
  }
]