[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Another movie I'm very surprised I never saw before. It's very easy to watch. It's impossible to not like the main character. You can take some lessons from the movie. It teaches you to cherish every moment of your life and to stay positive and true to yourself.",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Bit of a surprise package. On a bored moment brought it up on Netflix thinking it would be really bad but no. Enjoyed it and dare I say in this day and age more thought provoking than soon serious movies around",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I can’t believe that this movie is so low rated. It was really good and I might say eye opening too",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "In today's context of a superficial society and generations who believe they deserve everything with minimal effort, this film has become a gem.",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Life or Something Like It (2002) is a film that manages to deliver what it promises, it's a bit of a crazy story I know but I actually found it quite fun to watch. I'm starting to marathon some Angelina Jolie movies.",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Just dull... formulaic, predictable",
    "date": "2025-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "One of Angelina's worst movies.",
    "date": "2025-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A very unique take on a female news anchor who wants more out of life and finds out what her true priorities are after she discovers that she has one week to live.",
    "date": "2025-06-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Even Angelina can't carry this. What started as a movie where a professional is doing her best turns into a unlovable romance after getting a life changing prediction. Predictable, unimaginative, and a waste of time.",
    "date": "2025-06-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Jolie was very good and the story was good. A fun time. Tim Treakle",
    "date": "2025-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it!! Good 'Old Fashioned' movie.\nSimple, feel good, heart warming. \nObviously a lot of hate from other reviewer's, but I guess not everyone can appreciate these kind of movies anymore!",
    "date": "2025-05-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Totally predictable and shallow. Jolie had some relationship with a guy, who she now hates in a very convincing way, but somehow jumps back into bed with him; and very confusing, dufnt know he had a son. And the guy plays harsh tricks on Jolie, but is actually a nice guy???",
    "date": "2025-05-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I get why the movie has a low rating. The plot is unrealistic. It's a feel-good movie with a great lesson, though. I don't want to give the movie away but it's a good watch if you want a movie you don't have to think alot about. The actors, the male and female protagonist (Edward Burns and Angelina Jolie) both, did a great job, I thought. I wouldn't watch it again, but I like what it thought me.",
    "date": "2025-05-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This life or death movie was alright. Angelina Jolie, Edward Burns, Tony Shalhoub, Christian Kane, James Gammon, and the rest of the cast did a decent job in this movie. The story of the movie was too dramatic and bizarre. It's about fear of death and living life everyday like it's your last. If you haven't seen this movie yet, you might like it. I didn't like very much though.",
    "date": "2025-04-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie was ahead of its time. It's not perfect by any means, but it weaves together many seemingly disparate parts together to demonstrate a Dark Night of the Soul and the Ego's undoing in a way that was still palatable to the masses. Stockyard Channing excellently portrayed one who did not allow her own Dark Night of the Soul, pushing through to the glittery dreams an empty promises of Egoic accolades and fame. The need for Hollywood to include a romantic relationship and keep a movie under 2 hours were sort of at odds, however, it had a sweet ending, and I was very happy for Laney in the end. People get awfully distracted by Angelina Jolie's looks, and I think that's a shame, because she is an excellent actor, and shines in many different kinds of roles. She was very believable as Laney.",
    "date": "2025-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I mean it's adverge movie, the angela didn't disappoint.  But it's not something. I will watch again.",
    "date": "2025-04-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Although I usually find Angelina Jolie's movies not to my liking I loved Life or Something Like It.  I really think she did a good job in this movie. If she can come out of her shell a bit more and stop holding back with her emotions comedy might be her thing?",
    "date": "2025-04-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I truly love a rom com that's good. This one really did it for me...made me think and Angelina in this she is just truly flawless.",
    "date": "2025-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Angelina as always gives a solid performance on a relatively mundane subject. She is not out of her usual scope in this movie and the twist in the end is about as good as it gets. Could have worked out a more interesting way to address the way that a person reacts when they know that their days are counted nevertheless some cameos and some good acting is always a nice thing to watch.",
    "date": "2025-04-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I signed up for Rotten Tomatoes just to be able to write this review to counter the negative holier than thou review on Forbes of this film.\n\nIt is the first film I have ever watched of Angelina Jolie. The end of the film had me in tears - empowered, uplifted. \n\nThis film is thoughtful, original (contrary to the 21st century corporate money by numbers film making ), and tells a story of what it means to be alive....hint - it's not having the best rating.\n\nI respect this film. I'd actually watch it again - as it inspired me to live well. If you're sick of negativity - doomsday living, drama, trauma and divisiveness, you will be thankful you watched this film.",
    "date": "2025-04-17"
  }
]