[
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Great American and Chinese collab. Family and country being our shared common values. Jackie Chen is a beast and John cena is alright. Apologizing for his Taiwan slip up just stinks of sell out stench…. And it’s hard to unsee his real life actions on the big screen",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Nowhere near as bad as these clear armchair critics claim it to be. Yes the script could have been better. Yet I feel that these supposed critics have decided to scrap all over this movie because they have had to do some thinking and reading of subtitles during Chinese speaking parts.",
    "date": "2025-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1 hour and 42 minutes!!!!!!!!!!!!!!!!!!! Starring Jackie Chan and John Cena as former soldiers!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Applied the “Fast & Furious” logic to climatically peak above mounted set pieces and decent screenplay, proven to be secondarily flawed behind the action-packed visual execution being on par to the dynamical hilarity, which pleasantly verify pure enjoyment and your slightly above average in the action-comedy mixture. (B)",
    "date": "2025-04-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Bad jokes, way too much bad cgi backgrounds and explosions, Jackie Chan too old for the stunts.",
    "date": "2025-02-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Had to give it a watch as I’d seen it pop up on a social media channel and thought Cena and Chan in a movie. This has got to be a great action comedy. \n\nI was wrong. It’s an hour and 43 minutes of my life I’ll never get back. The script is terrible, storyline is terrible and the effects can be done better on an iPhone with a few apps. \n\nThe budget must have been that of a college project. The main actors deserved better.",
    "date": "2024-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Was it a great movie? No. Was it entertaining? Yes.\n\nGood for a a watch, although I did expect more comedy coming from this duo.",
    "date": "2024-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "dreadful and worse than a cheap video game",
    "date": "2024-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "John Cena and Jackie Chan duo make this a must watch if your a fan of action comedies.",
    "date": "2024-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Jackie Chan + Floating guns, cmon mayn ynawmsayin",
    "date": "2024-06-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "In all honesty, well made! Sure got me wondering about how it is even possible to have a cross between Blood Diamond and any Jackie Chan movie. The story was interesting and the relationship among the character is not too shabby either!",
    "date": "2024-05-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Poor story line, poor special effects",
    "date": "2024-04-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I was dissatisfied when there was none of Jackie Chan's usual excellent comedy. The plot was poorly written, and the exploitation of resources by a private Chinese corporation that did not hire any locals, did not make them to be such a saintly group after all. It wasn't believable, and I had to stop watching.",
    "date": "2024-02-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "it was great seeing John Cena and Jackie Chan together",
    "date": "2024-02-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I don't understand the hate this movie gets! Jackie Chan and John Cena in a surprisingly comedic, over-the-top action flick is just too much fun not to sit back and enjoy.",
    "date": "2024-02-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "If you have nothing to see, this is an entertaining option to have a good time. Both John Cena and Jackie Chan lose the seriousness of the beginning a little and do what they do best. The film, although the production is shared by several countries, demonstrates China's advances in special effects for cinema. Chapeau.",
    "date": "2024-01-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Truly terrible movie.  Action scenes and plot similar to 1980's A-Team only without Mr. T which is unfortunate.  Cheesiest lines ever,  even worse than me after a couple drinks at the bar.  An 8 or 9 year old would likely enjoy this movie.  I would expect a fifth grader to have better taste however.",
    "date": "2023-12-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The dream stars duo of some of us. \nHidden strike is a comedy for you if you see it \"Happy\", but the action is something to write home about.\nAbout the storyline, no comment .",
    "date": "2023-12-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "An extremely convoluted buddy with two stars that should be doing better than they are the only thing that really saved this from getting only two stars. Was some interesting camera work even though it was manipulated with not great CG it was still impactful however this mess of a film just dragged off and became something of a background movie, is much better martial art buddy films to watch.",
    "date": "2023-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I really like Jackie Chan but this movie was pretty lame. As usual some good visual effects and fight scenes but otherwise it was a struggle to get to the end.",
    "date": "2023-11-21"
  }
]