[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Terrible. Only have myself to blame as before I watched it I saw a review that likened it to Sorry To Bother You. Gave it the benefit of the doubt which was an error (although marginally better than STBY). Had to watch with subtitles to understand any chance of what was being said.",
    "date": "2025-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Smart, slick and a whole lot of fun.",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I am impressed by this movie. Cast is absolutely amazing. Production is on point & overall everything was great, jokes, writing, directing... Really enjoyed it.",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "(CASTELLANO) Lo mejor que se puede decir de esta película es que sorprende. Arranca con un tono de comedia gamberra, pero pronto se transforma en una mezcla de ciencia ficción, sátira social y thriller conspirativo que no se parece demasiado a nada reciente. Esa originalidad, en un panorama saturado de fórmulas repetidas, ya es un punto a favor.\n\nEl trío protagonista —John Boyega, Jamie Foxx y Teyonah Parris— es la clave del éxito. Su química hace que cualquier escena funcione, incluso cuando el guion se enreda o se alarga más de lo necesario. Boyega aporta solidez, Foxx roba planos con su desparpajo habitual y Parris equilibra la balanza con carisma y frescura.\n\nVisualmente, la película juega con un estilo retro que homenajea al blaxploitation, pero con un acabado moderno y muy cuidado. Esa estética, unida a diálogos rápidos e ingeniosos, le da un aire único que atrapa desde el principio.\n\nNo todo funciona igual de bien: algunos giros se sienten forzados y el metraje podría haber sido más ajustado. Aun así, la energía del reparto y la mezcla de géneros mantienen el interés y logran que el experimento salga adelante.\n\nEn definitiva, El clon de Tyrone es una propuesta distinta, divertida y con más fondo del que parece a simple vista. Una muestra de que todavía se pueden hacer películas originales dentro del cine comercial.\n\n(ENGLISH) The best thing you can say about this film is that it surprises. It starts out with a mischievous comedic tone but quickly turns into a mix of science fiction, social satire, and conspiracy thriller that doesn’t resemble much else released lately. That originality, in a landscape full of recycled formulas, is already a major strength.\n\nThe leading trio—John Boyega, Jamie Foxx, and Teyonah Parris—are the key to its success. Their chemistry makes every scene work, even when the script gets tangled or runs a bit too long. Boyega brings solidity, Foxx steals scenes with his trademark flair, and Parris balances everything with charisma and freshness.\n\nVisually, the film plays with a retro style that pays homage to blaxploitation, but with a modern, polished finish. That aesthetic, combined with fast, witty dialogue, gives it a unique atmosphere that pulls you in from the start.\n\nNot everything works equally well: some twists feel forced, and the runtime could have been tighter. Still, the energy of the cast and the blend of genres keep things engaging and make the experiment worthwhile.\n\nIn the end, They Cloned Tyrone is a distinct, entertaining project with more substance than it first appears. Proof that original films can still thrive within commercial cinema.",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "so good!!!!!!!!!!!!!",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very entertaining! I often fall asleep during movies, but I was on the edge of my seat. Great music too.",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Please watch. And listen.",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Clever, and gleefully fun. They Cloned Tyrone is one of the best films of ‘23.",
    "date": "2025-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What an amazing combination of moods… I’d like to think anyone would watch and enjoy this, action, science fiction AND comedy? I did not have any expectations before watching and yet I’m not disappointed, very stimulating for the mind. The aesthetics were also very pleasing I have to add.",
    "date": "2025-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "pretty good movie. funny and engaging. maybe a little drawn out, and a few holes in the plot. in my view, some of it doesnt make sense. but overall a good movie",
    "date": "2025-06-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I have no idea why I decided to watch this but I enjoyed it. Mix of Brave New World and Get Out. Great acting from everyone. Pulp Fiction-style snappy, funny dialogue. I don't usually like sci-fi but this was very good!",
    "date": "2025-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The most successful sci-fi action in 2 hours and 2 minutes!!!!!!!!!!!!!!!!!!!!!! Rated R for Some Sexual Material, Pervasive Language, Drug Use and Violence!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-05-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Narratively familiar as well as circumstantially on the thought-provoking speculative ground with complex imagination, this strange vision is stylistically sharpened as indicatively scripted and terrifically delivered on a humorous thought. (B+)",
    "date": "2025-03-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Great cast, funny but also suspenseful, many plot twists, and makes you think multiple times throughout the movie",
    "date": "2025-03-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This movie is actually really thought provoking. Who does the government target??? You know who!",
    "date": "2025-02-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Honestly the movie should’ve had a more subtle title, I think the early big reveal would’ve been a lot more impactful if the audience didn’t see it coming.\n\nAs for the movie itself, it was a really fun, well-written, well-made movie that does some really unique things. The whole cast really shines here and it’s such an interesting premise. John Boyega gives an especially incredible performance as Fontaine.\n\nThe only complaints I really have with the movie are:\n1. The graininess, which was a clear stylistic choice, but made some of the darker scenes in the movie difficult to see\n2. The movie has such an interesting premise that I wish they had done a little more with the whole “clones” thing. There were a few opportunities to use that to do some really interesting things, but it feels like they held back.",
    "date": "2025-01-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A lot of fun, and a largely unpredictable story at first. Equal parts mysterious, weird, freaky and fun - and the actors are clearly enjoying themselves. Pretty sure there's some social commentary here that I need to better understand, but that will require another watch or two.",
    "date": "2025-01-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A hilarious and sharp-witted satire that brilliantly blends so many genres together, from 70’s blacksploitation to sci-fi to noir mystery with some excellent commentary on racial stereotypes and the systematic conditioning trying their best to reinforce these stereotypes and keep the disenfranchised locked in their corner. John Boyega, Jamie Foxx, and Teyonah Parris are all fantastic and share great chemistry with each other. The movie starts a bit slow, but it pays off when they start playing with Tyrone’s daily routines after the cloning reveal. The movie had me in stitches at some points, and there’s plenty of solid commentary and sharp writing to back up the goofier aspects of the film. The worldbuilding and lore of this movie’s version of the American government and their clone experiment communities is very intriguing and really makes you feel like there’s a whole crazy world to explore. The art direction and cinematography are very solid as well. This is easily one of the most underrated films of the year and is my kind of post-modern intellectual shitpost.",
    "date": "2025-01-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The jokes aren't funny at all, and the societal commentary is really cringey and ham-fisted. I somewhat enjoyed the grand finale, but it definitely didn't need a 2 hour film to establish.",
    "date": "2024-12-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I don't understand how people are saying great things about this. It's as if they watched another movie. In my experience, They Cloned Tyrone was raunchy, dumb, boring, drawn out (and its two hours long) and could not wait for it to be over.",
    "date": "2024-09-20"
  }
]