[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Army of the Dead has a solid premise - a zombie heist set in a quarantined Las Vegas is undeniably exciting. But somewhere between concept and execution, the story loses its footing and never quite recovers.\n\nThe characters are so fundamentally underwritten that the few who actually deserve attention are pushed to the sidelines like Coyote and Dieter, and I would have liked to see more from Peters, yet we barely see enough of them to care. \nInstead, we’re force-fed a focus on Scott and Kate, which is genuinely baffling. Scott, okay fine he’s the designated lead. But Kate? What cosmic purpose does she serve? She is just simply… there.\n\nThe entire subplot where Kate wanders off to rescue Geeta feels like it was stapled onto the script during a coffee break. Are we meant to believe she’s suddenly a savior of the oppressed? Nothing in the film builds that foundation. One sad glance at a group of kids does not create a character arc. And as for some of the other characters, I won’t waste oxygen discussing motivations that barely exist.\n\nTo the film’s credit, the idea of zombies evolving into a structured society with hierarchy and leadership is genuinely fascinating. Had it been introduced with care or explored with depth, it could have set this movie apart. Instead, it’s rushed, overshadowed, and ultimately feels like an afterthought buried beneath chaos and noise.\n\nA bold concept, strong visuals, and a premise brimming with potential and yet Army of the Dead ends up a massively missed opportunity to deliver something great. Still, with lowered expectations, I would say it's a solid one time watch.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Army of the Dead (2021) The first 30 minutes are quite boring, the characters are rather weak and lack any charisma. But if you enjoy watching zombie movies, I recommend you watch this one. I was also expecting to see a lot of action, but there isn't much.",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Point one, desperately wants to be cool and stylish; fails miserably at both.\nPoint two, bad acting, bad dialogue, formulaic in a poorly executed way.\nPoint three, 25 minutes into it and it's still in the introductory chapter.\nSlow as shite.\nNot spending two more hours with this.",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Okay, so the story wasn't the best, but there were some good parts. I hated how blurry some of it was, it really bugged me. But the zombie scene in the hallway? That was awesome.",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Superb writing,acting and AI. The two and a half hours flew by. Dave Batista once again proves of all the wrestler actors he's the best. Loved the zombie tiger and horse. Very imaginative.",
    "date": "2025-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I liked it. I wish the zombie rules were a little clearer. Entertaining.",
    "date": "2025-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Army of the Dead was a Netflix movie about zombies in Las Vegas. Naturally a casino heist is involved so cue \"putting the team together\" montage and then add in zombie tigers, zombie horses, robot zombies, martial arts zombies, even pregnant zombies. The action is fine, CGI is marginal at best, Dave Bautista is good, but the way the movie is shot with the blurred background gets annoying fast. Overall, the run time is too long, the plot is silly, but if you like zombie movies then you might like this.",
    "date": "2025-06-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The worst ending ever please dont waste your precious time on this stupid movie everyone are dead and got no cash with them what a disappointed ending",
    "date": "2025-05-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I just adore the characters, I acknowledge the plot and movie itself is honestly terrible, but the characters are so lively and fun and enthralling. Love them to bits. Like it's absolute trash of a movie, but the characters are so amazing and lively that no matter what the plot was I'd love watching them.",
    "date": "2025-04-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Not great but still a lot of fun.",
    "date": "2025-04-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great zombie flick, the opening sequence alone was top tier over the top entertainment. The movie was flashy, great cast, and great story. So many questions that I just can't wait for it to be answered. Lots of crazy things you will spot after rewatching multiple times. Zack set a good foundation for a hopeful franchise to take off. Except that is never going to happen now because netflix quietly stopped all production of Lost Vegas and Planet of the Dead.",
    "date": "2025-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "There are screens in the move that just don't make scence. For example the death of Ana de la Reguera was just not staged right. \nEmotions are not done right by most actors .",
    "date": "2025-03-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Was bored all along !",
    "date": "2025-01-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Good movie I hope to see, what will continue if it has a sequel.",
    "date": "2024-12-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Not a bad movie, a regular, simple zombie movie, the zombie tiger surprised.",
    "date": "2024-12-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A mindless spectacle with poor dialogue and a horrid, saturated soundtrack. I'd rather stick pins in my eyes than hear that smug, shrieking, god-awful Viva Las Vegas cover ever again in my life.",
    "date": "2024-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Barrista ruins the movie. Can't act just grunts. Why does hokeywood keep casting him?",
    "date": "2024-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This is a cheap, lazy ripoff of the much superior movie \"Aliens\" by James Cameron... it has the same premise, the same second half (a nuclear blast is going to happen so they have to get out of there in a flying vehicle, that is gone when they arrive to the landing pad) Some people might liked it, but those of us who know the Classics, the Originals and the GOATs we simply won't fall for this, campy, cheap copy",
    "date": "2024-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "“Army of the Dead” is a thrilling cinematic experience that brilliantly blends action, horror, and a touch of dark humor. The movie’s intense pace keeps you on the edge of your seat from start to finish, with each scene carefully crafted to deliver maximum impact. David Bautista’s performance is nothing short of extraordinary; he brings a deep, emotional complexity to his character that adds a surprising layer of depth to the film. His portrayal of a conflicted hero navigating the chaos of a zombie-infested Las Vegas is both compelling and memorable. The ensemble cast, stunning visuals, and innovative take on the zombie genre make “Army of the Dead” a must-watch for fans of action-packed thrillers. It’s a masterful blend of storytelling and spectacle, and it’s easily one of the best movies of its kind.",
    "date": "2024-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Love this movie the only reason it isn’t higher is because of the daughter she was the cost of everyone dying for her stupid cause lol",
    "date": "2024-07-31"
  }
]