[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "If you enjoy family movies, you’ll surely love this film. It’s a stress-free watch, with everything feeling calm and comfortable—aside from the antagonist, of course. Still, it was a great film overall, highlighting family love and relationships.",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The logic comes in the second movie?",
    "date": "2025-06-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "At times critics seem so friggin stuffy and full of their oh so sophisticated opinions.\n\nWe found this film an absolute delight, and the ‘twins’ had us laughing with their spot on rendering.",
    "date": "2025-05-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Such a fun film! I remember watching this film as a kid and I remember how fun and cute it was. I love Mary-Kate and Ashley and there is amazing chemistry between them and all of the adults in the film. This film is such a cute and cheesy film and I consider it a classic.",
    "date": "2024-12-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I’ve seen this movie over 50 times. Loved it as a kid, and its charm persists into my adulthood. I don’t know how this movie could only have an 8% rotten tomatoes score! It is a fun and silly family movie that is very good for what it is. Not every movie has to be some profound think-piece. Sometimes it’s ok to have a little fun. I think the critics that review movies like this poorly must have terribly sad lives because it seems they’ve lost the ability to enjoy some old-fashioned whimsey.",
    "date": "2024-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fantastic movie! Loved watching this as a kid. Funny, witty and love.",
    "date": "2024-03-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Definitely similar to Parent Trap, but very fun and lighthearted! A great watch that's full of nostalgia.",
    "date": "2024-02-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie for kids!\n\nWatched it with my niece and her friend, we enjoyed it very much.\nIt was funny and had a little romantic touch.",
    "date": "2024-01-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Adorably cheesy and charming to the max, It Takes Two is a comfortable, feel-good flick. It recals childhood summer joys and endulges the fantasy of attaining rich parents. What more could you want?",
    "date": "2023-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It Takes Two is a 1995 romantic comedy starring the olsen twins,Steve Guttenberg and the late Kristie Alley. \nTwo girls who are identical to one another switch places while the girl's adopted mother Diane (Alley)falls in love with a guy named Rodger(Guttenberg) who's daughter Melissa(Ashley Olsen) is similar to Amanda(Mary Kate Olsen). But Roger however is engaged to a gold digger and its up to the two girls to get Diane and Rodger together.\n\nIf you love The Parent Trap with Lindsay Lohan then you'll love this film.",
    "date": "2023-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's got a load of character and plot holes, but it's still the pioneer of dual star's likeable enough classics.",
    "date": "2021-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It's not bad. I haven't seen it since I was a kid, and as an adult with almost fully grown kids, it hits differently. I found myself thinking Claire Kensington was right about a few things, and really did nothing wrong.",
    "date": "2021-03-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Good movie for the most part. A few scenes dragged on and bored me, and some too dramatic. Although, the humor was amusing and the plot was creative!",
    "date": "2020-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "one of the best films I've seen and I didn't understand why took out\n8% this film is all",
    "date": "2020-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I liked it better when it was called The Parent Trap.",
    "date": "2020-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "For what it is, classic!",
    "date": "2019-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I absolutely love this movie. The characters are relatable and funny, and it brings nostalgia of summer camps for anyone who has ever gone. It even makes you wish you were a child again.",
    "date": "2019-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie watch it",
    "date": "2019-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "We've seen this movie enough times to quote every line.  Seen it dozens of times.  Yes, there are some cheesy lines, and the acting is a little wooden, but you expect that from kids.  Kirstie Alley and Steve Guttenberg play great parts, and the lines that Philip Bosco gets are the best in the movie.",
    "date": "2019-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best movie ever made.",
    "date": "2019-03-31"
  }
]