[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wow!! A must see that left me on the edge of my seat the entire time!!",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Maverick is interesting from start to finish. 🤩",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie, A great Sequel to Top Gun, my only issue is with the music they chose for the beach football segment, it did not go with the movie, in fact it sucked, so much great music out there and they chose that",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Seen it like 6 times. 10/10. Intriguing, action, great story line. Keeps you on your toes. Highly recommend",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Awesome movie! A must see!",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Pure cinematic entertainment. Must be seen in a theater at least once.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Doesn’t get any better than this !!No political agenda just a great movie watching experience.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Its exactly what you expect. 5 stars.",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "MASTERPIECE!!! 20 out of 10!",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Me and the dads vibed hard to this",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thought it a absolutely perfect film I absolutely recommend it to you all people who like the original  one I think it one of the best film in cinema history  it absolutely perfect film I absolutely recommend it to you all people who like the original one it one of the best  move in my opinion i think it was perfect film  it my favourite 95 film I absolutely loved it a absolutely perfect film I absolutely recommend it to you all people who like the original one film",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Greetings from Lithuania.\n\nI wasn't the biggest fan of first \"Top Gun\" movie. I saw it like 5 years ago so for me it wasn't nostalic or anything. It was just OK movie and nothing more.\n\nToday i saw \"Top Gun: Maverick\" (2022) in cinema. And it blew me away. This movie was incredible. It literally put a smile on my face. Action scenes in the air were the best i ever saw of this type of action. Directing by Joseph Kosinski was perfect. Music was on spot. Cinematography was gorgeous. I loved how actually calm and quite this movie was, until it wasn't and transition between scenes, acts, calm and action was perfect. Acting was great. This is a movie making as good as it gets. Was it predictable? Yes. But at the same time i was excited and glued to the screen during its whole 2 hours run time.\n\nOverall, \"Top Gun: Maverick\" is a Hollywood blockbuster done right. Its a Hollywood action adventure movie in every possible way, yet this time its done incredibly good. What a terrific sequel.",
    "date": "2025-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "All the fight scenes where perfect. The suspense was amazing🔥",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Peak cinema I will never get tired",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Terrible movie. Extremely predictable and a poor ripoff of the original. The original is believable and authentic. This stretches reality and the production team clearly did no research.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Top Gun: Maverick shockingly pulls off the small miracle of not only matching the original's quality, but actually surpassing it, delivering a thrilling sequel that stands as a triumph. This is good old-fashioned, wild action, boasting breathtaking, practical flight sequences that are visceral and genuinely spectacular, all while delivering a surprisingly emotional and satisfying story.",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Entertainment that rescues almost 100% of the elements of its predecessor and replicates it in an accurate and improved way, full of action, humor, drama and beautiful people in Top Gun, in addition to Maverick.",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Top gun was a good movie tom cruise was awesome",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The flight action sequences are spot on and allow the viewer insight into the talent of our top fighter pilots. Story mirrors the prequel in some respects but this is offset by the pace and visual impact of this movie. Storyline held together by the actors /actresses (not just leads) even if at times a bit unbelievable. A great film to watch again and again even if it is for the flight sequences.",
    "date": "2025-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "88/100 - back to the theater with a bang",
    "date": "2025-10-16"
  }
]