[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "My all time favorite movie. Riveting! On the edge of your seat movie with surprises at every turn. I've seen it about 20 times and will watch again!",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Excellent acting. Strong script.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Solid, star-studded long-form book-to-screen story covering the usual raft of themes found in many a John Grisham novel. Well-acted, and well-told, if a tad longer than it could do with being",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A must watch, amazing acting, unpredictable, it's long but the suspense pulls you back. It elicits the emotions expected. I wish i saw more of the daughter. I am just surprised the daughter was not used as a witness in court. Not sure if she was not old enough.",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The performances are strong, the issues provocative.",
    "date": "2025-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very difficult to watch, gut wrenching. All star cast performs convincingly in character. Very well written, albeit a bit drawn out. Great cinematography. Very memorable movie filled with all the elements that makes for a courtroom drama and then some.",
    "date": "2025-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This is probably a case of not aging well, but this is so obnoxiously Hollywood. The script is pretty bland, in spite of the setup being interesting. It gets fantastical and a little cliché, however. The performances are good and it’s a solid movie, just not special, at least not by today’s standards. The story does hit intense, moving beats at times, though.\n\nThe big famous line in the climax though is an absolute banger. Easily the best writing in the whole thing. But it's just one line (with a great build up to it).\n\nWeirdly, it feels set way before the '80s, and most characters come off like caricatures, cartoony even. The scenes of black protestors versus the KKK rioters is so exaggerated, serving to smooth the edges of racial hatred that should feel extremely raw and volatile and ugly. Very Hollywood, very palatable, perhaps except for the opening scene, which is a hard watch. But then, of course, everything wraps up with a neat happy ending and the bad guys *finally(?)* getting arrested after the court hearing (why they waited, no clue). Tie the bow, roll credits.",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wow. This movie was absolutely gut-wrenching—10/10. The acting was superb. Make sure you have a box of Kleenex ready for Matthew’s closing statement in the courtroom; it’s unforgettable.",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Top notch in every way. Huge stellar cast. It's from a John Grisham novel so you know it'll be an interesting, captivating story. TERRIFIC film!",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie to watch. Emotional!",
    "date": "2025-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A Reliably solid legal thriller that has way too big a middle and repetitive themes and scenes to make it all the way there.",
    "date": "2025-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was honestly amazing. It had me emotional, and I couldn’t stop thinking about it after. The story was tragic and intense, and the cast was incredible. I was super impressed by everyone’s performances, especially Matthew McConaughey—his courtroom scene at the end actually brought me to tears. I’m not sure how realistic the trial part was, but that didn’t really matter to me. As a viewer, I cared more about how the story made me feel, and it really hit hard. I also wasn’t sure how realistic it was that people were so open about being in the KKK, but maybe that’s just how it was in Mississippi. Either way, that part didn’t bother me too much—it just made me think. Samuel L. Jackson and Sandra Bullock were both amazing too. This movie had so many powerful and emotional moments. I’d definitely watch it again and recommend it to my friends and family. Easily a 5 out of 5 for me.",
    "date": "2025-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of those rare movies that lingers in your mind, making you think well after it’s over.\nA heartwarming courtroom drama. Loved it!",
    "date": "2025-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Outstanding performances and an interesting plotline. All in all, a really good courtroom drama, even if it's too long.",
    "date": "2025-05-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Really awful.. given the cast. \nAn apparently serious story strung together by cliches. So much stereotypes 🙄 \nPossibly worth watching because Sandra Bullock is always brilliant 👍",
    "date": "2025-04-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Underrated film with standout performances",
    "date": "2025-03-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "poignant with touching performances by both Matthew and Sandra",
    "date": "2025-02-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Top-notch courtroom drama that, to me, sets the bar for its genre. An All-Star cast delivers in spades, and its incredibly well-told, powerful story makes this an annual watch in my house.",
    "date": "2024-12-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The movie was ok but the screenwriter should have been fired for the adaptation. The book was much more nuanced, better storyline and much more logical in its presentation. It felt like each character was cheated out of any development to advance the story. The re-writing of the closing argument compared to the book made for a quick and illogical ending. Lots of fine actors wasted in what could have been a great movie.",
    "date": "2024-11-24"
  }
]