[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I probably got 15 minutes into the movie. I stopped it shortly after Sofia started the cooking classes with her mom. Sofia is 29 yet such a brat. Her mom is so sweet helping her out, and Sofia is ageist against her mom and friends, whiny, and annoying.",
    "date": "2025-01-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Again Americans showing that they are completly ignorant about other culture/country ( no guys, you are not the only country on earth). \nA Spanish that speak like a latino american ( nothing against latino American spanish )... And say incorrectly how to pronounce Gracias 🤢 Clearly not the actors fault! But come on guys, don't you have spanish people in US just to ask advice, a bit of research before producing a movie never killed anyone!  And I'm not Spanish, so is not personal for me, just annoying to ear/see, couldn't finish it. \nAnd again is not the acting of the actor, is how an empty fake lead character was created, not even managed to get on the stereotypes!",
    "date": "2024-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Was it bad? No. But was it good? No. It certainly had a lot of good moments that made me want to keep watching, and there are some parts that are unintentionally funny, but they would always get ruined by having the worst scene follow it. The sex scene was entirely unnecessary and made me cringe so hard, it definitely made it so I wouldn't recommend this movie to anyone even as a joke. The main character wasn't likable, and she was complaining about work when literally nothing happened. I liked the love interest, but I just felt like it was awkward at the beginning and one of those movies where you can't understand why he would like the girl. She was just rude and mean to him at the beginning and he didn't seem to care. In addition, when her ex came back I had no idea who he was because we saw him for maybe 5 seconds. The time didn't move well at all either. You're telling me that she applied and got accepted to college in a less than 10 day montage?",
    "date": "2023-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Gorgeous thirty year old girl goes home and catches her boyfriend with another girl.  Girl crying, goes home to mom.  Mom enrolls her at a cooking class in a Spanish restaurant.  How convenient that there is a handsome, polite Español nephew of the restaurant owner.\nPredictable, color by numbers, familiar ingredients to make up this romcom.  I'll give it sweet.  Of course, they fall in love.  A nice little story we've seen dozens of times before.  It's watching this movie while doing wordle, sudoku, and updating your IG.\nA nice little chocolate con churros type of movie.",
    "date": "2023-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Fun movie.  Nice, cute, romantic story.  Nothing more, nothing less.",
    "date": "2022-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Rotten indeed. Ghastly wooden acting across the board and a terrible soooo predictable plot and script. Awful",
    "date": "2022-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "IN A NUTSHELL:\nAfter her job and relationship implode on the same day, Sofia starts from scratch and meets a dashing Spanish chef who might be her missing ingredient.\n\nThe romantic comedy was directed by Shaun Paul Piccinino, and written by Ali Afshar, John Ducey, and Tiffany Dupont.\n\nTHINGS I LIKED:\nI had never seen Riley Dandy in anything before. She is a cute actress, although her character's personality was a bit self-centered and annoying. That's a serious problem for a romantic comedy if you don't like one of the romantic leads.\nNancy Lenehan was adorable in her role. It was great to see her in something again.\nI lived in Spain for two years, so I loved that element of the story; however, some of the characters didn't actually look or sound Spanish. That was disappointing.\nI had foot surgery and had to wear one of those boots for months.\nI really enjoyed the cooking class scenes in the restaurant.\nI was impressed with all of the secondary characters, even those who didn't have very many lines. They all seemed believable and natural. The director did a great job creating a realistic, fun environment on set.\n\nTHINGS I DIDN'T LIKE:\nIt's super predictable and full of rom-com cliches.\nThe ex-boyfriend and ex-girlfriend were paper thin, making it way too easy to not like them.\nIsaac Gonzales Rossi's character is sweet but almost too smiley all of the time.\n\nTIPS FOR PARENTS:\nKissing\nFighting\nSuperficial characters\n\nTHEMES:\nChoices and consequences\nRomance\nSecond chances\nFood\nRelationships\nCourage to walk away from bad relationships.\n\nYou can see the full review on the Movie Review Mom YouTube channel.",
    "date": "2022-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I thought it was alright. I wouldn't say it's one of my favorite rom-coms or anything but it was watchable. I wouldn't watch it a second time though.",
    "date": "2022-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "She is American. He is Spanish. \n\nShe loses her job, finds out that her boyfriend is a schmuck, sprains her ankle and moves to Sonoma to spend some time with her mother. \n\nHe is a chef who is passionate about food and positive about life. Is he that one ingredient that will spice up the recipe of her life?\n\nThat's Amor is a sweet film that offers real characters in relatable situations. The lead pair is cute-as-two-buttons, the mother-daughter equation is sweet, as is the budding romance. The jerk boyfriend and finale are predictable, but hey this is Hollywood!",
    "date": "2022-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I really enjoyed it, not sure why its getting such poor reviews. The leads are charming, the food and drinks makes me want to go out for tapas and sangria right now! Easy feel good watch for a lazy day.",
    "date": "2022-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The perfect movie to escape from all the bad news in the world right now. So charming!",
    "date": "2022-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It was cute, passed the time on a lazy Sunday Afternoon. Wished I had a Sangria while watching.",
    "date": "2022-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's an adorable, feel good movie. Just what I was looking for.",
    "date": "2022-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "it was cute! I enjoyed it, and they were a cute couple!",
    "date": "2022-08-28"
  }
]