[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Oh my gosh this movie was fantastic. The jealousy, gaslighting, spineless whinny white man entitlement because a more intelligent, and deserving woman got the job he thought should be his.  I loved this movie and Phoebe Dynevor and Alden smashed it out the park. Netflix paid a lot for this movie only to let it down. Had all the potential to been an award contender.",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "6.7/10 — \"Decent\"/\"Worth Watching\"\n\n-(Seen on 9/17/25)",
    "date": "2025-09-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Fair Play on Netflix starts off as a seemingly passionate romance between Emily and Luke but quickly descends into a disturbing and unsettling portrayal of power and ambition’s corrosive effects on their relationship. I have to give it a high score for the acting—the performances were strong—but the content, although I guess possible, was not right for me. The graphic swearing and explicit, often uncomfortable, sexual scenes made it a tough watch. The ending left me feeling disturbed, and overall I wouldn’t recommend it unless you’re prepared for a grim, intense experience.",
    "date": "2025-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I don’t normally like drama’s but Fair Play is a really good, and dramatic tale of two pre-weds. Alden Ehrenreich Is fantastic, he plays such a jealous little infant so well I wanted to strangle him!",
    "date": "2025-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Waste of time, absolutely cannot recommend it to anyone except a mentally disabled person",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's a solid thriller that banks on tension of gender in the workplace. But at some point, it turns so far left that it doesn't make sense anymore.",
    "date": "2025-06-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Would not watch again, ending was trash. Good concept, bad production.",
    "date": "2025-02-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This film is about a relationship between two people with significant psychological problems.  Although the ending seems like a conclusion to their destructive insanity, it's doubtful it is.   They are trapped in a never ending cycle of their sick pathologies, insecurities, self loathing, and unhealthy co-dependency.  There is nothing redeeming about this movie.",
    "date": "2025-01-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Might be the worst movie I’ve ever watched",
    "date": "2025-01-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Unlikeable people, so unlikeable they don't even like each other. Very slow and nothing really happens, certainly nothing thrilling.",
    "date": "2024-12-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Edge of your seat tension watching this couple devolve from love to hate. A very good movie maybe not for everyone but I thought it was great.",
    "date": "2024-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The ending was highly unrealistic and unnecesdarily vindictive, spoiling what could have been an interesting exploration of how power shifts affects gendered relationships in the awful setting of financial services. Not a single character you can respect by the end of it, no dignity, no reasonable interactions, no grace.",
    "date": "2024-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "If the RT popcorn meter means viewers who can't handle uncomfortable situations or looking for feel-good movies all the time then it is meaningless because this is a great movie that made me edgy for the whole duration. It's not fun, it's awkward, you want to hide behind the sofa but it's brilliant. Most of this film is high tension but its last quarter is positively disturbing as the main characters disintegrate whilst all characters show their worst side but in a way that nobody can predict.",
    "date": "2024-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Horrible, shallow, self-absorbed, materialistic people being horrible, shallow, self-absorbed, and materialistic.  The only thing I enjoyed was seeing them getting exactly what they deserved.  Are we supposed empathize with or  cheer for anyone in this stupid film?",
    "date": "2024-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Moral of the story is don’t get romantically involved with coworkers…I love movies that are able to create so much intensity and tension over micro events, so overall this worked for me. I really loved how you could tangibly feel and empathize with what both sides of this war were feeling, rather than being a one sided perspective. Falls shy of 3.5 stars because the ending cheapened it for me.",
    "date": "2024-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A well done and acted movie, but the forced way it ends, it leaves you with the conclusion that the career at a corporation is more important than your personal life.",
    "date": "2024-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It wasn't a thriller.  It was 2 people putting money ahead of everything else in their life. You start off sympathizing with them hoping they survive as a couple but then the stupid things each one thinks, then actually says, just shows neither is grown enough to have a partner. SPOILERS:\nHer first mistake was offering her bf HELP to get promoted. How could he have any autonomy or esteem as an individual after that, professionally or as a husband? I'm a wife & would only help my husband professionally without him knowing, if he needed it. But I would always give him all the credit to everyone, him included, but because he does things all the time to help me in ways that no one needs to know about. Don't destroy someone's respectability. \nOne of his MANY mistakes was allowing his professional goals & obsession with the boss to come before himself, & his future wife, literally pledging himself on his knees, calling the boss \"his god\"... cringe! After that, I could not marry him or have him working for me. Because he has no self respect, at all. Only God deserves worship. He only gets cruel & stupider after that",
    "date": "2024-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Started off strong but then devolved into something way  too over the top as to not be believable.",
    "date": "2024-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's unclear what exactly brought this couple together to begin with. The lady is beautiful and smart but the guy is neither nor is he witty. He doesn't make her laugh and he never makes a smart impressive move. In none of their conversations do they ever reminisce about the past or anything that would indicate a reason for a connection. You end up cheering for the lady to leave him but she takes too long and because of the lack of connection or challenge from him it's unclear why she sticks around for so long.\n\nDespite this major flaw, the movie's mood and flow is entertaining and only because of this do I give it 3 stars.",
    "date": "2024-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This movie has all intentions of being a thriller, but falls short at completing the story line. I have a lack of good news after watching this movie and would not recommend the waste of time.",
    "date": "2024-07-08"
  }
]