[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This is a fairly fun and wacky movie, with a look into the early days of Jim Carry, making it a nostalgic goldmine.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was amazing to watch with the power of cartoon physics",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was entertaining and funny to watch! It was good acting of Jim carrey. Good thing it was on Netflix.",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "film very creative and funny protagonist very good  and antagonist very good i like character  musical:9 acting :10 history:10 final note:10",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I really liked this film, it's an funny movie, I recommended who likes comedy movies to see in free times alone or with somebody. The film starts with a sad bank teller named Stanley Ipkiss that find a mask that gives powers to him, his life sucks so when he finds this mask, his life changed completely, the police tries to get him and some bandits try to get the mask because of the powers to get revenge on your boss.",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Smokin good barbecue!",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Not for me. I didn't care for the humor and thought the movie was quite boring.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "So funny and I absolutely love Jim Carrey",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "THE MASK lets Carrey go full cartoon—wild, elastic, and a little bit filthy. Beneath the chaos there’s a pulse, a sweetness that makes all the madness land.",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Such a fun movie were Jim Carrey does what he does best. The super energetic lively funny character. Jim Carrey's best movie by far.",
    "date": "2025-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "3.5 stars;   I was really stuck on Jim Carrey movies back when he was funny: \"Ace Ventura\" series, \"Dumb and Dumber\", \"Liar Liar\", and of course, \"The Mask.\" This was a clever spoof of the popular superhero movies of the 90s. What made this a completely out-of-the-ordinary comedy film was the hilarious physical humor of Carrey. A gold star assist goes to the CGI special effects, ala \"Roger Rabbit\", and the sexiness of Cameron Diaz.",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Such a fun and great comedy with a great performance by Carrey",
    "date": "2025-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It’s always fun to go back to this 90s classic. Jim Carey leaves heart and soul in here but the revelation was Cameron Diaz, from the first moment I saw her big entrance was incredible. What a beautiful human being!",
    "date": "2025-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I just knew that this movie looked like trash. But I was bored one evening, and I figured that maybe this was just as good as his Ace Ventura movies. Nope! A far cry from his Ace Ventura movies. I didn't care for this at all.",
    "date": "2025-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "What I love about this film is Jim Carry's acting which made me laugh out loud, and it's a shame he didn't return for Son of the Mask. We could've had a better sequel than the horrible Son of the Mask.",
    "date": "2025-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The Mask is one of the quintessential ’90s films. I watched it endlessly growing up, and every time felt just as fun as the last. Even though it shows its age now, it still stands as one of Jim Carrey’s best performances.\n\nWhat doesn’t work: the villain. He’s dull, his plans are uninspired, and his motivations are scattered — revenge, rage, stealing the mask, winning over Cameron Diaz (which, sure, I get). It’s as if his character description only said “be villainous.” It feels like the idea was to make him a serious counterbalance to the Mask’s chaotic energy, but Carrey could have created that contrast with almost anyone opposite him. The story drags whenever the villain is on screen, especially after he finally gets the mask.\n\nWhat does work: Jim Carrey. No one else could have played this role the way he did. Lines that would sound cringey in anyone else’s delivery unfortunately became my personal catchphrases as a kid. The CGI — especially for the time — was phenomenal, blending cartoon animation and physics into live action in a way that still looks good. And, of course, that dance scene. I could write an entire review on that moment alone.\n\nWith its dark comedy tone, Carrey’s unforgettable performance, and impressive use of CGI, The Mask remains an endearing and lasting piece of ’90s pop culture — even with its weaker antagonist and uneven story. The mask is one movie I’m happy to say represents the 90’s in the best way.",
    "date": "2025-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it! This movie is in so many ways innovative and groundbreaking. Amazing cinematography and stunning visuals. Great story and nicely brought to screen. Whole cast excels in character, nobody could have portrayed Stanley better than Jim Carrey. Absolutely bonkers, very fast paced and filled with witty one liners I still use to this day. Highly entertaining",
    "date": "2025-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This movie is really weird. The meatball part and the alarm clock part are the best, but the worst part is when the alarm clock got smashed... RIP",
    "date": "2025-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I remembered really liking this movie as a kid, but now as an adult, it's meh. Stanley is a boring underdog, and Dorian is a generic crime boss. Trish does barely anything but looks pretty and needs a man to save her. The best character was Milo; he had the funnier moments with the mask on than Stanley.",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great. Funny, unique cartoonish style, silly and most jokes aren't disgusting! :-)",
    "date": "2025-07-28"
  }
]