[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Unnecessarily gory and hyperviolent. Weak plot. Elements of Ruroni Kenshin.",
    "date": "2025-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It was... too long, a bit plodding and a bit too much manifest destiny BS without really making you believe it. You could edit 20 minutes without losing much or, better still, do something interesting. It seemed like there were too many writers pulling in different directions. Okay though.",
    "date": "2024-05-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It had very good elements in the filmmaking, & MASUMI'S performance as Akemi, has me wanting more from her, but the movie as a whole shouldn't have been released til they figured out the quirks and actually had a high Concierto piece for  the end.  It Dive bombed so much at the end, it felt like they ran out of budget, would've been a stronger Film if it was a Short vs a Feature.",
    "date": "2024-03-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Even though I started watching this from the beginning, it took a long time for things to start to make sense - I stuck around for that, since the action was good enough to keep me watching until it made sense...but the \"setup for sequel\" ending was disappointing...",
    "date": "2024-03-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The definition of average. No really likeable characters, a simple plot. Filming emphasizes glossy pictures, no subtle editing.",
    "date": "2024-02-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I enjoyed it.  I'm looking forward to a sequel.",
    "date": "2022-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Minha opinião: Por ser um filme creio meio brasileiro irei dar um a mais. Por passar no #bairrodaliberdade um dos meus prefiridos aqui em São Paulo. É claro que deram um tapa na cara e modificaram o bairro, mostrando ser um bairro bohemio e cheio de mafiosos. A atriz Masumi, nunca havia a visto antes, creio ter feito uma interpretação mediana, mas nas lutas ela mandou bem, tanto com a katana (espada). O ator Jonathan também fez um papel legal, mostrou mais expressão e sua maquiagem muito bem feita. O ator japonês Ihara deve gostar do Brasil, pois já havia feito outro filme aqui no Brasil \"Coração Sujo\" que fala do conflito entre os próprios imigrantes japoneses aqui no Brasil que tiveram conflito com até mortes. Fato real daqueles que acreditavam que o Japão ganhou a guerra e daqueles que acreditavam no oposto (recomendo assistirem). Eu creio a melhor interpretação entre os atores no filme. As sequencias de lutas no braço e na espada, me surpreenderam por ser um filme feito aqui no Brasil (parabéns). O filme conta sobre uma guerra de clãs da #yakuza no Japão. Onde uma facção mata outra e nisso sobrevive apenas a fiha pequena em que o \"avô\" a leva para o Brasil. Até que descobrem a existência dela a yakuza vem para elimina-la. E onde aparece o anjo da guarda Ihara e Jonathan com perda de memoria também a ajuda. E assim e a estória.\nRoteiro: O roteiro é bom. Mas deixa a desejar partes da fala e cortes dos locais. Um filme também que passa a maior parte na noite, então é bem escuro.\nVale apena assistir? Sim, vale para prestigiar um filme que mandou bem. Não é aquelas coisas, mas vale assistir.\nNota: 7",
    "date": "2022-04-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The movie was almost a waste of time. It has an interesting premise, wasted by everything that is not the par action.  Whoever edited this, should be ashamed.  What a waste of the protagonist as well, why spend so much time on every but her.",
    "date": "2022-04-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The title made a promise the movie couldn't keep.",
    "date": "2022-03-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "overly acted, overly dramatic...even the action scenes were subpar. while they left it open for another movie, there's really no need to continue this train wreck",
    "date": "2022-01-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie is a master class in unnecessary full frontal male nudity.  By definition, this is nudity that does not move the plot forward or add anything of substance.  I'm not sure why film makers feel the need to add these elements.",
    "date": "2022-01-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Yakuza's plot had potential, even though Rhys Meyer's character was random. But it didn't capitalize on anything - the fighting is meh, the acting is meh, and it's not that fun to watch.",
    "date": "2021-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Worst movie I have watched in recent time, maybe worst in 2021 for me. Everything is wrong in this movie, the scenario is awful, the actors are bad (only one is good), it's full of cliches and it's so painful to watch. Terrible, really, please don't make a number 2!",
    "date": "2021-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Could've so easily been great had any one of the five writers actually created a screenplay that wasn't so choppy, derivative, incoherent, convoluted and riddled with plot and technical issues.\n\nIn the 111 min runtime, there was too much walking and talking with hardly any depth to the story or its characters. It had too much filler and very little substance. Many scenes were too long and/or unnecessary. Was this even edited? The scene transitions were horrible. And all that nonsense mystery didn't help the story either.\n\nWhat this film did have going for it, was decent cinematography, well choreographed fight scenes with awesome gore effects, and excellent performances. Considering this was MASUMI's first full length feature film - as a lead, with only three prior small T. V. roles, she nailed it, wow! I can't wait to see her in more action films, she's a natural. The location and production sets were on point, and the score was fitting and not overbearing as it usually is in many B films.\n\nHad this film been cut down to about 90 mins, with better editing and scene transitions, and more character development instead of all the filler, I may have given it an 8 or 9, but as is, it's only a generous 6/10 from me.",
    "date": "2021-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Expected this to be a mindless shoot-em-up movie, but really enjoyed the story and the movie. Beautiful cinematography and choreography. Some sections use subtitles, but the movie was fun. The pacing may be slower than the typical Hollywood blockbuster, but it kept building all the way to the finale. A little bit gory, but to be expected based on the source material. Would actually like to see if again.",
    "date": "2021-09-06"
  }
]