[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "My baby cousin Santiago love these guys!",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Filme mais ou menos, o roteiro é fraco, as cenas são mais ou menos, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I love Justin Timberlake and the comedy in this but it is also at the same time annoying.",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This was way better than it should have been. The music was great and so was the animation. I'm fascinated to know how this got greenlit with a $125M budget but it certainly wasn't wasted. While other movies like this crashed and burned the individual hairs and fibers being rendered made this a beautiful movie to look at and it was backed up by a fun and endearing plot.",
    "date": "2025-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A food mix of fun and annoying for the kids",
    "date": "2025-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "\"NO GOD PLEASE NO,NOOOOOOOOOOOO!\" - Steve Carrell",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "When I saw it with my nephews, they really liked it and had fun. It caught their attention, the joy and the music. They told me to watch the others and we watched them, but they liked this one the most. I think it's a good movie.\nDanna Restrepo",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The Original song is actually Loved!!",
    "date": "2025-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The Movie is supposed to be a kids movie with lots of color and joy and that's exactly what it is.\n\nJust pure comedy and nice storyline. Maybe one of the most entertaining kids movies I have ever seen.",
    "date": "2025-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 32 minutes!!!!!!!!!!!!!!!!!!!!!! Rated PG for Some Mild Rude Humor!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $153,600,000.00!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I might be a bit biased since Trolls was my FIRST movie I ever got see in a movie theater but I love this movie. Something about hearing Anna Kendrick be so happy and overly optimistic while Justin Timberlake being overly, majorly sad and negative makes this movie so much better. Just that once scene of Branch tossing Poppy's ukulele into a fire makes me so happy",
    "date": "2025-05-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Why is the best part of this movie not even original",
    "date": "2025-05-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Here, a movie that goes out to the optimists who have an obsession of joy & brightly colours.\n\nI really love this movie from DreamWorks - it is really engaging to me with being colourful & full of hype songs that I enjoy/make me happy.\n\nThere are a few lessons that you have been taught, such as showing your soft spot when I see your true colours & that is why I love you. It also stops jealousy with the Bergens just wanting to hunt Trolls to buy them happiness when they helped them unleash the inner happiness in them. Then there is courage with Poppy wanting to not give up & take risks to save her people, she rules.\n\nBTW, I also think the acting was awesome as if the cast was having a great time.",
    "date": "2025-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Well it is colorful as in a tier list it would be an A but definitely not as good as 2 and 3",
    "date": "2025-04-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Why does this exist",
    "date": "2025-03-31"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Cons\n1. The reasons why the movie is horrible and doomed from the start is there is too much cringeworthy and cheesy dialogue, especially the controversial “ But that's crazy talk. Who wouldn't wanna be with you?” dialogue from Chef, the most controversial and worst dialogues ever in a DreamWorks movie. Also there is one stupid line where Dinkles says “Oh Snap”, another corny dialogue.\n2. Sometimes the movie can get way too boring, watching it over and over again with no total meaningless. Making it feel like this is DreamWorks’s first and only animated film to date.\n3. The musical numbers serve no purpose no other than make the movie hit the 90-minute mark.\n4. Overall, this movie is the reason why The Boss Baby franchise was horrible, thankfully Captain Underpants was the first good movie after Kung Fu Panda 3.",
    "date": "2025-03-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "'Trolls' is quite enjoyable, unexpectedly so. I admit that I didn't know much about it before watching, but I did know of the troll dolls - well, just the quintessential (?) pink-haired geezer tbh - growing up so I didn't think a movie about them would move the needle at all. In actuality, it's good, light fun and suitably amusing.\n\nThe film has a brisk pace to it and the (toe-tapping, I'm afraid) music is expertly chosen, all the tunes fit their respective scenes. You could argue there are a few too many songs, at least compared to the standard scenes, but I'm not even sure that's the case myself. The voice cast are also praiseworthy.\n\nAnna Kendrick is a smartly chosen lead, with Justin Timberlake, Christopher Mintz-Plasse, Zooey Deschanel and Christine Baranski offering firm support. There are plenty of familiar voices behind those aforementioned actors too, including Russell Brand (eerily playing his future self?) and John Cleese.\n\nA pleasant surprise, this. I now wonder if they did as well as this with the two sequels, I plan to soon see.",
    "date": "2025-02-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Dreamworks made a good attempt at making a musical using the aspects that their known for wich makes the film more entertaining.",
    "date": "2025-02-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It’s alright, it can get too boring and cheesy at times.",
    "date": "2025-02-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "‘Because singing killed my grandma’ 😭 🙏",
    "date": "2025-01-25"
  }
]