[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Amazing film. While others say it trivialisd the sufferings of Alcacas victims, I completely disagree, the acting was impeccable and the focus on the game show was, in my opinion to make it more present-day social commentary. \n\nHowever, I do still think that Kendrick can continue to produce better films, i look forward to seeing her future projects. I have already watches this one twice!",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I am not usually one for true crime (to me it's grossly voyeuristic), but this was well done. It is properly intense and comes as a stinging social commentary following on the \"Believe women\" movement. It's a harrowing retroactive lesson about listening to victims. Anna Kendrick's directing is solid. There are some quite good performances, especially from the runaway teen and, dare I say, from the actor who played the killer so well I kind of hate the actor now. It is a taut, pretty distinctive, crime-thriller drama that manages not to be exploitative or gratuitous with what is shown on screen, despite the genre.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Whilst I want to give Anna Kendricks first attempt at working just as much behind the screen as in front the 5 stars I would love to... I have to admit that there were what felt like gaps in the overall story telling. I loved the combination of true story with developed story lines that further highlight the social and political troubles of the time. It kept me in suspense whilst also providing a strong ability to empathise with the characters and for that I have to commend Anna & her cast highly.",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Tight, solid entry of the trials and tribulations of the dating scene.",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Not bad. Plays a bit fast and loose with the facts for my liking.",
    "date": "2025-10-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A creepy, based-on-a-true-story period piece that's definitely worth 90 minutes of your time on a rainy night.  It's about a serial killer who has the stones to appear as Bachelor #3 on The Dating Game.  Kendrick and Hale were excellent.",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This was a really bad movie. If you look at the highly-rated user reviews you may notice they are accounts created by \"people\" (i.e., bots) for this one and only film. It is a sloppy boring clunky dishonest movie. I've never been too interested in this actress because she seems overly pleased with herself for some reason, and that same quality comes through here. She is the least interesting character in the story (and could have been the most interesting) but Anna Kendrick had a hand in writing and directing this piece--after it had already been written and someone else was lined up to direct it--and she has changed the story and the real-life person into a ridiculous character acting and saying things the actual person never said (nor would they ever say at that time in history), and instead behaving like a sassy girl-boss circa 2023. It's insulting to the real story, the acting is embarrassing and hard to watch, and unpleasant all around--and somehow the 1 hour and 29 minutes feels like about 3 hours. You'll be exasperated quickly--and wishing for it to wrap up, but it goes on and on and on in it's smug self-aggrandizing way. Terrible.",
    "date": "2025-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "In “Woman of the Hour,” the true story of serial killer Rodney Alcala is poorly retold, with the film missing key details to focus on a TV show element. By centering on his notorious 1978 appearance on \"The Dating Game,\" the movie unfortunately trivializes the profound suffering of his victims. It’s as if the creators, in their quest for a catchy title and marketable trailer, failed to truly grasp or research the harrowing realities of the story, resulting in a movie that feels more like a missed opportunity than a meaningful exploration of a real-life horror. The decision to downplay the brutal violence and focus on a sensationalized game show narrative is a profound disservice to the women whose lives were taken and to the survivors who lived through his reign of terror, reducing their tragic stories to a mere footnote of a television spectacle.",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Nice film. Worth watching.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Crazy movie worth a watch",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was STELLAR.",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I was disappointed in this given it's a true story. I'm not a fan of non-linear storytelling and this is a good example of why. It jumps around in timelines so much that it left me confused as to how the killer met his end.\n\nIt's also kind of bizarre they recreated the iconic \"Dating Game\" set and hired someone to \"play\" Jim Lange but called him something else and then didn't even include the famous theme music. Maybe the rights to it were too expensive, maybe they didn't want to denigrate the memory of Jim Lange, but again, this is based on a true story and they took too much artistic license in telling it. In the end, it just didn't ring true.\n\nWasted potential here. Bad job putting this story together, Anna Kendrick.",
    "date": "2025-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Woman of the Hour is a mess. What should’ve been a gripping, respectful deep dive into one of the most chilling real-life cases ends up feeling like a tone-deaf, scattered attempt to do too much and say too little. The depiction of the murder is particularly off-putting, unnecessarily drawn out, awkwardly handled, and lacking any sense of gravity or purpose. Instead of building tension or delivering emotional weight, it drags on in a way that feels exploitative and bizarrely disjointed.\n\nThe pacing is all over the place, jumping between timelines and tones with no clear rhythm or payoff. Scenes feel stitched together without coherence, and by the end, you’re left wondering what the film was even trying to say. It’s unsatisfying, uncomfortable for all the wrong reasons, and wastes its premise completely.\n\nIf you’re expecting a thoughtful true-crime drama, look elsewhere. This one misses the mark entirely.",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent suspenseful movie. Based on a true story. Highly recommend!",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "There’s a lot of really good stuff here with the visual direction, acting, production design, etc…\n\nBut there’s a TON of events changed in this “true story” that gives me a weird taste in my mouth. Mostly dealing with the central event and characters of the story - the dating show. So much of it is heavily altered for the same of presentism… If this was a made up story I’d actually liked it better, but it distorted and changed a lot of things in order to create additional, unnecessary narratives. The actual story in itself was interesting enough to not make those changes.",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The film looks good for a period piece.  Not really into serial killer stuff, but if you like that kind of movie you might enjoy this. That said, there are significant issues here.  Kendrick's character isn't the most interesting here - the runaway is.  She should have been the film's focus, and the dating thing a side story.  Instead, we waste a bunch of time seeing Kendrick's backstory for no real payoff.  Also she is getting a bit long in the tooth to be playing the ingenue.  The badie was decent and creepy enough, but seemed like a fairly generic whack job.  The only thing standing out is him going on TV for whatever reason they never go in to.",
    "date": "2025-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I was pretty impressed with the movie. It was an interesting take on absolutely horrendous tragedies. This is Kendricks first shot at directing and I am pretty excited to see what else she does. \nThe stroy line was a bit choppy, but the cinematography was excellent. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nf",
    "date": "2025-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The actual dating show sequence is witty, clever and the best reason one can give to go watch this movie. The ending pulls the entire film apart, but Kendrick's intelligence, enchantment and delivery is very entertaining.",
    "date": "2025-06-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very good film and rewatchable, too. Seen it 3 times, so far. Highly recommended.",
    "date": "2025-05-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Absolutely chilling performances by Anna Kendrick and Daniel Zovatto . . .terrifying!",
    "date": "2025-05-19"
  }
]