[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The movie is stupid, messed up, and dumb.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I don't understand why people don't like this movie. I accept that it's not an original story and the movie it's very stupid, but it is really entertaining and the actors did grate job with their interpretations, this movie deserves better. I think it's a great movie to whach with your family, it's also the goal of this movie, to remind us that all members of our family are important and that we all sometimes need to learn more from eachother, something that now a days a lot of families don't take it into account. Love this movie!",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Just really stupid, and completely unoriginal.",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Just a disjointed piece of trash",
    "date": "2025-01-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A Holiday Cringe Fest\n\nThe most important day for everyone just happens to fall on the same day.  Then everyone gets swapped the night before. The best parts are the dog and the baby. Everything else is random acts of blatant stupidity followed by the cringest possible payoffs. A modern take an a classic story. By modern I mean, juvenile level writing with decent attempts at acting a horrific story.",
    "date": "2024-12-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Overall the idea is not original, though that baby/dog is, but this delivers on the laughs, with some of them unexpected, in more than a regular basis to keep the film moving along. The ending is as expected but if you want a good holiday film, and you've seen Big, this is for you.",
    "date": "2024-12-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A sugar-cane-candy of a film. Suck it up and enjoy.",
    "date": "2024-12-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "**Family Switch** is the kind of movie that doesn’t reinvent the wheel, but wow, it knows how to keep you smiling. I absolutely *love* this cast—they bring so much charm and energy to a story we’ve seen a hundred times. Body-swap comedies aren’t new, but this one hits all the right notes of brainless fun and heartfelt moments about the importance of family. \n\nI went in with zero expectations and ended up pleasantly surprised. The humor is actually *good*, with some solid jokes that had me laughing out loud, and the pacing is spot on—you’re never bored. Sure, it’s predictable, but that’s part of the comfort here. It’s just really fun and incredibly heartwarming in the way it reminds you what really matters in life.  \n\nTurn off your brain, grab some popcorn, and enjoy. Sometimes, that’s exactly what you need.",
    "date": "2024-12-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Just too dumb and sweet. Jennifer Garner trying to do an updated version of \"13 going on 30\" from about 20 years earlier was a real bust.",
    "date": "2024-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It had several laughable scenes but is a tired plot.",
    "date": "2024-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Family switch movie is a family movie such hilarious literally the most good movie for family",
    "date": "2024-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Divierte sin más. Para ver solo una vez y se olvida rápidamente.",
    "date": "2024-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The teens chose this and even they didn’t enjoy it. Fell very flat.",
    "date": "2024-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "a lot about family but that's thousand of movies",
    "date": "2024-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Perfectly corny and cheesy to make it a good family movie.  Holiday movies are about classic values, walking in each others shoes and love.  I enjoyed it for what it was.",
    "date": "2024-06-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Me pareció muy buena 10/10",
    "date": "2024-04-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I actually hate this movie, it's like if dhar wasn't just pretty bad it's if he was HORRIBLE AND JUST THE WORST FILMAKER EVER! This movie needs to be removed from this planet, the fact that a horrible movie like this has anything over a 5% genuinely shocking, I can't believe I actually wasted over an hour of my life watching this movie, absolute worst movie ever.",
    "date": "2024-04-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It was really good but one scene made me really uncomfortable, with the kids in their parents bodies kissing and then the parents in the kids bodies flirting at the party.",
    "date": "2024-03-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Not good at all. Please save yourself and don't watch this. If you watched it already.....I'm sorry",
    "date": "2024-03-17"
  }
]