[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "What a waste of great talent (Ben Whishaw, Alan Rickman, Dustin Hoffman) on what may be the dumbest, most pretentious movie I've ever seen. Skip it!",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Perfume is a horror film in many ways, and the horror is the realization that our \"hero\" is horribly lost in his obsession.  It's a period piece in France about a young man in search of controlling the power of smell.  It's fairly graphic with some hard to watch scenes, but beautifully filmed, excellent script and an engaging original concept.  Fine acting and set design make this gritty world easy to be lost in. Well worth a watch.",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I really enjoyed this film up until the 3rd act, where it loses its momentum and that's why it didn't receive a higher score.",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Errr I always thought rotten tomatoes was the go to site but 59% ? Wha? This is a great film - you've become to young or inexperienced to give reviews on films that cut through the usual and indulge you in an adult fairy story without meeting your youthful modern sensibilities because you don't understand this, because you weren't alive when 'The Company of Wolves\" was made - and others of this genre. Take your brain out sometimes, just believe, and enjoy.\nI've nevet heard of twyker & whatever his previous, I take things as I see them - loved it.",
    "date": "2025-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Tykwer's Süskind adaptation never transcends mediocrity; the novel's plot is filmed too awkwardly. A generic score lingers over the TV-quality images, and there's never any tension or interest in the characters. Ben Wishaw, on the other hand, is great, as is Alan Rickman (when he finally shows up after 80 minutes); Dustin Hoffman, on the other hand, is completely in camp mode. All in all, a typical 'airs on network TV on a Sunday afternoon' historical/arthouse romp that doesn't dare to do anything. But I really want to read the novel now; it seems truly excellent.",
    "date": "2025-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A few details don't track and the main character feels too unrealistically like a singleminded machine. Which took me out of it somewhat. But bold and interesting storytelling nonetgeless, especially the less over-the-top 1st half.",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The scent of an object may seem the least significant among all other senses that stimulate the perception, for which reason it can never be extracted, can never be preserved, but is only echoed to such that it is tampered with. It essentially loses its novelty. Be that as it may, a scent equates to a particular beauty to which one may be enticed. Yet it never remains and eventually dies out. When that happens, yearning is inevitable.\n\nAs in the film, Grenouille sought a way to preserve the scent of beauty (literally the young ladies), taking extreme measures to do so. Ironic as it may be, he did not have a personal scent, therefore clenching to those of others. Such a mere talent he possessed became a menacing obsession—an obsession out of “love.” This love may be the representation of the beguiling scents of the women he murdered, forcefully and cruelly extracting it out of them. In the end, Grenouille himself vanished out of love—not a single residual left for all the love that he bestowed upon himself; it was devoured.\n\nA peculiar movie, it may seem, but twofold. Not much dialogue is spoken throughout, but it is still able to tell, rendering how passion turns into a haunting pursuit of cruelty.",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Very odd story, interesting look into perfume making, ending was terrible.",
    "date": "2025-05-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This film reminded me of, and has quite a bit in common with, Kubricks masterpiece, “Barry Lyndon”.  Both are visually dazzling, both are adapted from admired literary works and both tales tell of rather unsympathetic antiheroes and both rely heavily on a narrator. But whereas Kubricks film was uninterested in plot, this films director definitely is and his screenplay is quite plot heavy…and that’s the big difference: Kubricks adaption is cinematic, this one isn’t. The narrator in “Barry Lyndon” complimented the visuals, the narrator here (the magnificent John Hurt) doesn’t compliment, he distracts and too frequently is used to over explain and then over explain again. It’s feels less of a creative choice and more of an annoying necessity. There’s just something about this story that is not suited to the visual medium. Despite the best efforts of all involved, this story seems like it refuses to be cinematic—I’m assuming holding its full impact within the pages of the novel. However, the composition of the cinematography and the cast are strong enough to cover up its weaknesses and it is definitely worth a viewing…or two.",
    "date": "2025-03-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A fabulous story well told. \n\nBy far and away Ben Whishaws best role. Bit Sheriff of Nottingham from Mr Rickman but that’s why you pays your money. Fabulous understated narration from John Hurt as ever",
    "date": "2025-02-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Masterful and brilliant! Stellar performance of actors!\n\nThis cinematic marvel is a triumph of artistry and imagination. It’s a film that demands to be seen, not just for its technical brilliance but for its shockingly magical value. A true masterpiece, it cements its creator as one of the great film artists of our time.",
    "date": "2025-01-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Even though the movie romanticise the pursuit of happiness by a serial killer, which nothing else could be expected from given the fact that he has been neglected his whole life, since his birth (literally), the movie is quite interesting and involving. I have never seen any picture explorer the magnificent of the sense of smell and what someone could do if we had an amplified one.",
    "date": "2024-12-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "this movie is really disturbing and shows nudity. I wouldn't recommend it for 12 year olds as Netflix does.\nIt still has a great story and makes you overflow with negative AND positive emotions. Would recommend watching once you're around 15 or older (don't watch around your parents)",
    "date": "2024-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "\"Perfume\" . The film's opening in a grim, chaotic Parisian market immerses me  in the filthy, raw atmosphere that shapes the protagonist, Jean-Baptiste Grenouille. Its cinematography masterfully conveys his heightened sense of smell, using rich visuals and color grading to depict the beauty and obsession of scent-making. The film's ending is haunting and unforgettable: Grenouille pours his perfect perfume on himself in the same market, causing the crowd to fall into an ecstatic frenzy, only to end in his tragic, self-inflicted demise.",
    "date": "2024-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "What ultimately let's this movie down is not its cast or dialogue but it's attempt to end the movie on a statement about the power of scent which ascends humanity rather than the protagonist finding his humanity through the power of scent. The movie starts out telling a fairly sad tale about a young man, played by Ben Whishaw, with a gift for scent and some obvious social flaws which result in him accidentally murdering a young woman whose smell he spends the rest of the movie recreating through a series of further murders. Whilst the premise up until this point is fairly reasonable and enticing, especially when he tries to learn the secret of perfume making from Dustin Hoffman and tries to recreate the smell of the woman he murdered and obviously feels responsible for. However the movie takes a weird turn after he has completes his masterpiece perfume from a dozen or so dead girls, including the daughter of a Lord played by Alan Rickman. The protagonist is then sentenced to death by beheading at the town square but just before his impending death, he opens the perfume bottle which results in the biggest orgy in movie history involving the very townspeople who wanted him dead. The follow-up scene depicts him being let go and ultimately being torn apart by tenants of a local French slum leaves viewers perplexed and let down. The moral of the movie is not evil being punished or even the fragility of a single scent can never be created again so enjoy it while you can. No it's if you brew enough blondes and brunettes with some flowers you can get a city to orgasym and become a hamburger for the poor. 0.5/5",
    "date": "2024-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Very interesting movie and story. Weird orgy and eating part but kinda fit in with the movie. How it was a 12+ movie i dont know. Overall very fun and good story",
    "date": "2024-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Yes, it's weird! But seriously good! It's one of those movies I couldn't look away from. You have to sit down and WATCH it tho! No dilly dallying and missing bits and bobs or you'll miss important bits.",
    "date": "2024-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Awful movie. Way too long, dark and slow. The main character has zero qualities to redeem his abominable personality and behavior and the ending was just plain stupid. He murders a most beloved daughter but the father becomes so overwhelmed with his smell tht he embraces him like a son? Gtfoh, tht’s so ridiculous. Two final words: hated it.",
    "date": "2024-06-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Full of amazing images with a subtext of being obsessed with success...",
    "date": "2024-04-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Eu simplesmente não consigo ver defeitos neste filme.",
    "date": "2024-03-04"
  }
]