[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Central Intelligence isn't going to be on anyone's list of the best films of the year, but it is definitely a good way to spend a lazy summer night -- especially if you want to laugh.",
    "date": "2025-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A classic! Just underwhelming is all.",
    "date": "2025-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 47 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated PG-13 for Brief Strong Language, Action/Violence, Crude and Suggestive Humor and Some Nudity!!!!!!!!! The USA grossed over $127,400,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "could’ve kept this locked u",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I normally love Kevin Hart and Dywanyne Johnson together, but this was just unwatchable. Didn't laugh even once. Extremely disappointed.",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Another soulless Kevin Hart/ Dwayne Johnson movie. It’s watchable but don’t expect citizen cane level effort from the cast",
    "date": "2025-06-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's good in some parts but in others it's just inappropriate",
    "date": "2025-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Central Intelligence stars Dwayne Johnson and Kevin Hart and is about them teaming up to save the world. I'd like to say that I had zero expectations going into this but was still looking forward to it. This movie is HILARIOUS! The Rock and Kevin Hart are fantastic together and have some of the funniest jokes I've heard all year. Watching them both on screen is the best part of this movie and it was extremely funny.",
    "date": "2025-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Absolutely hilarious! Great chemistry between the cast.",
    "date": "2025-03-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Dumb. Was there a plot? And dumbest ending ever.",
    "date": "2025-03-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I watched this movie just recently to catch up. It was on TV on the movie channel and I streamed along to the movie. It's a light and funny movie, but it's more often than not more disappointing than entertaining.",
    "date": "2025-03-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Well written, directed, acted, and very funny movie",
    "date": "2025-03-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "While for me it's impossible to say if it's entirely good or entirely bad, I can say it's the most stereotypical action movie I've ever seen",
    "date": "2025-03-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the greatest buddy action comedies ever. Hart and Johnson are great together. Bateman's cameo is hilarious. Would love to see a sequel. Tim Treakle",
    "date": "2025-02-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Neither of them can act or play a comedic character well which is terrifying considering that’s literally their only job, casting either of them should count as a crime against humanity",
    "date": "2025-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "LOL!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2024-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I loved this movie as a kid still do",
    "date": "2024-12-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Una comedia ligera y entretenida que mezcla acción y humor en una fórmula efectiva. La química entre los protagonistas destaca, ofreciendo momentos hilarantes y una dinámica entrañable. Aunque no se aparta de los clichés del género, la película se sostiene por el carisma de sus actores y una trama que mantiene el ritmo. Ideal para pasar un rato divertido sin demasiadas pretensiones.",
    "date": "2024-12-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Central Intelligence ist ein lustiger,unterhaltsamer Film mit einer guten Dynamik zwischen Kevin Hart und Dwayne Johnson.Die beide haben eine mörder gute Chemie und passen gut zusammen.Dieser Film ist nett und unterhaltsam genug für einen entspannten Abend.",
    "date": "2024-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Uhhhhhhhhhhhhhhhhhhhhhhh. Pretty Good",
    "date": "2024-11-20"
  }
]