[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Derivative, but entertaining deep-sea ALIEN clone\nUnderwater (2020) ***1/2\n\nDeep-sea drilling rig workers must escape after an earthquake wrecks their facility, but soon find out they are not alone at the bottom of the ocean. UNDERWATER does not have an original bone in its body, but it’s a pretty darn entertaining underwater version of ALIEN (and it’s many subsequent knockoffs). LEVIATHAN and DEEP STAR SIX were two other underwater ALIEN knockoffs back in the day (I don’t count THE ABYSS. That one is more CLOSE ENCOUNTERS than ALIEN), but UNDERWATER is superior to either of those underwater monster movies. The filmmakers here are pretty open in acknowledging their forebearers, right down to the opening credits font, to a fun chest-buster callback, and even Stewart and crew walking around in their underwear at the end of the film (though it’s black underwear instead of white). I’m also pretty sure I saw a Weyland Corporation logo pop up on a computer boot screen early on in the film. While the setup is pretty derivative, it does go to some unexpected places by the film's ending, which was fun, but I did find the ending too CGI-heavy and basically became a meh Marvel movie with the overuse of CGI, which took me out of the movie. The film worked much better when the CGI monsters were only fleetingly seen moving through the murky waters, compared to when you later clearly see them in their full CGI lameness. Just as with JAWS, less is more when it comes to how much you show the monster. There is one scene where there’s a small practical effects puppet monster during a medical bay examination scene straight out of Ian Holm examining the facehugger in the original ALIEN, which is pretty fun. Also not so good is when the film does try to hit some emotional character beats, you can tell those scenes should have had an emotional resonance that was noticeably absent. I couldn’t help but recall the far more effective scenes in James Cameron’s THE ABYSS, a film that delivered both carefully drawn, fully developed characters and also some top-tier action and suspense. While this film is nowhere near up to those standards, with a threadbare story and characterization, the film is essentially wall-to-wall action, so you never really have time to get bored, making it easier to gloss over its deficits. The plot boils down to the deep-sea workers needing to cross the ocean floor for over a mile to some emergency escape pods. A particularly strong cast carries the bare-bones story, with Kristen Stewart, as the Ellen Ripley figure, doing the yeoman’s work of most of the film’s heavy lifting. Per usual, she’s effortlessly cool, and the audience immediately goes along with her character’s undersea survival horror journey. You also get Vincent Cassel (IRREVERSIBLE, BLACK SWAN) as the undersea captain working hard to keep his crew alive, but it’s TJ Miller (SILICON VALLEY) who steals every scene he’s in, including right off the bat when Stewart pulls him free from earthquake rubble and he thanks her by saying, \"You sweet, flat-chested elven creature!\" That sounds like a Miller, a former standup, ad lib. Overall, UNDERWATER is thin on characterization and story, and is wildly derivative, but the cast and the non-stop action and suspense are enough to keep fans of these sorts of films entertained. FUN FACT! The underwater scenes were actually shot on dry sets, and CGI water debris was added later. It works surprisingly well, especially compared to the lame CGI monsters. \n\nAI CAPSULE REVIEW: \nUnderwater is a blatantly derivative but brisk and entertaining deep-sea riff on Alien, elevated by a strong cast—especially Kristen Stewart—and nearly nonstop tension. Its murky, restrained early monster work is far more effective than the CGI-heavy finale, which dulls the impact. Still, for fans of creature thrillers, it delivers solid, fast-paced fun.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Alien meet Abyss meet Liviathan.   It needed more character development so i at least somewhat care when someone gets wasted.   Everyone died in the order i predicted and did exactly what i expected.   Despite all this its still an ok flick.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I thought it was a b- or b movie. But I enjoyed the movie.",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is so much better than its ratings would have one believe. I rewatch often.",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I can feel the pressure of the water.Love this movie",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The random and out of place comment \"You sweet flat-chested elven creature\"  \n\nSounds just as dumb and unnecessary when I say it.   Bad writing.",
    "date": "2025-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Underwater sports a welcome attention to atmosphere and well-cast leads that are both ill-served by Brian Duffield and Adam Cozad's highly derivative and poorly-paced screenplay, resulting in an truly earnest claustrophobic thriller that nonetheless dooms director William Eubank before he's even begun.",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "If I'm being honest I don't really like the fact that they didn't give any lore about the monsters or even a name for them. A hobby of mine is watching horror movies and trying to decipher what the monster is and study it but this movie deprived me of that pleasure, and the destruction of the \"queen\" and the death of the main character, Norah, leads me to believe that a sequel is unlikely leaving my questions unanswered.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A good monster movie with quality acting, action throughout and atmospheric cinematography. A few moments of really great suspense, creepy monsters, and a spooky underwater setting definitely make it worth watching. It is, unfortunately, bogged down by a way too on-the-nose script that doesn’t seem to trust the viewer to make inferences or interpretations.",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Underwater (2020) is a film that starts off too quickly and could have used a good explanation at the beginning of the story so that the audience could understand a little about what is happening here. The ending is quite disappointing.",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Horrible storyline, no thrill.",
    "date": "2025-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "An underrated sci-fi horror gem that flew under the radar. For old(er) people, think Leviathan mixed with Deep Star 6 but not as silly and more atmospheric. Solid effort from Stewart and Cassel is great as always. A bit of anticlimactic ending but it's still an enjoyable ride if you're a fan of the genre.",
    "date": "2025-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "No story. Video game level special effects. Pretty terrible. I'm amazed it has this reading level. As rotten as they come.",
    "date": "2025-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Underwater 'Alien' but not in the same class. Stewart leads a group of survivors around a deep sea drilling complex to escape a monster disturbed from the deep. Endless corridors exploding, collapsing and fireworks with lots of flashing lights on the monitors and computers. Inaudible dialogue and visuals with a predictable explosive denouement.",
    "date": "2025-05-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Special Effects: 0,5/Sound Effects: 0,5/Acting: 0,5/Story: 0,5",
    "date": "2025-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Only thing good about this film was getting to see Kristen Stewart in her undies",
    "date": "2025-05-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I normally can’t watch Kristen Stewart..,to be frank. She’s like Mila Kunis…I don’t get lost in the character, because I keep seeing, hearing the actress. But she did a great job in this movie. She shined. And the movie itself was really good. When it ends and you want a sequel, that’s a good movie. The script was excellent too: if you don’t know where you’re going, any road will get you there. T.J. Hooker shined in this movie too.",
    "date": "2025-04-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "(CASTELLANO) Underwater no se sale del molde. Desde el primer minuto sabes exactamente lo que vas a ver: un grupo de personajes atrapados en una instalación submarina, una amenaza que los va eliminando uno a uno y la lucha desesperada por sobrevivir. La película no pierde el tiempo con introducciones innecesarias y va directo a la acción, pero esa misma prisa le juega en contra, porque los personajes apenas tienen desarrollo. Kristen Stewart hace lo que puede con su papel, aportando intensidad y presencia, pero la historia no le da mucho con qué trabajar.\n\nEl mayor problema es que todo resulta demasiado familiar. Underwater bebe sin disimulo de películas como Alien, Abyss o Leviathan, pero sin aportar nada nuevo. Hay tensión, sí, y algunas escenas funcionan gracias a su ambientación claustrofóbica y los efectos especiales bien logrados, pero la sensación de \"esto ya lo he visto\" pesa demasiado. Además, la acción a veces es confusa, con secuencias oscuras y un montaje que dificulta seguir lo que está pasando.\n\nEn definitiva, Underwater es una película entretenida, pero poco memorable. Si te gustan los thrillers de supervivencia con monstruos y no te importa que sigan la misma fórmula de siempre, puede ofrecerte un rato de tensión y algunos buenos momentos visuales. Pero si buscas algo más original o con personajes que realmente importen, esta no es la inmersión que necesitas.\n\n(ENGLISH) Underwater doesn’t break any new ground. From the very first minute, you know exactly what you’re in for: a group of characters trapped in an underwater facility, a mysterious threat picking them off one by one, and a desperate fight for survival. The film wastes no time on unnecessary introductions and jumps straight into the action, but that same rush works against it—there’s barely any character development. Kristen Stewart does what she can with her role, bringing intensity and presence, but the story doesn’t give her much to work with.\n\nThe biggest issue is how familiar everything feels. Underwater borrows shamelessly from films like Alien, The Abyss, and Leviathan without adding anything new. There’s tension, sure, and some sequences work thanks to the claustrophobic setting and well-executed special effects, but the overwhelming sense of \"I’ve seen this before\" is hard to ignore. The action can also be hard to follow at times, with dim lighting and frantic editing that make it difficult to see what’s happening.\n\nIn the end, Underwater is an entertaining but forgettable experience. If you enjoy survival thrillers with sea monsters and don’t mind a formulaic approach, it delivers some tension and solid visuals. But if you’re looking for something more original or characters that truly matter, this might not be the deep dive you’re looking for.",
    "date": "2025-03-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "For a movie full of action and monsters, it's kind of a bore.",
    "date": "2025-03-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Aliens under water, this is not!",
    "date": "2025-02-06"
  }
]