[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "What can pass as a standard murder-mystery instead becomes a remarkably complex exploration of various malaises, including the agony of familial loss, the systematic disenfranchisement of Native Americans, and the ever-present evil of toxic masculinity.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The Wind River Range is beautiful; but it can be rough and not very forgiving.  This movie portrays that well.  The final shoot out scene was the best one I have ever seen in a movie.  Good acting throughout.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Sakto lang. Effective na drama thriller. Galing ng performance ng mga gumanap. Ito un mga tipong panonoorin mo ng isang upuan lang dahil hook ka sa istorya",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Second viewing of Wind River; still chilling, brutal and unsettling as the first time.",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The shaky camera used throughout is really annoying. Why? It reminds me of the days you could buy cheap DVDs somebody copied in a theatre with a camcorder. Then honestly you could watch the first 5 mins, then the last 15 mins and you get the whole story. Everything in between is pointless",
    "date": "2025-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very good movie... great setting if you like the cold. 4 out of 5 stars... close to 4.5 out 5 though.",
    "date": "2025-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Recently saw this for the first time and WOW.\nI don’t know what I was expecting, but it exceeded expectations. I love that Jeremy Renner is seen for more than his action movie roles, because again… WOW.\n\nAny story that highlights the strength of family, bond of grief, and the intelligence that comes with truly knowing your environment.\n\nIt is not flashy. It is not showy. It’s gritty and raw. Real human emotions\n\nOverall: A top 20 movie I have ever watched. And you should too.",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Obv great Actors. Its disjointed. Te Audience can not even formulate an idea/solve the crime. No backstory. That said if it can bring light to the injustices indigenous women/families suffer its worth it.",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Solid lineup, interesting story with a good balance of intensity and quiet moments. Satisfying ending.",
    "date": "2025-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Good writing plus good storyline plus top tier actors all adds up to good movie making. And if Graham Greene is one of the lead actors, you know it's going to be good. It was also nice to see Elizabeth Olsen in a different type of role than we are used to seeing from her.",
    "date": "2025-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Based on true life events. Thought provoking. 4.5 stars",
    "date": "2025-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great movie, has some things build up, wicked surprise and twist. Bravo",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The setting in the cold and snow covered mountains is out of this world magnificent.   But it is also a cruel and unforgiving environment, amplifying the loneliness of its inhabitants.   In an area the size of Rhode Island, there are only 6 tribal police officers.  Not surprisingly, the misfits, the druggies, the perpetually drunk and other miscreants can hide in their isolated trailers and do whatever they want ---- or think they can.  But a moment of lust and alcohol-fueled conflict leads to murderous crimes.  It is the job of the main characters played excellently by Jeremy Renner and Elizabeth Olsen to finally bring some measure of justice and peace.",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What a great crime movie with a very unique setting. Literally gave me the chills. Renner and Olsen make a great duo. Tim Treakle",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A very good cop show in a unique setting",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Grim, suspenseful, and believable, this western thriller set on a Native American reservation is not to be missed.",
    "date": "2025-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent movie with a great cast.",
    "date": "2025-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fantastic movie!! A must see",
    "date": "2025-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Great film Renner is great and so is Olsen ' .\n'",
    "date": "2025-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Inspired by true events, Wind River vividly portrays the injustice faced by murdered and missing Indigenous women. Excellent character work and bleak snow-bound setting, the pain of loss and grief empathically felt, make this so much more than just a murder-mystery action tale. You'll want to see it more than once...",
    "date": "2025-08-20"
  }
]