[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Hackshift360 provided excellent technical assistance when I needed help recovering and reviewing some important mobile data remotely. Their process was smooth, secure, and very professional. They explained everything clearly and made sure I was confident before each step. I’m honestly impressed by their expertise and how quickly they got things done.\nContact Www. Hackshift360. com for more information.",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "really terrible and has disgusting parts",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It was educative on some points, but i already knew eating veggies and fruits would be the solution but i wanted to understand the complexity. Why? And I think an hour and a half long movie just to say that eat more veggies was waste of time so yes definitely could have explained the complexity of gut and body connection more.",
    "date": "2025-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "They could have cut the film time down to 3 minutes and meerily recommend eating more fruits and veggies.  oh...veggie smoothies as well.  thats it.. just saved you a lot of time",
    "date": "2025-02-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "no, just no.........",
    "date": "2025-02-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Tested and trusted hackers, the use of zipcrak services was massive, they’re top notch in any hacking related issues they’re on instagram",
    "date": "2025-01-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "While tackling a subject that is very broad and deep, this film missed its chance to make a meaningful impact.  The use of the Muppets and animations certainly make it family friendly, but do nothing to help inform the audience on the science.  Consider this baby's first step into the world of the gut microbiome.",
    "date": "2024-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "They did a great job making it entertaining and cute.  The experts and subjects involved were very likeable.  The medicine and science were dumbed down.  The solution of eating fruits and vegetable was overly simplistic. I would have liked it better if they had left out the scene making the homemade poop pills.",
    "date": "2024-05-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wow can't believe people's negative reviews. This is a great documentary that can really change so many people's lives. It is easy to watch and gives you a good understanding of how the gut works and the gut is not just mechanical but live bacteria that live off the types of food we feed them makes a difference. Eat great food and encourage beneficial bacteria.",
    "date": "2024-05-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This informative documentary digs into the science behind gut health. It’s well done and it’s shining a light onto diet and routine that many have overlooked. I will be eating differently after watching the film.",
    "date": "2024-05-04"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Dangerous and irresponsible misinformation around Autism ‘causes’",
    "date": "2024-05-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was an amazing preview of where science and medicine are heading!",
    "date": "2024-04-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I’ve been focusing on gut health for the last few years.   I found it interesting to understand better how the gut works and some interesting concepts for ‘fixing’ it.",
    "date": "2024-04-28"
  }
]