[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Gripping story and beautiful performance by both dudes.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Well that's an hour and fifty seven minutes of my life that I'll never get back.     Webster's  dictionary defines a thriller as  \"a work of fiction or drama designed to hold the interest by the use of a high degree of intrigue, adventure, or suspense\".   This movie did none of that because the only element of the story that was not revealed in the first few minutes  was the outcome of the investigation, which was never revealed.  If the ending was meant to (finally) create suspense or leave me wanting more, it didn't succeed.  It did, however succeed in annoying me.  My husband made the right call.  Twenty minutes in he declared the movie a crashing bore and went to bed.  I should have done the same.",
    "date": "2025-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Late to the party but so glad I came. Engrossing, gritty and captivating, understated performances throughout made this feel very close to an authentic investigation that highlighted the meticulous and unrelenting efforts of police to catch a dangerous killer. Highly recommended.",
    "date": "2025-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Dialogue are so difficult to understand .. what’s happening with sound mixing with hollywood…",
    "date": "2025-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Good acting, but boring as hell. I stuck with it waiting for a payoff. Hint, there is none.",
    "date": "2025-06-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Australian cinema loves bleak storylines and this is no exception.  Joel Edgerton and the “based on a true story” plot makes this well worth the watch.",
    "date": "2025-05-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I never turn something off thinking it will get better.  I don't think i have ever been more surprised by the good reviews than i was with this.  This was so slow and just not that good at all.",
    "date": "2025-05-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Most of the screen is black most of the time. The acting is bland and the dialogue is uninspired. The overall plot is slow, boring, and needlessly bleak.",
    "date": "2025-04-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "After seeing the high percentage of people liking this  and appreciating the acting of Joel Edgerton we watched it. What a big time let down. This movie was terrible.So slow moving and boring. Please don’t waste your time. I’d rather watch paint dry. No bueno !!",
    "date": "2025-01-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Creepy and brooding - the excellent acting is bogged down by a plot that advances too slowly, and too predictably, toward a dark ending.",
    "date": "2025-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Man I love Sean Harris. Excellent gloomy style and delivery from the whole cast, thoroughly enjoyed.",
    "date": "2025-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Over-rated serial killer and crime drama is a little too slow for my taste.",
    "date": "2024-12-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This was slow but engaging. A little tough to follow at first but the 2 leads make this worthwhile",
    "date": "2024-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Starts off slow but gets addicting onwards. The acting by both leads is really good.",
    "date": "2024-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Stunning film. No other film in a long time had me as gripped and absorbed as this, even more so on the second watch. Truly visceral, but there's no denying you need to steel yourself for it. I particularly enjoyed the score, and the varying blends of tension and mood drifting throughout. Superb lead performances and a great example of a low budget/ big impact production.",
    "date": "2024-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Brilliant, just brilliant. Edgy, disturbing, paced, enough with out too much being said… do yourself a favour. Plug in and shake yourself.",
    "date": "2024-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Great acting and an enjoyable if very slowly developed story. The insidious undercurrent bubbling beneath the surface added a huge element of tension and jeopardy.",
    "date": "2024-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great story, acting is superb!",
    "date": "2024-04-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A slow and tedious narrative; the only reason I persevered was out of curiosity for its conclusion. The work possesses a somewhat unremarkable premise, yet manages to present it reasonably well. Overall, it's a solid film for its genre, just not a masterpiece.",
    "date": "2024-03-31"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "An interminable film,  I watched to this to the very end, but only because I'd already invested too many precious minutes in it (sunk-cost fallacy). \nThis is a prime example of a film without an assertive producer: someone who could discipline the director and prevent him allowing what should have been a gripping story from degenerating into a turgid mess. A pity, because \nthere are some talented performances, striking cinematography and a good atmospheric score. It reminded me of The Irishman- another film that also appeared to lack a decent producer.\nAs with Scorsese, someone needed to tell this director to can the boring scenes: long ones when the two main characters sit beside each other in a succession of cars; dull tracking shots of Australian roads: and frequent non-sequiturs that break the narrative flow. \nThis is a film where nothing appears to happen, but the end comes and you realise lots actually has. And it feels far too long (nearly two hours but feels like three).",
    "date": "2024-03-19"
  }
]