[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The Dilemma has a great cast and some funny moments, but it’s uneven blend of comedy and drama makes it hard to swallow.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I made this account just to say this isn't the best movie I've ever seen but its pretty good. All these people on here writing an in-depth analysis on this silly comedy are nuts. If you find yourself constantly offended by things other people say, then find something else. If you're a normal human being looking for a fun entertaining movie it's not bad, give it a watch.",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "How did Ron Howard get involved with this clunky mess?  Decent cast, tried a bunch of formula gimmicks, Vince Vaughn the glue to hold it all together and almost none of it worked.",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Well it's the better one of the Kevin James 2011 movies. But that's not saying much. The acting is alright. It starts out kind of promising but he longer it goes the more the dialouge just weighs and the humor is somwhere between flat and terribly unfunny. It's dumb, not well set up, repetitive, and just falls flat. James isn't bad and probably the best thing acting wise. Vaughn starts out good but the longer it goes the more unfunny, unlikeable, and dumb his character gets. Connelly I honestly wonder what the point of having her here as I struggle to find a reason for her to be here. And what a waste for Ryder. If the humor was better and a better script this may work because I struggle to see how you can't make something passable with this all star cast but here we are. Everything else is subpar. The direction is pretty basic despite lots of production value. The fact this is Ron Howard is just mind boggling also. There are some dumb and unfunny scenes that just fall flat like the home invasion and the intervention climax. Than it can't decide how to take all it's subplots and make them work together. Vaughn with Connelly, the Dodge car project, and the actual \"Dilemma\" all feels seperate and never works well together. The actual affair too feels low stakes and bounces around between everyone and we go in circles. Maybe it would be worth it if it were actually funny but it's not. It coud've been a lot worse but as it is, it's a unfunny romcom that should be skipped. What a waste of talent in front and behind the camera.",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It took 20 minutes before we knew what this was about and that was the high point.  Proof that a good cast and director can't make up for a terrible script.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The story is slow. Totally would not call this a comedy. Good actors but bad script very boring",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I had to decide tonight whether to wash my cat or watch The Dilemma. At the end of the evening my cat still stinks, but not as bad as this movie does!",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The Dilemma was marketed as a comedy, but it’s really a dark meditation on loyalty, gaslighting, and emotional isolation—wrapped in a comedy shell. One thing stands out: Vince Vaughn’s performance as Ronny, a gem in a morally murky world.\n\nRonny is the emotional center of the film—a man who discovers his best friend’s wife is having an affair and wrestles with whether or not to reveal the truth. But instead of finding support or understanding, he’s met with gaslighting, suspicion, and cold detachment. His journey feels less like a comedic romp and more like a psychological spiral—one that’s all the more painful because he cares. He’s not perfect, but he’s trying to do right by people who would rather maintain the illusion of normalcy.\n\nWhat’s most unsettling is how alone Ronny is. Geneva (Winona Ryder) manipulates and deflects. Ryder could have easily leaned into caricature—the cold, unfaithful partner trope—but she doesn’t. Her performance is calculated, restrained, and deeply human in its denial. Nick (Kevin James) is so disconnected he can’t see what’s happening around him. And Beth (Jennifer Connelly), instead of offering comfort, stages an intervention that feels more like betrayal than concern. The fact that Ronny proposes to her afterward is a haunting moment—perhaps a grasp at stability in a world that keeps pulling the rug out from under him.\n\nThere’s a moment when the film reveals Nick has been secretly visiting massage parlors. The plot leaves it hanging, but that choice feels intentional. The story isn’t about Nick’s morality or Geneva’s. It’s Ronny’s arc—and that detail, left hanging, strips away the illusion that Nick is just a victim. It shows that Ronny is surrounded by people who are just as flawed but unwilling to face it. The truth is messy, and Ronny is the only one brave enough to look it in the eye.\n\nThere are moments of real laughter—the absurdity of Ronny’s physical comedy in one scene involving a greenhouse, Queen Latifah’s blunt delivery, and the tension-release timing in a few scenes with Zip. But the humor doesn’t soften the tragedy; it masks it. It creates a false sense of levity that mirrors how the characters avoid what’s real. This isn’t tonal inconsistency—it’s emotional layering. The comedy works like a pressure valve, letting out just enough steam to keep Ronny’s unraveling from boiling over—until it inevitably does.\n\nWhat makes the film quietly devastating is not just that Ronny is hurt—it’s that he chooses to stay. In a relationship where he’s doubted. In a friendship that doesn’t meet him with the same loyalty. In a world that makes him feel like the problem for trying to protect people who don’t want the truth. That choice—that stillness—is the most haunting part of all.\n\nThe Dilemma may not be the film audiences expected, but for those willing to look past the comedic framing, it reveals something much more honest—and quietly crushing. Vaughn’s performance is subtle, raw, and full of restraint, anchoring the film’s emotional weight. It’s not flashy, but it lingers. And that’s what makes it worth watching.",
    "date": "2025-04-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Wonderful actresses completely wasted. NOTHING works in this mess of a film.",
    "date": "2024-02-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Ronny and Nick have been best friends since college. The two are partners in their own auto design firm; their big dream comes true when they land a big deal with Chrysler. Nick has found a way to make an electric car sound and feel like a muscle car. Ronny's life has now turned for the worst when he catches Nick's wife cheating with another man. So does he tell his best friend about the other man, or should he wait until the Chrysler presentation is over. Vince Vaughn's character over shot itself. It was just too much Vince. Jennifer Connelly gorgeous as usual. You caught your best friend's wife cheating, but to stretch this topic for a movie for a 1 hr. 58 min was just way too long. Not enough funny parts to compensate for the boring slow pace of the film. Constant yada yada's. Not one of Ron Howard's best films. Soft 3 stars out of 5",
    "date": "2023-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "80/100 - comfort food. vince vauhn and kevin james do a great job and are fantastic actors as always. not a bad romcom and special appearances by channing tatum. funny to watch and easy to digest.",
    "date": "2023-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "just tell him already! Oh my gosh it was way too long and drawn out",
    "date": "2023-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Only a 1/3 of the way in and some hilarious scenes with Vince Vaughn. Did smoke before viewing…not trying to be a great movie but good dialogue and VV has tremendous stage presence.",
    "date": "2023-05-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This comedy was pretty good. Vince Vaughn, Kevin James, Jennifer Connelly, Winona Ryder, and the rest of the cast did a pretty good job in this movie. The plot of the movie was dramatic and entertaining. It's about trying to tell your best friend the truth even if it hurts. If you haven't seen this movie yet, you may enjoy it. It wasn't too bad, but it wasn't great.",
    "date": "2023-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This got a horrible score and I don't see why. This has a great cast and was pretty funny as most Vince Vaughn and Kevin James movies are!",
    "date": "2023-05-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I can't believe that Ron Howard directed this.",
    "date": "2023-05-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Horribly written!! Both Ronny and nick seem like shitbags. Nick cheated first but that was mostly brushed under the rug. The way Beth just shrugged everything off and accepted probably the shittiest proposal known to mankind.. it was just dumb dumb dumb dumb! I had to skip through a couple parts because it was THAT painful to watch. The only good actor in this was queen Latifah but was not enough to save this horrible movie.",
    "date": "2023-05-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie was a true disappointment. I like all of the actors, and I thought they would have incredible chemistry, and that there was sure to be some great humor and feeling. But it was about a friend who needed to mind his own business, but he didn't, with tragic results. He spent the whole movie sticking his nose where it didn't belong. The whole movie was a downer until the end when Kevin James shot a puck into a tiny goal at an NHL game and won a trip to \"the Carolinas\" and tickets for the next game. The celebration was so overwhelming. It went on and on and on, slo-mo and ad infinitum. Just for two airline tickets and game tickets that they could have easily paid for themselves. It was an endless celebration by the audience Kevin and Vince for winning balloons. The movie wanted us to think all of the tragedy up to that point was neutralized by the big hyper-irritating way overplayed win.",
    "date": "2023-05-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I thought it was good . Really simple watchable movie.",
    "date": "2023-05-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "They're a lot of really good elements of this movie; Vince Vaughn, Kevin James, and Jennifer Connelly for one.  They are all very good.   Vaughn and James have great comedic chemistry.   Vaughn plays a character we have seen from him many times, and it never gets old.  The premise is interesting- two friends and partners have a huge opportunity to make a life changing deal in the automotive business that is, potentially, threatened by one of their wives' infidelity.   The components are good and some moments are very worthwhile, but the total execution is disappointing.",
    "date": "2023-05-05"
  }
]