[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Nikki Yovino is a proven liar, and should have been sent to prison for much longer than one year for her evil and despicable actions! I hope the civil lawsuit takes every penny she ever earns in life.",
    "date": "2025-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent job with a very difficult subject.\n\nTo me the most shocking thing about this problem is that these cops still have jobs.",
    "date": "2024-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This film was so well done and it made me so. angry. The audacity of these police officers to charge survivors with false reporting is infuriating. I am so glad this film was made and these stories are being told but it also made me want to throw things.",
    "date": "2024-04-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Just a continued look into victim blaming, and why victims are terrified to come forward. That for some reason when it comes to SA, victims are lying regardless of evidence, and the perpetrators are innocent even if they're guilty. It also showcases the intimidation, abuse, and continued violations SA victims are subject to when they seek justice. It is infuriating, and this documentary very clearly demonstrates that.\n\n I was a SANE nurse for 6 years, and also a survivor myself. These instances shown in this documentary is the reason why I became a SANE nurse, so the survivor would always have an advocate.",
    "date": "2024-02-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "eduaim.moodle.mii.lv",
    "date": "2023-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is an eyeopener. This storyline is written well and shows Police do NOT care for women's rightr. Whatever Roger Ebert review. He's an idiot who is a freaking dinosaur that needs to reform his opinions to current understanding. These days are not the Good Ole Boys Club anymore.",
    "date": "2023-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A journalist, Rae de Leon, began investigating women who were victims of assault, but were instead charged with filing a false report and the facts de Leon uncover are damning. There will be times your heart will break and you'll be angry, but this is an important documentary to watch if you have a daughter,  a sister or any friend who is female. The police work (or lack thereof) is sickening. This doc needs to be seen! Final Score: 8.3/10",
    "date": "2023-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Everyone needs to see this. I'd like to learn about more people this has happened to. I'd like to know what that pompous interrogator police guy is up to these days. He and the others like him need to be stopped!",
    "date": "2023-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A bit of a snooze fest. The fat chick is a bit dumb, dug her own hole.",
    "date": "2023-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This was pretty riveting. It's about women who were sexually assaulted and then charged with the crime of false reporting when the authorities basically turned on them for one reason or another - they were accusing powerful men in the community, the cops wanted to get their violent crime statistics down so they manufactured a non-violent crime to prosecute instead, etc. The fact that the police can lie to you when they interview you - and this is enshrined in the law and a daily part of policing - they call it \"ruses\" - but if you lie to the police you are committing a serious crime and will be prosecuted to the fullest extent of the law - this is the hypocrisy that is at the heart of this depressing and very well-made documentary. None of the women in this film were lying, and their stories are all backed up by evidence, but when the police employ dishonesty in their investigations, it leads to terrible injustices.",
    "date": "2023-06-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Powerful and a necessary look into victim shaming. Scary that this happens.",
    "date": "2023-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Really well-done documentary based on solid investigative journalism.  Definitely worth watching",
    "date": "2023-05-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A must watch! Police culture needs to change.",
    "date": "2023-05-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Unbelievable  and these women are so brave and crucified, I cannot believe these women were treated so hanously and most of the suspected perpetrators were not even interviewed as they declined, hey it's a crime, they shouldn't even have the choice, is a suspected crime, that would not happen in my country. Absolutely disgusting 🫣",
    "date": "2023-05-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Terrifying depiction of how victims are treated",
    "date": "2023-05-24"
  }
]