[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Put these two in more movies!",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Even though all the great scenes were given away through the trailer, still enjoyed the laughs in the theater. Great cast and songs.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 01 hour, 37 minutes, and 13 seconds!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated R for Language Throughout, Brief Drug Use and Sexual Material!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $49,900,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny asf! Female Friday!",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "new style humor, talented women, and a heart-warming message shrouded in the wacky tellings of struggle.",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Went in with no expectations and while not disappointed it was still fairly mid. SZA did well here and Keke always kills it, this was light work for her I'm sure. Really wasn't into the actor that played the boyfriend, not the way he was written which was done well to dislike him, the acting was ham fisted-over selling it. Felt like a competent movie from the mid 2000's.",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I really enjoyed this movie and I don't regret watching it.\nHowever it felt more like a comedy skit than a big* production movie. Keke and SZA are big names and they are carrying the movie. I also believe it was SZA's movie lebut. Both of them did great. If you have nothing else to watch then simply tune in. The comedy element will make you laugh but don't have big expectations.",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Probably slept on this one for too long, but could Keke & SZA be the best comedy duo of the year? While #OneOfThemDays script doesn't do much to spice up the genre, Palmer & SZA add all the flavour necessary to make this one sizzle. #2025FilmCatchUp",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I did not expect a reinnovation of the buddy-comedy genre, but a whole lot of energetic performances and heart make up for it real quick. The characters are vivid and you care for all their stories although you can have the feeling that you have seen it all before. \nThis movie is designed to make you feel good and suceeds at it most of the time.",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Great comedy. Keke Palmer kills it.",
    "date": "2025-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Ive seen better Indy movies. It need better writers or producers. Felt rushed currently not using it as back. Ground noise",
    "date": "2025-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Really Good! Very funny!!   Well worth my time",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "One of Them Days is a fun, light and breezy film. It has style and joy, although it's not especially unique. It's also one of those 'it all happens in one day' films, which I usually enjoy. Dreux and Alyssa live together in a small apartment in Baldwin Village, Los Angeles. Dreux works hard in a diner and Alyssa is an aspiring artist. They live with Alyssa's boyfriend Keshawn who dreams big but doesn't achieve anything. When he uses the money due for rent on a scheme of his they are in a predicament. The landlord demands the rent or they will be evicted. So ensues a crazy day of them trying to find the $1500 due. They try to get a payday loan, but when that fails they have to resort to other ideas. This film moves at a pace and the stars in Keke Palmer and SZA do well and have a nice chemistry. But by the end it all feels a little light. A fun film, but not one to live in the memory.",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Not worth paying to see at the movies..I was super disappointed..It was long a long episode of a less than average TV show pretending to be a movie.",
    "date": "2025-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Basically a long episode of insecure",
    "date": "2025-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It had a lot of fun moments and Keke Palmer and Sza has very good buddy chemistry but the plot decisions made it so I never really rooted for them.",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Hotel Mario, saving the princess from Koopa and his 7 Koopa hotels: It's been One Of Those Days.\n\nDreux and Alyssa, trying to avoid eviction: Oh yeah? We had One Of Them Days!\n\nWhy did this feel like Friday? I liked it!",
    "date": "2025-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It is rare these days, to have a film be comedic while also developing and advancing themes that are relevant in the current socio-economic era. The hypebole used throughout the film is grounded in reality, so much so that it doesn't come off as absurd. This made for an enjoyable watch.",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It is rare these days, to have a film be comedic while also developing and advancing themes that are relevant in the current socio-economic era. The hypebole used throughout the film is grounded in reality, so much so that it doesn't come off as absurd. This made for an enjoyable watch.",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Funny and good chemistry.",
    "date": "2025-08-18"
  }
]