[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Awful awful movie with some actors I used to like.  Unbelievable timeline of cocaine being transported from its source near the Columbian/Bolivian border  across the Gulf of Mexico,  through Mexico, through the States (California, Nevada, Idaho, Washington and then, with Skidoos (in the summer) to British Columbia.  Another USA slap to Canada re: drugs and being inept at law enforcement.  Give me (and Canada!) a break.  The last scene where an FBI Agent in charge murders Nicolas Cage is so ridiculous that my spelling out the stupid ending should do YOU a great favour— skip this one!",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Not as bad as majority of reviews. All actors are convincing in character. Could have been written with more coherence and direction, cinematography is good but seems half heartedly directed. Such a great cast, all that talent could have been better utilized. A lot seemingly unconnected events happening, which makes story sometimes feels convoluted.",
    "date": "2025-05-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I don't know why such bad reviews, I enjoyed this film. I mean it's not an academy award film, but a very real look into cocaine travel. Great actors and I give it 3 1/2 stars.",
    "date": "2024-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It's not a blatant caricature of the cocaine trade. But it falls short on nuance and acting and the ending feels rushed. Both Fishburne and Cage deliver watered down performances and they were as good as it got. Mediocre directing and predictable script missed a chance of a much better portrayal of the deadly and costly drug war. Watch it with low expectations and you might enjoy it. Just keep in mind that it barely scratches the surface.",
    "date": "2024-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It was so interesting how this story is told and how the characters ultimately converge. I could do with a little less of the vulgar sex scenes with Laurence Fishburne (great actor) which is why I gave it 4 stars, but you can always FF through that. Don't trust all these negative reviews. It was so cool to see the map graphic from time to time in the movie to see how the drugs travel and how the cost goes up with each stop. Just try watching it. Unique, cool movie with all great actors to support the plot.",
    "date": "2024-03-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It's an interesting look at the steps to getting drugs from the farm to the united states, but it just doesn't have enough happening outside of that to make it a very interesting movie. Nic Cage feels wasted as a serious top level drug runner who's only role is really to test drugs along the chain of custody.",
    "date": "2023-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie seems to be getting smashed in the reviews and I'm not sure why. It's well acted, directed and written. Maybe it was packaged as something it wasn't in the trailers, but it's not typical and I like movies that aren't afraid to try something different. Worth watching",
    "date": "2023-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I enjoyed the movie. It's a lot better than some I've seen with higher rotten tomatoes scores.",
    "date": "2023-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A very understated story following the trafficking of cocaine into America from various viewpoints.  The disjointed storytelling style and big stars elevate it a bit, but it is slow going and doesn't really go anywhere or do anything interesting.  The short run time, semi-realistic take on affairs and subject matter holds your interest, but it doesn't build up much tension and the ending was very anticlimactic.",
    "date": "2023-05-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "É um filme delicado com tema recorrente no cinema. Na trama temos atores de peso o que faz um diferencial para o filme ser razoável acima da média. Fui assistir achando que fosse um filme de pura ação... Me decepcionei até certo ponto, pois dar para assistir e é interessante até.",
    "date": "2023-05-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Básicamente el traslado de producto de un cartel de drogas, desde Colombia hasta su destino en Canadá.. Ya esta, eso es la película. Aburrida pero el principio y el final estuvieron buenos.",
    "date": "2023-02-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Why would someone waste time and money making a pointless movie half of which you don't eve know what's happening because everyone is speaking Spanish?",
    "date": "2022-02-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's a movie that's smarter than its predictable audience. A subtler title would've helped draw proper attention. A good cast of veteran and rising stars should cue folks that is a film worthy of Nicholas Cage rather than just one of his paycheck flix. Takes about 5 minutes to make that this ain't that. For those who ignored this film just because... suspend your assumptions and check it out.  You'll be glad. For those expecting the predictable schlock, you're right to be disappointed; this movie wasn't made for you.",
    "date": "2021-12-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "They should have made this into a dark comedy... There was nothing serious about this film. It was filled with unbelievable scenarios and corny characters",
    "date": "2021-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It just junky story from farm to consumer with lots of society chaos. Absolutely not for teens, nothing interesting here; it's just a waste of Cage & Fishburne talents.",
    "date": "2021-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Film d'azione in ambito di malavita e traffico di droga che riesce nel suo intento di distinguersi grazie ad un filone interessante in cui si segue tutto il processo di un carico di cocaina dall'inizio alla fine.\nInteressante il mix di personaggi che si sussegue, tutti pur con pochi minuti riescono a dare qualcosa di nuovo e ad arricchire il contenuto.\nScene di azione pessime e assolutamente evitabili.\nFinale discreto.",
    "date": "2021-09-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "We always watch movies because it's just our \"thang\" and so many are notoriously bad.  This was a surprise, he didn't act at all like usual, not the same mannerisms or even voice pitch.  It was a surprisingly good movie.",
    "date": "2021-02-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Cage is near the top of the coke chain and has to take care of some shipment issues that Fishburne has gotten his hands into.  Leslie Bibb is fed up, running around and nobody getting arrested...",
    "date": "2021-02-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "What a waste of time!  Just plain terrible.",
    "date": "2021-02-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Enjoyed this film quite a bit. Twisting and interesting, brings drug trade back into conversation where it should be.",
    "date": "2021-01-19"
  }
]