[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Poorly done with too many cuts to other comedians. Too many meh clips and poorly organized. Too bad. Poor execution, not worthy of its subject.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Such a disappointment.  Eddie Murphy was da bomb, the king of entertainment for a period of time until he bombed taking on awful scripts and projects. This documentary is a vanity project presenting Eddie without any insights on his failures or his personal challenges.  What made the documentary worse, beyond the effusive praise of when was da bomb, is what comes across as Eddie’s humongous ego.  Eddie Murphy may have more talent than (all??) others - we can debate that - but there’s no debate for his lack of humbleness, which turned my stomach.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It’s not the Eddie Murphy documentary I was hoping for. As one of the best comedians of his generation and an actor that shaped my childhood, I was looking forward to hearing about what inspires him as an artist and his legacy in the industry. Being Eddie is just two hours of Murphy talking about himself in a one-dimensional way.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A fun documentary that just lets us sit with the charming Eddie Murphy who  is as engaging as he has always been.  It does make you remember that Eddie should have received an Oscar nomination for The Nutty Professor!",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "One of the greatest performers of all time unfortunately comes across as insecure narcissist. The first 30 minutes was enjoyable but it got tired and depressing afterwards. He should have hired Bill Joels documentary team",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Finally, we can all sit around and watch Eddie Murphy stroke his own ego for 2 hours straight.  He’s so great, just ask him.  Nobody wants to see that. \nOther than that. Great to watch.  Love the Richard Pryor references.  Hate that anyone could ever be called \"the new Richard Pryor\", because… Richard Fricken Pryor!   But Eddie Murphy is also very funny and talented.   Just ask him lol. \nI would just rather hear that from fans, rather than Eddie himself.  Over and over again.. did you know Eddie Murphy Credits himself for Denzel Washington and Morgan Feemans careers?  Yup.\nIt actually gets kinda gross at some point.  Ego Murphy..",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Who knew all this time Eddie Murphy just wanted to be Jeff Dunham.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "An hour and 45 minutes of just pure ego driven fluff. Eddie talking about how great he is interspersed with every big name comic they could get to talk about how great Eddie is.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "great one-sided eddies view of his life. coulda had a minute with his 1st wife who he fathered 9 kids with or dan aykroyd, jamie lee curtis, anybody. other than that, this was a good watch.",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A different perspective.",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Documentaries should cover the good and the bad. This just evangelizes Eddie and discounts any negative interactions he may have had. There is no mention of any of the controversies it's just all fluff, so you only ever get half the person. After a while it's a bit grating and synthetic. I don't know if that's his fault for not filtering his own ego or the directors fault for steering away from difficult questions but the end result is another puff piece that is a bit dull.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "They must have fired the editor early on.  Much good material, but a self-indulgent, endless ego trip.  Could have been a delightful film",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It was nice to see a different side to this artist. My eyes were opened to some of the challenges he faced and how many doors he opened for others. It’s worth a watch.",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It's decent, but it could have been - and should have been - so much more.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This documentary touches mostly on the highlights of Eddie's career. Not really much insight into the person. I like Eddie Murphy as an artist and I know a little bit more about him when he did standup in New York back in the early 70's. But this documentary is not a must-see even if you're a fan.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I was completely bored out of my mind. Even Eddie with his family just looked contrived and staged. Dave, Tracey, Chris just drivelling crap about him was just sickening to be honest. There was no mention of Nicole his first wife who he had many children, his current wife how they meant or anything with substance. Netflix do better, why am I paying subscription for half a$$ed entertainment",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Being Eddie is completely wholesome; as a person born in the later years of his career, I was truly introduced to him during Daddy Day Care, Shrek, and Dreamgirls. It was shock to see how introverted he is yet quirky, but extremely grounded. It’s a good watch.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "- Suzie Q. \n\nThis Netflix documentary  \"Being Eddie\"   is an outstanding one. It starts from his early years before fame, and then it takes you through his entire career. There are a lot of things that you will learn about him that you didn’t know. There are things that the industry does to cause friction between fellow actors and comedians. Eddie is a very talented individual, from acting, writing, directing, and his musical talent is also amazing! \n\nThis documentary brought light to the darkness of the industry, the way that they play black actors against each other, or at least they try to. There are clippings of Richard Pryor being asked, how did he feel about Eddie becoming the next Richard Pryor. Why was a question like that ever asked? It was as if they had to erase one to praise another, which is never cool. Arsenio Hall commented on that and made it very clear that no one ever asks white actors about being replaced with other actors. It’s as if there can only be one black entertainer per industry.\n\nThis documentary reflects the personal side of Eddie, it shows him as the person he is behind the stage, behind the scenes. The documentary shows how he has been purposely overlooked to receive an Oscar, which I feel personally that he should’ve received one for Dolemite Is My Name, Mr. Church, and Dream Girls. It doesn’t take away his brilliance, it doesn’t take away his phenomenal genius. The documentary also reflects on the pain that he endured while Saturday Night Live, the show that he literally brought life to, made fun of him, calling him a fallen star. How dare they! Garrett Morris was simply known as \"The Black Guy\" on Saturday Night Live. No other actor brought what Eddie Murphy brought to the show whether black or white. Eddie Murphy was the only reason people tuned in to watch Saturday Night Live every Saturday night… Period.\n\nHe reinvented characters and real life entertainers, such as Buckwheat, Gumby, Mr. Robinson’s Neighborhood (His version of Fred Rogers), James Brown, Stevie Wonder, Velvet Jones, Richard Simmons, and the list goes on. None other has brought this kind of talent to the stage, Eddie Murphy is simply gifted. It was something special about everything that he did on SNL, and the fact that what he brought to us was never done before in the way that this mastermind brought to us through his performances. He’s made us laugh, he amazed us, he brought millions upon millions to their T.V.’s on Saturday nights. He never let us down, he scored every single time! And, that is what brought viewers to SNL, it was truly The Eddie Murphy Show. After he left SNL the viewers dwindled, they never had as many viewers as it had when Eddie was on the show. Facts. He still continues to amaze us over four decades of excellence. \n\nThere may have been a few flukes along the way, but they could not erase what Eddie has already given us. There are many entertainers that have had flukes, or made bad choices in productions, but that in no way can define one's sagacity such as Eddie Murphy. Today people still make references to his movies and his comedy even as far back as the early ‘80’s to current. He spoke of the loss of his brother, Charlie Murphy, who was an awesome entertainer and comedian. He didn’t linger on the subject, but he did speak on it. As we all know, it’s not easy to lose a loved one, and it’s extremely hard on others that they cannot dwell on the subject regarding a lost loved one, because it can truly take you to a very dark place. It was visible that he was hurting within while discussing Charlie.\n\nThe documentary briefly reflected on his children, all ten of them. The documentary did not focus on his marriage with Nicole, nor the divorce from her, it generally focused on him and his career, rightfully so. There were various actors, comedians and entertainers commenting on topics regarding Eddie’s career. Although Eddie Murphy is widely known internationally, in my opinion he should be recognized far more than he is. What I love best about him, is that he knows when the industry tries to throw digs at him, but he overlooks the impertinence of their gestures, and he keeps moving forward.  Such a stupendous one he is.",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This was a fluff piece. I was hoping to learn more about Eddie as a person including warts and all but it felt like it was an Oscars tribute not a real honest to god look at his life. Pass.",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This showbiz documentary was very good. The entire crew did a spectacular job on telling the story of the legendary actor/comedian Eddie Murphy. Eddie goes in depth on what his life and career has been like and what he does to keep progressing in it. If you haven't seen this documentary yet, check it out sometime. It's an absolute must see.",
    "date": "2025-11-15"
  }
]