[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I liked it, but the whole idea of the infected got lost. They went from being the main villains to basically becoming background characters. I also didn’t like how the movie tried to humanize everything; the other films do that too, but in a more shocking, impactful way. I wasn’t a fan of the \"alpha\" idea either — it’s a good antagonist, but it shouldn’t be above the regular infected, because that was supposed to be the key difference compared to movies like World War Z. I also didn’t like (and this is more personal) the childbirth scene; I honestly don’t think it was necessary. As for the humanization, the previous films were much more brutal. I just hope the next ones are good.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Story falls apart quickly with little tense action and meandering plot line that leads to a dud trying to set up a 4th film",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "TERRIBLE. Cheap and a waste of time",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Absolutely awful, I loved the other films but this was terrible, do not watch",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "2 hours of my life ill never get back",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I am 99% sure this movie was written by an 8 year old.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Annoying kid making poor decisions.   When you find yourself routing for the protagonist to die that is a problem.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Possibly the best of the 3 films. Very poignant. The young actor who plays the lead character Spike makes this a worthy watch.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Dearie me! Danny, Danny, Danny. Dropped the ball with this thanksgiving turkey. What a load of garbage! \n\nWe were so excited to watch this after a rerun of the first two and what a disappointment. It’s a film that doesn’t know what it wants to be. \nStarted out okay but it’s like the writers somehow managed to get themselves infected and trolled everyone into parting with their cash! My jaw is still on the ground.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "OMG. I’ve never written a review on RT before. I felt compelled.  I won’t get that two hours back, or my £4.99. Move on.\n\nWhat were Danny B and Alex G thinking? What was Ralph Fiennes thinking? And Jodie Comer!?\n\nThe editing is like a bad pop video. The score just doesn't work, but I was ready to forgive the creative licence. Then... it was OK, up to the point a zombie had a baby. Then, it decends into comedic farce. Awful.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I was a huge fan of the first two movies and was so excited for the release of 28 years later, but I couldnt be more disappointed. I honestly dont know why this did well with critics. I watched this with my family and every one of us thought this movie was a total letdown. The story line was just infuriating and the characters were very unlikeable.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very different from the original,  but I enjoyed almost as much. Very much a film in two parts, with some pretty dramatic tonal shifts. There were a few strange choices that took me out of it, but overall quite engaging.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "si pudiera no le pondría ni media estrella, esta era una gran saga de cine, quien pensó que la idea estaba buena, están desfasando el cine del terror, nadie quiere historias de amor y sentimientos no tiene sentido nada en esta película. me dio vergüenza ajena.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is probably one of my favorite sequels to the franchise it was gritty and scary I like the fact that we get different levels of infected they\nexpand the lore really well this a must see",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Loved The chaotic  energy and beautiful cinematography",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "28 Years Later is as a thrilling and worthy continuation of the franchise, with the original creative team returning to deliver a darker, more evolved take on the rage virus. I like the fresh setting of isolated settlers, the father‑son dynamic between Aaron Taylor‑Johnson and Spike, and the emotional stakes of Spike’s journey, which add heart to the horror. The film introduces new classes of rage zombies—regular, alpha, and bottom feeders—bringing variety and tension, while Ralph Fiennes’ doctor role expands the lore. With intense violence, gripping atmosphere, and strong character work, I found it both scary and heartfelt,  it's possibly my favorite of the series despite a strange ending that sets up future sequels.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A great plot which adds little to the overall universe.\n\nI enjoyed the disconnect which has grown between the rest of europe and Britain as it comes to day to day item, e.g. the internet not being a thing in Britain or beauty standard being radically different to the lack of makeup and people just trying to survive.\n\nThis movie changed from the others from being end of mankind movies, to a sort of new way of life and the merging of the dead / living.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "How on god's green earth did this get an 89% on tomato meter? This was awful. What a disappointment. I can \"suspend\" disbelief, after all this is a horror movie, but this is just dumb. Glad we didn't spend money on it. First 1/2 an hour was ok and goes down hill to complete stupidity from there.. Non infected babies born from infected. Babies that haven't eaten since birth many hours later not crying... 'doctor' in woods all by himself surviving and making drugs with no equipment but able to make a crematorium and a mountain of skulls. Meanwhile a well armed military group can't survive 15 minutes. Give me a break...",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "It was extremely boring, especially during the second half with the mum. I think it was meant to be emotional and touching but I couldn't give a rats bottom what happened to be any of the characters to be honest.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I can't understand why this movie got such good reviews. It isn't even coherent. There are more plot holes in this movie than I have seen in a long time. I went with a friend, so I was hesitant to walk out and watched the whole thing.\n\nHis first two movies were excellent in this franchise. My only guess is that they had AI write the movie, then had AI write a bunch of positive reviews once it was released. What a world we live in.",
    "date": "2025-11-23"
  }
]