[
  {
    "user": "Michael Clark",
    "rating": 4.0,
    "text": "What the “Machine” filmmakers did here is to point this out in a humorous and lighthearted manner why AI is the last thing humanity needs at the moment. To be sure, it is a cautionary tale and does so without any furrow-browed, tsk-tsk, finger-wagging.",
    "date": "2024-01-03"
  },
  {
    "user": "Jillian Chilingerian",
    "rating": null,
    "text": "The Mitchells vs. The Machines puts a new spin on the dysfunctional family trope by setting it in the midst of a smartphone apocalypse.",
    "date": "2023-08-22"
  },
  {
    "user": "Rick Bentley",
    "rating": null,
    "text": "Rianda and Rowe deliver their smart script with animation that ranges from traditional to chaotic. Even when the presentation jumps around, the film never loses focus.",
    "date": null
  },
  {
    "user": "Zach Pope",
    "rating": null,
    "text": "PERFECT, Chaotic, Creative, HILARIOUS heartwarming, & the BEST FILM so far of 2021! You’re gonna cry, you’re gonna laugh, & you’ll do both through the entire runtime. I’ve seen the film twice & absolutely adore the film!",
    "date": null
  },
  {
    "user": "Manuel São Bento",
    "rating": null,
    "text": "With a beautiful blend of two animation styles - that may impact the future of this type of movie - Mike Rianda and Jeff Rowe deliver an emotionally resonant story about family, love, and more explicitly, placing ourselves in someone else's shoes.",
    "date": null
  },
  {
    "user": "Nuha Hassan",
    "rating": null,
    "text": "It is an animated feature that includes so many cliches, and yet, it is fun and quirky with a burst of visual storytelling about a family that learns to communicate just in time to save the world.",
    "date": null
  },
  {
    "user": "Mark Serrels",
    "rating": null,
    "text": "It's a little patronizing and borders on cliche, but carries a charm and wit that barrel through your concerns with the energy and subtlety of a good old Rick Mitchell Special.",
    "date": null
  },
  {
    "user": "Brian Susbielles",
    "rating": null,
    "text": "In one of the best surprises of the year, the battle between humans and technology is a wild, high-watt blast of comedy and film homages that attaches old and new generations to the love/hate relationship with our phones.",
    "date": null
  },
  {
    "user": "Benjamin Wiebe",
    "rating": null,
    "text": "Director Michael Rianda and producers Lord and Miller have produced the best example of why “the medium is the message”.",
    "date": null
  },
  {
    "user": "Zoë Rose Bryant",
    "rating": null,
    "text": "The Mitchells vs. the Machines is a fun, family-friendly subversion of “sci-fi disaster” stories with a wholly compelling emotional core and vibrant voice work from the entire ensemble.",
    "date": null
  },
  {
    "user": "Keith Garlington",
    "rating": null,
    "text": "The daddy-daughter dynamic hit me right in my soft spot.",
    "date": null
  },
  {
    "user": "Cody Dericks",
    "rating": null,
    "text": "An inventive, high-energy adventure with a genuine heart that's rarely found in films of its kind.",
    "date": null
  },
  {
    "user": "Erick Estrada",
    "rating": null,
    "text": "A reflection on the possibilities of the internet and what we've created with it... [Full review in Spanish]",
    "date": null
  },
  {
    "user": "John Paul King",
    "rating": null,
    "text": "An inclusive family treat.",
    "date": null
  },
  {
    "user": "Rafael Motamayor",
    "rating": null,
    "text": "The feature debut of Mike Rianda, The Mitchells vs The Machines is both a great coming of age film, a fantastic story of a family coming together and learn to be better, and a highly entertaining apocalyptic adventure.",
    "date": null
  },
  {
    "user": "Susan Granger",
    "rating": null,
    "text": "Frenetic and fast-paced, it's become popular because of a massive marketing campaign.",
    "date": null
  },
  {
    "user": "Carla Hay",
    "rating": null,
    "text": "The animated film The Mitchells vs. the Machines puts a high-energy spin on the over-used apocalypse concept, by balancing heartwarming earnest about family with biting satire about technology obsessions.",
    "date": null
  },
  {
    "user": "David Nusair",
    "rating": null,
    "text": "...an exceedingly slick animated adventure that is, to a progressively distressing degree, dominated by larger-than-life, over-the-top action set-pieces...",
    "date": null
  },
  {
    "user": "Victoria Luxford",
    "rating": null,
    "text": "Its not just the family that work together, everything seems to mesh perfectly in this joyous and hilarious misadventure. On the surface, theres a lot of gags about our reliance on technology... However, its also about embracing the difference in you.",
    "date": null
  },
  {
    "user": "Carson Timar",
    "rating": null,
    "text": "Not every individual frame of the film will work, but the overall experience carries both enough laughs and hearts to be clearly worth checking out",
    "date": null
  }
]