[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Balls to the wall Ana👍👍. Loved it‼️",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Jesus this movie is painfully boring. Some how Ana has even thicker plot armor than John Wick had. It just drags on with this 100lb unkillable monster. But she doesn't hit hard and it's not fun.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Unwatchable.  The only thing worse than the story was the actors and actresses in it. I guess I just hate the dance of bad acting.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Enjoyable comic book type action movie.\nUnbelievable plot doesn't detract from the action.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Good fun action movie on par with the john wick films.\nThough the story is pretictible the film never really goes over the top like john wick 4. Ana de Armas played the role really good and I guess most fight seems are believable for her size.\n\nA joint movie with both characters is a must.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Exactamente el tanque de accion, adrenalina, peleas, tiros, violencia, cuchillazos, hachazos y explosiones que esperaba ver. El mundo de John Wick se amplia y de la mejor manera posible. Peliculón.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It was promising halfway through, but the final act was over drawn-out action, and the run time could've been slightly reduced",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great Movie!!! They Bring John Wick into The Movie!!! Highly Recommended!!!! A++ 🍿🎥🍿",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "So much fun to watch.  I never re-watch movies, I've seen it three times!  Love the elaborate fight scenes, and choreography.  \n\nHighly recommend if you like John Wick movies.  When I saw the pilot light in that dark alley - I yelled out loud!!   Oh no!!!",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "ana de armas fails to fill out the role of action hero. she has the energy of an ig influencer. even keanu who normally shines in these roles fails to lift up the movie beyond a one star dirge. having loved the prior john wick movies, this was a big flop.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Easily the worst movie I’ve seen in a decade. Forced myself to watch the whole thing \"in case it got better.\" It didn’t. Dumb storyline, wildly un-compelling characters… Ana de Armas lacks any trace of bad-assery and is a wildly unconvincing action hero… Not even Keanu could make this a full one star. How could so many great actors make such a bad movie 😅 A disservice to the John Wick franchise.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Absolutely ridiculous \nLikely lots of AI scenes \nIf you like violence you may like it \nBenal plot \nOne could postulate it appeals to a lower IQ sector of the population that are steadfastly in holding onto violence as a way to enlightenment and now its females that are our action hero's \n\nAI effects interesting rest atrocious",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Still carrying bombastic action set pieces with a sense of flair and a story motivated by vengeance, ‘Ballerina’ has everything that makes this action franchise work. Whether it be gorgeous scenery, a badass lead or the intense choreography, this film works in spades by being rough around the edges with all the brutal energy you pay to see!",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is one of the best movies I've seen in a long time. This movie is action from start to finish. The plot is well executed and will keep your attention. I won't go into details because it's better if you see the movie without knowing the details of it, but it's worth watching. I am buying this movie asap. There's not a lot of movies that makes sense, but this one does. I didn't particularly like the ending, but I guess they had to end the movie that way to leave the door open for a sequel. They outdid themselves in this movie.",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Very good movie! Loved the ending",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not Bad,not good neither,in the fight scenes there's always a guy waiting for her with a weapon to finnish the other guy,her father fight scenes are much better,i was sleepy,didnt wanna go to bed yet,so i watched it and stayed up 'till midnite",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Certified American classic 🇺🇸",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Like the majority of Keanu films, it's terrible. Sucks, because I loved watching him growing up. The whole franchise is braindead garbage made for the lowest common denominator.",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Halbgare Storyline trifft “moderne” Ideologie. Viele Unnötige Kampfszenen. Das Motto: Frauen gegen das Patriarch. Eine Ekelhafte Fortsetzung der John Wick Reihe.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Spoko walki z motaczami ognia.",
    "date": "2025-11-08"
  }
]