[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I read this entire book series. More like I devoured this book series. So when I saw there was a movie on Netflix. I turned it on with my little brother at around 11 PM at night, and boom! My night turned sour. All the acting was good. Especially Sophie and Agatha. They were how I imagined them. It felt like someone was given the vague plot of the first 3 books, and made a movie. Why in the name of the School Master did Soman Chainani do a cameo in this! They misunderstand almost every single concept (the ones that put in the movie) in the books. They misunderstand the Trial by Tale, and that’s one of the only things in the book they include. They ignore the biggest mystery of the first 3 books by just name dropping Rafal in the literal beginning of the movie! When in the books it took three, 400 page, full length books to get their names! Then at the end of the movie they dare to propose a second movie. Even the way they represent a 2nd movie is horribly diluted from the book. They imply Tedros is the one who wants Agatha back in the world of fairy tales instead of the opposite! I’m so mad at the direction of this movie the only good thing I can say about it is that I liked the character of Hort in this movie.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I love this movie. Watched it 2 times already and I gotta say that the industry needed this sort of movie. Not 10 because in my opinion they could've went even further with the visual effects because sometimes they felt a bit\n\"cheap\" but maybe that's just me... Soundtrack is very fitting. Loved everything about it but with the bigger budget it would be even better.",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Terrible acting , I feel like even a bunch of students could act better than this. Way too corny and cheesy with just the most random jokes that aren’t needed . The only good thing about this film is the VFX other than that nothing is good",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What can I say? It’s fun and had great acting. If you’re a millennial who enjoyed Sky High, give it a try, I’ve watched it several times and love it.",
    "date": "2025-10-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I know there is a lot of cheese to this movie but I thoroughly enjoyed it. It is fun and entertaining. I always love movies with lots of fantasy. \nI really enjoy how it is narrated, the characters and the music.",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Please make a season 2. I still remember the end of the movie said ( this is just a beginning).",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The dialogue and fight sequences combined with the music and the incredible acting from Sophie’s actor and put together in such a satisfying way that I didn’t realise I was missing until I saw this. The moral complexity is not overdone and is almost brushed over by the bigger problems, which catered to the entertainment of older viewers.",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Wow. The story, the acting-terrible.",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It started slow but definitely picked us up right into the story! Loved the storyline with twists and turns. My daughter, 12, also really enjoyed it! The music was great as well. Will there be a 2?!",
    "date": "2025-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I really wanted to like this, but the story is so weak and lacking. The ending is so dull and the whole narrative falls flat.",
    "date": "2025-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Al final termine encantando con esta historia, no le tenia expectativas pero termina gustando.",
    "date": "2025-06-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I haven't read the books yet, but watching this movie makes me want to read them! I really enjoyed it as something just to watch, it's nice to have on while doing homework, since you can get the gist of the movie without paying too close of attention. Really hoping for a 2nd movie, but will go read the books while I wait! :D",
    "date": "2025-06-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Despite all the backlash I am seeing, I believe this was a great movie! It has an amazing message of how nothing is ever truly black and white in the world! It’s a story of friendship sticking and holding together through the storm! I was in love with this book series when I was in middle school! When I realized there had been a movie adaptation, I was ecstatic! And though I agree that the movie lacks details and insights from the book, it still was an amazing watch for me! I hope there will be a second movie!",
    "date": "2025-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Rubbish rip-off of Harry Potter and aspects of other much better earlier movies. Unimaginative, dull, not recommended.",
    "date": "2025-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very good movie, I'm impressed honestly by how a lot of it took after the books, you don't usually see that with book adaptations. Overall I think it did a great job getting the story across. Though it was a bit rushed, which is fair as the first book is almost 600 pages long!",
    "date": "2025-04-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The film is so horribly embarrassing. The way Sofie is acting, is horrible.",
    "date": "2025-04-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely loved this movie!! I hope they make a 2nd one.",
    "date": "2025-03-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved the story and idea of the movie. \nCan’t wait for the second movie when they decide to go ahead with it.",
    "date": "2025-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "At times it was cheesy at the beginning but it turned out to be a VERY enjoyable movie to watch. The actors were good and did their best. I watched all of it without complaints. storyline was very cute. I would watch again.",
    "date": "2025-02-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The special effects and acting is the only thing that really makes this worth watching. The characters, despise the actors best efforts, were basic and one sided and had no real character development. The old woman prosthetics for Sophie did not look good in the slightest and they might have well have casted someone else for her scenes. This movie would work just fine as a PG movie but they insisted \"oh it has violence and fighting like a lot of kids movies so let's put swears in and make it PG 13\"",
    "date": "2025-02-09"
  }
]