[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Such a great emotional movie",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Emotional and feel good. great for the kiddos with heart and connection for the parents.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Charming and heartwarming little tale with a Wall-E-esque sentiment to it.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I really liked this movie 🍿- it was good 👍🏻",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely loved this. It’s a beautiful illustration on motherhood, love, growth, and life changes. The kids loved it and I cried sentimental tears haha 🤣",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Pixar's WALL-E walked so The Wild Robot could run. The story, while very simple, still offers meaningful lessons on the themes it tackles. The Wild Robot isn't afraid to discuss the darker aspects of isolation, separation, acceptance, the environment, loss, and societal expectations. The strongest aspect of this film is its character dynamics. Lupita Nyong'o as Roz offers a brand new perspective for her career, which shines through as her most unique performance yet.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Completely disarming, utterly magical tale filled with awe and wonderment, continues ascending throughout, and will fill your heart with inspiration and joy. One of the finest films ever rendered to any medium, still gives me goosebumps every time I recollect 🤗",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "10/10 honestly. You know what I mean.. especially if you’re a parent. Great film",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I watched this movie expecting something simple. By the end, I had no tears left to cry, but I was still crying. I'm crying as I write this because I keep thinking about the last line, but you can call me Ros, the way I literally balled my eyes out, for God's sake I can't see the letters on my keyboard because of the tears in the way.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "4/5 since its a part 1, but still felt bitter when i watched it",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "WOW NOW THIS IS A MOVIE",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "é simplesmente incrível, o filme me entreteu do começo ao fim, e os temas abordados só o tornam melhor ainda, tipo a maternidade e mostrando como a natureza é cruel, é simplesmente: \"absolute cinema\"!",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The art, animation, and story telling were captivating. The whole movie I felt engaged and could not look away. My heart ached for each characters and I felt like I connected with them. The lessons this movie teaches are great for any age.",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Definitely pulls on your heart strings.  Such an easy movie to love.  Possibly even shed some tears (I did). Reminded me of watching Johnny 5 or E.T.",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was such a great original film. It captured the attention of my teenage children and even myself. I recommend this movie for all ages.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wild robot was an amazing movie lots of tears and joy my daughter loved it kept her engaged in the movie. 10/10 movie best movie recommendations to all kids ! Must watch !",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The animation is BEAUTIFUL, and the characters are so well written. The soundtrack is also amazing, as is the tone. Greatest movie ever",
    "date": "2025-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Beautiful.",
    "date": "2025-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best movie I’ve seen in years",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "In Love, this movie could have been done with no words and have the same effect on me. beautiful movie",
    "date": "2025-11-03"
  }
]