[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I only ever heard about the escape of the inmate and not the outcome. This was a nice documentary to get caught up on it without making you feel like you're supposed to side with either person. Interesting story. Worth viewing.",
    "date": "2024-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Quite entertaining look at the various  characters in and around a rural jail. Not much more to the story that wasn't already known with the very big exception of a series of phone calls between the perpetrators, and the perspective of various enthusiastic characters surrounding the events.",
    "date": "2024-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very captivating story.   A must watch",
    "date": "2024-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "When Netflix gets their teeth into a juicy story you can guarantee the outcome will be a highly enthralling documentary, and that's what we get with 'Jailbreak: Love on the Run'.\n\nSYNOPSIS: 'When Vicky White, a highly respected corrections officer, aids the escape of a violent felon nearly twenty years her junior, it reveals an unexpected love story amidst the ensuing high-profile manhunt and media frenzy.'\n\n'Jailbreak: Love on the Run' fits into that category where I always say 'only in America' and with this documentary that actually might be the case. \n\nIt's a fascinating story told in an exceptional captivating manner, leaving viewers mesmerised by the madness happening on-screen.\n\nObviously the outcome is sad, maybe harrowing, but it's still terribly intriguing.\n\nNetflix do it again.\n\n8/10",
    "date": "2024-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Nothing creative or revealing in this made- for-Hollywood story about 2 star crossed lovers.",
    "date": "2024-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Shocking and fascinating documentary that shows what people are willing and are able to do to attain the feeling of being loved.",
    "date": "2024-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This is a disturbing documentary. Not because of the assisted escape of a criminal. But, of the clear red flags that were ignored, enabling this to happen. There are phone recordings of the corrections officer and the criminal clearly having a intimate connection. That these recordings were not heard until after the fact shows the incompetence of the local police force and its prison system. It's hard to watch stupidity unfold and take it seriously.",
    "date": "2024-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This story is very strange and very sad. Vicky White is an aging burned out Corrections Director who opened herself to a romance with a dangerous inmate. Whether he truly loved her or was merely manipulating her is not clear, it may have started as one thing and two years later, became the other. I felt sorry for her. She was tirelessly working a highly stressful job, one that likely was a bad fit for her compassionate nature and lonely life.  She ended up in a terrible situation because of that trait. It would be easy to brush off her lack of caution as a woman foolishly in love, willing to do anything to secure the fantasy life she envisioned with her lover. However, I truly think she was exhausted, drained and had a mental breakdown and needed care, care that she was unable to seek from a more reliable and professional source. How I wish she could have had a true friend to confide in, one who would lead her to proper help rather than becoming prey to a predators fantasy escape. The desperate steps she took in her job and the eleven days on the run ultimately reminded me of the ending of the movie Thelma and Louise. Poor Vicky ran out of road.",
    "date": "2024-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Definitely kept our attention as we found it to be a fascinating story. Made us think about how could these events and remance happen. Well done show!!",
    "date": "2024-09-28"
  }
]