[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I thought (incorrectly so) that the cast would pull this movie out of the garbage, I WAS WRONG. This director IS THE WORST EVER! The sequences make NO SENSE in the order they are shown. ABSOLUTELY NO CHEMISTRY between ANY OF THE ACTORS. Vaughn is the only one who pulls it off, and just barely. Conclusion, DON'T WASTE YOUR TIME. THIS DIRECTOR SUCKS.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Reminds me of a Tarantino or Coen Brothers film.  Deserves higher rating.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Good movie for a depressing rainy day when ya don't want to get out of bed.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Yo! I had never heard of this movie. Saw recommendation on Facebook! This movie is bada$$ You heard? Gritty nail biter! Mel Gibson never disappoints",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Zahler manages to deliver the genre goods while challenging audience assumptions and deliberately pushing everybody's buttons. Additionally its quotable dialogue is pulpy but not smugly self aware which is a real feat these days.",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Imagine an amazingly directed movie keeping you on the edge of your seat for more then two hours, with a wonderful script and fantastic performances to enjoy with on top plenty of morality and sociological depth. They don't make them like these anymore. This is astonishing slow-burning craftmanship at all levels, especially director and writer CRAIG ZAHLER. What a film !! !! !!",
    "date": "2025-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Waaaaay too long. Would have easily been four stars if the had cut 45 minutes and kept it at 2 hours. They tried to make it more than it was with some of the dialog, but it didn't work. A bit too hokey. I can't really recommend it.",
    "date": "2025-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Should be called, \"Two people talking in cars\" because that's what's going on for the majority of the movie. Due to its slow build up, I was primed for something awesome to bring it all home. That never occurred but they did include some over the top gratuitous gore so if that's your thing maybe you'll enjoy. Too bad too, mel Gibson and Vince Vaughn could've been a great duo",
    "date": "2025-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's a really cold and brutal crime film. It has some similarities to Heat, but I rate it higher than that film.",
    "date": "2025-06-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This was a really strange movie. \nIt's the most leisurely paced film I've seen AND liked. \nMost Heist movies have a long build up- then the big reveal- then the aftermath. This one took it's time but in a way that made it enjoyable, Almost like it would be in real life= real time. Dialogue was good. Vaughn is awesome, so was mel. Story was pretty cool. \nA keeper and worth your time.",
    "date": "2025-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Vince Vaughn",
    "date": "2025-05-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I really enjoyed it the first time I saw it but after rewatching a lot of the plot falls short. I decent popcorn action flick that's kind of rare to see these days.",
    "date": "2025-05-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "It just did not make my day",
    "date": "2025-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The chemistry between the two leads is superb, which is uplifted even more with great dialogue and moments that would otherwise not make it into many modern films. Even though it is a slower burn than many crime thrillers, the payoff is worth it.",
    "date": "2025-04-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "\"THIS GUY IS LIKE A CIGARETTE COMMERCIAL\"",
    "date": "2025-04-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Another truly original and enjoyable piece of cinema from Zahler. I don't love every direction he goes in but ignore the dummies saying this is sLoW AnD BoRiNg... they just need to go watch another Marvel movie to feel good.",
    "date": "2025-03-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A story which can be fully described within 1hr but \"dragged us across the concrete\" for 2.5hrs. Sometimes, slow storytelling is good. But in this case, I just cannot understand why I'm staring at the actors sitting in a car for almost 10 minutes and basically have done nothing. I don't know where the antagonists came from, what's their name and how did they managed to pull off their goals. This movie literally taught me that if you see the same \"hightlight\" clip on YouTube or TikTok again and again, then it might be a terrible movie or TV show. Also the movie showed us how a bank employee didn't want to go to work and begging her husband for opening the door, only for touching her child once more before she leaves. This clip wasted 3 more minutes and for what? Letting us know her husband have made a bad decision? Or just how important this person is? I couldn't see any of that. Maybe the director wanted to make this movie looks lika a real-life tempo. But movie is movie, I didn't came to the theater to watch somebody's vlog footages.",
    "date": "2025-02-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A really gritty slow burn… I don’t think Vaughn was the right choice, and Gibson seems relatively uninterested, but as far as the antagonists go… good lord what an unsettlingly morbid depiction of real-life violence. It’s worth a watch for that alone.",
    "date": "2025-02-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The writer and director betray the audience again and again. Gratuitous violence does not yield cinematic depth - not in slasher films and not here.",
    "date": "2025-01-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Dull, unimaginative, boring.",
    "date": "2025-01-24"
  }
]