[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Murray plays a middle aged curmudgeon for the umpteenth time, the kid is wise beyond his years and the movie is a mix of the sentimental and unlikely. Maybe the most surprising thing about the movie is Naomi Watts playing against type and getting most of the laughs. Unfortunately the final act wallows in the sentimental and cliche. Pretty average.",
    "date": "2025-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Bill Murray is great, per usual. The movie strikes a nice balance of being funny without being too precious about its heartfelt moments. The humor and poignancy coexist smoothly. Great performances all around.",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 43 minutes!!!!!!!!!!!!!!!!!!!!! The USA grossed over $44,100,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Excelente movie , excellent message worth it , simple but strong !! Light and fun to watch",
    "date": "2025-06-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Pretty damn good. Bill Murray in outstanding grump form with plenty of support. Unlikely winner - but aren’t all Bill’s winners?",
    "date": "2025-05-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A brilliant movie! How did Bill not win awards?",
    "date": "2025-04-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "An absolutely adorable movie ... I haven't had a movie make me cry this hard in a long time BRAVO 👏",
    "date": "2025-04-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This movie deserves at least an 80 percent rating.  This is why rotten tomatoes score are stupid.  It's a very funny movie while being touching and great acting.  The pacing is perfect and ending is amazing",
    "date": "2025-04-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie shines because it has a wonderful cast.   Really enjoyed this dramedy about a single mom and her son, who befriends a cranky old Bill Murray in arguably in his best performance yet.",
    "date": "2025-04-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Really disappointed in this movie, had high hopes. It followed a very predictable narrative with a cliché, unrealistic happy ending. A few funny moments with Bill Murray, it’s a good family movie.",
    "date": "2025-01-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A very good, funny, family movie.",
    "date": "2024-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A nice feelgood movie. Great cast, good storyline. Enough to make me feel without making me cry. I liked it. Give it a go.",
    "date": "2024-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "es de esas pelis que te muestran que hay cosas buenas en las personas rotas, y te dan ganas de conseguir un linaje, muy bonita, bill murray merece un oscar deberian darle uno a esa arrugado vejete pero asi es la academia en fin muy bonita recomendada",
    "date": "2024-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This was hands down one of the best movies I've seen in a long time. Very cute story line as well as a twist of comedy and drama. The little boy Oliver was such a smart boy this is definitely a movie I would watch time and time again.",
    "date": "2024-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I'm being generous giving it a two, but there was some good acting in it.  It's a sloppy movie with a poor message.",
    "date": "2024-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This was a really good movie. Bill did a great job and the kid was fantastic. I really enjoyed this movie. The ups and downs and story was well done with a great twist on the ending. I enjoyed it.",
    "date": "2024-04-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I tried to watch the movie but ended up clicking forward many times\nToo sentimental to predictable. I stopped where I thought there may be something to watch my general impression is this movie though means well tries to hard and \nforces too much on the audience. A simpler script may have made for a great movie\nremove the bookie and the girl friend and just focus on the boy mom and murray\nleave out the priest too. Cheers",
    "date": "2024-02-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "A good example of poor rhetoric in movie form. It hides self-contradictions beneath emotional music and silly sentimentality, a slight-of-hand attempt at hiding its flaws from the audience. It fails at this as well.\nMurray's accent is entertaining but his character is unsympathetic. Sainthood denied.",
    "date": "2023-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wonderful acting and casting! Such a sweet story. I really enjoyed this one!",
    "date": "2023-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "It's always nice to see actors who, over time, mature over time; as in this case, that of Bill Murray. Almost immediately his character catches our attention and sympathy, to leave a good taste in our mouths in the final act.",
    "date": "2023-08-18"
  }
]