[
  {
    "user": "Rachel Wagner",
    "rating": 4.0,
    "text": "It's just so odd and I kind of wish it wasn't so gloomy and morose.",
    "date": "2019-04-17"
  },
  {
    "user": "Matthew Jackson",
    "rating": null,
    "text": "'Frosty' is surprisingly emotional because of the level of love Frosty himself shows for the kids who made him.",
    "date": "2018-12-03"
  },
  {
    "user": "Ryan Voyles",
    "rating": null,
    "text": "It's a tight narrative that avoids unnecessary detours or mediocre songs, and Professor Hinkle is the perfect foil for the children and the kind, absent-minded Frosty.",
    "date": "2018-11-30"
  },
  {
    "user": "Joe Dziemianowicz",
    "rating": null,
    "text": "The animation is folksy and cute, like an old-timey holiday card, and the raspy voice of Jimmy Durante...as the narrator is like home sweet home.",
    "date": null
  },
  {
    "user": "Lynne Heffley",
    "rating": null,
    "text": "The 1969 original, which, though hardly an animation classic, had a genuine, simple sweetness stemming from its inspiration.",
    "date": null
  },
  {
    "user": "Chris O'Falt",
    "rating": null,
    "text": "From the raspy sound of Jimmy Durante's narration to the pastel animation of the town, watching this movie...is like the warmth of listening to an old record.",
    "date": null
  },
  {
    "user": "IGN Staff",
    "rating": null,
    "text": "A big part of what makes Frosty the Snowman work is the voice talent of Jackie Vernon, who gives life to everyone's favorite talking snowman.",
    "date": null
  },
  {
    "user": "Jessica Rawden",
    "rating": null,
    "text": "The movie is distinctly sixties, but its message is still resonant and its story is still fun, today.",
    "date": null
  },
  {
    "user": "Richard Corliss",
    "rating": null,
    "text": "To those of middle age who remember Frosty fondly, we offer this warning: Look again, and yawn.",
    "date": null
  },
  {
    "user": "Jen Johnson",
    "rating": null,
    "text": "This is truly a show about a more innocent time. Makes you want to believe in magic all over again.",
    "date": null
  },
  {
    "user": "AV Club Staff",
    "rating": null,
    "text": "There's not much to it beyond Jimmy Durante's raspy narration and Jackie Vernon's dim, galoot-y voice as the icy golem of the title.",
    "date": null
  },
  {
    "user": "Felix Vasquez Jr.",
    "rating": null,
    "text": "It adds a new dimension to a fun Christmas song only Rankin Bass could have pulled off.",
    "date": null
  },
  {
    "user": "Ellen Dendy",
    "rating": null,
    "text": "Classic Christmas TV special is sing-along fun.",
    "date": null
  },
  {
    "user": "Michael Dequina",
    "rating": null,
    "text": "Retains its charm and all-ages appeal decades after its original broadcast.",
    "date": null
  }
]