[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Nonnas is wonderful, this movie is so heart warming and makes me further think of and appreciate my own amazing grandma, nothing like a sweet feel good movie with a realistic yet powerful message of pursuing what you love with who you love, no matter the venture!",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The concept of this movie is excellent and the fact that it is based on a true story, raised my expectations. but about 10 minutes into the film I started to realize that it was nothing more than a vehicle for Italian stereotypes. So utterly predictable and trite, I truly feel sorry for the famous actors like Brenda Vaccaro,  Talia Shire and Lorraine Bracco, who were evidently roped into this production, thinking it would have more than a millimeter of depth.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Vince Vaughn is always amazing and he definitely worked his charm in this heartwarming true story",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Watching \"Nonnas\" is like getting a warm hug from an old friend. This film lovingly tells the true story of Joey, who channels his grief and longing into something beautiful: a restaurant powered by the culinary wisdom of Italian grandmothers. The real-life footage at the end grounds it all with genuine emotion, reminding viewers that the journey wasn’t just a script—it was Joey’s way of honoring his mom and grandmother.\n\n\"Nonnas\" gently navigates the complexities of loss, forgiveness, and regret, while also celebrating friendship, risk, and—most powerfully—love. Every scene is infused with heart and soul, steering clear of the violence and cynicism often found in modern dramas. Instead, it offers a refreshing, wholesome antidote: an invitation to slow down and savor life’s simpler, richer moments.\n\nIf your brain needs a shot of genuine feel-good chemistry, let \"Nonnas\" dose you with hope and comfort. It’s a reminder that love and food can heal us in ways nothing else can.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A touching story but pretty slow.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A feel-good story that doesn't fool you with the protagonist's struggles (you just KNOW this is gonna work) but is still a fun journey along the way. A lot of familiar faces in this film, and Vaughn has the perfect temperament for the lead. Didn't know it was a true story until the ending.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This is a lovely, feel-good film based on the real life story of a man determined to open a restaurant staffed by grandmothers. It’s a feel-good, comforting watch and Vince Vaugh’s portrayal of protagonist Joe brings a relatable everyman quality to has the audience immediately on his side in determination that his venture is successful in honour of his family.",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I went into Nonna's with no expectations and came out pleasantly surprised and quite entertained. I loved the casting of all the ladies in the kitchen. Vince delivers as usual.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A humbling, heart warming watch.  Great for a Sunday afternoon.  Would recommend and will be watching again.",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie is what you'd get if you asked chat gbt to write a movie about ALL the Italian American stereotypes.  Horrible writing, horrible acting and not even that funny.",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A great movie. Uplifting story. Great performances.",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Such an uplifting, heartwarming movie!!! In a day when it’s hard to get great reviews for beautiful, wholesome movies you’re not afraid to watch with the whole family, this perfectly fit the bill!!! And we are huge Vince Vaughn fans-didn’t think we could love him more!! The ladies-wow! Now we have to go back to visit NY so we can eat there!",
    "date": "2025-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I actually went out of my way to create an account just so I could review this movie. I cannot fathom how it has so many positive ratings. To each their own, but this was one of the worst movies I have seen in years. I’m all for a cheesy feel good movie any day of the week. But this wasn’t that at all. It also lacked any kind of hard hitting deep sentimental emotional moments either. It felt cheesy in the cringiest way and was slow and painful to watch. \n\nNot once did I laugh, I let out an awkward, sympathy chuckle at one point to gauge whether the people I was watching with were finding it as terrible as I was (I found out about 50 mins in that they were). \n\nSide note- I really like a lot of the actors and actresses in this movie so I was very surprised at how utterly crap I thought the movie was. \n\nLike I said - to each their own, but personally I didn’t enjoy anything about this movie. Had to come on and make this account and write this review to hopefully stop other people having to endure it (as I watched based on all the positive reviews). Not sure if I’ll be trusting reviews ever again after this, I’m shaken and so confused by the good ratings (as was everyone I watched with).",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Cute movie with an allstar cast. Based on a true story.",
    "date": "2025-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A feel good movie ideal to fall asleep to on a Sunday afternoon.\nHits all the classic (hackneyed) beats of a Hollywood production in an order as comforting as the food on offer.\nSurprisingly questionable accents, especially considering Lorraine Bracco's language talents, factual inaccuracies and slow pace can be forgiven for the stellar cast.\nSadly, an opportunity to take a great true life story and combine with a superbly talented and experienced company is wasted.",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A comforting, charming showcase of underlying passion expectedly stir the sentimental warmth in tonally honoring a touchingly layered story that respects the meaningful subject’s confidence, even though it was derivatively told under familiar structural routine that follows the similar impact as formulaically stretched. (B)",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A warm hug of a movie! Not breaking new ground but very well done.",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Such a amazing movie. Made me cry with laughter and sadness.",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The premise of the movie was exciting but the execution was a disaster. So many missed chances to delve into the lives of New York Italian Nonnas, so much rich culture and history to share with the world, just for it to be a painfully cringe caricature of what white Anglo Saxon Protestants think of Italians and Italian Americans. The Nonnas don’t even speak Italian, the actors pretending to didn’t bother to learn the most basic pronunciation. Imagine watching someone pretend to be from Mexico and say “gray-see-us” instead of gracias? Thats how Antonella sounded saying grazie, the most basic and easy Italian word, and she kept saying it wrong throughout the movie. Anyone who had a Nonna or even remotely knew one would ever be convinced by this movie. Seems like some rich private school girl’s drama class project that daddy paid for and paid the teacher to give her an A. \n\nNext they should make a movie about Miami Cubans but have people from Minnesota write and direct it and Canadians be the actors.",
    "date": "2025-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "(CASTELLANO) Hay películas que no buscan reinventar nada, sino simplemente ofrecer un rato agradable. Nonnas entra de lleno en esa categoría, con una propuesta cálida, cercana y pensada para disfrutar en familia. Su mayor acierto está en la idea: reunir a varias abuelas italianas alrededor de la cocina para construir una historia de comunidad, nostalgia y afecto.\n\nLa trama se desarrolla sin grandes sobresaltos, pero con un encanto que resulta difícil de rechazar. No pretende ser un thriller ni un drama complejo; apuesta por lo cotidiano, por los pequeños gestos y por un humor ligero que acompaña sin restar emoción. En ese sentido, sabe exactamente lo que quiere ofrecer y lo consigue.\n\nEl reparto es otro de sus puntos fuertes. Hay intérpretes con carisma y oficio, que se entregan a una historia sencilla pero efectiva. Entre todos logran que los personajes resulten entrañables, incluso cuando la película roza lo cursi o lo previsible.\n\nVisualmente, destaca por la fotografía de la comida y los espacios, casi publicitaria, pero efectiva a la hora de trasladar el ambiente hogareño. El espectador casi puede oler las recetas que se preparan en pantalla, un detalle que suma a la experiencia y refuerza el tono acogedor.\n\nEn definitiva, Nonnas no aspira a ser más de lo que es: una película amable, sentimental y agradable de ver. Puede que se quede corta para quienes busquen profundidad, pero para los que quieran pasar un rato entrañable, tiene los ingredientes justos para dejar buen sabor de boca. Y más aún, sabiendo que el restaurante existe de verdad.\n\n(ENGLISH) Some films don’t try to reinvent anything; they just want to offer a pleasant time. Nonnas falls squarely into that category, with a warm, down-to-earth proposal meant to be enjoyed with family. Its greatest strength lies in the concept: bringing together several Italian grandmothers around the kitchen to build a story of community, nostalgia, and affection.\n\nThe plot unfolds without major surprises, but with a charm that’s hard to resist. It doesn’t aim to be a thriller or a complex drama; instead, it leans on the everyday, on small gestures, and on light humor that adds to the emotion rather than detracting from it. In that sense, it knows exactly what it wants to deliver—and it succeeds.\n\nThe cast is another highlight. The actors bring charisma and skill, throwing themselves into a story that’s simple but effective. Together they make the characters endearing, even when the film edges toward the sentimental or predictable.\n\nVisually, it stands out for its food and setting photography—almost like an ad, but effective at conveying a homely atmosphere. You can practically smell the recipes being prepared on screen, a detail that enriches the experience and reinforces the cozy tone.\n\nIn the end, Nonnas doesn’t aspire to be more than what it is: a kind, sentimental, and pleasant film. It may feel too light for those looking for depth, but for anyone in search of a heartwarming time, it has the right ingredients to leave a good taste. And even more so, knowing that the restaurant actually exists.",
    "date": "2025-09-10"
  }
]