[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie was terrible. I truly have no clue what the director was thinking.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "When your novel finally comes to big screen, directed by the one Peter Jackson, cast by top actor and actress, but the heart of the story is not delivered by heart. Some scenes randomly peak without strong reasoning, no good payoffs, it became disconnected.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Peter Jackson regresa de nuevo al drama con esta adaptación cinematográfica de la novela de Alice Sebold. The Lovely Bones fue la primera novela de la autora y la más popular. Curiosamente, tuvo una carrera muy corta como escritora, dado que solo escribió dos novelas y una memoria. The Lovely Bones fue la más destacable debido a que su popularidad hizo que llegara al mundo del cine y también al mundo del teatro. Así que esta fue la única obra de Sebold que pudo llegar a tener su propia película. Peter Jackson se encargó de adaptar esta novela y la convirtió en una película que retoma el trabajo que él había hecho con Heavenly Creatures. Un drama juvenil con elementos fantásticos, algo de humor y momentos sombríos. Jackson ejecutó esta película sin dejar de lado su capacidad para contar historias fantásticas. El director vuelve a aplicar el concepto de la muerte y el más allá, como había hecho en The Frighteners, pero con un enfoque melodramático que se orienta al duelo y la perdida. Es un concepto esencial en la novela que Peter Jackson plasmo bastante bien en la película y la historia resulta ser una tragedia bastante conmovedora de la joven Susie Salmon viendo la repercusión que dejo su muerte en aquellos que amaba. La película conserva la parte sustancial de la novela y solo se diferencian en la forma en que cuentan la historia. Cuando Peter Jackson adapto The Lord Of The Rings, pudo materializar con precisión mayor parte del material original y lo consiguió al convertir la adaptación en una trilogía cinematográfica. Con The Lovely Bones fue diferente y es que la precisión para adaptar la novela tuvo limitaciones.\n\nLa novela original es extensa y puede que en tres horas se haya podido adaptar gran parte de la trama. Pero hay razones por las que se condensó bastante la trama. Se hicieron modificaciones, se cambiaron de lugar algunas situaciones, algunas cosas se descartaron y hasta se tuvo que suavizar el concepto. A diferencia de la novela, la película empieza con un prólogo sobre la vida de Susie para ir conociéndola a ella y a sus seres queridos. Esto se construyo a base de los flashbacks de la novela, ya que la historia en la novela empieza directamente con el momento en que Susie pierde la vida. La novela es mucho más perturbadora con respeto a cómo Susie pierde la vida y en la película decidieron suavizar eso. En la novela, Susie es violada por George Harley antes de ser asesinada. Esto se modificó por obvias razones y la muerte de Susie no se presencia del todo. Aunque la película descarta la violación, la forma en que Harley actúa en frente de Susie es muy similar a la de un depredador. Eso basta para saber cuáles eran las verdaderas intenciones de Harley al invitar a Susie a su escondite. Otro cambio que se hizo es el momento en que Harley se deshace del cuerpo de Susie. Mientras en la novela eso ocurre en el principio, la película lo reserva para después y dar tensión. Un cambio menor que hicieron fue que reemplazaron uno de los huesos del cadáver de Susie por su gorro. En la novela es un perro quien encuentra el hueso, mientras que en la película es un gorro encontrado por la policía. Lo más llamativo de la película es cómo el purgatorio en que Susie se encuentra es plasmado. La película lo retrata como paraíso personal que está forjado por los sueños y fantasías que Susie tenía en vida. Hay un parecido con E Cuarto Mundo visto en Heavenly Creatures por ese aspecto fantasioso que es bastante alucinante. La película recurre bastante al surrealismo en este plano espiritual y hay momentos que son muy psicodélicos. La banda sonora de Brian Eno se hace notar y relucir mucho más en estas secuencias. Lo que Weta FX hizo con estas secuencias es una interpretación que Peter Jackson tuvo sobre manuscrito. En la novela se menciona este escenario en que Susie se encuentra, pero deja que sea la imaginación del lector la que se encargue de visualizar el aspecto de este mundo. Lo que se ve en la película puede o no coincidir con la forma en que el lector haya visualizado el mundo espiritual de Susie. La película condensa la situación de los Salmons al enfrentar la dura tragedia de Susie. Buckley es un niño inocente que no tiene mucha idea sobre la muerte y en la novela él va aprendiendo sobre ello. En la película es reducido a un personaje menor y no se pudo ver como va procesando la muerte de su hermana. También se redujo la aparición de Samuel, el novio de Lindsey y su hermano Hal fue descartado. En la novela, ambos personajes participan más como apoyo de los Salmons La película descarta el romance que hay entre Abigail y el detective Len Fenerman. En la novela, Abigail deja a un lado a su esposo y recurre a Len Fenerman como medio para superar la perdida de Susie. Esto demuestra que la muerte de Susie afecto gravemente la relación de sus padres. En la película se modificó esto, aunque sí se puede apreciar cómo el matrimonio de Jack y Abigail se está desmoronando. También se descartó un momento de la novela donde Ray es considerado un posible sospechoso por la policía. Jack y Lindsey fueron los que más permanecieron intactos, aunque en la novela se profundiza más la pena y tristeza que ellos afrontan. Jack respeto gran parte de su contraparte de la novela y solo se descartó un momento en que sufre de un infarto. Una actualización que se hizo al adaptar la historia es que en la película Lindsey se lleva el libro completo de Harvey como evidencia mientras que en la novela solo arranca una hoja. En la novela Susie conoce a las demás víctimas de Harvey en el cielo, pero en la película ella es quien va descubriendo en el purgatorio esas víctimas. Esta modificación hace que haya tensión y una sensación de desolación que aporta bastante. Otro cambio ligero que se hizo es cuando Susie usa el cuerpo de Ruth para tener un último momento romántico con Ray. En la novela ellos tienen sexo mientras que en la película solo se besan. En la novela hay un momento donde le dedican un memorial a Susie dando a entender que su muerte genero un impacto en Norristown, pero en la película no está eso y es como si lo que le paso a Susie fuera solo otro caso más del montón. Muchos de estos cambios se debe a la condensación que se le hizo a la historia y se redujo el periodo de tiempo.\n\nLa película termina contando la historia de un modo diferente y puede que no convenza del todo a quienes leyeron la novela. Pero la película respeta la temática central de la novela y su mensaje sobre lidiar con la muerte de un ser querido. En ambas versiones de la historia hay un momento donde Jack busca hacer justicia por mano propia y las cosas no salen bien. Este momento sirve como punto de reflexión de que la justicia por mano propia no siempre va a brindar la calma que uno está buscando y tiene sus consecuencias. El mensaje de la historia sería que hay que dejar ir a aquellos que hemos perdido y seguir adelante. Muchas veces pasa que al perder a un ser amado por causa de un crimen, surge el deseo de hacer que el culpable pague a cualquier costo. Pero a veces es mejor dejar que el tiempo sea el que se encargue de ello. Susie tiene un momento en que si desea que Harvey pague por lo que le hizo, pero Holly le dice que la muerte siempre le llega a todos. Este es un momento reflexivo que da a entender que por más que no se llegue a hacer justicia, el culpable de provocar la muerte de un ser amado en algún momento dejara el mundo de los vivos. En la película y en la novela es el karma el que se encarga de ello, pero el punto es que hay que soltar a los seres amados que hemos perdido y seguir adelante con nuestras vidas. En la novela es un proceso largo y en la película está más simplificado, pero el mensaje es el mismo. Así que como adaptación está bien y no pierde la moraleja esencial de la historia. Como película es de hecho excelente y tiene muchos aspectos positivos que la vuelven de las mejores de Peter Jackson. La historia está bien contada, es visualmente bella, tiene momentos reflexivos y un estupendo elenco. Saoirse Ronan es quien se roba gran parte de la película y deja una muy buena impresión como actriz juvenil.\n\nThe Lovely Bones es una fantástica y conmovedora película con un buen mensaje sobre el duelo y tener que dejar ir a aquellos que hemos perdido. La fidelidad al material de origen es algo que ya queda bajo el criterio de cada quien, pero con que haya conservado el concepto inicial y su moraleja es más que suficiente. Mi calificación final para esta película es un 10/10.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I never expect a movie to be as great as the book but wow, I was so ready to love this movie after reading the novel, was absolutely gutted with how much was missing. If you’ve only watched the movie and not read the book definitely add it to your list because you’re missing YEARS worth of storyline. It all felt a bit rushed but still worth the watch regardless.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "3.0 stars; An interesting movie from a movie-making perspective. It's a combination of a psycho killer film and a fantasy. It might have been considered bizarre by the standards of those times (2010); but compared to some of the junk out of Hollywood today, I find it creative. The graphics were good; however, they reminded me of a rock video from that era. Although early in their careers, performances by Mark Wahlberg, Susan Sarandon, Stanley Tucci, and Rachel Weisz were average. However, I was impressed with the teen performance of Saoirse Ronan.",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I watched this movie around midnight and I think it hit differently. I really liked it. It wasn’t mind-blowing, but I appreciated the symbolism behind it. Every detail was important and easy to miss if you weren’t paying attention. I also liked the full-circle feeling that this movie gave me.",
    "date": "2025-09-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Enjoyed the film, some parts felt like the maker was on acid when they wrote it but I watched it to the end which doesn’t happen often as I get bored too easily. \n\nDefo worth a watch imo.",
    "date": "2025-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "decent movie with a very sad story. the actors are great, but the “in between” scenes and the cgi to me were very dragged out and cheesy. It was not a bad movie, but nothing crazy. The story is very emotional however, and the ending isn’t all that satisfying. Overall a decent watch.",
    "date": "2025-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The movie is wonderful, but it wasn't what I expected. Things happen quickly, and some characters don't seem to really care about Susie's loss, as if they never liked her. There was a lack of justice in the end. They could have left the movie with a sunset vibe and non-CGI scenes, beautiful and more real grass, removed the time jump from the movie. The movie is incredible, but I think it had the potential to convey a different and better vibe.",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I can't identify with the low scores. This film is such a classic. Brutal and sad and real. Fantastic acting and just such a tragic but realistic storyline. Maybe the naysayers would rather watch family guy. Fine. Just f off then.",
    "date": "2025-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The story that this movie tells is an important and real one for people to hear, but the characters feel rushed and underdeveloped. The cinematography is great and the acting is phenomenal, but the pacing for some of the characters combined with the painful movie logic can leave viewers feeling frustrated. \n\nI think we are supposed to feel sorry or happy for some characters but you just end up feeling numb to them or disliking them because what’s supposed to make you understand them happens too quickly and/or makes their actions come across as traumatic for the other characters. \n\nFor a movie about grief after loss, with the mom’s character especially, it sadly made a lot of excuses for abandoning responsibilities and lashing out because of personal emotion, which can be particularly frustrating for some viewers. Though I understand it may just be trying to display a range of grief, there is inadequate discussion of how some reactions might warrant an apology later, and that didn’t sit right with my family.",
    "date": "2025-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Well, for all the great things this movie does, it just falls flat. The cinematography, acting, effects are all great. The story itself is heartbreaking, but one that should be told. But, the script and how things were put together just didn’t work.",
    "date": "2025-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Just kept seeing the shirt reels and people were praising so watched this movie. However, I didn’t like this movie at all. With the story they could have done so much better. It was so poorly written and directed. The ending itself was so bad. The guy was never convicted for what he did. He lived a long life and died by falling a cliff. So disappointed",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Poor pacing, weak storytelling, and a cast of characters that play little to no role towards the plot. I’m so disappointed by this film. The trailer made it seem like this was a story of a girl who lost her life, and her father’s journey to avenge his daughter and solve her crime. The trailer also showed a psychic girl who I thought would play a significant role in solving the crime… [SPOILERS AHEAD] Instead, we got a bunch of characters who did absolutely nothing to further the plot, a disco party-photoshoot in the afterlife (literally…), and somehow, the investigation to find the murderer got little to no attention!! I thought the investigation and avenging the murder victim was going to be the main point of the film… instead we got an 8 year time skip and no resolution. The psychic from the trailer played zero part in the story (so why was she even there??) And in a film that wants to be taken so seriously, the grandmother was needless and inappropriate comedy relief!! This had the most unsatisfying ending with absolutely no resolution regarding the murderer. This movie is only 2 hours long because of the excessive CGI scenes. I’m sure the book must have been better somehow, but as a film it fell flat…",
    "date": "2025-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme horrivel, só não dou 0 estrelas porquê não tem como, CGI péssimo, história bizarra de ruim, parece que o filme tenta passar pano para o antagonista o tempo todo, e de certa forma ele ainda tem um final bom, comparado com o fim dos personagens que ele deu para alguns personagens da história, perdi 2 horas da minha vida com esse filme.",
    "date": "2025-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Most frustrating movie ever to sit and watch.. waste of time and money.",
    "date": "2025-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "A terribly frustrating watch. The movie tried to be too symbolic constantly and missed. Could’ve handled the plot so much better. One of the worst movies ever.",
    "date": "2025-05-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "incredible , thought provoking and intense/ scary. I have absolutely no idea how this is rated anything below 80%. This movie will stay with you for a very long time if not always",
    "date": "2025-04-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Quite disturbing. A great film that I still think about, years down the line.",
    "date": "2025-03-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "How not to watch a movie with Stanley Tucci, great actor, sadly and hard to watch but it has become reality for some people, for me is a good movie that you have to watch at least once",
    "date": "2025-02-25"
  }
]