[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Definitely a dad movie. I liked both of them. And of course Benicio Del Toro was great. Down with the cartels!!!!",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is as close to a perfect movie as there is. Villanueve, Brolin, Del Toro, and Blunt are amazing.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "From its explosive opening sequence to its shocking finale, Sicario engulfs you in its perfect tone, score and atmosphere.  Toro, Blunt, and Brolin command the screen in what is 2015's best film.",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Extremely good action and very good storytelling.  Had me captivated.",
    "date": "2025-10-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Easily Villeneuve's Top 3.  It is authentic and raw.  Casting is spot on and each character is adequately fleshed out.  Both directing and cinematography are Oscar worthy.",
    "date": "2025-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Bitter, cynical, and chock-full of suspense and tension. Every scene unfolded with amazing timing and precision.",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "the familiarity of suburban family life captures you and then disturbing realities of violence and gov agendas suddenly make it nightmare-ish, movie manages to get under your skin, solid job by Villenueve again",
    "date": "2025-10-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Pretty boring. Not really engaging.",
    "date": "2025-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "An underappreciated gem.  The sound quality was a little off, and the plot was probably a little too convoluted.  But overall, it is a great story and a great production.",
    "date": "2025-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie with plenty of action along with some great cinematography.",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I honestly did not enjoy this movie at all. The plot was terrible, there was no character development whatsoever?? The whole thing honestly really didn’t make any sense and when it did it left me feeling like … oh that was it..?",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very catchy and thriller. Lots of action ! Must watch",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Easily one of the best and most underrated films of all time for any Action/Drama enthusiasts—but if you are one you’ve seen it (multiple times) and know it’s near the top of the list.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Exciting movie with anticipation and action. Very satisfying ending",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Shows the war the us and Mexico are fighting against the cartels and drugs",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "great movie about the power that the cartel has over Mexico. also i believe that Kate and regie behave like civilians but they were FBI and  swat before joining. also Emily blunt playing the character doesn't really fit she is a small crony women who doesn't look like she can pass the police test.",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the greatest movies of all time",
    "date": "2025-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Awesome movie, such great execution.",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Good production values, This movie is not for me",
    "date": "2025-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The movie starts of great but has a ever slow decline happening the entire time but it never gets bad",
    "date": "2025-08-04"
  }
]