[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The Call (2020) starts with an interesting idea — two women connected across time — but completely wastes its potential. The characters make one dumb decision after another, the logic collapses halfway through, and by the end you’re left irritated instead of impressed. There’s no real closure, no satisfaction, just chaos for the sake of shock. What could have been a tight, emotional thriller turns into a frustrating mess with zero payoff.\n\nIf you want a thriller where the characters actually think, watch Hush, Run, or 10 Cloverfield Lane instead.",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Had to put a one star review to even out the rest. I thought the movie was extremely predictable and the ending didn’t make much sense. Throughout the movie I noticed many cheap points in the writing of the movie. Was is extremely mediocre overall.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "It actually turned out to be a great movie. Found it by searching another movie, but I'm so glad that I bumped into this one. It was really worth it. The whole idea of this movie is not original. The similar concept was in the movie \"The Lake House\" (2006). But this movie is not a romance, it's a horror baby! And they took the whole idea to the whole another level and they nailed it. Besides everything what I mentioned, the acting was good and production was on point as well. U should definitely watch it.",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Pretty good, had me on the edge of my seat and thinking a lot throughout the movie, wondering the outcome. A good watch, but I’ll say I wouldn’t watch it again, but that’s just the emotional side of the movie that left me feeling like that.",
    "date": "2025-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Hard to make horror through a cordless phone work well - but they did. Antagonist chick is wicked.",
    "date": "2025-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The Call, adapted from the 2011 film The Caller, offers a gripping story of cross-time communication that alters the present in real time. While this concept creates suspense, it introduces major logical flaws—such as memory inconsistencies and sudden resurrections—that clash with established time-travel logic. Despite its plot issues, the film shines through stellar performances, particularly by Jong Seo, and strong visual execution, though the after-credit scene undermines what could have been a powerful ending.\n\nRead the full review here: (Indonesian version : alunauwie.com)",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The story had a lot of potential, but the director ruined the movie.",
    "date": "2025-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "amazing story . the performance is amazing.",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The show was good. But the ending doesn't make sense.",
    "date": "2025-05-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "First half might be slow. But it really picks up! First half 5/10. Second half 15/10.. Average 10/10",
    "date": "2025-05-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie kept me entertained the whole time. I loved how it showed how fast a person can change in such a short time and go crazy. Overall this shows that the past should not be messed with and everything happens for a reason. The acting was really good, especially since this is Jeon Joong-Seo's second movie filmed. The emotions of all the actors were shown perfectly. The ending may be confusing to some people especially since I don't usually watch all of the credits.. In conclusion this movie is definitely worth watching.",
    "date": "2025-04-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I loved it, poor girl shouldn't answered the phone or let that crazy be sacriced by her stepmother, and why they ruined the ending, I'm goimg to keep the one before the credits not the ruined one",
    "date": "2025-04-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Ignorando o final/cena pós créditos rídicula e sem sentido, quebrando toda a narrativa construida e a lógica do filme, minha nota é essa. pensando no final antes do plot forçado. Eu achei um suspense muito bom. A insegurança da estabilidade do presente da protagonista é a chave do desconforto do filme. Gostei demais dessa ideia de mexer com o futuro sabendo o passado, e conseguiram deixar uma história bem linear, com um assunto tão complexo como esse, como já dito, ignorando totalmente o final.",
    "date": "2025-01-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "excellent movie. The greatest performance ever",
    "date": "2024-12-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "When I first watch this, I don’t find it scary but when your already in the most part of the series, I was started to feel very anxious and frustrated (dunno why) I really like how they made the film, very interesting. The plot was great. I really like how the two characters one from the future and one from the past had a conflict to each other. Like the killing scenes by the way. I definitely recommend this movie, really good!",
    "date": "2024-12-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Um thriller tenso, com ótimas atuações, um belo roteiro, maravilhoso trabalho de cenografia e efeitos. O fim surpreende, e aposta numa continuação.",
    "date": "2024-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Solid thriller with an interesting plot mechanic. Don't spend too much time trying to make sense of it, just go with it.",
    "date": "2024-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Good enough mind bender, but totally spoilt by a ridiculous addition to the end scene ffs🤦‍♂️",
    "date": "2024-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I'm very happy I trusted the Tomatometer on this one. It was genius. Watched it in Korean w/Eng subtitles (cuz you need to know). I've always enjoyed time travel movies. You travel back, then butterfly-effect the \"present.\" But, \"The Call\" takes a different (original) spin on this, by using a telephone to span the 20-years between the (literally) tortured Oh Young-sook of 1999 and the (figuratively) tortured Kim Seo-yeon of 2019. My eager suspension-of-disbelief bought into this concept and its dramatic (horrific?) effects on both the present and the past. Very well done. Lots of wonderful tension. Is Oh Young-sook's shaman mother the villain of the piece? You'll have to stream it and find out....",
    "date": "2024-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "WOW. this is crazy. it's absolutely mind boggling",
    "date": "2024-06-11"
  }
]