[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This third movie of the series was a good ending. It summed up all the characters from the earlier movies. I must say it was a bit of a sexual film compared to the other two. But definitely also a watch worthy.",
    "date": "2024-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "At first, I couldn't imagine what a third film could offer, but I was pleasantly surprised by the result! We see many returning characters from the second film and are also introduced to new characters, like Peter Maxwell, who is oh so charming. The film has quite a bit of tension and a sexual undertone, which suits the film well and you can't help but get quite giddy ;)\n\nThe film is a good conclusion to The Princess Switch series and you won't regret watching it!",
    "date": "2024-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I still feel like adding a third was distracting from the original storyline. And still believe that Lady Margaret and Kevin have no chemistry, but they have somehow progress further than the other duo. Stacy De Novo and Prince Edward in my opinion have better chemistry and the reason I fell in love with the first. But they seem stuck, they are in the same place as they were in the first movie. We have to believe that Edward is still prince and not king and that the pair have no plans to start a family. It just seems that the last two movies of focused on Lady Margaret and Kevin relationship with the addition of Fiona.",
    "date": "2024-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Es. Mejor 1 y 2 pero es mala y muy aburrida y Fionna y Peter es relación que importa el 90% de los personajes son olvidables y las actuaciones son feas es un 2.3 de 10",
    "date": "2023-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Laughably 'bad' movie, perfect for people who don't want to take it too seriously. Fiona is the best of the 3 lookalikes because she is purposely unrealistic and her character is exaggerated to the max; which makes her a good main character as it is hard to believe what the writers wan't you to believe about the perfection of the other two.",
    "date": "2021-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Por ser uma trilogia de Natal, acabamos que não temos muita novidade no enredo, apenas mais uma história de amor, para provar que vilões também amam!",
    "date": "2021-12-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The third Princess Switch features less of the romantic plotlines of the first two in favour of a bland and by-the-numbers caper.",
    "date": "2021-12-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Super fun!!! I hope every year they add another character for Vanessa to play until she is 80 years old. Count us in. Family Christmas movie every year, all three switch movies. Love love love it's honestly fun and goofy and good times.",
    "date": "2021-12-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The first of these movies was okay for me. Not great, just okay. The second was pretty meh. I wasn't even sure I wanted to watch this third one because I didn't really love the Fiona character in the second one. But I finally figured I'd see it, just so I could say I watched all three. And I've gotta say, I was surprised how much I actually enjoyed this third one. More than I expected to. It wasn't like the other two--this one is more of a heist movie, and I love heist movies, so that could be why I vibed with it. It was funny and I ended up liking Fiona quite a lot by the end. She turned out to be a far more interesting character than Stacy and Margaret.",
    "date": "2021-12-04"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Acting is cringe worthy. Fiona character is obnoxious to watch",
    "date": "2021-12-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It puts a spin in a character we thought we'd never see again, and three vanessas is always a plus, but the story is loaded with Netflix Christmas bait.",
    "date": "2021-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "So bad. It's a shame because the first movie was lovely, the second one was also nice. I feel like they've added too many Vanessa Hudgens characters and it just comes across as… tacky.",
    "date": "2021-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The most unexpected trilogy ever and this could be the best of the three yet. Entirely ridiculous but wholehearted Christmassy fun.",
    "date": "2021-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I could watch these films every year. Just keep adding more Vanessas. This time it was all about redeeming Fiona. Next time? How about a baby? Or another look-alike? Or a crossover with her other franchise, The Christmas Knight?",
    "date": "2021-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This one didn't know what it was trying to be. There's are romantic comedy, heist film, emotional drama, and twin switch stories all in here. It has fun moments but it's not as enjoyable as the first two entries.",
    "date": "2021-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I like the chemistry between Remy Hii and Vanessa Hudgens in this movie. They should make more rom-com together. The message in this movie is about forgiveness, love, understanding, and patience which reflects the true meaning of Christmas. Vanessa Hudgens is a great actress. She was able to portrait 3 characters in one movie.",
    "date": "2021-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Meeh... That's the best way to sum this movie up. It's perfect for the type of situation I was in when I watched it. Before going to sleep, didn't feel like browsing so when it popped up in recommendations I hit play.\nThe storyline is ok I guess, but there are too many exagérations on the main character.. All those \"perfect sexy thief\" moves she performs during the heist feel way too exagerated, cheap. She didn't make me believe it. \nPlus it doesn't match the rest of the character. You can't show a cardashian type of girl all through the  series and then make me believe that when she puts a black suit she transforms into a ninja. \nI didn't like the fact that when it \"snowed\" there was actually no snow on people's clothes... And in this movie the husbands actually have no real part... They are just there, hanging around, approving or disapproving from time to time. But anyway, it's not running for the Oscar  sooo I'll just stop here with the criticism.. It's a nice movie all in all but nothing wow.",
    "date": "2021-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Idiocracy movie was right.",
    "date": "2021-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Vanessa Hudgens playing Fiona is insanely funny",
    "date": "2021-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "its good over all but the physics are really un realistic but yes its good overall",
    "date": "2021-11-19"
  }
]