[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It’s a comedy !!! Ffs \nNot meant to offend the sensitive type , I m thinking ????\nBetter you shield yourselves from the  vulgarity and negative dialogue , you’ll have nightmares 🤪 \nBit of fun 🤩 I enjoyed it anyway 👍",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "While Robert De Niro and Zac Efron show flashes of comedic brilliance in Dirty Grandpa, the film's overall unappealing and lack of originality leaves it feeling like a missed opportunity. The rest of its talented cast deserved better,\n\nGrading: C-",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Ignore those low critics score because this is a funny movie. The A list actors and the jokes are spot on for people that want a good laugh.",
    "date": "2025-05-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I honestly don't understand all the hate this movie gets. Just finally watched it and loved it. Laughed my ass off. Idk if people have an expectation because of De Niro but I love he did this and wasn't his normal schtick. If u wanna laugh and love raunchy comedy. Watch it!",
    "date": "2025-03-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I laughed the whole movie.",
    "date": "2025-03-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I enjoyed this film thoroughly. The novelty of seeing Robert De Niro do half the stuff he did in this movie, so much better. Zac Efron was pretty decent too, I think most if not all the jokes landed for me. This movie is a good time and that’s all it needed to be. You’re not getting the next “Dr. Strangelove” out of this. It’s exactly what the title implies and it does it well. 4/5 stars.",
    "date": "2025-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I swear, if the Tomatomater says 10 percent, you need to stop trusting it  — this is a gem of a comedy, plus there’s Robert de Niro! Well, he’s not the stellar performer he was in, say, The Intern — but he’s entertaining as entertaining can be, from beginning to end. As are all the other main characters, in fact. Except for the implausible + soppy bit at the end, 4 or 5 stars any day. Plenty of fun for the entire family! [Just kidding — this movie is a serious R!]",
    "date": "2024-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This movie only gets such criticism because De-Nero is in it. It's a a perfectly decent dumb funny film, a few laughs, and a few things to think about in you own life.",
    "date": "2024-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Not a bad comedy at all!",
    "date": "2024-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I absolutely love this movie. And I've watched it several times and love it more every time I watch it. Robert De Niro is amazing in this movie and so is Zac Effron.",
    "date": "2024-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Robert de Niro and Zac Efron did excellent! \nObviously people don't know what comedy is and don't have any sense of humor. \nRobert de Niro did extraordinary and dirty Grandpa! \nShould have got a sequel. \nEveryone that has negative comments should just watch (Law & Order).\nAnd reflect on yourself.",
    "date": "2024-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Just look for laughs and nothing more, and it's a decent watch. Reminds me of a Farrelly Brothers movie,",
    "date": "2024-06-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Rubbish. I would give it zero stars if that were an option.",
    "date": "2024-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I watched this on DVD recently.  I have very mixed feelings about this movie, and especially the way it ends.  I thought it started quite well, building on the solid foundation if reviving a relationship between an elderly widower (Dick) and his grandson (Jason) who had drifted apart during their lives.  It makes sense that Dick wants to make the most of the life he has left, and the contrast between him and Jason is fun to watch at first.  The problem for me was that Dick becomes quite obsessed about making love to the much younger college girl they meet, which takes over the rest of the story.  I expected Dick to find a deeper meaning to his life via his time spent with Jason, but he doesn't.  I found the ending very strange and rather uncomfortable to watch.  If the movie was designed to challenge age stereotypes it succeeds, but in a way that I found unpleasant and disagreeable.  I don't recommend this movie because it made me feel uncomfortable and dirty.",
    "date": "2024-04-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It had its moments.....",
    "date": "2024-04-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "pretty funny! but just a little too long, if it was cut down a bit, it'd be perfect!",
    "date": "2024-04-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Dirty Grampa feels as disgusting as humorous. The story is predictable and relies on gimmicks to be entertaining. It feels flimsy despite its talented cast. Overall, this film has way too much bang and precious little buck.",
    "date": "2024-02-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It's over the top sometimes and the gags are not the greatest, but I did get some good laughs out of it.",
    "date": "2024-02-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This was worst then bad",
    "date": "2024-02-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "With this movie, Robert De Niro became an ugly old asshole with no quality adult film.",
    "date": "2024-01-31"
  }
]