[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It wasn't exactly a hit surprisingly. I saw it in theaters. It was all very cool. It couldn't do it like Fury Road though. I actually wasn't a fan of Hemsworth in this one.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A movie soaked in its own style, I'm not really into those heavy apocalyptic style films but I have to admit: you won't get bored when watching furiosa",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Its amazing, it has action, feelings and more action i loved",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Like Mad Max: Fury Road, Furiosa has become – visually and technically – one of the most dazzling films I've ever seen. Everything in this film captivates the viewer: from the actors and cinematography to the soundtrack and memorable performances. This post-apocalyptic world is chaotic, bizarre, and extremely dangerous, which provides a uniqueness that sets it apart from anything else presented in cinema. The action scenes are splendid, so much so that I couldn't take my eyes off the screen. The origin story of Furiosa, a character introduced in Mad Max: Fury Road and played by Charlize Theron, is very compelling and well-developed, making me think that George Miller considered every detail when he created the character years ago. I was pleasantly surprised by Chris Hemsworth's performance here: perhaps because Dementus is quite different – ​​in personality and appearance – from Thor, the Marvel character that launched Hemsworth to stardom. I also enjoyed Tom Burke's character (throughout the film, I kept wondering where I knew this actor from, only to discover later, upon checking IMDb, that I had already seen him in the film The Wonder, with Florence Pugh). Anya Taylor-Joy needs no introduction, delivering a performance unlike her previous roles. And Alyla Browne, whom I first encountered watching Sting, is definitely a star in action, delivering one of the best performances in the film. Oh, and at the very end, we get a glimpse of Charlize Theron's Furiosa, which made me eager to rewatch the 2015 film. Without a doubt, one of the best films I've ever seen!",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A great addition to the Mad Max saga!",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Exceptional visual effects, solid prequel story, tight action sequences --- everything you'd hope to see in a Mad Max Universe film.\n\nAnya Taylor Joy is a wonder to behold.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The cinematography was absolutely captivating, never seen anything like it before. Felt like a panoramic window to another world. Each scene was meticulously crafted with vivid colors, unique camera angles, and just breathtaking to watch.",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Wow. It was very impressive.\nI even like it more than the first movie. Well produced, great cast & storyline. I'm glad that I got to know who Furiosa is and how she became her",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It’s not terrible but still bad! It made no sense all they did was drive cars in the deserts with flamethrowers for some reason! What even are they doing and why is it so long we don’t even see Furiosa as an adult til the halfway point and all you see is Chris Hemsworth acting Dumb and Furiosa in the background crying like why is this a thing?",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "You want it or not, a comparation with the old movie is automatic. The first thing that comes to mind is that it kinda drags the story. It lacks the flow of the previous.\n\nThe main villan is unconvincing and I found myself many times not understanging how to categorise him. Is evil without a clear motive, powerful without convincing greatness. You don't know if you want to love him or not.\n\nThe actions scenes are ok, but no moment where I would thing it's something epic worthy. At times almost too much of the same.\n\nMaybe the main problem was the script, neglected in the face of the many action scenes paired with fancy camera movement. The plot was ok, but it lacked a smarter way of putting it on the screen.",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It’s a good movie but too much like Fury Road, especially the good bits. Furiosa had to be a younger actress(es) but they are less interesting. Hemsworth, despite the disguise, is recognisable for standard acting style: wooden. The franchise has run its (very good) life.",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This was a great Mad Max movie. Mad props to the filmmakers and great job to all of the cast! I highly enjoyed this movie. I definitely will watch this again.",
    "date": "2025-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Me sacaré los ojos antes de ver otra vez esta porquería",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Not really that good. It looks fake, this movie so needed some big epic car scenes actually on location.\nFuriosa is a terrible character, no growt, no acting, I hated her from start to finishing pretty bad for the 'hero'",
    "date": "2025-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "An amazing new entry for George Miller. This one looks as beautiful as Fury Road, answers all our questions, and once again sets the bar for dystopia. Hemsworth and Taylor-Joy are unrecognizable and their performances were perfect. A+",
    "date": "2025-09-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Wasn’t bad, but lacked the energy and throttle of Fury Road.",
    "date": "2025-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "An exhilarating ride from start to finish, Furiosa: A Mad Max Saga is an absolutely stunning and thrilling cinematic experience.",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A wild ride with this one! Action nonstop and the Worldbuliding’s crazy good. Anya taylor-joy killed it and Hemsworth surprised me in a good way of course! Although it drags up a bit in certain spots but the energy of mad max is still alive 🔥",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great orgin story for a phenomenal character",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Can anyone dislike movies in this series?",
    "date": "2025-08-18"
  }
]