[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 01 hour, 39 minutes, and 26 seconds!!!!!!!!!!!!!!!!!!!!!!!! Rated R for Violence!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This movie comes across like it was written, directed, and produced by Aaron Eckhart to showcase Aaron Eckhart, and it just goes on and on. For anyone who likes action movies, it's watchable - but I totally get what Abigail Breslin didn't like about him too.",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Absolutely one of the worst movies I've ever seen. Eckhart is atrocious.",
    "date": "2025-06-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "fun throwback action flick with Aaron Eckhart",
    "date": "2025-05-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Diferentão, um filme de ação e suspense policial, mas cômico do que se poderia, tentou ser levado a sério, entretanto os diálogos pobres, simplórios e quase juvenil, não prejudica, mas interfere na seriedade, além de situações meio abobadas, divertidas e exageradas, impossível levar a sério o policial, quando a guria, apesar de toda instagramável, tem mais seriedade nas ações como repórter investigativa desesperada por um furo… O desfecho final muito socos, quase um \"Adrenalina\" juvenil...",
    "date": "2025-03-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Do they don’t know how to make good movies anymore. Is it a comedy movie ?\nHonestly movies now a day are just people doing stupid things. Movies were great from 2015 and down\nHonestly what a waste they did with actor penny (the policemen) doesn’t fit him as a police character because he was a great character for the movie Batman as two face.\nI think producers should look at old movies before making a movie, stop making movies just because they have the money and can hire the actors to make a movie, or use at least what everyone is using CHAT GPT",
    "date": "2024-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Meh, passed the time, good action, not a good script/story. There's an attempt to give it a more youthful/young audience punch, but it comes as childish/naive instead.",
    "date": "2024-04-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This is a real boot licker of a movie.  It's over the top and annoying. I enjoyed Eckhart and he had some funny lines, so he gives the movie two stars. It passed the time but won't watch it again.",
    "date": "2023-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It's one I'd seen but then forgotten. Enjoyable enough, though not particularly plausible, nor very well acted",
    "date": "2023-12-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "So bad so so so bad, The director was asked how unrealistic do u want this movie to be? He replied: \"Yes\" absolutely one of the most cringeworthy movies I've ever seen… do not waste your time… I thought it was good based on the trailer and the main actor but no..",
    "date": "2023-05-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Muy buena película para pasar bien. Muy entretenida.",
    "date": "2023-04-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This action thriller was a good watch. Interesting plot and loads of action. Will keep you entertained.",
    "date": "2023-04-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Seriously, can a thug out-punch well-trained uniforms? It's a good thriller; it keeps you up for the airtime with reality douche cowboy seasoning. You may watch too many TVs lol... Can do better on the CGIs?",
    "date": "2022-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Surprisingly Addictive to watch, snowball effect watching it through",
    "date": "2022-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Good pastime, however, the movie is a cliche with a bad CGI.",
    "date": "2022-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Special Effects: 0,0/Sound Effects: 0,5/Acting: 0,0/Story: 0,0",
    "date": "2022-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The Special Effects are amazing. The makeup and costuming were  remarkable.  Some of the dialog needed to be rewritten,  The story line was interesting.  Over all, it was and enjoyable movie, better overall than many others being produced at this time.",
    "date": "2022-05-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The film has some pace and is entertaining. You just must not think too deeply about the plot or the behaviours of the cast.",
    "date": "2022-05-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Aaron Eckhart is capable of many things and can carry many a film, but with the weight of an abysmal cast, this film began to drown from the start. In a word, cringe. Cringe lines to cringe characters to cringe moments no amount of Jim Gorden and two Face could not fix. It's sad that a possibly solid story, is just another thrown together, everyone gets paid then lets all walk away films.",
    "date": "2022-04-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It's always sad seeing once great actors sink to accepting roles in lowly action flicks.",
    "date": "2022-03-01"
  }
]