[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Baz Luhrmann’s documentary is incredible in its pathos and stringing together the incredible and complex life of Elvis Presley. Like the Elvis movie, it’s a masterpiece… a work of art that brings Elvis to life. Some facets are asynchronous and a stickler to historic accuracy may find fault with. Yet, it brings light to Elvis’ unique talent, his magnetism  and his struggles like no other movie or documentary has ever managed to. It’s brilliant!",
    "date": "2025-04-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of my favorite performances by Elvis Presley! Loved seeing the lead up to this show, and what came from it. Definitely recommend to all Elvis fans and non Elvis fans. A great documentary!",
    "date": "2025-01-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A brilliant documentary. It provides some great information and insight on Elvis's early, trailblazing musical career in the 1950s and subsequent mediocre movies in the 1960s.  But the real highlight is seeing the lead-up to and especially his performances in his 1968 NBC special. From the 1950s clips I'd seen, I knew he as quite a talent. But the 1968 show is a real eye-opener; it shows what an incredible performer he was.\n\nA bonus for Springsteen fans is Bruce's astute comments on Elvis and on how Elvis inspired his own career.",
    "date": "2024-12-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The documentary itself was great, definitely learned a lot about Elvis that I didn’t know and was intrigued. After watching this I also watched the Elvis movie, and they complimented each other well.\n\nI knocked off a star and half only because of the current “celebrity” people they interviewed in this..bruce springsteen??? billy corigan?? and conan o’brien??? wth?\nI have nothing specifically against these people, (I do NOT like springsteen, but that’s not my problem with him in this)..\n\nI don’t think the 3 of them would be fit to even shine Elvis’s shoes..springsteen couldn’t sing his way out of paper bag, and corigan Id say double on that..I mean he’s alright with smashing pumpkins, but most of that is digital enhanced BS - I heard he’s horrible live in concert..\n\nI’m not even going to venture a guess as to why they would put o’brien in this, the guys a comedian (I guess)..Not sure why his opinions on this topic are at all relevant 🤷‍♂️\n\nI think they could have picked or found better people to interview and get the opinions of. Maybe musicians who could actually hold even a fraction of a candle to Elvis? Idk..But these were bad choices in my opinion..\n\nOther than that great documentary 👍🏻",
    "date": "2024-12-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This rock' n 'roll documentary was great. The entire crew did an excellent job on making this documentary about the Elvis Presley's comeback in 1968. It was very interesting to learn more about who Elvis really was and who he wanted to be at the time. If you haven't seen this documentary yet, check it out sometime. It's worth watching.",
    "date": "2024-12-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "i love it, this is a good doc",
    "date": "2024-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "**Return of the King: The Fall and Rise of Elvis Presley** is a solid 3.5-star watch for me. As an Elvis fan, I loved how this docu wasn’t just about the '68 comeback special—it covered his entire timeline, making it perfect for both fans and newbies. It’s well-made and packed with unreleased footage that gives a behind-the-scenes look at Elvis as a person, not just a performer. You genuinely feel like you’ve met the guy by the end.  \n\nWhile it kept me entertained and taught me a few new things, a lot of it felt like familiar ground since I already know so much about Elvis. That said, it’s fun, decent, and respectful of his legacy. It might not blow your mind, but it’s worth a watch—especially if you want to see how the King reclaimed his crown. A must for casual fans; diehards may wish for a bit more.",
    "date": "2024-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "To any viewer from any era, this is the quintessential idealistic representation of Elvis that one should indulge in. Instead of focusing on the downfalls and \"tragic\" label world consciousness has bestowed upon him, the film focuses and celebrates the greatness and signature magnetism of what Elvis was, is and could have continued to be. The project is thoroughly imbued with love and care to make even the most cynical individual an instant fan or at least respect the guy, with Priscilla Presley at the producer helm, Elvis lovers and personal witnesses on board. As someone who had little exposure to the figure, \"Return of the King\" is a must watch to fully comprehend in awe the impactful importance and authenticity Elvis had on culture and music in a global scale. And - what we are left with is take all the talent and charisma that Elvis Presley was unequivocally meant display on his very own spotlight amongst the stage performing and inspiring us all.",
    "date": "2024-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It was very well done. It did a great job of painting the picture of how frustrated Elvis was with the direction his career had taken and some of the demons he dealt with. This all-be-it short lived triumph was a joy to watch. He was able to break out of the restraints and once again display his extreme talents and for the first time in a long time be his authentic self. Just as an aside a couple of people on here criticizing Springsteen’s commentary - give your head a shake and the one who said I never found the connection. He explained in one of his first clips how seeing Elvis on the Ed Sullivan show changed his life and for the first time he felt there was a different life and you could break the rules - basically saying you could live a different life than your parents did. This drove Bruce - before Elvis and then the Beatles he felt he didn’t fit in. He was a huge Elvis fan and he changed Bruce’s life. Not talked about on the show but Bruce also viewed Elvis’ story as a cautionary tale of what can happen if you don’t stay true to who you are - stay grounded so he always made sure he kept people around him who knew him well and would keep him grounded. Overall this show leaves us on a high with Elvis’ return in 1968 and is feel good though we know it doesn’t end that way. It is definitely worth watching.",
    "date": "2024-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The beginning is like all other Elvis documentarys but then it changed the mood.  It was excellent and showed the true Elvis.  I recommend watching it.",
    "date": "2024-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Nov 15, 2024\nThis is a a very good documentary of Elvis Presley. It is centered around his 1968 Comeback Special. The film is a sort of companion piece to the highly successful Baz Luhrmann film. Baz is heavily interviewed together with the Priscilla Presley. There is more here than the 1968 Comeback- the main part of the story is what lead to the need for the Comeback at all. That was a series of monetarily momentous, yet culturally disastrous decisions by his Manager, Col. Tom Parker. The footage is great. The music is great.",
    "date": "2024-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "So great to see the actual footage of Elvis’ work in the 1968 Christmas Special. The only piece that didn’t fit was Bruce Springsteen. I kept waiting for his connection to Elvis or his work, but he was just there to give us his 2 cents. Did Springsteen need the work that badly?",
    "date": "2024-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Could have done without Bruce Springsteen",
    "date": "2024-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This is a a very good documentary of Elvis Presley. It is centered around his 1968 Comeback Special. The film is a sort of companion piece to the highly successful Baz Luhrmann film. Baz is heavily interviewed together with the Priscilla Presley.  There is more here than the 1968 Comeback- the main part of the story is what lead to the need for the Comeback at all.   That was a series of monetarily momentous, yet culturally disastrous decisions by his Manager, Col. Tom Parker.   The footage is great.   The music is great.   The film is not too long.   I highly recommend this for Elvis fans, or for people not too familiar.",
    "date": "2024-11-13"
  }
]