[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "eesh; this is by far the worst installment of the franchise, but I do think it was necessary for their overall story to have them part ways for a bit. i fricken hate how they both immediately blew up over every little thing. this movie seemed really long. also those bangs - gross.",
    "date": "2024-06-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Rich brats try to decide if they still love each other while remaining incredibly selfish.",
    "date": "2024-05-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "It gave me trauma and promoted toxicness. But loved Harden his accent was FANTASTIC, very impressed and he is a very kind soul.",
    "date": "2024-05-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "\"After Ever Happy\" delivers a satisfying conclusion to the \"After\" series with emotional depth and compelling character development. Fans will appreciate the closure and the film's ability to tie up loose ends.",
    "date": "2024-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "After Ever Happy. After. Ever. Happy. Attempting to invoke the saying 'Happy Ever After', the writers didn't how the title sounded, which leaves a jumbled mess, foreshadowing the movie. Though none have had excellent titles, this one may take the cake for one of the worst-titled movies of all time.\n\nStocked with the same break-up/make-up that has been redone multiple times in each installment, After Ever Happy cannot figure out any new ways to cause drama. Unsure which character to give MORE daddy issues to, the writers decide to give them to both by giving double daddy issues to Hardin Scott (Hero Fiennes Tiffin) and expanding on Tessa Young's (Josephine Langford) as well. I have never seen a character go through the same daddy issue arc, with 2 different fathers, but this franchise never fails to amaze me.\n\nWriting, filming, editing, and releasing with only one year between each installment, the lack of quality in the franchise is painstakingly evident. After Ever Happy continues to trick viewers into rewatching the same reskinned movie by changing the title. Thankfully, with only one left in the franchise, we are almost at the merciful end. This truly belongs in the Sewers of Cinema.",
    "date": "2024-01-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "After+ hero fiennes tiffin= my therapy",
    "date": "2023-12-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I cant believe people are rating this high, its garbage and toxic",
    "date": "2023-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Es mejor de after no es buena pero la actuación de Josefina es buena y tiene momentos triste pero hardy es insoportable y es plano es un 3.6 de 10",
    "date": "2023-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "These After movies are very repetitive. They're fighting, one of them runs away and then they get back together. They're both very immature and it has nothing to do with their age.",
    "date": "2023-05-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Is the last sequel??",
    "date": "2023-03-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I'm just not quite sure why we turn this into a franchise. Because the first movie was good, but then after that, it just completely diminished the film and completely throughout these characters to be boring and at the movies to be unwatchable. This is definitely one of those seagulls that you just are not here for. It's not something exciting and it just completely derails from what the actual movie should have been about, I do not believe this movie is something fun or exciting to even have in the background.",
    "date": "2023-02-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The only reason why I watched this was because I saw the previous movies for some reason. Like all the movies in this series, the plot is basically the same, with a few minor changes but nothing new. Unfortunately, we didn't get any character development, and I struggled to finish the movie.",
    "date": "2023-01-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "So confusing. The plot is so slow and overall it's hard to understand what the point of the movie is. There is much better things to watch.",
    "date": "2022-12-31"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "0.5/5 with a heart because was it terrible? the hell it was! will i watch the next part? of course!",
    "date": "2022-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Judging these films by their own standards, this one is somewhat less insufferable than its predecessor. Unfortunately, it suffers from the same problems as its previous entries.",
    "date": "2022-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best movie in the After series since the first one!  The acting was so good and the story was very emotional!  Hero has really come so far.",
    "date": "2022-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Thank God that trashy story is over.",
    "date": "2022-10-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Ive watch the previous 3 movies and read all the books. Absolutely love the movie!",
    "date": "2022-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I didn’t like the way it ended ☹️",
    "date": "2022-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Better than 2 and 3! Just as good as the first movie!",
    "date": "2022-09-18"
  }
]