[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Very dark throughout, but well acted and neat twist toward the end.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This movie is solid. Grabs you right in the beginning and keeps you on the edge of your seat. Falls a bit short at the end. They could have cut the last 10minutes out and finished at the final climax. Still definitely worth a one time watch.",
    "date": "2025-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Absolutely abysmal.\nTotally predictable with the usual frustrating type of characters.  You even get to hate the good guys because they are so annoying.\nStoryline is so weak.\nAnyone got a wall they've just painted so I can watch it dry?",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Allison Janney’s performance embodies how the film’s tactically intellectual and stand on her own somewhat resonating ground against the rest of the frustrating screenplay’s “thrilling” mode that only limited its intentional direction to come off as psychologically nonsensical with unfulfilled gaps that would’ve rounded this as a better, more soundly balanced picture. (B-)",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a great movie in the sense that it casts an older woman in a completely different role, makes us think beyond grey hair meaning milk and cookies in a warm kitchen. Hopefully older women can still do that. But also, to see this character as a physical, strong 60 something woman with a history of anything else other than looking up the best chocolate chip cookie recipe, was actually refreshing. Allison Janney was so believable in the opening 20 minutes - I was settling in for a total action movie. She was like Clint in female form. But argh, then the story sort of went awol. Loved the whole premise of the violent dad coming back (who did not realise that there was a tarantula waiting for him). But I feel the scriptwriters then filled the next bit with fodder, just to get to the end, and really, a psychopath like we really needed Phillip to be, would not be so warm and fuzzy. But anyway, I totally loved this movie. Great characters. Great idea. Allison - blimey. I believe you could take out anyone. Waiting for the sequel!",
    "date": "2025-05-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Allison Janney was quite literally the only thing that was decent about this movie. And even she had a couple of lapses where the tone or what she did with the line fell a little short. But there is something unique about the actress that get you to the end.\n\nI'm not sure where to start with the problems and the list is too long to be descriptive so I'll just give bullet points:\n\n* One singular solid punch from any man would have rendered a woman of her age and build unconscious. A decent chance that the punches landed by the hulked out mercenary would have resulted in serious damage, possibly death.\n\n*  The bat signal would be more sublime than this movie's ability to  signal the plot developments. Extremely predictable. \n\n* If you are politically moderate or conservative you should always know that actresses like her or Sarandon are always going to try and convey a message that everybody on the right including Reagan are evil. But it's actually kind of laughable how they do it here. \n\n* Any mother whose child has been abducted would be in a constant state of some anxiety and particularly solemnity. So it's just very eye-rolling when she makes a joke or cracks a smile or has a normal conversation.\n\n*  The killer/villain going into the van was particularly cringe. Immediately asking personal questions, teasing, playing with the radio, pulling out the cassette tape, etc. Just not happening; not playing out like that.\n\n*  The choice of music - especially with the headphones scenes was horrible. Wrong mood. Jolting in the way that advertisements can break your attention from flowing with movie.\n\n*   I give the movie credit for trying really hard to make Allison's character sympathetic but monstrous and brutally abortive \"relationship\" she has with her son ultimately fails to make the case. \n\nIf you're really bored, and you have a couple of beers handy, and you're craving a little bit of vigilantism, and are intrigued to a degree with Janney...you'll get through it...but  when the credits roll don't be surprised if you hear her whisper in your ear, \"sorry kid\".",
    "date": "2025-03-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Good Writing and a unique story make this a great watch",
    "date": "2025-03-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Now y'all get Grandma's doing fight scenes the f*** she would have lost that fight 10 out of 10 no matter what kind of training she had",
    "date": "2025-01-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The movie is watchable largely because Allison Janney is a terrific actress.  Having said that, the plot is pretty generic, though the realism of the setting is good.  My biggest issue is that Philip, the kidnapper, is reputedly a Green Beret and yet finds hand-to-hand fighting with Allison Janney and Jurnee Smollett difficult at times.  His character has major advantages in training, size, and strength, but these factors don't seem to matter.  I can buy that Lou has training, but even with that in mind, she should be no match for a male Green Beret in his prime.  \n\nIt's entirely possible to have a female action star holding her own in fights with men, but the writer and director have to be careful with how it's down.  A good example of a movie that pulls this off is Atomic Blonde with Charlize Theron.",
    "date": "2025-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I really enjoyed this emotional and suspenseful movie. There were a few times where there's a plot twist which I always appreciate. Definitely loved watching!",
    "date": "2024-12-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Not an Oscar, but really good! Some flaws, as always, but this is a really good movie!",
    "date": "2024-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Lou is about an elderly woman who lives isolated on an island in the USA. She is cold, tactless, and mysterious. When her neighbor's daughter is kidnapped, she tries to track her and the kidnapper down in the stormy raining forest. This setting provides beautiful images and determines the thriller atmosphere of the film. The cinematography is extremely strong, as is the directing. The actors deliver commendable performances. I thought it was an entertaining quality film. The downside, I found, was the script, which at times came across as ordinary. With far-fetched storylines about CIA and special forces, and twists that seemed uninspired. All things considered, this was a compelling thriller that is definitely worth watching.",
    "date": "2024-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's a decent movie. Nothing exciting, nothing new, nothing gripping. The plot was fairly generic with a number of moments that'll just leave the over-thinkers saying \"uhh...seriously??\". For those looking to turn off their brains and just watch, there's enough action mixed in just enough to keep it moving at a steady pace. However, it's too slow to be overly engaging. Actor's performances were okay but script was a little bland so I can't really blame them. They did what they could with what they were given.\n\nOtherwise, it's a good movie for a relaxed evening and won't feel like a complete waste of time. So a solid 3/5 stars seems quite fair.",
    "date": "2024-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I really liked this movie alot. It was suspenseful, kept me riveted till the end. The storyline was surprising and I won't give any spoilers. I think both female leads did an outstanding job, the filming in the storms was great. I don't know why this movie gets low reviews. It was a great action packed movie, with an unusual female lead being the tough broad. Nice to see. I highly recommend it, and go into it with an open mind.",
    "date": "2024-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie was terrible.  I could not even finish the entire thing.  Such bad acting and terrible story line.  I DO NOT recommend this movie.  you will loose an hour and 49 minutes of your life that you can't get back.  Don't waste your time.",
    "date": "2024-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Terrible. Just bad all around. Terrible writing, terrible acting. Don't waste your time.",
    "date": "2024-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It was mildly entertaining, but the writers' need to use GD over and over was distracting. Typical lack of plausibility that you'd expect from this type of movie. Weak dialogue and highly predictable. And seriously, quit ruining shows with GD this and GD that. Almost no one speaks that way.",
    "date": "2024-03-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved this action packed grandma!!",
    "date": "2024-03-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Very enjoyable and tense movie. Could have focused on the storm more and had some realistic fight scenes where the characters are tumbling around.",
    "date": "2024-02-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A well-made and honest film that shows people struggling to overcome adversity without using superpowers or high-tech.",
    "date": "2023-11-30"
  }
]