[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "this movie is a banger. it is another stealth horror movie. it is stressful, but it constantly keeps you fed with layered, insane details. the way that most of the people around her are in their own world, mostly ignoring what she says, and usually either giving her inactionable advice or taking the same things she is feeling out on her is beautiful and horrible. the audio is great. it never stops, and there are so many scenes where the music is perfectly mismatched to what is happening. the camera work is great. i had to pause it to google feeding tube removal, i had to know.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "First time ever writing a review,  but this movie was so stupid and a waste of time watching. You spend the whole movie hoping it will get better or have a point to make, but it doesn't. I watched because the reviews were good but it was a lie.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The most accurate film yet.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Great acting, but too damn \"artsy\". I also dont need to see some bish smacking on pizza in 4k",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "What a terrible movie. Wasted 2 hours of my life.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great character, humor, creative storytelling.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Extremely exasperating film, but worth every grooling minut. \n\nWow Rose Byrne, what a trip. Women should see this film before they decide to have babies",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Rose Byrne is terrific is this character study psychological tense drama. Bordering on the claustrophobic we wonder is this real or imagined. This lies the mystery and a trip well worth the ride. \nNon derivative fine filmmaking,",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A taste of what life is like for many single parents with disabled children that lack a social support system and are doing their best to cope.  The mom is expected to do it all and has no way to refill her love tank other than turning to alcohol to escape.\n\nSo many metaphors in this film, that I will likely watch it a second time.\n\nI’m still trying to figure out the title.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best movies about the anxiety of the adult life",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Everything is under control.\n\nIf I Had Legs I'd Kick You is a 2025 American psychological drama film, written and directed by Mary Bronstein 😱 \n\nIt’s good 🙂\nWorth a watch. \nI’d recommend it if you like this genre 👍🏼\n\nWith her life crashing down around her, Linda attempts to navigate her child's mysterious illness, her absent husband, a missing person, and an increasingly hostile relationship with her therapist.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Despite the presence of a very good cast (O'Brien is absolutely brilliant in this) the absurdity and absolutely loathsome lead character makes the whole film an exercise in irritation. But end, I just didn't care.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Rose Byrne is a brilliant actor, but we knew that.  \nIf you loved Eraserhead,  you might sort of appreciate this film,  but you won’t love it.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I have no words... its that bad.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The best movie that is about how much adult life sucks",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Not that good until that dreadful ending…woof.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Stunning and deeply disturbing in the best way—Rose Byrne gives a career-best performance as Linda, a therapist/mother whose life collapses under her daughter’s illness and endless pressure. You feel every ounce of her frustration, exhaustion, and rage; the way she lashes out at everyone (husband, doctors, even her own therapist) is painfully real. Beautifully made, psychologically intense, and so raw it almost hurts to watch. Only downsides: the dream-vs-reality blur can be confusing, and it’s definitely not for everyone—mostly hits home for women (or people close to women) who’ve felt this kind of overwhelming burden. Still, an easy 9/10 for me.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "If I Had Legs I'd Kick You is a searing portrait of motherhood under pressure. It's at times an unsettling watch, but absolutely a worthwhile one. Linda is a young mother with a young child. Her daughter has an eating disorder, so every day is a struggle to keep her going. So much so, that she needs a tube at night to keep her weight up. Linda also works full time. She is a therapist. But because of her struggles she also seeks therapy. Linda also has an absent  husband. He is often away for work and when he calls he is overly critical of her. To top it off leaking water has blown a hole in their bedroom ceiling, so mother and daughter have moved into a motel temporarily. This creates a maelstrom of pressure for Linda. The film effectively looks at the struggles of motherhood and how the pressure to cope can be very overwhelming. As you might imagine this makes for a sometimes stressful watch, as we follow Linda and her struggles. But ultimately it works, as the film feels so real and honest. The film was written and directed by Mary Bronstein and she has created a great work of cinema. She is aided by a truly superb performance by Rose Byrne. She embodies every detail of struggle for the beset Linda. This is a substantive work. Although never an easy watch, it's definitely a vital and important film.",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Total waste of time I don’t understand how it has a good rating",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A hard watch, but so emotionally cathartic. Rose Byrne gives the performance of a lifetime - and if not picked up by the Academy for a nomination, she will have been snubbed unjustifiably. A love letter to moms, and especially those who struggle daily with mental health an anxiety. It's a tough one to get through, but with an ending so rewarding and hopeful, it makes up for the virtual house of terror we're asked to sit through for two hours. Outstanding work!!!",
    "date": "2025-11-20"
  }
]