[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Shang-Chi and the Legend of the Ten Rings has some great action sequences, humor and a good hero.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it! The fight choreography was insane!!!",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "At first I thought, \"Okay, China wants a prominent place in the MCU, so they'll foot the bill for something that showcases Chinese actors.\" OMG, I couldn't get past the 15 minute mark. Horrible, absolutely terrible. What a waste of the Marvel brand.",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I think this is similar to joker/venom to me because it is so far from christianity i.e. doing like kung fu magic. Maybe will watch the movie fully one day.",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great choreography and an interesting but simple story line that sets the stage for a potentially massive character in the MCU to come. Overall good origin story but CGI definitely could have been better.",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "La peli me gusta mucho. Es lo más cercano a un live action de Dragon Ball. Me encantan las artes marciales. Y esta peli lo tienen.",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is amazing! I’m fond of action movies and Shang-Chi is just what I needed because of  the fight scenes that make it feel real. The CGI was also very impressive. The cliffhanger was also a bit predictable. The movie was full of action but it was also humorous because they made jokes while being in a serious situation. I don’t particularly like action movies but this really changed my perspective. I do like movies that feel adventurous and the movie was just that.",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The comic relief was the best part, I guess if the c.g.i. and action isn’t going to impress anymore at least make the audience laugh.  Unfortunately there was just too much back & forth in timelines which, of course, makes for a fragmented story and one that spends a bit too much time on family drama.  After an hour or so, it becomes a story about a dysfunctional family infighting that just got worse as it progressed. It’s basically the Star Wars trilogy crammed into one movie... which makes it’s story just a 1/3 of what Star Wars story was.  Ultimately, there’s just too much that disengaged me; from the back & forth storytelling, to the subtitles, to a proxy villain until the final minutes when the final boss shows up with no build or purpose.",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best in my opinion.",
    "date": "2025-09-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "La mejor película de Marvel de 2021\nLos efectos visuales son buenos\nUn buen villano el final un gran origen es perfecto",
    "date": "2025-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Shang-Chi is an origin story done right. The cast is strong, the pacing flows well, the CGI and fight choreography look fantastic, and the humor strikes a solid balance without undercutting the drama. The characters are engaging, and the plot delivers exactly what you’d want from a superhero introduction.\n\nIt doesn’t try to reinvent the genre, but it doesn’t need to. Instead, it executes the formula with confidence, wrapped in a beautiful blend of Chinese folklore, striking visuals, and a standout score.\n\nA stylish, well-crafted film — and absolutely worth watching.",
    "date": "2025-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I found it very entertaining, and what is cinema if not that. Wonderful cgi and digital effects, the story well written and nicely delivered by the cast. Photography great, music great. \nOk it is based on marvel comics and the story is predictable.But is done professionally.",
    "date": "2025-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Fun story and a cool movie. There's some questionable intersectional feminism at times (typical of Phase 4). Unfortunately, the future showed that this new character was introduced into the larger universe for no apparent reason.",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "So powerful and very well directed! Superb.",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The best marvel movie of this phase. Great characters portrayed by skilled actors, and its heart, passion, and humor make it a hit.",
    "date": "2025-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Well glad to see Disney is focusing on the Chinese audience.",
    "date": "2025-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This was my rainy Sunday afternoon movie.  I thoroughly enjoyed it!  I am hoping they make a follow-up.  It was fun with enough action and humor to hold my attention.  Plus, I really enjoyed having strong female characters.  Nice movie.",
    "date": "2025-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Outlier - I thought it needed an editor. Shang-Chi is a CGI-drenched spectacle that ran at least 20 minutes too long. The main character is interesting, but lacks any grounded action or compelling narrative. Wait, what? Why is Awkwafina a sniper now? Great ingredients that don't quite stick the landing.",
    "date": "2025-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Good acting, great fighting and a touch of humour. This is stunningly well shot and the fx are astounding. If you're going to do fx in a movie, this is how its done to fit with the story. Loved it.",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The movie is good. Awkwafina is not.",
    "date": "2025-08-03"
  }
]