[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "At its heart, this evolves like a regular sports drama with an underdog going for the win. Some elements in the third act can feel a bit rushed.\nWhat makes it stand out are the stellar indigenous cast and cool visual ideas thanks to solid photography.",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Es una buena película, habla de como el deporte transforma a las comunidades como hay quienes logran vivir de practicar un deporte, quienes se pierden en el camino desviándose y quienes tienen la oportunidad ya sea de trabajar o seguir estudiando para tener un trabajo mejor remunerado, es cruda pero se siente no tan ficticia aunque creo que sí es ficción por lo que entendí no está basada en un hecho real.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Rez Ball is an interesting and mostly entertaining film. It feels authentic, but is let down by a fairly standard and predictable story that keeps it from soaring. The film is the story of a high school basketball team in New Mexico. They have talent but aren't fairing well in their new season, despite the return of their star player from injury. They have to oversome personal tragedy early in their season as well. But they don't play well together. After a long losing streak, they finally start to pull together. Perhaps their goal of winning a state title is still in reach. The cast are nearly all Native American and they do a reasonale job without being stellar. An enjoyable film, but not one that feels unique enough.",
    "date": "2025-04-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "REZ BALL employs a familiar sports movie formula to create a dynamic, entertaining and heartfelt portrait of indigenous life that is elevated by place-based details and a very talented cast.",
    "date": "2025-03-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Rez Ball is an entertaining movie centered around the game of basketball that I had the pleasure of watching with my son. Released in 2024, the film features a cast of relatively unknown actors, bringing fresh faces to the screen.\n\nThe movie is a delightful experience, skillfully directed with a vibrant energy and a solid script. It not only captures the team's quest to succeed but also delves into the personal struggles of each character, allowing viewers to connect with them on a deeper level.\n\nRegarding the screenplay, I found it to be well-crafted overall, though there were a few instances where certain scenes could have been tweaked for clarity or impact. Nonetheless, the film remains an enjoyable journey, perfect for a casual rewatch. While it may not be a film you'd rush to see repeatedly, it certainly offers enough charm to make a return visit worthwhile.\n\nMy son genuinely loved the movie, which speaks volumes coming from a child who typically prefers animated features or superhero flicks. His enthusiasm for Rezz Ball highlights its appeal beyond the typical genre expectations.",
    "date": "2025-02-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Watched the movie. Location was obviously awesome too see. They had some comedy that was and wasn’t called for but time wasting. It had some good, bad, and ok story content. Could have went on more about the team buildups and not focus on the fast win and how badly the team did. Also it should have shown more to make the story more awesome. It felt like I was watching Money Ball but it was basketball on the Rez. Watched as the coach was from Frontier and it was on Netflix….It had potential but got lost in translation and was rushed in a bad way.",
    "date": "2024-12-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Its a great story told by great writing. If you're looking for a good \"feel good\" movie, this is the one",
    "date": "2024-12-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Filme: Guerreiros do Basquete\t\t\t\tAssistido: 13-11-24\nElenco: @kauchani @jessicamatten @zoeyreyes @juliarjones @kusemgoodwind @kiowajgordon @ambermidthunder @jojojaxn @dallasgoldtooth\nModelo: #esporte #motivação #drama\nDuração: 1h 51m\tAno: 2024\nMinha opinião: Um filme que já conhecemos a estória. Um grupo improvável, se ergue com um sonho que para a maioria passa de utopia. Ainda mais quando o principal jogador tira a sua própria vida, por não suportar a perda da mãe e irmã. Aqui ao invés de afro descendentes, latinos ou desajustados, tem um time de índios americanos. E um jogo com o principal time e acabam perdendo. Como superar todos estes obstáculos? Temos uma equipe que não são uma equipe e a técnica que busca uma outra cidade para ser técnica. Com todas a adversidade, o grupo começa a superar degrau por degrau cada obstáculo. Até o momento que começam a vencer jogos e mais jogos. Até o momento que o sucesso acaba sendo outro momento de queda. Quando acha-se imbatíveis e quebram a disciplina e a ordem. Vários dos jogadores ficam de porre no dia do grande jogo e perdem. Mais uma vez aprendendo vão competir novamente. Até que vencem e se sagram campeões. Agora a técnica tem várias ofertas de emprego, mas agora descide ficar com a equipe.\nRoteiro e enredo já conhecidos e bem executado, trazendo um novo ingrediente que foi a perca de um dos integrantes.\nVale apena assistir? Sim\nNota: 6",
    "date": "2024-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it! Great ball story with lots of heart and emotion. And some solid hoopin’",
    "date": "2024-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's not rocket science as far as sports movies go - but it is unique in the makeup of the team and their struggles.",
    "date": "2024-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent movie, great action shots, need more Kusem Goodwind!!",
    "date": "2024-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "How many of these rag tag kids go from outcasts to heroes sports movies do we need? Watch Bad News Bears, Hoosiers, Mighty Ducks then repeat if you want to watch the same movie again. For that matter, if you substitute an individual for the kids, you can just watch Rocky (the first 3 anyway) or Million Dollar Baby and get all the underdog overcomes adversity to win sports contest thrills you will ever need.\n\nRez Ball is just the same plot with poor direction, no development of a connection between the viewer and the character, obtrusive musical montages instead of actual acting and checking off some Dine stereotypes. Oh, and if they said the phrase \"Rez Ball\" one more time, I planned on sticking an icepick into my eardrums.\n\nI'm all for using Native American actors in films wherever you want to cast them. Just make sure you create a good movie first.",
    "date": "2024-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Although the plot could be a little predictable at times this beautifully shot film really does not disappoint.",
    "date": "2024-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Some of the worst acting you will ever see.",
    "date": "2024-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie! Excellent casting!",
    "date": "2024-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Predictable...the Americans will love it.",
    "date": "2024-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The way the movie touched on many real problems in reservations and brought light to them, this movie showcases how most challenges are over come by pain and help from others.",
    "date": "2024-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is amazing and was a blast to watch. It was also relatable to the reservation lifestyle.",
    "date": "2024-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was a great movie!!!! I enjoyed it a lot! It was really what it's like to live on the reservation & be so good at ball going against all types of teams. It's real-life things & they show a lot of real personal problems & problems on the rez. I also like how it just kept getting entertaining & how the mom wanted to get better throughout the whole movie. 100/10",
    "date": "2024-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "i didnt watch the whole movie but the parts i watched where entertaining and intresting with a good ending",
    "date": "2024-10-16"
  }
]