[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Don't let the overly sensationalized title put you off of this one, which is about a gang of young toughs all sentenced to a reform school, where they suffer mistreatment until James Cagney improbably shows up to run the show.  Cagney befriends the nurse (Madge Evans), but clashes with the strict warden (Dudley Digges), who does not approve of their ideas to give the kids more freedom and the chance to govern themselves.  Cagney has further trouble in that he's a gangster himself, trying to keep his 'racket' under control while he spends time at the school.\n\nCagney has such charisma and his presence carries the movie, but there are also fine performances from Frankie Darro (the leader of the kids), Digges, and Arthur Byron (a thoughtful judge), among others (and including all those child actors).  It's fun to hear all the 'tough talk' and slang from the 30's, and the scenes early on with the kids are enjoyable.  The film's message, to paraphrase Cagney's character, is that you have to take a firm hand with kids or they'll walk all over you, but on the other hand, they're just kids, and behave better when shown a little love and respect.  The action gets a little melodramatic as the film progresses, and the simplistic and somewhat horrifying ending isn't great, but all in all it's an entertaining film.",
    "date": "2017-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I really enjoyed this very different role for James Cagney--as a gangster who has a soft spot for children, uses his connections to get appointed a deputy inspector, and visits a state reform school, where he witnesses many abuses and decides by golly to do something about it. A remarkable and endearing performance.",
    "date": "2014-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Juvenile delinquent social drama where early in the film a mother pleads to the court not to send her youngest son to reform school because her first son went there and \"came out a murderer!\" James Cagney plays a political machine appointee (a favor for delivering votes) who takes a genuine interest in reforming a juvenile prison. There are some of the usual prison social reform film tropes, but there are also some unusual elements like Cagney being somewhat of a criminal who's acting the social reformer and also an ending that's absolutely unexpected and quite good. Cagney is terrific as the criminal who makes amends for his criminal past. He's an actor who I often remember as a caricature, but he really is a dynamic performer and a captivating screen presence.  Directed by Archie Mayo with uncredited work by the great Michael Curtiz.",
    "date": "2014-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A great little flick. I dont know what it is with this director and movies featuring gangs of kids, but it always seems to work. This flick is quite violent as well. I cringed a few time at the brutality featured in this film. This was a year before the Hollywood code to effect and ruined the freethinking of films for a while until the late 1960's, and you can tell.",
    "date": "2013-06-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The Mayor of Hell deals with the controversial subject (in the 1930s) of reformatories as it follows the life of depression-era children as they try and survive on harsh urban streets. They work together but break societies rules. At the reformatory they are faced with different types of administrative styles as Thompson (played by Dudley Digges) and Patsy Gargan (played by James Cagney) disagree on how exactly to keep the kids in order and how best to help reform them into good citizens. \n \nPart of Patsy Gargan's motivations for trying to fight the existing system is his interest in a young nurse (played by Madge Evans) who works at the reformatory and has had enough of the current system. \n \nIn some respects the story seems formulaic early on but soon begins to twist and turn as a personal crisis threatens Patsy Gargan's ability to further his crusade against the status quo. \n \nDudley Digges is great as the strict disciplinarian who has worked in his current position for twelve years. He plays a harsh and hateable character, yet he is also sympathetic to a certain degree when you consider his responsibilities and the way they have hardened him. After all, he has a whole school filled with juvenile delinquents to deal with. The audiences ability to first sympathize with this character and then soon come to realize that he has crossed the line both add to the realism and the depth of the story. \n \nMadge Evans does a wonderful job of playing a nurturing nurse who is dedicated to her work, yet attracted to the impulsive and uncultivated Patsy Gargan. She is a great blend of motherly instinct towards the boys who have to endure harsh living conditions and sexuality as she inadvertently attracts Gargan and then falls for him. In the opinion of this reviewer Madge Evans has a screen presence and an ease with which she acts that has a mesmerizing quality. She seems to really be invested in the character and she has an effervescence about her that is scene stealing, which is really saying something considering the massive screen presence of the physically diminutive James Cagney. \n \nJames Cagney has the ability to explode into your home as he acts on screen. He is a fireball of energy and presence and in this role he plays a complex character that is very enjoyable to watch. James Cagney plays Patsy Gargan who appears to be a kid at heart but has found himself in the very adult role to help kids with a similar past to his own. Sure, he is partially motivated by his eagerness to impress the lovely nurse, Dorothy Griffith, but it is enjoyable to watch him transform from selfish opportunist to selfless humanitarian as he attempts to teach these wayward children a little something about life as a responsible adult. \n \nWhile the diverse cast of children are wonderful young actors, the parts they play will seem stereotypical and at times politically incorrect to modern audiences. The scene near the beginning when the children are being sentenced to the reformatory features the stereotypes of the era with potentially offensive portrayals for instance of an ignorant black man and a penny pinching Jewish man, more concerned with the potential income he is loosing out on by not being at work that day then the trouble his son has found himself in. The stereotypes featured appear to be more for humorous effect then because of any racist motivations and one can't help but applaud the diversity in casting for the time despite some politically incorrect content.\n \nThe movie has its flaws and at times is a bit oversimplified but it does feature some outstanding performances including some hugely talented child actors, some of which had long careers in show business. It is rough movie, and a movie that was controversial for its time. It certainly feels like a precursor to the Film Noir of the 1940s and 1950s with its candid depictions of violence, hatred, murder, physical attraction and crime. \n \nEven if the plot or subject matter isn't of particular interest to you it is worth seeing for some very well executed performances. This is a unique movie and one worth taking time to see.",
    "date": "2013-06-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "76/100. James Cagney is awesome in this film about his involvement in the way kids are mistreated at a reform school. Interesting and surprising ending. Well made. Good writing and direction by Archio Mayo. It's an unusual film.",
    "date": "2013-06-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "1933 (NOT 2008) morality drama about down and out kids in a reform school.  Tyrannical headmaster Thompson goes one kid too far and the kids revolt.  (Watch for \"Farinna\", now 12 years old and former Little Rascals character.  He did quite a job throughout the film).\r\n\r\n\r\n[img]http://t1.gstatic.com/images?q=tbn:ANd9GcSllVRJ0h9vt8Ko9Dl5BeYf7gIiG8MFrG3f6p5Qu8197U33KIL2mA[/img]\r\n\r\n\r\n\r\n\r\nThe Mayor of Hell is one of those titles that while creative, is too over the top.  Better, Babes in Hell, or My Chocolate Bar for a Trip Out of This Place.\r\n\r\nOutstanding Cagney performance as an unlikely hero to a bunch of down and out kids in reform school.  With help from a school nurse, the kids learn that they need not be, as Cagney puts it, Chumps.  They have to survive the cards given them and Cagney gives them the cards.\r\n\r\n\r\n[img]http://t3.gstatic.com/images?q=tbn:ANd9GcRiwh__Aq0JNQ-OMExfwhfk5rQitT5g8Z1JzVyMnX_LFRKrciUv[/img]\r\n\r\n\r\n\r\nUnfortunately, the cards turn bad for Cagney and he shoots a rival, having to leave supervision of the school once again to the dreaded Thompson.\r\n\r\nThe kids turn rebellious when a fellow inmate dies.  Any more than that and you might as well not watch the movie.\r\n\r\nThis is one hell of a movie, but as morality plays usually go, it is a most unlikely plot.  A guy like Cagney gets to see first hand what a reform school can do to kids, even though he's a ruthless killer himself.\r\n\r\n\r\n\r\n[img]http://t2.gstatic.com/images?q=tbn:ANd9GcSyzOmRsRMhG5W71iM7WusF-eZX4fIlZXO-el8k56ODnnxotSI8Mw[/img]\r\n\r\n\r\n\r\n\r\nPure Hollywood, but thats what made Hollywood great, especially in the Depression era of the U.S.\r\n\r\nAnd now for my take.  This is a sappy movie true.  Cagney is great and it all turns out for the best.  But this is a most unlikely story that makes moviegoers feel great, but is hardly likely in reality.\r\n\r\n\r\n[img]http://t0.gstatic.com/images?q=tbn:ANd9GcQx7Uri_kyqV1AQ3SNDlcS0mY9dak41FYvPTnMeJhEFXJHDrD43[/img]\r\n\r\n\r\n\r\nA deduction of 20% for Mayor of Hell for credibiity, I give it an 80.  Not real bad for a far fetched morality drama is it?\r\n\r\n\r\n\r\n\r\n[img]http://t1.gstatic.com/images?q=tbn:ANd9GcRU9ZgDO9tpxs1m5wkoGUh_taw60LKnPndYUdaFPGOiEjXFMaIr[/img]\r\n\r\n\r\n\r\n\r\n\r\nREVIEWS:\r\n\r\n\r\n80%\r\n This one of those social dramas that Warner Bros. knew how to put together and were guaranteed box office hits in the thirties.\r\n\r\n\r\n70%\r\n The Mayor of Hell deals with the controversial subject (in the 1930s) of reformatories as it follows the life of depression-era children as they try a...\r\n\r\n\r\n[img]http://t1.gstatic.com/images?q=tbn:ANd9GcSDDyeAr4d9gL7HL5PLzM0E4-R3koBtREPP9dc3pTqDVmdy7ej12Q[/img]  Here, basically, Cagney tells this guy to suck his dick... (meaning: total disrespect)\r\n\r\n\r\n\r\nNOTES on the film:\r\n\r\n1   The film was remade in 1938 as Crime School with Humphrey Bogart taking over James Cagney's role and Hell's Kitchen with Ronald Reagan.\r\n\r\n\r\n\r\nStarring\r\nJames Cagney  ...  Richard 'Patsy' Gargan  \r\n  Madge Evans  ...  Dorothy Griffith  \r\n  Arthur Byron  ...  Judge H.J. Gilbert  \r\n  Allen Jenkins  ...  'Uncle' Mike  \r\n  Dudley Digges  ...  Mr. Thompson  \r\n  Frankie Darro  ...  James 'Jimmy' Smith  \r\n  Sheila Terry  ...  Blonde with Mike  \r\n  Robert Barrat  ...  Fred Smith, Jimmy's Father  \r\n  Allen 'Farina' Hoskins...  Joliet 'Smoke' Hemingway        (as Farina)  \r\n  Harold Huber  ...  Joe, Gargan Henchman  \r\n  Dorothy Peterson  ...  Mrs. Smith, Jimmy's Mother  \r\n  G. Pat Collins  ...  Brandon, Head Guard (as George Pat Collins)  \r\n\r\n\r\nDirected by Archie Mayo\r\nMichael Curtiz (uncredited) \r\nWritten by Islin Auster (story Reform School)\r\nEdward Chodorov \r\n\r\n\r\nRelease date(s) June 23, 1933 U.S. release\r\n\r\n \r\nRunning time 90 minutes",
    "date": "2013-06-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "James Cagney is wonderful -- when is he not? -- as a gangster who, through a political favor, becomes the head of a boys' reform school formerly run by a sadistic warden",
    "date": "2013-05-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Strange Warner Bros. social drama; Cagney is fascinating, as usual.",
    "date": "2013-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This one of those social dramas that Warner Bros. knew how to put together and were guaranteed box office hits in the thirties. This early \"dead end kids\" are sent to a reform school where they are mistreated. Cagney, a gangster as part of a deal is appointed as the commissioner of the school. He doesn't take it seriously at first but he changes and makes the necessary changes to improve the lives of the boys. The idea is to let the boys rule and administer their community.  A Social project that's a great Character study for Psychology.",
    "date": "2013-03-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Surprisingly good. The kid actors weren't horrible, and Cagney's a knockout, as always. Actually had a few tender moments.",
    "date": "2013-02-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "2: A decent enough picture, but nothing to write home about.  Cagney fits the part admirably, as does his child alter-ego, but it all seems a bit pre-planned and terribly obvious.  In other words, it could be summarized in a sentence or less.  Alternatively, one could catch one minute chunks of it at random intervals and probably not miss all that much.",
    "date": "2012-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Although made post-Hayes Code, this one slipped through a lot of things before the Hayes office started really cracking down. But this juvenile delinquent reform school story, featuring a lot of kids in pretty fun parts, gets obviously overshadowed by the entry of James Cagney as the deputy inspector who actually decides to give the kids a chance. Eventually the story was remade twice in the next 10 years by Warner, ideally because it was a story with social importance as well as entertainment value.",
    "date": "2012-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Another relatively unknown film from the early 1930's. \"The Mayor of Hell\" consists of several young boys who live in the city slums and only get through life by causing havoc on the streets. Sadly, their latest attempt to steal ends with a critical injury towards a store owner and the boys are convicted of the brutal assault and sent to a military school. The leader of the school causes them to suffer through poor living conditions and it is isn't until a new man (James Cagney) comes in and changes everything around. Though at times the dialogue is a bit corny, I found this to be a very interesting film, especially when Cagney makes the boy behave well by working peacefully on the premise as normal city workers and establishing a mayor and other important jobs at the same time. I did actually like this film and it is mildly entertaining.",
    "date": "2011-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Dated. Worth seeing once. Cagney is excellent. The story is by turns compelling and silly.",
    "date": "2011-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Reform Comes to the Reform School  \r\n\r\nI think this movie may be a little overdone.  The trailer goes on about how \"fearless\" and \"dramatic\" it is, and of course there is the title.  You would think we would see constant beatings, deaths covered up, boys living in squalor--at least a prison riot or two.  And while I suppose there is technically one, there at the end, it's a pretty tame riot.  There are a couple of deaths in the movie, but there is very little violence.  In point of fact, one of them is probably from the effects sleeping in a shack on a cold night have on tuberculosis, and there's no way to be sure that the kid wouldn't have died by the end of the picture of just general lack of proper treatment anyway.  What's more, while it's quite clear that these kids have a hard life, and while the reform school is mismanaged and probably in the long run at least as bad for the kids as being on the street, the kids would be pretty shocked by how much worse state prison would be.\r\n\r\nOur story starts with an integrated, or at least somewhat integrated, band of hoodlum kids led by Jimmy Smith (Frankie Darro).  They end up getting sent off to reform school for robbing a candy store and injuring the owner.  It turns out the reform school is run by the corrupt Mr. Thompson (Dudley Digges), who is not so much interested in the \"reform\" end of things so much as making sure the boys do what they're told.  What's more, he's skimming off the state funds, and the boys are ill-fed, ill-clothed, and just generally ill-treated.  Nurse Dorothy Griffith (Madge Evans) wants things to be run better, more in tune with modern principles, but Thompson doesn't care.  However, in comes Patsy Gargan (James Cagney), who has gotten the position as a stopover on the way to a slightly higher patronage job, and Patsy wants to impress Dorothy, so he decides to run the place her way, including making Jimmy \"mayor\" and appointing other boys to other positions of \"authority.\"  And all goes well until Patsy shoots a guy and ends up on the lam.\r\n\r\nThe interesting thing is that it's called a \"reform school\" even though the original uses of the place do not seem to include reform in any meaningful way.  I'm not a hundred percent sure what they actually are doing with the boys, but it never really seems to come up that they might want something to do with the \"school\" part of the name.  The only time they ever have books is what is probably hymnals or something.  Anyway, it's specifically stated to be church.  The point is, even the most hardened anti-reform advocate must surely acknowledge that the point of sending someone to prison is to prevent them from harming society, and these boys are going to get out sooner rather than later.  One boy's mother says that one of her sons went into reform school and came out a murderer, and I can't see that these boys were being taught much of anything else.  No problems were being solved here for anyone.\r\n\r\nIt is true that the black and Jewish people in the movie are crude ethnic stereotypes, but they're in the movie to be stereotypes at all.  And while Mr. Hemingway (Fred Toones) is just there to be laughed at, his son, \"Smoke\" (Allen Hoskins) is not.  Mostly, he's part of the gang.  It's roughly the same with Mr. Horowitz (William H. Strauss), who is admittedly not as funny.  However, Izzy (Sidney Miller), while admittedly doing a bit Borscht Belt, is also taken relatively seriously.  One might even expect that he'll convince Patsy that he should maybe consider serving kosher meals.  When he is incapable of trading his bacon for someone else's eggs, he just gives up and gives the guy the bacon, which is showing him to have dignity of a sort.  Yes, it's a bit of a stereotype that he ends up as a storekeeper and presumably the treasurer, but he is considered for such a relatively important role among the boys.  He is shown early on to have an eye for beauty.  This is better than nothing.\r\n\r\nReally, Cagney doesn't much register here.  It feels as though the casting people weren't sure whether they wanted a movie about Cagney or the kids, and they weren't sure Cagney was the right guy to cast.  James Cagney the man was actually a softy, I've read; James Cagney the character, not so much.  I'm not sure exactly what the plan was when he took the job at the reform school, but it was clearly supposed to lead somewhere.  He was supposed to be working his way up the chain of government.  The reform school was supposed to be a step on that.  That doesn't really work for me.  The idea that one look at a girl would convince him to do right by a bunch of hard-up boys?  Not working.  Yes, all right, he came from the same place as these boys, but that didn't exactly mean he was working for them before he met Dorothy.  He almost seems to be stopping in on his way to another movie.  The whole thing is a little disjointed, and the title is certainly extreme.  But hey, it was 1933, and there was money to be had in this kind of thing.",
    "date": "2011-06-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I wasn't expecting much but was absolutely floored at how great this movie if you like old classic's I would say a definate \"MUST SEE\"",
    "date": "2011-01-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "An okay movie, but I've seen others just like it, so it wasn't all that interesting, and the beginning is really boring.  The end is where it gets exciting.",
    "date": "2010-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The Mayor of Hell sounded like it was going to be a weak version of Angels With Dirty Faces but it was surprisingly more than what I'd initially expected. James Cagney plays a racketeer who starts taking a cushy in-title-only government job at a boys reform school seriously. The last half hour starts falling apart a bit once you discover the focus isn't quite where you thought it was but the final fifteen minutes redeem the flimsy third act quite a bit. Cagney plays Cagney and quite a few of the inmates, I mean students turn out some pretty good performances. If you can consider The Mayor of Hell one of the early Warner Bros. gangster movies, I'd say its one of the better ones...",
    "date": "2010-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Love when James Cagney plays a gangster.1 of my favorite Cagney movies",
    "date": "2009-10-16"
  }
]