[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I’m sorry did they even look at the book!? This is so comically bad. I’ve never seen a movie so far off from the book",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Classically weak plot lines. Tension is manufactured and absent when it is convenient for the story. The mystery is fairly thin and the only good part was when the villain gets their comeuppance. Overall kind of a flippant waste of time, which is on par with these kind of novels.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Super disappointing.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Mediocre psych-thriller that at times delivers some moments of intrigue, but mostly it's just about showing off a yacht with a cast that, for the most part, are there merely as window dressings to the same",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Why? Absolute contrived crap - timewaste and dull. \nThe cast got paid and obviously need the work. Its a shame because a couple of the cast are known for good work but it was hammy and predictable: cringy 1980s thriller (not thrilling). Watch this and lose 90 minutes of your life and you don't get compensated.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "(CASTELLANO) La mujer del camarote 10 no inventa nada nuevo, pero sabe a lo que va: un thriller psicológico de ritmo ágil, con aire de novela de aeropuerto bien adaptada. Desde el primer minuto se mete en la acción y evita esas introducciones eternas que suelen lastrar el género. Agradezco eso: no hay rodeos, ni discursos, ni pistas subrayadas con neón.\n\nKeira Knightley sostiene la película con aplomo. Su personaje, una periodista algo inestable que presencia (o cree presenciar) un crimen a bordo de un lujoso yate, se mueve entre la paranoia y la lucidez con la elegancia habitual de la actriz. Es ella quien mantiene la tensión cuando el guion flojea, y quien da un mínimo de verdad a una historia que podría haber naufragado sin su presencia.\n\nVisualmente está cuidada. La dirección aprovecha bien los espacios cerrados, el reflejo de los espejos, la sensación de aislamiento en medio del mar. Todo contribuye a esa atmósfera de sospecha donde nadie dice la verdad y cualquiera puede ser culpable. Hay ecos de Hitchcock, aunque sin su sutileza, y algo del whodunnit clásico pasado por el filtro de Netflix: limpio, bonito y un poco impersonal.\n\nLa película se ve con gusto, pero no deja huella. Cumple como entretenimiento —tenso, breve, bien producido—, aunque su misterio se resuelva de forma demasiado cómoda. Da la sensación de que podría haber sido algo más si hubiera arriesgado un poco en el desarrollo de los personajes o en la ambigüedad moral.\n\nAun así, no me aburrí en ningún momento. La mujer del camarote 10 tiene ritmo, oficio y la suficiente intriga como para mantenerte enganchado hasta el final. No pasará a la historia, pero funciona para una noche de sofá y manta, con el mar golpeando de fondo y la sospecha flotando en el aire.\n\n(ENGLISH) The Woman in Cabin 10 doesn’t try to reinvent the genre, but it knows exactly what it wants to be — a sleek, fast-paced psychological thriller that gets straight to the point. From the very first scene, it dives into the story without wasting time on endless introductions or forced exposition. That alone is refreshing in a sea of overcomplicated mysteries.\n\nKeira Knightley carries the film with confidence. Her character —a slightly unstable journalist who witnesses (or thinks she witnesses) a murder aboard a luxury yacht— moves between paranoia and lucidity with the grace we expect from her. She’s the glue that keeps everything together, even when the script starts to wobble.\n\nVisually, it’s elegant. The direction makes smart use of confined spaces, mirrors, and the oppressive calm of the open sea. It builds that sense of isolation and doubt where everyone hides something and truth becomes slippery. There are hints of Hitchcock, though without his finesse, and a touch of whodunnit style polished for the Netflix era: glossy, pretty, and a bit impersonal.\n\nIt’s enjoyable, if not memorable. The film delivers decent tension and solid craftsmanship, though the mystery resolves too neatly. It feels like it could have gone deeper — into its characters, or into the unease it hints at but never fully embraces.\n\nStill, I never got bored. The Woman in Cabin 10 is the kind of polished thriller that works perfectly for a quiet night: engaging, well-made, and just mysterious enough to keep you watching until the very end.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Non le scénario ne mérite pas un Oscar, mais il est amplement suffisant pour une soirée avec un thriller. Je souligne malgré tout la belle prestation de Keira Knightley.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I almost let the critics' reviews mislead me.  This movie has a stellar cast.  I was surprised how many actors I was familiar with.  It's just an okay movie but the actors elevated the material.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "After getting into it, I watched at the edge of my seat.  Tight, gripping, suspenseful and well delivered.  It does contain a couple of surprises and twists: it kept me guessing.  Certainly worth watching.  Don’t trust the critics.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Awful! Started out out okay then devolved to pure drivel.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "What a waste of a great cast. Paul Kaye is so under rated, it is beyond ridiculous",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I read the book and the movie hardly bothered with the original story. What’s the point of making a movie based on a book if they don’t bother to follow the story at all. They killed off a person who didn’t die in the book and basically didn’t bother to make the story make sense in a way that you could make a second movie and considering a second book does exist it would make sense not to change everything about this story. Stop using book titles for movies . Beautiful disaster and where the crawdads sing along with this movie are all perfect examples of failure to stick to key points of the story.",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A nice looking thriller, with a top movie star like Kiera K, why not? Why not indeed. It’s a whodunnit with flashes of horror in a confined space, a posh boat, milling around space or the sea, it’s no Event Horizon or Triangle of Sadness, more like Steve Carell’s Mountainhead with all of these billionaires plotting to AI the world, and the writers do manage to get AI facial recognition software in, but it turns out that this then becomes a plot twist, rather than an attempt to control the world. Norway is nice, but we have seen the billionaire retreat in Succession, and I probably should have just watched Murder on the Nile again, this looks nice but Kiera is the flashy whodunnit’s only saviour, watch Guy P in the Brutalist, you don’t really need to see him in this. Three out of five is a little generous but not bad for a streaming mid weeker.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This felt like someone asked ChatGPT to make a movie in the crime thriller genre set on a yacht, \n but also make it as obvious and ridiculous as possible.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Haven't finish watching all 2025 movies but this movie will surely be in the best 5 top movies",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It might have tried to follow the book a bit better. Adding stuff that didn't happen in the book didn't make it better. Also, why would Ben keep sharing info that wasn't his to share? The storyline in the movie seemed very choppy.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I wanted to throw myself overboard. Dead dull from the start, meanders along at such a slow pace. The basic premise has been done before but so much better, and more thrilling.",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Movie was watchable enough that I watched the whole thing, but progression of story was terrible and  disappointingly predictable.",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it, was very entertaining.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "A decent, mostly British, cast is totally squandered in this very mediocre film, which I can only imagine they agreed to participate in for a jolly on an actual $150m luxury yacht it's set on. Amazingly, it took 4 writers, including its director, Simon Stone, to adapt Ruth Ware's 2016 novel, which would've fit perfectly the literary thriller landscape at the time, but feels as dated, and cliché, as that title does now. Starting like an Agatha Christie, with a myriad of characters, including Keira Knightley's journalist Laura, being invited to a 3-day cruise to attend a fundraising gala in Norway by a terminally ill billionairess, it soon spirals into a frantic gaslighting exercise when no one believes Laura who's convinced that the woman in the cabin next door was thrown overboard on the first night. While Laura is constantly lauded as a brilliant and well regarded journalist, her crazy and unhinged behaviour never demonstrated any signs of that brilliance; while normally interesting character actors like Guy Pearce, Hannah Waddingham, David Morrissey, and others have nothing to do here as interchangeable character-less wealthy guests, merely there to fill up space. As a whodunnit, it's so blatantly obvious who did it, they might as well be twirling moustaches in the background, as that increasingly contrived and ludicrous plotting unfolds, with a climactic end that's nowhere near as clever or thrilling as the writers think it is. Coincidentally, the night before, I watched a 1945 B-movie called My Name Is Julia Ross which shared practically the same plot-twist, with Nina Foch playing the titular shrilly woman whom no one believed is telling the truth. I didn't buy the plot or Foch's acting in that film, and 80 years later, I don't buy this film or Knightley's acting either. Plus ça change.",
    "date": "2025-11-16"
  }
]