[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Filme mais ou menos, o roteiro é fraco, as cenas são mais ou menos, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "La historia de un tenso escenario de rehenes, por parte de un policía difamado, tiene sus buenos momentos en el que mantiene en vilo al espectador. No está entre las mejores actuaciones de Samuel L. Jackson pero se desempeña bien.",
    "date": "2025-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Must have been a slick thriller back in the day. Hasn't aged particularly well, I am afraid.",
    "date": "2025-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Exciting with an intelligent storyline and dialogue. Well directed, brilliantly cast and acted!",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I liked the character Nebaum that was emphasized by Sam Jackson.",
    "date": "2025-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great conspiracy movie. Probably too cerebral for modern audiences!",
    "date": "2025-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "As always Samuel Jackson delivers. Superb acting. Great script plot and wonderfully directed.",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The plot itself is so good it keeps you thinking the whole time. Big props to Samuel L. Jackson—his performance truly came from the heart. I just wish they explored more of the plot, but overall, it’s a very good movie.",
    "date": "2025-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This highly incredible story lives and dies on its leading performances, so it's a damn good thing someone hired Jackson and Spacey to go toe to toe.",
    "date": "2025-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Teaming for the first time Kevin Spacey and Samuel Jackson, arguably the two best actors of their generation, in perfectly fitting roles is a shrewd move and the best element of this fact-inspired but overwrought thriller",
    "date": "2025-06-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It's not perfect, but it's enjoyable enough to be one of those movies I might stop channel surfing to watch on late-night television.",
    "date": "2025-05-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Apesar de demorar um pouco para atingir seu ápice, que eu diria ser a segunda metade do filme, \"A Negociação\" nos faz — não ironicamente — reféns de uma claustrofóbica batalha de inteligência e sagacidade entre Samuel L. Jackson e Kevin Spacey. E embora F. Gary Gray — mesmo diretor de \"Straight Outta Compton: A História do N.W.A\" (2015) e \"Velozes & Furiosos 8\" (2017) — estenda o roteiro um pouco além do alcance de sua substância, o diretor compensa com generosas doses de tensão e suspense. O resultado é um filme levemente longo, que leva um tempinho para pegar embalo, mas entrega suspense policial de altíssima qualidade na sua segunda metade.",
    "date": "2025-03-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The Negotiator is one of those classic thrillers that still holds up well today. The plot is engaging from the start, throwing you into a tense, high-stakes standoff where trust and deception play a big role. The pacing is solid, though it stretches a bit in parts, but the setup and execution make up for it. \n\nF. Gary Gray's direction keeps the tension tight, balancing action and drama without overcomplicating things. The cinematography isn't flashy, but it works well in capturing the claustrophobic feel of the hostage situation, making you feel right there with the characters.\n\nWhat really makes this movie stand out is the acting. Samuel L. Jackson delivers an intense, gripping performance that makes it easy to connect with his character and root for him. Kevin Spacey plays off him perfectly, creating a dynamic where their back-and-forth feels natural and engaging. \n\nThe supporting cast is strong too, though some characters feel a bit underdeveloped. The script does a good job keeping the dialogue sharp and the tension high, but at times, it leans into familiar tropes that might feel predictable.\n\nThe score and sound design do their job well, enhancing the mood without being too overpowering. While the soundtrack isn't particularly memorable, the way sound is used to heighten key moments is effective. \n\nOverall, The Negotiator is a well-crafted thriller with strong performances and a gripping story. It might not be flawless, but it delivers where it counts, making it an easy movie to rewatch and appreciate.",
    "date": "2025-02-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "What a great movie. Excellent acting all around with some pretty well known actors. The scarey part is it was totally believable. \nWell written script that is unpredictable and very suspenseful without a lot of violence. \nGreat movie.  Highly recommend this one.",
    "date": "2024-12-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Edge of the seat from the first moment to the last. No one is pretending this is what a real negotiator would do, but hey, it's a movie! Class direction, lighting, cast, screenplay and acting. You won't guess who the 'bad guy' is until it is revealed to you.",
    "date": "2024-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The Negotiator is a pretty solid piece of action entertainment. It looks good and marches on nicely through the scenes. It's just that the entire premise is deflated by making the wrong guy the protagonist. It's very hard to sympathize with Jackson's character playing with other people's lives and the resources of an entire city just because he's doing the right thing.",
    "date": "2024-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "One of the most underrated movie ever. Just great!",
    "date": "2024-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What a movie!!! The acting and the plot, I was never bored watching it. In fact, this movie made me sign up for rotten tomatoes, just to give it five stars! Amazing",
    "date": "2024-04-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Loved this.  A lot of fun and on the edge of my seat moments.",
    "date": "2024-01-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A good film, but not a classic by any means. Kevin Spacey is great. Such a scene-stealer. And you can rarely go wrong with Sam L Jack. Was pleasantly surprised at how convincing he pulled off grief at a scene involving a funeral. The film does get a bit claustrophobic, same-y and a bit boring at times (it’s far too long). It also doesn’t quite come over re: its surprise reveals/twists. The stakes never feel that real either which I think is to the film’s detriment.",
    "date": "2024-01-26"
  }
]