[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Most nonsensical movie I have ever seen and I hate how they are mocking and stereotyping Indian parents in the US. Please.... get your facts right first before portraying something like this.\nThe protagonists- Foolish two individuals with narcissistic attitude and major mood swings and double standards for everything. They should have the liberty to fake and lie and be dishonest but expect honesty from other people. \nAnd these kids, were they raised in Mars or Venus? They lived with these Indian parents only right and they don't know what to do in temples and weddings- go and say 'Hi' to the dieties!! How do they act like aliens to their own culture? Did the parents suddenly become Indian after kids became adults?\nThe other daughter of the family is another psychotic character who doesnt know how to solver her problems except locking in a room and drinking.\nWhy do they even make such movies? Trying to make fun of something they have no idea about.",
    "date": "2025-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "so bad. tlas a true lover of bollywood I really wanted to like it and the start was good enough sadly the storyline  quickly became shallow and predictable , events sequencing simplistic ,anr dialogue just cringy",
    "date": "2024-02-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love this movie and could watch it continuously.  Top notch acting, phenomenal casting, cultural relevance and just a fun love story all the way around. Definitely watch if you enjoy lighthearted movies about love, family and positivity. I wish they had a sequel!",
    "date": "2024-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The plot had potential, but the execution failed. I couldn't watch more than 20 minutes of it. Waste of time.",
    "date": "2023-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's a chill, no pressure, pleasant movie that I wouldn't watch again but really enjoyed watching the one time!",
    "date": "2023-05-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Wedding Season (film on Netflix) is a lite but good romcom. It has a bit of a 27 Dresses feel due to the many weddings the lead characters attend in and around the Indian diaspora in New Jersey. The leads pretend to be a couple at these weddings to get their parents and extended family to stop trying to set them up with partners. The outcome is as you'd expect. Nice journey to it though. \n\nIt has a good message about 2nd generation immigrants making their own way in the world. I liked it.",
    "date": "2023-02-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Cute until the unnecessary gimmicks occurred in the last hour. If you're gonna create drama, you need to be able to fix it better than this film did. Plus, there are ways to make big public gestures less cringey than they did in this film.",
    "date": "2023-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was a such cute and heartwarming story, with a wide array of emotions woven into it. There was a few plot twist that I did not see coming!",
    "date": "2022-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I thought this was a cute movie. It was well cast and the acting was believable. The storyline was unique and refreshing and their love story was a slow burn so it was satisfying. I would watch it again.",
    "date": "2022-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Feel good, not really any surprises, but I enjoyed it on a Sunday afternoon.",
    "date": "2022-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "feel good movie. a bit cliched but good watch overall",
    "date": "2022-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Absolutly had it's funny and heartwarming moment.",
    "date": "2022-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I enjoyed this even though it was cheesy and predictable. The leads were likable, and I genuinely laughed several times. Plus it was clean, which I LOVED. I can't give it more than 3.5 stars because it's basically a small step above a Hallmark movie, but it was entertaining and sweet!",
    "date": "2022-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Fun cliche about parents trying to interfere with your life and you doing your best to make your own life.",
    "date": "2022-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Can we please stop making these films? Predictable from the first second? Tired plots, all fake fake and lazy storylines!!",
    "date": "2022-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Adorable movie.  It was released 4 days ago and I have already watched it 3 times.  Both Suraj and Pallavi are naturals.  I must say that this is a first in which an actor born in India has perfect American accent and mannerisms.  I had no idea that Suraj Sharma grew up in Delhi.  I always assumed that he was a 2nd generation Indian living in America who assumed an Indian accent for Life of Pi like so many other American Indian actors.  The story line is tad old but the performances and witty dialogues make up for it.  Love the concluding song - show me love- can't find it anywhere.  Natalia Winkelman must not know Indian culture if she is turned off by the focus on \"capitalistic success\" because that is what Indian arranged marriages are all about.  And can we please be done with the mean Indian Aunties, not all Aunties are all that bad.",
    "date": "2022-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A bit difficult to reconcile why a Caucasian American is directing a movie about the lived experiences of second generation Indian Americans. Denzel once said Marty Scorcese directed Goodfellas and Spielberg likewise directed Schindler's list for a reason. It's culture. Casting relatively young second generation Indians with Canadian accents to play the parents was somewhat of an own goal. They did not look or sound authentic. They sounded like a white person imitating an Indian accent, rather than an actual Indian origin person speaking English the way that they do.",
    "date": "2022-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I liked it. Lighthearted, predictable romcom, but who doesn't need that from time to time. Love Suraj Sharma as the male lead. He was a favorite character in the CBS show \"God Friended Me.\" Grab some popcorn, a beverage and a place on the sofa and turn away from the world's cares for a little over 90 minutes. You'll be glad you did.",
    "date": "2022-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thought there were a lot of comedic elements which made it an enjoyable watch!",
    "date": "2022-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is trite and dumb even by the standards of cynical rom com. All the characters are caricatures and  watching them emote their way though a rehash of a rehash of a parody of a movie was exhausting.",
    "date": "2022-08-06"
  }
]