[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Interesting documentary, with good development and excellent analysis of the protagonist's life,",
    "date": "2024-10-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This is the problem with Netflix produced documentaries. They're lazy, unprofessional and the story meanders. I don't care about the camera guy wanting to go make coffee in the middle of the interview, I don't want them cussing for no real reason. It's sloppy. If the BBC made this movie, it would have been of the highest quality. Strive for more, Netflix.",
    "date": "2024-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I don't understand some of the low ratings on this film.  I absolutely loved it.  I'm not sure about the accuracy of it, since it was a story largely told by John, but I don't care.  I just wanted to be entertained and this certainly did this well.  What a story.",
    "date": "2024-04-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "If there was ever a documentary where the phrase 'going down the rabbit hole' was so true it was 'Running with the Devil: The Wild World of John McAfee.' \n\nSYNOPSIS: 'Revealing footage and interviews uncover new layers of fugitive tech pioneer John McAfee's wild years on the run.'\n\nThis is bonkers. This Netflix documentary follows John McAfee who's a heavily armed, mega-paranoid tech millionaire, Libertarian presidential hopeful and suspected murderer.\n\nOn top of this he does a lot of drugs, drinks a lot of booze, and seems to exist in a constantly agitated state of paranoia.\n\nWhat's the worst that could happen?\n\nYou're driven by curiosity to watch this, it's car crash TV. But you just have to watch.\n\nAs we follow McAfee over a number of years his behaviour escalates to weirder and more wayward levels.\n\nA multmillionaire madman is a compelling watch, but it's also terribly sad. For all those involved.\n\n8/10",
    "date": "2022-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Well documented movie about a single phrase: \"Play stupid games, get stupid prizes\". This includes the film crew\n\nLook forward to \"I called my pimp\"\n\nand... \"I'm taking OUR chances\"",
    "date": "2022-09-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "this guy is just unbearable on every level.",
    "date": "2022-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Really chaotic. Seemed to be put together very quickly. Disappointing because I usually LOVE this stuff!!",
    "date": "2022-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "While the documentary struggles to answer some complicated questions about McAfees life, the sensational aspect of the story is worth following, and does make for some entertaining wacky footage.",
    "date": "2022-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Today's soft NPC types won't like this film - it doesn't hold your hand and feed you some easy-to-digest, feel-good bullcrap. It's an inside look into humanity and life, in so many ways. The simpletons will miss the inside views of the first wife from Belize, and the second lady from South Beach. They will miss the unique opportunity to view real and unadulterated life and the actions people take. For example, the murdered rich man in Belize first took it upon himself to poison and kill McAfee's dogs. Imagine you're rich, you're in paradise, and you choose this aggressive behavior to engage in. What happened afterwards seems obvious.\n\nI think this is an extremely rare and real view into a variety of very real situations, and some very exclusive situations. But for those looking for some braindead, generic, Disney-esque piece pushing \"The Message\", there is no easy bird-food to be had here. For real, live human beings with a functioning brain who have curiosity about humanity and life, this is a waterfall in a desert.",
    "date": "2022-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It is a poorly made documentary. I made it about 75% of the way but it was painful. In addition, McAfee was uninteresting. Just another needy guy desperately seeking attention and validation. When he started \"philosophizing\" I muted it. He was bad at relationships and just a mess who appeared to lack meaning in his life. The movie was a shard of that disaster.",
    "date": "2022-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I stopped watching after 15 minutes. It was more about some wannabe reporter from vice, than actual Mcafee",
    "date": "2022-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I stopped watching after 10 minutes.",
    "date": "2022-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This is a good look at the crazy days and later life of John McAfee.  There is another documentary made about the actual incident in Belize which gives a better look at the madness and duality of this madman.  This one takes place mostlt after the incident and takes the viewer much more to date than the 1st.  This is a decent and engaging look at a true story that is stranger than fiction.",
    "date": "2022-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "(No spoiler)\nI was looking forward to it and I heard a bit of McAfees career and life before. But after half an hour I stoped, cause the docu does little to nothing to explain the background.\nIts something new when you have footage of a Cameracrew who spend night and day with this man so close before his death, but you still need to pick up people who maybe have not heard about John McAfee or at least not so much that you know what happened before the Crew arrived in Belize.\nAs long as you are not willing to read Wikipedia and other articles about the events prior to his runaway to Beliz, dont watch it.",
    "date": "2022-08-24"
  }
]