[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I sure have a lot to say about this movie. It's not \"Pets United\" bad since that's the worst movie to ever exist and I will die on that hill, but it's still bad and very obviously had no soul behind it. The first thing I'd like to say is this movie isn't extremely boring. It was able to keep my attention even just by a thread. But other than that, that's pretty much it. Op is really annoying throughout the whole movie and she messes up so much in the movie to the point it's difficult to like her. And Ed is just.... there. There's nothing interesting about either characters except they're disliked by the other flummels because they mess up everything . There's no really redeeming qualities of either of these two. Another thing is the movie doesn't do anything interesting with the flummels fast forwarding to modern day Shanghai. They barely explore it. If this was set in any other timeline it would not make a difference at all. That's how much they don't interact with Shanghai. The only thing they really do is look around for a little while, eat an apple and then panic over donuts because they look like flummels. I feel like they really could of done more with it. Also while they’re exploring Shanghai, they meet this dog named Clarence and spoiler alert, he’s the villain of the movie! But here’s the thing. There was no hints or buildup to him being a villain. He said he’s a villain because he hates flummels but the only time he ever showed slight hints that he was evil was that he barked at the flummels in the beginning and that his owner disappeared. Other than that, it just came out of nowhere. That’s a very reoccurring theme that I noticed in this movie. Everything just comes out of nowhere with little to no warning. Which is what I wanted to discuss with the dodo and Ed’s relationship. There wasn’t like any romantic tension between the two or any signs that either the dodo or Ed had feelings for one another and it was so out of pocket for them to just have sex at the end. (yes that happens in the movie… in front of everyone.) I felt like the writers just wanted there to be a couple at the end of the movie so they just put Ed and Dodo together because they shared some interactions. I feel like it would have been better if instead of Dodo dating Ed, she was instead a mentor or parent to Ed. Or if you did want to keep them as boyfriend and girlfriend, maybe I don’t know, have SOME romantic tension between the two! Even a crappy little montage where there’s jazz in the background when Dodo gets introduced and Ed is blushing and stuff is better than what this movie did! Gosh! And then the extinctables or whatever they’re called. I mean… I don’t even know what to even say about them because they’re just so boring. They all have no personality traits except for the triceratops which catches toys and the dodo which gives advice (or at least gave advice to Ed at the end of the movie). And the last thing that I really wanted to comment on was the flummel’s horrendous design. Like I might just be the only one but the design they chose where they decided to give the flummels holes in the middle is just so ugly… they look like hamsters but if it got shot with a huge bullet and then the wound healed. Like it’s hard to believe that THEY were the most popular pet in the modern day. Anyway that’s pretty much most of what I had to say about the movie. There’s obviously more but I can’t be bothered to really mention it. Overall, it’s just such wasted potential. I feel like it has all the right stuff to be an interesting movie but it all just fumbles and becomes an absolute mess.",
    "date": "2025-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This isn’t pissed off bad, It’s just boring",
    "date": "2025-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "yes.donut,how they breed and make egg without (ykw)💀💀 also they just met and they make egg 💀💀💀💀😭🙏🙏🗿. it's funny 🙂and PLEASE PART 2 I WANNA SEE THE EGGGGGG also they are diffrent species how they make egg??🗿🗣🔥🙏😭💀🤰🏿\n\n\n𝒶𝕭s🅞𝓁𝖀Ⓣe   c𝒾𝔑ℯℳᴬ\n\nhttps://preview.redd.it/absolute-cinema-v0-dlfu8la74e9e1.jpeg?width=640&crop=smart&auto=webp&s=9c1dcf3385def342c665d5911a6bc9176a632117",
    "date": "2025-03-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Ed just lost his virginity in the end 💀💀",
    "date": "2025-01-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "CHARACTER DEVELOPMENT IS BLAND AAGGHH",
    "date": "2025-01-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Improper Character Development+Sudden Betrayel without any prior signs, and\n\nNooo not the crossbreeding scene 💀",
    "date": "2024-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It have sax but this is a kids movie",
    "date": "2024-03-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Suprisingly funny! Watched with my 8 year old and we both thoroughly enjoyed it.",
    "date": "2024-01-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Contrived angst-ridden teenage soap opera. The first few episodes were okay, but the whole thing bogs down into a flashback fiesta with everyone switching sides at the drop of a hat, and so on. Bland. Boring. Annoying.",
    "date": "2024-01-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It wasn’t good but it wasn’t terrible",
    "date": "2023-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The donut and dodo have a child onscreen.",
    "date": "2022-12-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I enjoyed this animated movie overall with my family as it was an interesting look at bringing different animals together with time travel along with a fun-loving animal called Flummels",
    "date": "2022-01-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Esta Pelicula Es el COLMO del reciclaje, primero, el concepto de los marginados a los quee nadie les habla y luego salvan el mundo,luego el tipico musical insorportable, tambien el villano con traumas del pasado que no puede superar algo que paso hace años  y ese el mismo personaje que antes era bueno pero ahora es malo, tambien la tipica escena en el que los protagonistas se dicen que se odian y luego uno la busca y se disculpa, pero es bastante divertida y si estas con tu familia es mas entretenida que tu viendola solo",
    "date": "2021-12-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "ew ew bad  i hate them , ew",
    "date": "2021-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Pretty rough. Extinct follows a trend with recent Netflix CGI animated features out of China being very flashy, brain dead adventures.",
    "date": "2021-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fun, cute, great watch for the kids",
    "date": "2021-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Very shallow story but absolute fun to watch. Couldn't stop smiling all the way through. Would be a hit for a drinkinggame aswell.",
    "date": "2021-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It amused my children and passed the time",
    "date": "2021-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Came across this movie while searching for something to watch as a family. The concept of creatures (Flummels) traveling through time via a flower was a little strange, but in the end my kids enjoyed it, which is the important thing since the movie is targeted towards them and not adults (which some critics on here seem to forget sometimes). To be honest, I actually enjoyed the movie as well. It was different and it had a nice message about accepting yourself as well as others (inserted subtly as opposed to smacking you in the face with it). It's certainly not the best animated family movie to be released recently, but it is enjoyable.",
    "date": "2021-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Terrific fun and great jokes",
    "date": "2021-11-18"
  }
]