[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "If you like movies where the woman character is helpless and clueless and being led my the man the whole time then this is for you.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Really well done.  Yeah, it is cheesy, dumb and over the top.  There is a plot mcguffin like any spy flick, and it isn't anything special.  But Cruise generally makes really good movies, and he doesn't disappoint here with a spoof of his Ethan Hunt persona.  The movie in no way takes itself seriously, has lots of great action scenes, is fast paced and breezy.  You won't learn anything about yourself, but you will be entertained.",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved this movie in my top 20",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie is way better than it's given credit for.",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Everyone gets pie! What a fun time",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Just really good movie making . Pure enjoyment . Seen it 4 times .",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Just a fun movie and it really moves along! No dull places. I think people who didn't like this movie, don't like Tom Cruise. I happen to enjoy his movies. Cameron Diaz played her part really well, too. They had great chemistry together on screen. Just a fun movie with lots of action.",
    "date": "2025-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Tom Cruise is so cool that this movie is unwatchable.",
    "date": "2025-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Brilliant! One of most re-watched movies on my list. Very fast paced, silly, hilarious, ridiculous, adrenaline filled, gutsy and wacky. Superb in character performances from Tom Cruise and Cameron Diaz, well, whole cast pretty much excels in character. Very well written and brought to screen. Lots of nice and catchy one liners and great musical score. Very memorable",
    "date": "2025-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This has been my family's all time favorite movie.  we've watched it dozens of times and reference our favorite quotes often. It's funny and entertaining.  It gets better every time we watch it.",
    "date": "2025-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "One of my favorite Cameron Diaz flicks in forever. \nVery underrated. Tom Cruise is classic on this movie.",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Please make a sequel, original cast",
    "date": "2025-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Hard to believe this came out 15 years ago! Great fast fun story with Action and Romance. Tom's character is cool and collected in the midst of chaos. Great interaction between the characters.",
    "date": "2025-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I don't get the hate that this movie has received.   I found it to be very entertaining combining action, comedy, and romance.  I've watched it many times and always enjoy it ...even more so than a couple of his MI movies.",
    "date": "2025-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This is a good, but not great movie. Great action and the leads are fun to watch.",
    "date": "2025-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Totally underrated!!  I was never bored and their chemistry is off the charts.",
    "date": "2025-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Tom Cruise was born for this role. The self-deprecating portrayal of this Mission Impossible role of the all-rounder is sensationally funny. The eeriness and mystery of him is played out perfectly. He should do more comedies with him playing the role of a psychopath with the typical Tom Cruise smile",
    "date": "2025-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This may have been one of the worst films i jave ever seen. I felt emotion twice. First i felt awkward after the plane crash and then I felt happy... when my wifi cut out and i thought we were goong to turn off the movie.",
    "date": "2025-05-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Knight and Day (2010) was an excellent surprise for me, I have to say that it has its charm and creativity but the CGI is a little strange and its script is terrible.",
    "date": "2025-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a good movie. Some of the reviews here are inane. People love hearing themselves talk  ( text ). It's a mini-MI film, with lots more humor. Diaz and Cruise  have good chemistry. \nSee this underrated gem. \nIt will make your  ( K )night  and  ( D )ay .",
    "date": "2025-05-23"
  }
]