[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Absolutely shocking. If it is based, even loosely on true events, then she's so thick it's unreal. The actual footage of stand up parts confirms she's stupid and I can't believe she'd actually admit to this being based on anywhere like real events. Peasant woman's/man's Amy Schumer and that's being nice.",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This was sooooo good. This had one of the best female friendship’s representation. All felt real. This also did a good job at showing that the guy doesn’t have to be traditionally abusive or mean to be a bad guy, nice guys who lie or do anything mundane are also bad. This also presented why women should be aware of guys with low esteem. LADIES WATCH THIS!!!",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Disappointing as far as it's supposed to be a comedy. The main characters Cho Schlesinger were not bad. Overal though pretty boring",
    "date": "2025-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "At least it kept my interest.",
    "date": "2025-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I didn’t mind it! I found it entertaining.",
    "date": "2025-07-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Good! Watch this ladies !",
    "date": "2025-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Iliza is hilarious… at everything she does.  Nuf said!!",
    "date": "2025-03-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This is the first movie she has been in that I enjoyed. Her standup comedy I don’t get. But her lines in this movie were great. I guess I like her better in movies.",
    "date": "2025-02-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Finally not a sappy rom-com that I could watch till the end. Good job with casting too!",
    "date": "2025-01-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "SUCKS! This movie is trash.",
    "date": "2024-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The cringe wasn't terrible, the story felt different enough to keep watching.",
    "date": "2024-05-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It's cute, funny, very on-brand comedy for Iliza. I couldn't believe that it was based on a true story that she actually went through...Crazy. I found it an easy watch, would watch again, and plan to recommend it to friends. I hope she writes more movies/TV, because I will be watching!",
    "date": "2023-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Watched the whole thing but not a good movie. Bad acting and not funny- very obvious what will happen next",
    "date": "2023-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "What did I just watch? A mash up of some BS romcom with an episode of Seinfeld? Whatever this was trying to be, it turned out to be a really annoying bicker fest with an ending thats begging for a lawsuit. Not very well written, acted, or pretty much anything. Do yourself a favor and watch a few episodes of Seinfeld instead.",
    "date": "2022-12-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It may have looked good on paper, but in execution the film was excoriatingly unfunny.",
    "date": "2022-12-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It was funny, though the climax was a bit of a pulled punch (felt like they were running out of budget), I was hooked throughout.",
    "date": "2022-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Good on Paper clearly depicts what being the victim of a master manipulator is like. What being in a false relationship is like. Lead actress Lisa Schlesinger knows all about it since the story is her own. I value this movie. It is a big lesson in protecting yourself from false people. A lesson in listening to that small voice warning you that things are getting weird. It supports trusting family and friends when they have hesitations about your significant other. \n\nWe have a tendency to look for the best in those we love. That's okay, except when a duplicitous person gets past our defenses and we are being manipulated into believing it is true love.\n\nYou don't want to be so critical that you miss out on a potentially good mate, but there are terrible people out there who come disguised as \"too good to be true\". That is what her best friends kept trying to tell her. He is too good to be true. \n\nThe acting by Lisa Schlesinger is great, and Ryan Hanson as boyfriend Dennis Kelly is also brilliant. He is so good at showing exactly what these awful people are like.",
    "date": "2022-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Good movie and this might sound cliche but I couldn't get over how awkward Dennis mouth looked the entire time. It was distracting",
    "date": "2022-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I really enjoyed the overall framing of the story - the standup interjecting throughout the film. I also found Iliza to be quite likeable in this as the lead. A relatable character that connects to the audience. \nIn my opinion, the film lacked in its ability to tell a story in any real depth. The romantic development was weird… there was zero chemistry between them and then we're suddenly meant to believe they're in love. I was also confused by how deeply he was villainised in the film. It felt like a very one sided story being told, and it was lacking nuance. Even if the storyteller hates him, I believe there needs to be some room for the audience to decide how they feel for themselves. \nOverall, it wasn't a bad film but it just wasn't great.",
    "date": "2022-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Boring concept, not great acting. Wish I could have the time back.",
    "date": "2022-04-24"
  }
]