[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What a lovely movie beautiful setting amazing actors really different and refreshing story",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This work is absolutely beautiful, with its simplicity and content derived from the book. The actors deliver astonishing performances, transforming silence into poetry. There’s an intense emotional depth in this outstanding work, created by the directors, actors, and the very book itself.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This film invites us to rehumanize our relationships and ourselves. The cinematography is amazing and changes according to the action. Rodrigo Santoro is a powerful presence, and the story of a family reunited by affection feels very contemporary.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Lindo, delicado e com atuações magníficas. Deslumbrante fotografia.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Beautifully sensitive film that delivers an unusual story.... Absolutely mesmerising acting that is easy on the eye, but has immense depth of both characters, and understandings.....",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A beautifully crafted storyline of 4 people from different walks of life who despite their hardships come together to form their own little circle where humanity, love and belonging reign. Can't remember the last time I cried for a movie. Very touching and charming film. Loved the cast.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Even though Brazil's literature has few works in the fantastic realist style that, to many, characterizes Latin American literature, Brazilian cinema has lately incorporated surrealistic elements and iconic/archetypical representations that may seem forced or exaggerated. But bear in mind that that is on purpose. \"The Son of a Thousand Men\" does not shy away from stereotypes to deliver its message -- which is precisely the movie's highlight, especially for those who are aware of the conservative right-wing evangelical wave that has overtaken Latin American polítics lately and how it has impacted minorities. The movie also showcases some of Brazil's most beautiful and least explored landscapes -- a misture of Chapada Diamantina, in the state of Bahia, and the coastal city of Búzios, in the state of Rio de Janeiro.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the rare recent films that truly leaves a lasting impression. Raw, honest, and deeply emotional from start to finish. With so little dialogue, yet the feelings it evokes are incredibly powerful. A quiet story that hits unexpectedly hard. Absolutely recommended",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Pure poetry, a dialogue so simple yet profound that could only be written by someone who understands the world as a person who has lived through a lot of it but talks about it with the innocence of a child. Compelling soundtrack and amazing visuals connect everything together.\n\nOne of my favorites from the year.\n\nBrazilian cinema is a treasure !",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Cativante. Belo. Sensível! \nUm filme para poucos.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was real poetry. So touching, captivating and inspiring! Beautifully crafted characters, beautiful screenplay, brilliant acting. People craving for love, affection and understanding. It really touched my soul and made me cry.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A brilliant captivating movie movie.\nEvery human craves and deserves love.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The Son of a Thousand Men emerges as one of the most remarkable Brazilian films of 2025 and one of Netflix's major recent releases. Daniel Rezende, who directs and adapts Valter Hugo Mãe's book, delivers a film that reaffirms the special moment that Brazilian cinema is experiencing. The production combines emotional depth, sensitive performances, and a narrative structure that breaks with tradition, focusing more on experience and sensation than on direct explanation. It is a film that embraces the audience through silence, contemplation, and an attentive gaze on the pains and affections of its characters. The Son of a Thousand Men delivers a story of unity that is not based on idealizations, but on the construction of unlikely bonds between people who, until recently, believed they had no place in the world.\n\nDaniel Rezende delivers a film that stands out for its courage in escaping the conventional. It is not just a story about fatherhood, but about family in its broadest and most affective sense. About welcoming and being welcomed. About allowing yourself to love and be loved. With a narrative constructed like an emotional puzzle and a set of remarkable performances, The Son of a Thousand Men consolidates itself as one of the great Brazilian productions of the year, and certainly one of the most exciting ever delivered by Netflix. It is a film that resembles the style of A24: intimate, sensory, human, but with the heart and identity of Brazil pulsing in every scene. A work that stays with the viewer long after it ends.",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "If you want action this movie is not for you. Recommended",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Adapting Valter Hugo Mãe’s delicate, poetic universe for the screen is no small feat, yet Daniel Rezende achieves it with rare grace and emotional precision. The Son of a Thousand Men is a quietly powerful meditation on loneliness, love, and the search for belonging, rendered with luminous cinematography and understated direction.\n\nRodrigo Santoro delivers a career-defining performance as Crisóstomo — restrained, soulful, and profoundly human. Johnny Massaro provides an equally sensitive counterpoint, bringing depth and quiet tension to the story.\n\nSome may find the film’s touches of magical realism unconventional, but they elevate rather than distract, expanding the emotional and spiritual dimension of the narrative. Even with a few inevitable shortcuts from page to screen, the heart of Valter Hugo Mãe’s work remains intact.\n\nThe Son of a Thousand Men is pure cinematic poetry — tender, contemplative, and deeply human. A luminous triumph for Brazilian cinema.",
    "date": "2025-11-20"
  }
]