[
  {
    "user": "Matt Pais",
    "rating": null,
    "text": "Unhurried and elusive, beautiful and haunted, limited yet overwhelming. Amy Berg’s documentary about the legendary singer embodies Buckley without suggesting that every rock can be overturned about someone so simultaneously present and unreachable.",
    "date": null
  },
  {
    "user": "Johnny Loftus",
    "rating": null,
    "text": "It’s Never Over, Jeff Buckley envelopes the viewer in the soul of its subject, a place that like his preternaturally beautiful voice was a source of his creativity.",
    "date": null
  },
  {
    "user": "Chris McCoy",
    "rating": null,
    "text": "It’s a thoughtful and deeply emotional film about a character who never quite fit in in life, and whose death was yet another Memphis tragedy.",
    "date": null
  },
  {
    "user": "Sarah Vincent",
    "rating": null,
    "text": "“It’s Never Over, Jeff Buckley” may inadvertently be the perfect documentary to describe the dangers of parentification and how visitation with a distant parent can sometimes cause more damage than good.",
    "date": null
  },
  {
    "user": "Annlee Ellingson",
    "rating": null,
    "text": "A profound elegy of profound loss.",
    "date": null
  },
  {
    "user": "Cortland Jacoby",
    "rating": null,
    "text": "Documentarian Amy Berg uncovers the true story behind the adored musician’s enigmatic persona and contemplates the sense of loss he’s left behind.",
    "date": null
  },
  {
    "user": "Stephen Silver",
    "rating": null,
    "text": "A beautiful, ethereal documentary about the late singer.",
    "date": null
  },
  {
    "user": "Linda Cook",
    "rating": null,
    "text": "The late musician's life is every bit as engaging as his music.",
    "date": null
  },
  {
    "user": "Jim Laczkowski",
    "rating": null,
    "text": "One of the year's best films is a remarkable music documentary about an artist that meant so much to me, it's hard to express it all here in a review. This film shows that our love of music, of the arts, of people like Jeff Buckley, is truly, never over.",
    "date": null
  },
  {
    "user": "Erik Childress",
    "rating": null,
    "text": "Amy Berg remains one of the great documentarians of our time and here takes us on a lovely and sad musical journey for an artist that deserves to be remembered.",
    "date": null
  },
  {
    "user": "Karen Gordon",
    "rating": null,
    "text": "Amy Berg’s achingly intimate documentary gives us a view of the late singer Jeff Buckley through the eyes of people who knew him best.",
    "date": null
  },
  {
    "user": "Adam Kempenaar",
    "rating": null,
    "text": "Berg approaches Buckley’s life with the same intense empathy that Buckley himself approached his art.",
    "date": null
  },
  {
    "user": "Kimberley Jones",
    "rating": null,
    "text": "Whatever the reason, it left me hungry for more. Then again, for Jeff Buckley fans, whatever it is, there will never be enough.",
    "date": null
  },
  {
    "user": "Richard Crouse",
    "rating": null,
    "text": "This isn’t an episode of Behind the Music. It’s a humanizing tribute of a person who also happened to be a generational talent.",
    "date": null
  },
  {
    "user": "Elizabeth Weitzman",
    "rating": null,
    "text": "Ironies -- both intimate and enormous -- imbue It’s Never Over, Jeff Buckley with much of its thematic weight. So it’s only apt that they also contribute to its artistic buoyancy.",
    "date": null
  },
  {
    "user": "Andrew Parker",
    "rating": null,
    "text": "It’s Never Over, Jeff Buckley applies the standard biographical documentary approach to its subject’s life and struggles, but that works well here.",
    "date": null
  },
  {
    "user": "Alan French",
    "rating": null,
    "text": "The chickenscratch handwriting becomes illuminated, and unlike many documentaries about musical acts, It’s Never Over utilizes the medium to visualize Buckley’s words and the worlds they created.",
    "date": null
  },
  {
    "user": "Rachel Ho",
    "rating": null,
    "text": "Berg carefully considers the person Buckley was, creating a touching portrait of a complex individual.",
    "date": null
  },
  {
    "user": "Charles Mudede",
    "rating": null,
    "text": "It's Never Over, Jeff Buckley offers those who study human memory an excellent examination of what's called a \"reminiscence bump.\"",
    "date": null
  },
  {
    "user": "Robert Abele",
    "rating": null,
    "text": "The result is loving, spirited and honest: an opportunity for us to get to know the talented, turbulent Buckley through the people who genuinely knew him and cared about him.",
    "date": null
  }
]