[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "A maudlin teenage romance movie with a trope ghost element.  Predictable, boring.  The audience reviewers must be mostly teenagers to score 78%.",
    "date": "2025-03-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie. It is has a very good plot/drama/romance/comedic. I laughed I cried.",
    "date": "2025-03-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Kyle allen is gorgeous",
    "date": "2024-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "love it. its make my cry. love from pakistan🇵🇰.",
    "date": "2024-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Simply fantastic, I even cried at times",
    "date": "2024-02-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A great movie. Just be patience and you will enjoy it!",
    "date": "2023-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The story tried to give a unique setting and deliver an intriguing love story. But I saw it to be repetitive. The western romantic movies have not deviated away from having almost similar protagonists with consistent kissing and making out scenes. Anyway, I was able to watch all of it by being busy with other things at the same time.",
    "date": "2023-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I liked this film overall as a chick flick. The film was well acted and the characters had a believable chemistry.",
    "date": "2023-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It is a touching story which makes you crying",
    "date": "2023-04-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The normal teen melodrama with hollow emotions.",
    "date": "2023-01-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The In Between ist ein Liebesfilm von Arie Posin (Regie), das Drehbuch stammt von Marc Klein. Die Geschichte handelt von einer ersten Liebe, ja Liebe und Verlust das sind die Themen… . Joey King und Kyle Allen spielen ihre Hauptrollen voll überzeugend und glaubwürdig… .  Die Farbbearbeitung von „The In Between\" ist großartig und erzeugt eine gewisse Mystik… . Die Musikalische Gestaltung von JJ Pfeifer ist voll ausgereift und lädt uns Mitfühlen ein, von Songs bis zum klassischen Klaviersolo. Ja alles passt zusammen, für mich ist „The In Between\" ein perfekter Liebesfilm mit einer gewissen Mystik.",
    "date": "2022-12-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The story is nonsensical & Joey King is cloyingly irritating. Skip this drivel.",
    "date": "2022-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I hate horror movies or scary ones. I don't like sad movies neither, but this movie was beautifull. The music, the design, the picture, the script, everything.",
    "date": "2022-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it, you get what you wanted..",
    "date": "2022-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Yes yes yes! See this movie its awesome and will overwhelm you with emotion its my favorite movie of 2022 so far",
    "date": "2022-05-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "An totally original way to tell an age-old story i just loved it from beginning to end. phenomenal filmmaking",
    "date": "2022-05-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie dont have noting good to see",
    "date": "2022-04-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Movie had me tearing up in the end. Was such a beautiful movie.",
    "date": "2022-04-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This movie drags on forever like an over-chewed old chewing gum that lost its flavor hours ago. \n\nThe actors are cute but not great actors. \n\nThe whole jumping between then and now with the countdown and all - big yawn. \n\nSorry. I forced myself to sit through the movie but even the end is bad, I just can't find anything nice to say about it. Pure waste of time.",
    "date": "2022-04-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Perfectly watchable and fairly touching. Just all a bit average . Meh ! It passed the time though the consistent INXSS was superb",
    "date": "2022-04-21"
  }
]