[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A sad and enraging glimpse into Britney Spears' conservatorship.",
    "date": "2022-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I only vaguely knew this story before watching the film. The two filmmakers clearly care about Britney and handle sensitive information with great care. I thought the choices they made with the film, using found footage and famous shots of her, in addition to talking heads, brought the story to life. I feel so bad for Britney. She was truly treated abominably and we all watched it and knew something shady was happening, but no one did anything to help her. Hers is really an American tragedy, and like other American saga myths, it has a (thankfully!) happy ending. She is finally free.",
    "date": "2022-04-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Wasnt worth the time. Nothing new... missed a lot of pieces before and after the freeing.",
    "date": "2022-02-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A vivid portrait of what she went through. Britney is one of my most favorite singers of all time and through texts, and calls, and telling of the events, it is one crazy documentary. Apparently her Father may have been trying to get her to Christ and if that is so that is good because Jesus is our only hope. Same to Britney Spears and everyone. However other stuff was going on and she was not being able to be independent enough with other things along with God in her life. Now that the conservatorship is ended, I support her Father trying to tell her The Gospel but she has to be more independent in other ways along with The Lord.",
    "date": "2021-12-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It's very slow and doesn't offer more than what the Hulu New York Times documentary has already said; just listen to her phone call with the judge to get everything.",
    "date": "2021-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This was an underwhelming documentary compared to \"Framing Britney\". I was annoyed watching the end. They were talking as if these things were brand new information but we all knew those things when the doc was released??",
    "date": "2021-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Britney Vs Spears is a searing documentary on how one of the world's most successful women is treated by courts and family alike. She was subjected to conservatorship for 14 long years. What is conservatorship, you may ask? A conservatorship is the appointment of a guardian or a protector by a judge to manage the financial affairs and/or daily life of another person due to old age or physical or mental limitations. Watch this documentary to decide which of these is applicable to her. Incidentally, the guardian was her estranged father who was given control over every aspect of her life. You will be baffled at the audacity of the system that allowed this to happen.  Incidentally, today marks the day that she has been freed from conservatorship. Her loyal fans had stood by her and raised awareness through #FreeBritney movement.",
    "date": "2021-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "So hard to move on from this!",
    "date": "2021-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Nothing really new in another look at the Spears conservatorship, sorry but Hulu beat you to it Netflix.",
    "date": "2021-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Nothing new or interesting, hard pass.",
    "date": "2021-10-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Honestly, this wasn't worth the time. It struggles to fill the time and it's obviously late to the \"Britney documentary\"-party. It will always be remembered as the boring one that came after, bringing nothing new to the table. Definately skip this one unless you absolutely have to consume anything with Britney in it.",
    "date": "2021-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Somewhat informative if you don't know the story, but even for me growing up in the 90's and being a boy who has no interest in Britney other than her looks... i knew basically most of what this movie offers through word of mouth and the occasional tabloid cover. If anything hopefully this movie helps get her case resolved as other Netflix films have.",
    "date": "2021-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I think the whole conservatorship is an interesting story. Too bad these filmmakers have no idea how to tell a story. Many times just reading off of a paper? Come on. Interesting topic but terrible storytelling.",
    "date": "2021-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Tries to cover too much ground and ends up falling short in many areas. Attempting a comprehensive approach, the film focuses on too many dead-ends and leaves out some of the most important and interesting details. It owes a LOT to Britney's own recorded testimony but doesn't even completely cover that powerful statement. You're better off listening to the actual statement from Britney herself if you are genuinely concerned or interested.",
    "date": "2021-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Britney Vs. Spears - 8/10. Netflix joins the long array of production companies that have zeroed in on the #freebritney saga with their new documentary. The difference here is, sadly, the last half hour of the film blows all the other productions out the water. Its that last part of the documentary that reveals and exposes so much in accordance to helping give justice to Britney Spears. The rest of the doc we have seen countless times through the recent barrage of other documentaries focusing on her controversial conservatorship. The majority of the documentary recounts the lead up and the process of what has happened to her the past decade or so. For people unaware of the whole situation, it helps as a recap, but for those who are generally aware, it doesn't offer any other new info. The documentary really hits its stride when it interviews people that were actually in close contact with Britney. The accounts of how much a good person she was and how smart she was help bring to light that Britney was truly suffering during the whole ordeal. There are moments that are pretty upsetting to hear, especially the films final moments where you actually get to hear her leaked court audio session where she recounts what she has been going through. The documentary also does a fairly good job at showing how even through the trials and tribulations, she still was a force of nature in the music industry. Though not entirely new in content for the most part, this doc does a fairly good job of showing the pain that she suffered and how finally, she might really get the justice she deserves.",
    "date": "2021-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It feels incomplete and rushed and has no conclusion, but it's still even more information on the bonkers story of Britney Spears and her conservatorship.  The story is still unfolding and hopefully people stop using Spears for their own fame.  While a lot of the story has been told, the filmmakers were unable to unearth some new details, but they are sparse.  It's never uninteresting, but it's a part one of what needs more.  Final Score: 5/10",
    "date": "2021-09-28"
  }
]