[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love this movie so much and I always am recommending it to others! One of my favorite movies for sure",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Lighthearted fun film takes you back to the early 2000s.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The movie is charming and light. Perfect for unwinding after a long, tiring day. I watched it with my ex on our first date; I don’t think it was the best idea for a first date, but it really is a light, pleasant film and deserves a higher rating than that.",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is from back when Hollywood knew how to write a romcom. The critics call it predictable, but modern movies are unpredictable and unbelievable, and feature people chosen for their looks over their acting abilities. \n\nThis movie is adorable, the acting is good, the leads have chemistry, and if you want a fun romcom I’d definitely recommend it. \n\nAlso if you’re on the younger side, some of the tech might be kind of funny.",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "How to Lose a Guy in 10 Days delivers a predictable yet delightfully entertaining romantic comedy, based on a picture book but with original characters. With natural performances, witty moments, and a well-structured plot, the film balances absurd humor and emotional depth. Its easygoing tone makes it a perfect rewatchable choice for anyone craving feel-good fun.\n\nRead the full review here: (Indonesian version : alunauwie.com) and  (English version : uwiepuspita.com)",
    "date": "2025-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "La mejor película romántica que he visto",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Its a funny romantic movie, but i'm not gonna watch it again.",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Fun romcom that felt fresh and well-cast.  Kate Hudson is effervescent and Matthew McConaughey is, well, Matthew McConaughey! Worth rewatching",
    "date": "2025-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Delivers exactly what it promises.  \n  \nHow to Lose a Guy in 10 Days is exactly what I expected, no more, no less. It’s a light, predictable romantic comedy that delivers just what it promises: two charming leads, exaggerated situations, and a few genuinely funny moments. It doesn’t try to be deeper than it needs to be or reinvent the genre, but it really doesn’t have to. The film works well if what you’re looking for is something simple, enjoyable, and easy to watch. Both Kate Hudson and Matthew McConaughey are charismatic and carry the story without any unnecessary pretense. A movie for those who know what they want, a classic and uncomplicated rom-com.",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A very cheesy and corny romantic comedy with a twist of a bet.",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "How to Lose a Guy in 10 Days works because of its chatismatic leads.\n\nThe writing is very mixed. The story is predictable, but it has unique elements. Sometimes it's pure fun, sometimes it's a little too much. The dialogues are usually unnatural, but some of that comes with the genre. The character are so fun though. They're very similar people and it's really fun to watch them achieve their goals.\n\nTo be honest I did not look out for directing, cinematography and editing traits, but they are probably around average, since I didn't catch any choices I would consider amazing or horrific. The casting and the acting performances on the other hand. Now those were absolutely on point.\n\nHow to Lose a Guy in 10 Days is really great at what it's trying to be, but it's boring in the middle.",
    "date": "2025-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Its a fun non serious movie.",
    "date": "2025-06-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I wish that we lived in a world where films like this were still made. How to Lose a Guy in 10 Days in the quintessential early 2000's romcom. The chemisty between the two leads is excellent, and the film is infinitely quotable (love fern, princess sophia, etc.) and rewatchable.\n\nWhere this movie succeeds and others in the genre fail is in the likability of the two leads. Though Andie drives me nuts and Ben is selfish, you want them to both succeed and be happy (together).\n\nBest Character: Andie\nBest Quote: \"You can't lose something you never had.\" - Andie\nBest Scene: Getting to know the family (Also, the moment on the boardwalk when \"Somebody Like You\" starts playing and the two *truly* start falling in love is perfect.",
    "date": "2025-05-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Funny, charming, and full of great chemistry between these two leads, this is a fun film to watch.",
    "date": "2025-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Great performances from the actors.  Creative way of getting two people who are not interested in each other in a genuine way to becoming in Love with each other.",
    "date": "2025-04-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Filme muito bom. A trama é leve e engraçada. Os atores são lindos.",
    "date": "2025-04-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "An absolute classic & hands down my favorite movie ever! I’ve seen it more times than I can count, and it never gets old! The chemistry between Matthew McConaughey and Kate Hudson is electric—funny, flirty, and totally believable. Their banter, the iconic yellow dress scene, the “love fern”—every moment is gold. It’s the perfect blend of humor, romance, and charm. 100/10 recommend!",
    "date": "2025-04-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's a standard OO's from com. Of course it's predictable, it's a rom com. It doesn't fall into absurd comedy. Having more serious actors in the lead helps keep it realistic and keeps it grounded. Matthew and Kate work well together. The stand out scene for me is definitely the \"You're So Vain\" duet. Absolutely works for as a cute throwback date night movie. Understandable why it's considered a classic to some people.",
    "date": "2025-03-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Os personagens são muito autênticos e possuem uma ótima química e o roteiro fazendo com que eles se encontrem em objetivos distintos é incrível. Não vou dar nota máxima por que em alguns momentos a Andie irritando o Ben ficou um pouco massivo. Mas no geral, é um ótimo filme",
    "date": "2025-03-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This goes on my top ten Romcom list!!!!!!",
    "date": "2025-02-06"
  }
]