[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Felt like a paid piece to jump start Jessie’s career. Nothing of their support for Jessie’s innocence seems remotely believable",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Empty calorie conspiracy theory documentaries, like this one, can be entertaining when you don't care about the truth of the incident in question. Like if it's in a far away country, etc. But this is hard to watch as an American concerned with the country possibly just coming apart. We really don't need more lies about racially charged incidents. Smollett made up the story, that's about as clear as anything can be. It's not the end of the world, he didn't commit the crime of the century, but the 'reasonable doubt' this documentary tried to create with selective presentation and innuendo just doesn't exist.",
    "date": "2025-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I hesitated to watch this documentary because I thought I knew the story. Actor stages a confrontation with two men who are supposed to be white MAGA supporters in order to gain publicity for himself. That's not what this is. Instead, it is an investigation into the whole affair and raises questions about the narrative the world has been told.\n\nThe filmmakers do a good job of highlighting the inconsistency in the police narrative. There were two witnesses who claimed to have seen two white males and not the two brothers from Nigeria. There is missing surveillance footage. There is footage that appears to imply that police had made a deal with Ola and Abimbola Osundairo. One of the brothers was on probation and not allowed to be in possession of weapons. Yet, when police raided their apartment, they found numerous weapons. That fact alone makes both men susceptible to police persuasion. And there is Jussie Smollett himself continuing to claim his innocence.\n\nThe evidence that police pressured the brothers to lie about the whole ordeal is strong. Just watch the expression of one of the brothers when a detective says that no one has pressured them. Watch the reaction of the detectives when shown surveillance video of two men who are definitely not the brothers. I would be all in on Jussie's innocence but for two facts that are hard to explain away.",
    "date": "2025-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This kid may look like a Disney Channel kid/attention seeking star, but he’s never changed his story and the Chicago police have been found brokered a deal with the brothers. That’s the Illinois Supreme Court folks. This is a good documentary. It gave every single person a chance to air their side of the story. To me, Mr. Smollett comes off as consistent, focused and unwavering. And when was the last time anybody said those kind of things about the Chicago Police Department unless it was about covering their butts?",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "this guy is trying to say he is innocent. give me a break. guy should be in jail for staging a hate crime hoax",
    "date": "2025-09-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Terrible Documentary. Trying to make a guilty man look innocent. Definitely wasted an hour and a half of my life. Thanks Netflix.",
    "date": "2025-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The attempts to muddy the water about Smollett's culpability fail miserably and are abject speculative falsifications.",
    "date": "2025-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This story with the counter investigation from the woman from England and the other pro defendant was ridiculous! They wanted it to seem as it was the Chicago Police conspiring against Jussie Smollet! There is a sound proof of that. Not to mention I live in Chicago and there are zero MAGA Militia creeping around Chicago, and also no sane person goes outside during a polar vortex at 2 AM, not even gang bangers! The alternative the documentary tried to spin was so weak, it was a far reach & aggravating to anyone who knew all the presented facts and lives in Chicago. One thing that was not brought up was Michelle Obama’s  involvement with the Chicago State’s attorney Kim Foxx, supposedly Michelle Obama reached out to the corrupt State’s attorney on behalf of Mr Smollet and that was why the original case was dismissed. Instead they brought in an English case worker who has had zero information on the ever changing  Chicago Judicial system. Not to mention the crack down in Chicago’s Police Department for at least the last decade, they would have never pulled off a cover up like she proposed! Too far fetched. Like a lying teenager made up the last part of the documentary. This documentary was completely irresponsible in whatever it tried to accomplish, SMH! Awful, like reading the National Enquirer",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "what a wildly irresponsible documentary. glad to see it isn’t fooling many",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It’s entertaining, but it’s clear that the production lost its objectivity by trying to please, especially Jussie, in order to secure an interview, having done the same previously with the other characters. This undermines the impartial approach expected from a documentary of this kind.",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Wow, so I guess Jussie is a victum again at the hands of the Chicago Police. Give me a break. If he feels so strong about his innocence and being framed why doesnt he counter sue the city of Chicago and police for putting him in jail. That would clear things up. The evidence including eyewitnesses of \"a white guy\" were presented and court and the jury found him to be a liar and douche. Case closed in my opinon. I just wish they also brought up  the Michelle Obahma connection to all this and her being the call that convinced the Dist Att. to give him that deal.",
    "date": "2025-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "When I started watching it, I was in disbelief that they even tried to turn the narrative around window. The entire world knows the truth anyways it’s still on Netflix top 10 even though it’s got over 1,000,001 stars.",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "VERY COMPELLING! This documentary DEFINITELY provides motive for the corrupt Chicago PD to lie, information and evidence that was hidden from the media, key witnesses that were IGNORED, and why & how they coerced confessions from those African bros. A MUST WATCH!",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Not really sure why they’re trying to act like he’s innocent",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "What a sack of lies by this guy.  And now he is trying to make money off this story and try to have people believe he is innocent.  So ridiculous   He should be in jail !!!",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Definitely a MUST WATCH in my opinion! This documentary was a huge eye-opener compared to what mainstream media wanted us see and chose to put out. It peels back layers, challenges the narrative, and will definitely have your jaw on the floor more than once. At times, it leaves you questioning who’s really lying and who’s actually telling the truth. Whether you believed the headlines or not, this film forces you to take a deeper look and realize the story isn’t as one-sided as it was portrayed. I couldn’t believe the amount of evidence shown and I’m not even talking about against Jussie Smollett. (Hint hint).",
    "date": "2025-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I kinda believe Jussie Smollett now, and had no idea that there were 2 unbiased witnesses confirming his story.  In any case, this was an interesting documentary!",
    "date": "2025-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This man faked a hate crime and is now making money of his story? This is truly as discusting as Jussie Smollett himself",
    "date": "2025-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Don’t believe the bots in the reviews. This documentary allowed both sides—the cops and Smollett—to have a voice. The last 7 minutes of the documentary should tell you everything you need to know about the people who led this investigation…",
    "date": "2025-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This irresponsible documentary is part of the dumbing down of humanity. It's clearly crafted as junk-food tv, slop you consume just because it's available. But it is merely taking advantage of car wreck curiousity. In the end, it fails to ask critical questions, gives equal weight to wholly unplausible ideas, fails to present key evidence, etc. I get that this nonsense is all over Netflix, but I'm embarrassed for what it says about humanity.",
    "date": "2025-08-26"
  }
]