[
  {
    "user": "Will Bjarnar",
    "rating": null,
    "text": "Won’t feel particularly revelatory to anyone who has frequented the spy-centric cinematic well enough to have a familiarity with every trope from Bond to Bourne, but Burger’s staging is what allows Inheritance to succeed beyond the trappings.",
    "date": null
  },
  {
    "user": "Steven Prokopy",
    "rating": 3.0,
    "text": "Inheritance essentially rests on how engaging Dynevor is in the context of this very labyrinthian story",
    "date": null
  },
  {
    "user": "Christy Lemire",
    "rating": null,
    "text": "She never becomes Jason Bourne... She's figuring it out, and we're figuring it out right alongside her.",
    "date": null
  },
  {
    "user": "Emilie Black",
    "rating": null,
    "text": "Inheritance is a dynamic thriller with plenty action sequences, some unexpected twists and turns, and solid acting.",
    "date": null
  },
  {
    "user": "Matt Hambidge",
    "rating": null,
    "text": "With Dynevor, Ifans, and a few effective twists and surprises, Inheritance makes for a mildly entertaining espionage thriller.",
    "date": null
  },
  {
    "user": "Jackie K. Cooper",
    "rating": null,
    "text": "Better as a travelogue than as a movie.",
    "date": null
  },
  {
    "user": "Keith Garlington",
    "rating": null,
    "text": "Dodging restrictions and permits, there’s almost an anxiety in the filmmaking which feeds the tension in its story. Then there’s the sheer visual craftsmanship which impresses on many levels.",
    "date": null
  },
  {
    "user": "Mark Jackson",
    "rating": null,
    "text": "The solid performances, in particular Phoebe Dynevor's pout-y charisma, make “Inheritance” a modest yet entertaining espionage yarn.",
    "date": null
  },
  {
    "user": "Travis DeShong",
    "rating": null,
    "text": "Inheritance is too coherent and competent to be described as a truly bad movie, yet it’s far from the territory of a good one.",
    "date": null
  },
  {
    "user": "Dennis Schwartz",
    "rating": null,
    "text": "The gimmicky film was shot guerilla style entirely on an IPhone.",
    "date": null
  },
  {
    "user": "Joe Friar",
    "rating": null,
    "text": "The minimalist plot makes this a standard-issue spy thriller, but Phoebe Dynevor and Rhys Ifans are convincing and focused. I was fully engaged. A tense thrill ride with first-rate performances.",
    "date": null
  },
  {
    "user": "Manuel São Bento",
    "rating": null,
    "text": "Inheritance shines through its impromptu filming style and the strength of its lead performances. Neil Burger pushes the boundaries of traditional filmmaking, proving that creativity and technical skill can overcome any financial limitations.",
    "date": null
  },
  {
    "user": "Miyako Pleines",
    "rating": null,
    "text": "If you’re looking for a spy film with the right amount of thrill but without too much intellectual fanfare, then Inheritance might be for you.",
    "date": null
  },
  {
    "user": "Sarah Vincent",
    "rating": null,
    "text": "It is ultimately a shallow, anti-climactic affair that uses espionage to thinly disguise a predictable daughter confronting her disillusionment with her dad.",
    "date": null
  },
  {
    "user": "Katie Walsh",
    "rating": null,
    "text": "“Inheritance” is a throwback thriller that harkens to the retro days of the Y2K era. And while its style eclipses its substance, it’s the style that makes this cinematic curio worth watching.",
    "date": null
  },
  {
    "user": "James Verniere",
    "rating": null,
    "text": "Burger smartly exploits the freedom of shooting with an iPhone13 in streets, markets, planes and trains. He makes exotic countries his special effects, their people his extras. It's conceptually brilliant. Dynevor's Maya is a believable badass rebel.",
    "date": null
  },
  {
    "user": "DarkSkyLady",
    "rating": null,
    "text": "The scope of travel, Phoebe's performance, and the questions the movie presents keep Inheritance interesting even with the spatters of drag, but little stands out.",
    "date": null
  },
  {
    "user": "Connor Petrey",
    "rating": null,
    "text": "Inheritance moves at a breakneck pace, capturing a world of paranoia at literal face value.",
    "date": null
  },
  {
    "user": "Mark Meszoros",
    "rating": null,
    "text": "If only it were as interesting to watch Inheritance as it is to read about it.",
    "date": null
  },
  {
    "user": "Alissa Wilkinson",
    "rating": null,
    "text": "Not only does “Inheritance” fail to sell its aesthetic; it doesn’t sell its story, either.",
    "date": null
  }
]