[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The detectives in Tokyo  did a fantastic job solving thus case.  Great  documentary.",
    "date": "2024-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Was not the most engaging documentary, but I did like ending.",
    "date": "2024-05-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This true-crime film manages well to intrigue its audience and to give a fascinating insight into how crimes are solved.",
    "date": "2023-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Another murder mystery documentary drops onto Netflix with 'Missing: The Lucie Blackman Case'.\n\nSYNOPSIS: 'It follows the turbulent and complex investigation into the killing of British tourist Lucie Blackman.'\n\nThis is a heartbreaking case of the loss of a woman well before her time whose family suffered for over 18 months not knowing what had happened to their daughter. \n\nAs a whole the documentary plays from the start like a classic non-fiction whodunit.\n\nA combination of archive footage, reconstructions, and more recent interviews revisit the case and dig deep into what happened to Lucie.\n\nA fascinating watch.\n\n7/10",
    "date": "2023-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A solid Netflix documentary about a young woman who went missing in Japan. An interesting investigation with a conclusive ending.",
    "date": "2023-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It's a standard Netflix true crime documentary that sheds light in both sides of the investigation while doing right by it's all too unlucky victim.",
    "date": "2023-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very sad, tragic story about an English girl missing in Japan. The perseverance of Lucie's family is awe-inspiring. I hope they find peace. Worth watching although heart rending at times.",
    "date": "2023-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This case isn't widely seen in the true crime community, but it is definitely a interesting one. The culture clash between the British parents desperately trying to find their loved one and the Japanese authorities is intriguing to see, but they both are dedicated to their goal of finding Lucie and the person responsible for her disappearance and eventual death. Then the discovery of other victims of this monster is revealed by the investigation… The entire story is captivating and moving. I would definitely recommend watching it",
    "date": "2023-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "\"The Lucie Blackman Case\" is an interesting true crime story that I'm sure fans of this genre will appreciate. I don't really watch a lot of documentaries of this kind since they can be a bit bleak and sad but I think this one was well made for the most part. I do feel 80 minutes is a bit of a stretch and I felt the story gave off the feeling that might have been more engaging in a very high-quality and long YouTube video. At a point, the documentary becomes a bit repetitive and while I do feel really bad for the family, I do feel the pacing could have been tightened up and told in a more concise format.",
    "date": "2023-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A good true crime documentary that gets directly to the point and doesn't shy away from revealing the nitty-gritty details.",
    "date": "2023-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This is a very well done and compelling true crime documentary about the disappearance of a British foreign National in Japan who becomes the linchpin for the investigation into sexual deviance and sexual crime in Japan. The case unveiled a look at how The Japanese police treated sex crimes and crimes against foreigners. The show features archival footage, contemporary interviews, and documents associated with the case. Jake Adelstein, the subject of HOB's Tokyo Vice, is featured as a Western reporter with intimate knowledge of Japan and the Japanese police. The show is good. It is sad, but good. The show has a lot of cultural undertones, and it is tight as far as documentaries go.",
    "date": "2023-07-29"
  }
]