[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It’s probably my lest favorite despicable me movie but it’s alright, this movie brought a new legacy character Lucy and then introduced the AVL. I think the villain of this movie was kinda mid. This movie wasn’t like a big plot tho it was gru gets invited to the AVL and then they stop the villain, not the most original plot.",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a very big movie, with million of laughs and a creative story with the characters of despicable me. This is a big second movie to kids.",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "So far these are funny with the minions.  My daughter seems to like them.",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Siento que es casi imposible odiar la saga de “Despicable Me”. Sí, está lejos de la animación de otros estudios como Disney o Dreamworks, y también entiendo cómo muchos catalogan las películas de Illumination como “superficiales”, pero no podemos negar que ver estas películas es una experiencia divertidísima. Y esta “Despicable Me 2” está a la altura de su predecesora; sí, tal vez con más chistes y acción que en la primera parte, donde se centraba más en el desarrollo interno de los personajes, pero ya una vez establecidos en la historia, esta ya puede tomarse las libertades de ser una experiencia súper divertida, ¡y vaya que lo cumplen!\n\nUno de los riesgos más grandes en la animación es introducir nuevos personajes a una historia ya establecida, y más en apenas una segunda parte. Pero Lucy como nuevo personaje funciona muy bien: es la antítesis de Gru en casi todo, y la evolución de su relación funciona muy orgánicamente. No sientes este romance como invasivo en la historia. El villano, El Macho, aunque le falta contexto, visualmente es increíble, y aunque me parece que aceleran su desarrollo, funciona como fuerza opositora de la película. Al igual que el diseño de los Minions morados; en verdad, sí, se nota que todos estos conceptos están introducidos para ser comercializados hasta explotar, pero la película en rasgos generales es tan buena que no te importa el descarado \"Product Placement\".\n\nSiendo honestos, aunque este tipo de animación le da identidad a la saga, la verdad es muy simple, está lejos de las maravillas técnicas que hemos visto en otras cintas, incluso del mismo año en que esta fue estrenada. Al igual que la sobresaturación de los chistes que, aunque la mayoría funcionan, en esta entrega en particular sentí un pequeño temor de “aburrir” a los niños que vieran esta película. Pero aun así, me parece que, aunque más sutil que en la primera parte, esta retoma todos esos momentos más enternecedores que sirven para crear un vínculo del espectador con estos personajes, tanto Gru como las niñas y, sobre todo, los Minions. Estoy convencido de que antes de ser por sus chistes, todos los que los aman es por lo puro y bondadoso de su actuar, y eso es lo que hace especial a esta franquicia del resto.",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Everyone knows the first is the best one, but I think this one gets too much hate",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Good movie, I think it could've been a bit better in dealing with the villain but it was still iconic. The minions had a much bigger presence with seeing how their influence changed the world.",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Mai nella vita bello quanto il primo, ma si avvicina perché punta maggiormente sulle risate e sull'azione incredibile. Come il primo vantaggio un cattivo perfetto.",
    "date": "2025-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The story is terrific, it's really funny.",
    "date": "2025-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Uma sequência incrível, personagens bem desenvolvidos e uma história muito divertida. Mais uma Obra Prima!",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A good sequel, just not as good as the first movie",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Overall a pretty good sequel to despicable me",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Sequels are hard to make. Okay, let me change that. They're actually easy to make, but what I mean is that they're hard to make as good as the originals. Some sequels to good films do very badly (Megamind 2 is a prime example). However, Illumination sure did its homework, since I like Despicable Me 2 better than much more emotional sequels, like How to Train your Dragon 2. They just nailed it.\nMusic was great (Thank you Pharrell for 'Happy'; I enjoyed it), animation was as well; the characters were good as always; and I think that people really don't need to get offended by there being a Mexican villain, because that just made the film get to show Mexican culture a bit more; did it not?\nLucy Wilde and Silas Ramsbottom were good additions to the plotline, though Lucy Wilde was more crazy while Ramsbottom was more serious and grumpy. The kidnapping of Minions plot was also clever, I have to say. And so, all in all this was a very good sequel, and if they ever make a Despicable Me 5, I hope they get it up to this caliber, since the third and fourth films were just awful.",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Prolly haven't watched this since it came out. Not as great as the first one, but this is a very worthy follow up. The comedy tho is still peak.",
    "date": "2025-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Era muy entretenida y divertida y es para mí la 3º mejor película de Ilumination 94%🍅🧊",
    "date": "2025-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Despicable me 2 is a godsend of a movie! I'm sure its a surprise to you when I say I enjoyed this movie way more than despicable me 1 yeah I know come at me I'm not scared of you.",
    "date": "2025-06-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "excellent for illumination",
    "date": "2025-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "back 2 work",
    "date": "2025-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "LOL, 1 hour and 38 minutes of comedy!!!!!!!!!!!! Rated PG for Rude Humor, and Mild Action!!!!!!!!!!!!!!!! The worldwide gross is $970,766,005.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-05-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "El Macho, the guy, he's great",
    "date": "2025-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Honestly, this one is even better than the first one.  The villian was compelling and who can forget the guacamole sombrero!",
    "date": "2025-04-23"
  }
]