[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Starts out well. High production values and an intriguing plot. But in the last third it all falls apart. Could have helped with a lead actor who can actually act. Mark Wahlberg seems okay in frivolous B movies but as a one-dimensional actor it’s a mystery why you’d cast him in anything potentially serious or worthwhile.",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "J’ai vu un commentaire qui disait que le scénario ne faisait aucune sens car si Bathurst souhait arrêter la réincarnation, il pourrait juste se tirer une balle dans la tête avec son pistolet. J’avoue m’être posée la même question… L’action était cependant sympa sans plus.",
    "date": "2025-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The worst movie I've watched in a long time.",
    "date": "2025-09-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "They forgot to tell the story. Mark Wahlberg did his best to tie this story together but it was a mess. I watched it and went why, why, why? It was not cohesive, it did not tell a story, it was confusing. It only gets 3 stars from Mark Wahlberg or it would be a 2. A 2 is just above boredom and mildly entertaining.",
    "date": "2025-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Um potencial gigantesco mal aproveitado, com cenas absurdamente sem sentido que dariam inveja a qualquer Velozes e Furiosos. Sem suspense algum  o filme é uma linha reta doque você acha que vai acontecer e acontece. Não é um desperdício total, em uma tela quente de segunda feira se daria muito bem.",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Worthless piece of trash.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Let's waste the minimum amount of words on this. Yes, that.",
    "date": "2025-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Painfully bad movie. An interesting premise that could have been used and developed in many ways is wasted by not using it for anything at all, other than a wooden pretext for a lazy, dumb action movie.\n\nZero world building, horrible storytelling, horrible writing, horrible dialogue, horrible characters, mostly bad acting (prob not the actors’ fault really, with this material…). \nWhile the action scenes are decent, they are also pointless because no-one cares — everything else in this movie feels so amateurish you feel like watching a play written and acted by 12-year olds in a school theatre.\nThis movie fails at a lot of very standard stuff even B or C movies master with ease these days.\nSuch crap from Fuqua… inexplicable.",
    "date": "2025-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Entretenida, me agrada la mitologia de la reencarnación, funciona con sus escenas de acción, tal vez si se explora aún más la idea de origen sería más interesante.",
    "date": "2025-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Pretty standard Mark Wahlberg action movie. Entertaining but not amazing.",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The concept at the heart of this film is undeniably intriguing, drawing you in with its promise of a fresh take on reincarnation. However, as the story unfolds, glaring inconsistencies pile up, making the plot predictable, tedious, and at times, downright incoherent. While the action sequences and visually striking cinematography attempt to salvage the experience, they can't fully mask the script's shortcomings. If you're a fan of reincarnation-themed content and don't mind overlooking flaws for the sake of the genre, this might still be worth a watch. I've seen it three times since its release, but by this latest viewing, the cracks in the narrative were too obvious to ignore—almost as if the filmmakers leaned into them, hoping flashy visuals would distract us. Spoiler: they don't entirely succeed.",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "WTF did I watch? Not worth watching",
    "date": "2025-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Started of pretty well, I was hooked onto it but after a while it just ran out of steam the plot line became silly and not to mention the huge plot holes. The graphics and CGI were good and Mark Wahlberg did a decent job but this a brain rot movie thru and thru",
    "date": "2025-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "What started out as something interesting, just decended into some wierd sci fi attempt",
    "date": "2025-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It's  the temu version of the Matrix",
    "date": "2025-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Filme: \tINFINITO\t\t\tAssistido: 29/6/25\nElenco: @markwahlberg @cookie_soph @chiwetelejiofor @wallisday @johanneshaukur @kaealexanderthegreat @imdylanobrien\nModelo: #ficção #ação\nDuração: 1h 46m\tAno: 2021\nMinha opinião: Uma ficção, onde um número de pessoas denominada de Infinito, tem uma vida infinita, onde quando morre o corpo sua alma irá reencarnar em um novo corpo. Existe um grupo de Infinito que vive para melhorar a evolução humana e a outra que quer exterminar a todos Infinitos. Nesta guerra temos Heinrich (O’Brian) que escondeu o “Ovo” artefato que pode eliminar a todos Infinito. Heinrich morre e com ele onde ele escondeu o Ovo. Ele reencarna como Eva (Wahlberg), porem ele sempre foi tratado como esquizofrênico e tomando medicamentos que não permitiram ele lembrar de quem era. Porem ele é encontrado pela Nora (Cookson) que o salva de ser levado por Bathurst (Eijifor) o lider que quer o extermínio dos Infinitos. O filme tem bons efeitos e vemos que teve um bom investimentos. Mas o roteiro peca com cenas forçadas  e incoerentes. A aceitação de Eva de toda a estória de forma tranquila. Se o filme tivesse um melhor roteiro, com certeza teria alcançado um sucesso maior. E neste filme temos Wahlberg novamente pulando de um avião como em Uncharted. E ao final todos são libertados, as almas que estavam aprisionadas. E os Infinitos continuam.\nVale apena assistir? sim, mas poderia ser bem melhor.\nNota: 7",
    "date": "2025-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Not enough Dylan O'brien. Acting was trash. Dubbing was trash.",
    "date": "2025-03-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I don't understand why all the negative views on infinite, don't get me wrong, it doesn't bring anything new to the genre or have a story building foundation, but by heck it's entertaining, I have it saved on my virgin media box and have watched it at least a dozen times, Wahlberg falls into these sorts of movies 4 brothers is another film that you only watch to be entertained",
    "date": "2025-01-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "it had potential, it just never made it.",
    "date": "2024-12-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "There is a lot going on here that is reminiscent of a lot of other fantasy action/adventure movies and it is fairly well balanced with action that is  explosive and well choreographed but... not another quest for a magical egg.",
    "date": "2024-12-15"
  }
]