[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Thanksgiving movie! I remember wondering when this came out why it didn't get a ton of attention. Now that I'm rewatching it a decade plus later, I understand why. The heist is underwhelming, the whole story feels one-note and the supporting cast is somewhat forgettable.\n\nAll of that aside, I actually really enjoyed this movie. I'll watch anything starring Ben Stiller, Eddie Murphy provided a few good laughs and I find myself quoting Matthew Broderick's Mr. Fitzhugh more often than I realized. There are some good third-act payoffs as well. \n\nNot great, not bad, but still an enjoyable \"holiday\" flick. \n\nBest Character: Mr. Fitzhugh\nBest Quote: \" I'm very sorry, Mr. Shaw, but we don't accept tips at the tower.\" -  Dev'Reaux\nBest Scene: Prepping for the Heist\nBest Piece of Score: \"Theme from Tower Heist\"",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Ages 13 and older!!!!!!!!!!!!!!!!!! The worldwide gross is $152,930,623.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Tower Heist is a feel good  light hearted  movie with some serious moments like Master's attempted suicide  in the subway . \nThe movie is entertaining with a good quality cast , even though  the story line is not original , but has its twist in the end although there is no true romance in it , it's fantastic  entertainment .",
    "date": "2025-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I literally logged in for the first time just to write a review and raise the audience score of this movie. \n\nAudiences are silly. This is a *great* popcorn heist movie with an airtight script. From Stiller as the building manager/heist coordinator to Murphy as the criminal subject matter expert to Leoni as the lead investigator to Alda as the smarmy villain, and every bit part in between, everyone nails their respective characters. \n\nIts audience score is more criminal than the finance bro villain of the movie itself. God, it'd make for a great sequel.",
    "date": "2025-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Exciting, funny and great for the family!",
    "date": "2025-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I really liked the movie. Very funny and a nice plot...",
    "date": "2025-05-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Exciting, funny, and heartfelt",
    "date": "2025-02-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Ben Stiller and Brett Ratner are garbage people making garbage movies",
    "date": "2025-01-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Tower Heist cuenta con cientos de huecos argumentales y guionazos para que la historia avance, pero logra ser emocionante, una historia de reminiscencia con toques de comedia igual de bien implementados cómo su acción, y para mi es lo que la vuelve especial, el compaginar ese toque más de thriller con tintes de comedia para volver accesible esta historia a todo el público. A estas alturas creo que todos somos conscientes del cine de Ben Stiller y Eddie Murphy; y creo que, si entramos en la convención de su propio subgénero que ellos mismos han creado, esta historia cumple a creces, pero si hay expectativas de un buen thriller con tintes noventeros esta historia es todo lo contrario, lo cual no es malo. Yo creo que el mismo público y la crítica han desvalorizado el género de la comedia cómo tal, y para mí sería una pena el subestimar el talento de Ben Stiller y Eddie Murphy en esta industria, ellos demostraron que sin importar el género, una historia entrañable siempre precederá. Esta historia está lejos de ser perfecta, pero la misma logra hacer que pases un buen momento.",
    "date": "2024-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I have seen this movie about 5 times and I never have been bored,,,top shelf movie!",
    "date": "2024-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I just didn’t find it to be that good. Kind of boring.",
    "date": "2024-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Maybe not the funniest, but certainly the coolest heist comedy.  Love the Robin Hood theme!  Great cast.",
    "date": "2024-04-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Fun cast.  Mildly entertaining.  Lacks edge and fresh humor.",
    "date": "2024-04-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A rather bland comedy. No one here, from the writers to the actors, have extended themselves, and as a result we're left with a movie you won't be rushing back to for a second viewing.",
    "date": "2024-02-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "one of the worst movies ive ever watched tbh",
    "date": "2024-02-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I personally love this movie. It's a great cast Ben Stiller, Eddy Murphy, Matthew Broderick, Michael Pena, and Casey Affleck. Hmmm, so why do I love this movie? 1. it was filmed on location, so many movies today are filmed in a giant green screen, or way too much CGI. This movie gives a pretty good sense of how New York Feels or should I say \"used to feel\". Pre Covid… NY ain't it nowadays. 2. Where else can you see this all star cast together? 3. It's a fun movie, many of the critics on here gave this movie a low score because the \"script\" wasn't up to par but this is a Family Movie, I wasn't expecting a complex psychological heist. Overall this is a fun great movie. Lastly I am a very difficult person to please so my stamp of approval on this movie means a lot. So you ever want to see Ben Stiller running around in a comedic hyjinx movie. Check this out.",
    "date": "2024-01-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "W movie just too good an OG movie the best one ive ever seen",
    "date": "2023-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A good comedy with an unexpected ending.",
    "date": "2023-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Tower Heist is a hilarious story that takes life in an equally funny cast. It's a payback heist film is simple and delightfully so.",
    "date": "2023-08-28"
  }
]