[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Colin is a joke of a gambler up to his eyeballs in debts. The multinational backdrop is cool - but this ballad meanders to an ending you could see coming.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The story is as old as humanity, the att is in the telling.  Farell is made for roles like this, he has lived experience and his own hungry  ghosts\n\nI liked it  though it was uncomfortable in places ... \nIYKYK",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Since there are a lot of negative reviews I am compelled to say I thought it was outstanding.  Farrell’ s descent is so uncomfortable, he is brilliant.  The cinematography is brilliant.  This is a triumph of digital film making when there is so much visual guff about.  The staging is brilliant and was no doubt very challenging for the bigger scenes but every shot looks really thought out and there is effort to give the viewer something extra.  Very artistic.  There is some really good dialogue but it’s also very sparse.   A lot of people say they thought they guessed the twist, I’m not sure about that, there were at least three plausible ways it could have gone given the clues.  This film requires a bit of work from the viewer.  I needed to watch it in 2 parts to really enjoy it.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Undoubtedly the worst film I've seen this year, a total hot mess in motion picture form. Somehow aiming for something deep and philosophical but being actually entirely empty and banal.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Simply amazing. The colors, cinematography, and of course, the plot were all top tier. This film is a creative masterpiece, both visually and story telling wise, and the performance from Farell was astonishing. I dove into this movie expecting a straight forward tale of an addiction gambler, but what I got was something far more valuable - the story of a man gripped by greed, delusion and grandiosity - and his path at redemption. The plot twist was solid, and if you take into account the hints that are subtly given throughout the film you realize that the truth of his journey is not explicitly stated, a real movie that makes you think! The only thing I noticed was the pace of the film was very sparatic, at some points resembling an action-packed movie while at others feeling like more of a slow, introspective film. I can understand why some people may not love it, but if you do, it is incredible.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a well crafted, well casted message movie. It's about greed, excess, fantasizing about being \"better than\" (a Lord), all causing the ruination of 2 poor lost souls.  Colin Farell's acting knocks it out of the park. His gambling addiction. His alcohol addiction. His thievery. His fantasy of being a Lord. His medical problem. And when he has it all, he discovers all the excesses are what's making him this lonely lost soul. So he throws it all away in exchange for redemption and maybe happiness.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Ballad Of A Small Player is an ambitious and inventive film, but one I feel fails to convince. Due I believe to a weak and patchy script. It's directed by Edward Berger, but I don't think it lives up to his two previous films. The film is set in Macau and is concerned with 'Lord Doyle', a degenerate gambler and swindler who is wanted for fraud and set on a path of destruction. We see Doyle once gain having a losing night at the baccarat tables. He is approached by Dao Ming, a credit broker, who seeks his patronage. Doyle and Ming are lost souls with lots of baggage and they form a rather odd bond. Doyle is also pursued by Cynthia Blithe, who is employed by Doyle's UK creditors. There is not much more plot after this. The film is more about style than substance. But it does look great. The colours and lights of Macau are shown off with great effect. But the storyline is rather muddled and unconvincing. Colin Farrell is great though as the troubled gambler and Tild Swinton is great as Blithe. A worthwhile watch in parts, but a slightly disappoiniting film in total.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "So Underrated, Collin performance was incredible, \nAnd i don't know why viewers talks about Penn in OBAA and saying Oscar and so, \nThe performance was so normal, \nCollin was better",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "(CASTELLANO) Hay películas que giran en torno a la perdición y otras que la observan con una mezcla de fascinación y tristeza. Maldita suerte pertenece a las dos. Edward Berger nos lleva a una Macao hipnótica, de luces de neón y ruletas girando sin descanso, donde Colin Farrell interpreta a un jugador que intenta escapar de sí mismo. Está magnífico: agotado, irónico y con esa melancolía que solo los que han perdido demasiado saben mostrar.\n\nLa película tiene el ritmo de una resaca elegante. No busca la épica, sino el temblor interior del que lo ha apostado todo y aún así sigue tirando los dados. Berger filma con un pulso seguro, aunque a veces se deje llevar más por la forma que por el fondo. Pero incluso en sus excesos, hay algo hipnótico, casi poético, en la forma en que retrata la adicción como una especie de limbo entre la vida y la desaparición.\n\nTilda Swinton, en el papel de una detective con más intuición que paciencia, aporta un contrapunto perfecto: sobria, contenida, incisiva. Su presencia ancla la historia, la humaniza, y evita que el delirio visual se vuelva vacío. Fala Chen, por su parte, añade un toque enigmático y etéreo que le da un aire casi onírico al relato.\n\nNo todo funciona —algunos tramos se sienten irregulares o demasiado calculados—, pero el resultado es una película que se queda contigo más por su atmósfera que por su argumento. Es un viaje entre el lujo decadente y la ruina emocional, donde cada mirada dice más que las palabras.\n\nMaldita suerte es una historia sobre perder, pero también sobre seguir jugando. Porque a veces, lo más humano no es ganar… sino volver a apostar.\n\n(ENGLISH) Some films revolve around ruin, while others watch it unfold with a mix of fascination and sorrow. Ballad of a Small Player —released in Spain as Maldita suerte— belongs to both. Edward Berger takes us to a hypnotic Macao of neon lights and endless roulette spins, where Colin Farrell plays a gambler trying to escape himself. He’s superb: weary, ironic, and carrying the kind of melancholy only those who’ve lost too much can understand.\n\nThe film moves with the rhythm of an elegant hangover. It’s not about grand gestures, but about the quiet tremor of someone who’s risked it all and keeps playing anyway. Berger directs with confidence, though at times he leans more toward style than substance. Even so, there’s something hypnotic—almost poetic—in the way he frames addiction as a limbo between life and disappearance.\n\nTilda Swinton, as a sharp, unflappable detective, brings the necessary balance: calm, grounded, incisive. Her presence anchors the story and prevents the visual fever from collapsing under its own weight. Fala Chen adds a mysterious, dreamlike quality that makes the film’s tone even more ethereal.\n\nNot everything works—some stretches feel uneven or too deliberate—but the result lingers thanks to its atmosphere. It’s a journey through decadence and emotional ruin, where glances often say more than words.\n\nBallad of a Small Player is a story about losing, but also about the stubbornness to keep playing. Because sometimes, being human isn’t about winning—it’s about daring to bet again.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Empty movie without story line. Gambler keeps losing, we all know what it is, very boring, The director was too lazy to even create a story. Wasted all the good actors. The plot twist only came in the final 10minutes. It was all the great actors pulling it together, Colin was extraordinary.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I went in expecting absolutely nothing because I did not know anything about it and I did not read anything about it. I will say that it was produced and directed well, however those who do not understand 1) the symbolism in the story and 2) Asian culture, may have a difficult time following. Colin Ferrell was a great cast for the this role as he just looks like a pathetic gambler. Tilda Swinson was okay, her role was minor.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "\"Ballad of a Small Player\" does have a few qualities that I genuinely liked. I think the colors and visual aesthetic of the movie are consistently good, and I also think Colin Farrell is great in this. I think the issue with the movie is that the story just didn't feel engaging for me. I tried to get into the chaos it presented, but it felt less and less interesting as it went on. It is a shame because the movie looks visually great and features such strong acting, yet feels like it isn't enough. Overall, this is a disappointing follow-up for director Edward Berger and not close to the level of his other recent film outings.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Beautifully crafted. Superbly cast.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie. Dont expect action and mystery packed story. This is one deeply personal psyhcological drama of a flawed man in a flawed world.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Ballad of a Small Player is one of the most beautiful and cinematic pieces of late. The shots/sounds with the intention of aligning and supports the story is worth a repeat watch. The concept of the festival may be foreign to western audiences but it was played out perfectly. With the actions perfectly aligned with someone that understood what salvation of the character looks like and would do. Colin act the heck out of the character once again! Even with a story and props that seemed daunting to take on, he brought in the grounded and realness to take the viewer on a wild ride.",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "2/5 STARS - Ballad of a Small Player isn’t the psychological thriller it’s being sold as — it’s a beautifully crafted but deeply frustrating character drama. Colin Farrell gives a fantastic performance, and the cinematography is excellent, but I never clicked with the story or this self-destructive protagonist. By the time he finally seems to turn a corner, he makes new choices that left me shaking my head. Some people may appreciate the adaptation, but as a Goodreads user who reviewed the book says, \"There is a niche audience for this… and it doesn’t include me.\" Video review: https://youtu.be/RixbjhW_100",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Not so sure what to say, surely captivating and incredibly acted. Huge logical gaps in the story. Worth to watch it though.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Weirdo and confused but it's works!",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "One of the more beautifully filmed movies in recent memory. The cinematography is breathtaking. And Colin Farrell proves again he is one of the finest living actors on the planet.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The Hong Kong scenery is a treat.",
    "date": "2025-11-17"
  }
]