[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Just absolute hot garbage. Forgettable songs, annoying MC, terrible plot, terrible villain, just hot garbage.",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is a really bad movie!\nI hate this film from its terrible character designs, non-sensical villain reveal and story that doesn't make sense.\nThis deserves to be thrown into a garbage can.",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A shimmering tale of underwater adolescence, of tides and currents that speak to the restless heart of youth, and yet, beneath all its animated spectacle, a void yawns wide. Ruby Gillman, Teenage Kraken, drifts through the waves with innocence unbroken, its narrative safe as seafoam upon the shore. But for all the swirling oceans, the luminous depths, and the myth of transformation, there lingers an absence that gnaws like silence in a storm: no intimacy, no flame, no scene that dares to acknowledge the raw pulse of desire.\n\nWhat emerges instead is a film cautious and tame, a dream washed clean of passion’s salt. It is a kraken with no thunder, a wave that never crashes, a love story forever held at arm’s length. And so, though the sea was wide, though the colors sang, I left the theater unsatisfied, marooned upon a shore of longing, whispering to the tide: what is a tale of growing up if it never dares to breach the horizon of becoming?\n\nOne star—for the ocean glimmers, but the soul remained untouched.\n\n\nP.S No sex scene.",
    "date": "2025-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Filme mediano e genérico, decepcionou bastante",
    "date": "2025-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Luca but worse.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Ruby Gillman Teenage Kraken Filled with A lot Of Charm Wit And Humor And A Good Story, Great Characters And Great Animation And Great Voice Acting That All Audience's Can Injoy And Appreciate And I Give This Film A 10 Out Of 10",
    "date": "2025-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Not bad. The ending was meh. The mermaid kind of took over the show.",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie is (in my opinion) good, maybe some people hated the movie for some reason, but for me, this movie is okay! 👌",
    "date": "2025-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 31 minutes!!!!!!!!!!!!!!!!!!!!! Rated PG for Some Action, Rude Humor and Thematic Elements!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $15,700,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I think there should be a second movie and I think this movie is so interesting because of the giant Kraken and the whole family thing",
    "date": "2025-05-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is the best movie I want to watch over and over again I love Ruby Gillman😍💕",
    "date": "2025-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Hello I like and love Ruby Gillman Teenage Kraken , is good movie and the charaters fantastics, Ruby Gillman is very cute and interesting the story of wars among the Krakens and Mermaids, i love villain Nerissa , she is wonderful and more famous , the Family Gillman is goods , mainly Uncle Brill is the character very funny and a good uncle for Ruby Gillman,  I like the movie my peoples and deserves sequel DreamWorks Animation please, \nRuby Gillman Fans really want th sequel of the movie , we need more Ruby Gillman please , listen the fans .\n\nResum.\nRuby Gillman Teenage Kraken is good movie and bad movie, the film will be 2 years in June, Congralutions for Ruby Gillman Teenage Kraken",
    "date": "2025-03-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Horrible movie Horrible storyline so bad 👎",
    "date": "2025-03-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Lesbian couple in a kids movie is disgusting. Id rather no romance than forced romance. These are children, this isn't strictly for adults",
    "date": "2025-03-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is my favorite one.\nI've seen this movie for entire month since 2023 when it came out. And I like how ruby is amazing 👏 \n\n5 stars for her",
    "date": "2025-03-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Absolute fever dream why did I even waste my time reviewing it...",
    "date": "2025-02-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Not as bad as I thought . The only problem is, that some characters fall short and don’t get enough screen time. So I can’t really care about them.",
    "date": "2025-01-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I really do appreciate the effort, but it´s just mid.",
    "date": "2025-01-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Similar to trolls, This is more of a child movie, there really nothing funny or any good action scenes in it, Very average",
    "date": "2025-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I LIKED THE MOVIE RUBY GILLMAN TEENAGE KRAKEN⭐⭐😃😃😁😁",
    "date": "2024-12-31"
  }
]