[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It repeats the first movie, but loses the novelty and deeper questions of power under restraint. It devolved into a typical action movie turns comedy. Violence for the sake of violence. Etc",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "You get what you expect.  .nothing wrong with that!\nLots of fun",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It’s Really Good Me And My Dad really enjoyed it and it’s kind of similar to John wick but all the bloody action violence it is more similar to Die Hard",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Action fun! Go along for the rides and stay for the free hot dogs 🌭.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "One word lame. Go watch the first movie only redeemable thing in this movie is Christopher Lloyd. Go figure cause it's on peacock.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Terrible writing throughout. He beats up about 500 dudes with no effort, only to get beat up by 2 chicks at the end, just to have a girl boss moment... \nThen those 2 chicks get taken out in the lamest and easiest way ever, just to have it make even less sense.\nVillain also tried way too hard, and failed at it. She wasn't as cool or intimidating as the movie thought she was. Just weird. And her actions would've got her whole operation shut down in no time, since she's not very smart, and kills everyone and everything.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The film was what could be best expected as a sequel. \nCasting the same actor-different character as an antagonist in both nobody one and two is a lowball move. Losing what genuine leverage the movie had. Poor choice",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "No where near as good as the first. A bit hokey at times, but okay overall.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I personally enjoyed the first film better. This one does many things alright. But, it doesn't do anything to move this character forward. And utilizes many tropes from the first film, sometimes effectively, and other times, not so much. In the end, it just feels like a recycled version of the original film.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Nice pastime. Nothing more, nothing less. Some laughs even.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Fun movie. Just mind numbing action and violence. Love the family aspect of part 2.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Definitely a good movie if near non stop action is your style, for me it worked, I recommend it if you like movies with basically constant action (it's not action from start to finish but it is close), and are ok with a shorter more narrow storyline, aside from that the acting is good, and consistent across the cast, and it feels well written for the narrow storyline.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Absolutely Nobody would like this terrible movie",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely loved this movie! I enjoyed Nobody 1, but this sequel impressed me even more. Huge kudos to the director and cast! 👏🏽",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Nobody 2 (2025) I found this sequel quite weak and far inferior to the first film from 2021. The action scenes are very weak, and the villains in this sequel are quite mediocre and generic. I wish I had liked it more, unfortunately it's a very poorly developed film.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This is very strange: I thought the first film was daft but rather fun, at least enough to keep me entertained on my indoor bike.  This sequel received half-decent reviews, so I duly paid out my £5 rental fee for couple of days worth of exercise material.  What a mistake: yet another ludicrous action flick that gets the tone entirely wrong, such that the violence is deeply unpleasant but lacking any visceral excitement, and the comic aspect simply makes the whole thing tension-free.  And the action scenes simply don’t make any sense whatsoever.  Several critics I think are usually pretty okay are now on my NEVER TRUST list, and yes, I am talking about you Mark Kermode!",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "If you watched the original entry of this franchise in 2021 and enjoyed seeing the usually comedic and quick-witted Bob Odenkirk turn into an unconventional action star, chances are you’ll enjoy this follow-up.\n\nThe plot doesn’t stray too far from the original concept featured in the first installment. The location and characters may have changed, but writer Derek Kolstad, this time teaming with Aaron Rabin, doesn’t muddle up a formula that worked the first time.\n\nThe story, while somewhat fresh in the initial outing, is secondary to the action sequences pitting Odenkirk in a role you’re still not really used to seeing him play.\n\nSharon Stone is a nice addition in a villainous role, alongside Colin Hanks as a corrupt sheriff. It’s always a pleasure to see 87-year-old Christopher Lloyd on screen, and, although his role is brief, The RZA continues to show just how well-rounded he is as an actor, composer, and rapper.\n\nThis movie doesn’t break new ground, but I’m ok with that. It’s a fun watch for when you just want to be entertained for 90 minutes.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Very fun and very entertaining",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Fun Action Movie. Just the right amount of time too.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Would have been 5 stars minus Sharon Stone’s horrible acting as a villain. Glen Close would have been a better choice.",
    "date": "2025-11-25"
  }
]