[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Absolutely terrible. This book is the worst book to film adaptation I have seen. Its so loosely based on the book its only by a thread. It makes it almost impossible to follow. Everything about Agent Cross is different. The kidnappings are completely different story. The victims are different. Some victims (murder ed and kidnapped) are missing from story line. The kidnappers background and motive are missing. The kidnapper was also in prison for a lot of book and Alex Cross was interviewing him as a psychologist kind of like Silence of the Lambs. The secret service woman Jezzie her role in the book is completely different. Her relationship to Cross is also different. Both key plot lines. I could go on. It isn't the same story at all.",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It’s a fun movie, not amazingly written but a 7/10.",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Along Game a Spider (let's shorten this to AGS) is a thriller about the kidnapping of the daughter of a low-profile Senator and how the forensic psychologist Alex Cross solves the case—based on the homonymous James Patterson's novel. Simple and effective for the most part.\nIf you are just a movie fanatic, you might notice this Cross dude is super similar to the Cross on the movie Kiss the Girls (1997) and you wouldn't be wrong: they are the same character based on Dr. Alex Cross from Patterson's novel series. However, the order is reversed in the cinema: Alonge Came a Spider released later in movies; in the book series, AGS comes first.\nAnyhow, considering the movie alone, Dr. Alex Cross is thrown into an investigation over the kidnapping of Megan Rose when the kidnapper calls Cross with some cryptic BS. Pairing with Jazzie Flannigan, the Secret Service's agent tasked with protecting Megan, Cross and her needs to unravel a eerie case that defies the usual kidnapping schematics.\nAGS is 24 years now and you feel its age. It has that early 2000's vibe and pacing, and cinematography. Nostalgia should surround you, but also a feeling of cliché.\nNothing to do with Morgan Freeman, though. He is God.\nOverall, AGS works as intended, but expect no masterpiece. It is a simple movie that provides a simple experience and it works for the most part.",
    "date": "2025-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "(CASTELLANO) Morgan Freeman regresa como el detective Alex Cross, un papel que ya había hecho en Kiss the Girls. Con él la película gana presencia: basta con verle actuar para que la atención no decaiga, incluso cuando la trama se pone más rutinaria.\n\nLa trama gira en torno a un secuestro con tintes retorcidos, un escenario perfecto para el suspense, pero que nunca termina de explotar todas sus posibilidades. Hay giros, tensión y cierta atmósfera inquietante, aunque también se perciben huecos en el guion que restan credibilidad a la historia.\n\nEn comparación con otros thrillers de la época, como El coleccionista de huesos, la película se queda un peldaño por debajo. La dirección es correcta, sin demasiada personalidad, y el villano no consigue ser tan memorable como la premisa requería. Monica Potter acompaña con dignidad, aunque carece del carisma que en su día aportó Ashley Judd en la anterior entrega.\n\nPese a sus limitaciones, la película se deja ver con facilidad. Su ritmo ágil y la capacidad de Freeman para elevar cualquier escena hacen que resulte entretenida, aunque el poso que deja sea más bien ligero.\n\nEn definitiva, un thriller correcto y funcional, que entretiene mientras dura pero que difícilmente se recordará con el paso del tiempo. Freeman sostiene la tela, aunque la araña no llegue a atrapar del todo.\n\n(ENGLISH) Morgan Freeman returns as detective Alex Cross, a role he had already played in Kiss the Girls. His presence alone gives the film weight: just watching him act keeps your attention, even when the story slips into routine.\n\nThe plot revolves around a twisted kidnapping, a perfect setup for suspense that never fully delivers on its potential. There are twists, tension, and a certain eerie atmosphere, but also gaps in the script that undermine credibility.\n\nCompared to other thrillers of the era, such as The Bone Collector, this one falls a step below. The direction is competent but lacks personality, and the villain isn’t as memorable as the premise required. Monica Potter is fine, though she lacks the spark Ashley Judd brought to the previous installment.\n\nDespite its flaws, the film is easy to watch. Its fast pace and Freeman’s ability to elevate every scene make it entertaining, even if it doesn’t leave much of a lasting impression.\n\nIn the end, it’s a decent and functional thriller that works while it lasts but is unlikely to be remembered over time. Freeman holds the web together, even if the spider never fully traps its prey.",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Alex Cross is a great character and the stories are solid. This film didn't live up to the original - but was still entertaining. Potter is a great character to be a traitor.",
    "date": "2025-06-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Took a good book and made a krap film. Good cast, but my goodness they butchered some good material...",
    "date": "2025-05-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I think Kiss the Girls was better. This wasn't really a bad film but it felt like it did some things worse than that film. The preceding film did have a good-enough prologue establishing Alex Cross to the audience whilst this stand-alone sequel's cold open had a prologue that I think would've worked better if they were flashbacks, due to how disconnected it feels from the rest of the movie. Also, it had, even for 2001, a very obvious CGI car crash with the unnaturally fast-moving animation being a dead giveaway. Foreshadowing for this director's work on James Bond's first 21st-century cinematic adventure, perhaps? And the climax is similar to the first film where an apparent ally was evil all along. But Along Came a Spider is otherwise still a decent crime thriller with yet another terrific performance from Morgan Freeman, - shame he never did a third film - some genuinely good moments of suspense and good old-fashioned detective work and Michael Wincott making for a sinister, and memorable, villain. One of his first scenes where he's wearing a Mission Impossible-style mask was a bit far-fetched though. Especially since nothing outlandish ever shows up again. Also, give this film credit where it's due. The abducted girl at least tries her best to escape rather than being a generic little damsel in distress waiting for Alex Cross to come rescue her and even figuring out near the end that somebody's not being completely honest about their intentions. Overall, while I wouldn't call these great films, - to the point that their lack of any real pop culture impact put the kibosh on any chance of James Patterson novels getting wide, mainstream film adaptations, with only mini-majors and VOD companies being willing to greenlight movies based off of his work - these are passable crime thrillers, even if there are far superior options out there. And knowing how infamous the reputation of the Tyler Perry reboot is, I'm sure it makes this duology's merits stick out more.",
    "date": "2024-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I loved this when I was younger. It is a good story, containing a number of twists, though the casting choices aren't the strongest - aside from MF of course, and this lets it down as it leaves things a bit woody in places",
    "date": "2024-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "With so many plot twists left and right, I would assume that everybody would be pretty tired after what happened. Well, not for me! ALONG CAME A SPIDER kept me on the edge of my seat throughout the entire movie. I literally think that Morgan Freeman should really play Alex Cross again when he gets a chance.",
    "date": "2024-01-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "really good movie i like this one",
    "date": "2023-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Shallow plot, didn't make me feel anything whatsoever. 1 star because the actress was stunning.",
    "date": "2023-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "One thing I didn't know about this movie is that it's a sequel to Kiss the Girls. Why? Because Morgan Freeman plays a character named Alex Cross and then he has a partner, so I haven't seen Kiss the Girls but I will do sooner or later. Most of the viewers say that Along Came a Spider is not as good as the book and as many people would say, the book is WAY better than the film so I haven't read the book so I guess that this'll be better than the film if I read it. The story resembles around Alex Cross who is willing to rescue the school girl called Megan who is kidnapped by a brilliant psychopath, Gary Soneji played by Michael Wincott, who disguised himself as a teacher. OK, so what can I say about it? Well, honestly, I don't know. I mean it has some twists and turns that interests me and Michael Wincott is good as the villain. I guess I know what to expect, especially the ending. I wonder if I notice that this movie is not faithful to the book if it doesn't then the book would be better, so that's all I've got. But for what it is, this is not too bad. I don't think I can watch it again or maybe I can because I like the thrills and it left me on the edge of my seat so yeah, that's Along Came a Spider.",
    "date": "2023-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Minha opinião: Na década do final dos anos 90 e nos anos 2000, tiveram vários filmes do gênero com vários atores, Denzel, Angelina, Robert, Douglas, Brad Pit,.....  Um psicopata Gary, sequestrada afilha de um senador. E chamado Cross e tem como parceira deste caso Flannigan. E trama vai te levando por uma teia de aranha, onde o vilão sempre esta um passo a frente, porém ele esta enfrentando ninguém mais que Morgan Freeman. É claro que ele irá cometer um erro. E este erro pode custar sua vida. Mas a grande surpresa quem guarda é para o final. Pois pode surgir novos vilões. Quem será? Uma trama bem construída, porém não é um filme como \"Seven\". Morgan sendo Morgan. Uma boa atuação dos atores. Trás um pouco de suspense, mas deixa a grande surpresa para o final, ao estilo de \"Pânico\".\nRoteiro e enredo boa, as atuações ajudam bastante no filme.\nVale apena assistir? 7",
    "date": "2023-05-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "From its ludicrous opening and laughable CG, to its cheap-looking makeup & hair and needlessly convoluted plot, even the reliable Freeman can’t save this script that has more dangling threads than a shut down sweatshop. #nitrosMovieChallenge",
    "date": "2022-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A worthy sequel to Kiss the Girls that is both similar and different. This movie is more action packed and has less than a predictable ending, but I still enjoyed this movie even though I wished it had more suspense.",
    "date": "2021-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Enjoy it better than the Holmes series for me. Wow didn't see that twist coming for sure",
    "date": "2021-05-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "After Washington, D.C., detective forensic psychologist and author Alex Cross (Morgan Freeman) loses control of a sting operation, resulting in the death of his partner, he retires from the force. He is drawn back to police work when Megan Rose (Mika Boorem), the daughter of a United States senator, is kidnapped from her exclusive private school by Gary Soneji (Michael Wincott), a computer science teacher. US Secret Service Special Agent Jezzie Flannigan (Monica Potter), held responsible for the breach in security, joins forces with Cross to find the missing girl. Soneji contacts Cross by phone and alerts him to the fact one of Megan's sneakers is in the detective's mailbox, proving that Soneji is the kidnapper. Cross deduces that the man is obsessed with the 1932 Charles A. Lindbergh Jr. kidnapping and hopes to become as infamous as Bruno Hauptmann by committing a new \"Crime of the Century\", which might be explored by Cross in one of his true crime books. Megan's kidnapping proves to be only part of Soneji's real plan: to kidnap Dimitri Starodubov (Anton Yelchin), the son of the Russian president, and guarantee greater infamy for himself...\n\nRotten Tomatoes critics consensus was \"Derivative and contains too many implausible situations.\" Elvis Mitchell of The New York Times called the film an \"overplotted, hollow thriller, which crams in so much exposition that characters speak in fetid hunks for what seems like minutes at a time ... But Spider couldn't be better served than it is by Mr. Freeman, whose prickly smarts and silken impatience bring believability to a classless, underdeveloped thriller ... Still, he is wasted in this impersonal, almost inept thriller.\" Roger Ebert of the Chicago Sun-Times gave the film a mixed 2 out of 4 stars, calling it \"loophole-riddled, verging on the nonsensical\". He wrote, \"I'm wondering, since Dr. Alex Cross is so brilliant, how come he doesn't notice yawning logical holes in the very fabric of the story he's occupying?\" Nonetheless, Ebert thought that Freeman's performance was commendable. \"Maybe actors should be given Oscars,\" he wrote, \"not for the good films they triumph in, but for the weak films they survive.\" Robert Koehler of Variety felt \"the very characteristics that have made Cross so appealing, particularly his mind-tickling abilities to assess and outmaneuver his criminal opponents, are reduced here to the most fundamental and predictable level ... As reliable as any actor in Hollywood, Freeman delivers the requisite gravitas, but the bland script curtails any personal touches he might have inserted were his sleuth character unraveling a truly vexing mystery.\"\n\nThe second Alex Cross film with Morgan Freeman in the lead is quite generic despite attemps to plot twists. Michael Wincott does his standard bad guy while the lovely Monica Potter adds an aura to the film as US Secret Service Special Agent Jezzie Flannigan. It´s the second installment in the Alex Cross film series and a sequel to the 1997 film \"Kiss the Girls\". The screenplay by Marc Moss was adapted from the 1993 novel of the same title by James Patterson, but many of the key plot elements of the book were eliminated. The film was a box office success, although receiving mixed reviews from critics.",
    "date": "2021-05-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I don't get the hate for this movie!!! I think this was a very interesting movie!!! So many interesting scenes!!! Morgan Freeman did an excellent job as Alex Cross and Jezzie (Monica Potter) as the villain in the end was so scary and menacing!!! This movie gets a 9/10!!! 👍👍👍",
    "date": "2021-05-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Thriller poliziesco che gode fin da subito di un buon ritmo e di una trama in continuo mutamento.\nMorgan Freeman purtroppo è costretto a dare vita ad uno dei personaggi più banali e triti del genere.\nIl film inoltre si spegne clamorosamente negli ultimi minuti, in cui tutto si risolve troppo rapidamente con colpi di scena assurdi e spiegazioni poco convincenti.",
    "date": "2021-04-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Excellent police suspense! Works together with Kiss the girls (1997) and Alex Cross",
    "date": "2021-03-22"
  }
]