[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's a TV movie so the acting is debatable.",
    "date": "2025-01-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent movie about a harrowing story of some brave women finding sisterhood in the face of adversity. Bone chilling and a sense of uncomfortableness. A true horror/suspense story.",
    "date": "2023-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "An unbelievably sad and ghastly story but captured so well in this intense drama.",
    "date": "2022-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This crime drama was pretty good. Taryn Manning, Raymond Cruz, Katie Sarife, Samantha Droke, and the rest of the cast did a great job in this movie. This true story about the abduction of Michelle Knight, Gina DeJesus, and Amanda Berry was dark, dramatic, and traumatizing. What Ariel Castro did to these women was just downright evil. These women didn't deserve to have their lives taken away. If you haven't seen this movie yet, check it out sometime. It's worth watching.",
    "date": "2021-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Movie was okay, I'm sorry for those girls. You have my blessing.",
    "date": "2021-02-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "WOW! Everyone knows of Amanda's story, so to get Michelle's is very eye opening. I was really impressed with this movie! I would recommend it to anyone. \nand PS- for him to hang himself one month into his life sentence really shows that he couldn't handle the life he gave those girls. Locked in a cell and tormented was too much for him; but im happy all 3 of those girls came out alive and strong.",
    "date": "2020-12-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I have always been very interesting in the sad story of Michelle, Gina,&Amanda. When I heard there was a movie about it i just had to see it. Boy was I disappointed! I did not like how it was only based on Michelle's perspective. It would of been a million times better if they told all three girls stories not just one of them. I also thought the movie was way too short, they suffered for 11-10 years the movie should have been longer in order to fully tell their tragic story.  Seriously disappointed!",
    "date": "2019-02-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Good movie. \n\nDifficult to watch at times. \n\nManning was excellent.  \n\n[7/10]",
    "date": "2018-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A mood killer but a brilliant watch. Hard to understand that this is a true story!",
    "date": "2018-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Bad movie. Worst movie",
    "date": "2018-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This story has captivated me ever since I first saw the exclusive interviews with Amanda Berry and Gina DeJesus. This movie is chilling, enthralling, and hard to watch at times. Taryn Manning really outdid herself. I couldn't not take my eyes off the screen. Not for the faint of heart.",
    "date": "2018-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It show it well what happened,and there all give a great experience of it.",
    "date": "2017-06-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "la película hubiera estado perfecta si causara más sensación de intriga, como pregruntarse \"¿que pasará después?\".",
    "date": "2017-06-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Very good. And it makes you really feel bad about the victims",
    "date": "2016-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Wow - prayers to the victims",
    "date": "2016-02-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "What a terribly sad story ... 11 years in captivity ...",
    "date": "2015-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "\"Cleveland Abduction\" is a great TV movie that tells the tragic but true story of three women held captive for ten years... the direction and performances are impressive for a movie made for television..... Dark, but inspirational....",
    "date": "2015-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Slushy, predictable and highly stereothyped",
    "date": "2015-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I get the point of it. But the movie was so sad that it was hard to watch.",
    "date": "2015-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great job turning this mind blowing true story in to a movie.  Tears started flowing towards the end.  I highly recommend this movie.",
    "date": "2015-08-29"
  }
]