[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely amazing and underrated",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Está debió ser la ganadora del Oscar",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "10 out of 10.",
    "date": "2025-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was so emotional and amazing. The flashback video tape scenes remind me of my childhood when I was little and every time I make a mistake. I have to fix it no matter what. I love this movie so much. 10 out of the wonderful 10",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "It’s very heartfelt and a great addition to the Sony library",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny. Beautiful. Action. It is the perfect movie to watch with the whole family. It's a beautiful story. It's a beautiful movie in general. It has amazing sci-fi, comedy, and action. This movie never disappoints. This movie also manages to have the perfect cast of Danny McBride, Abbi Jacobson, Maya Rudolph, Mike Rianda, Eric Andre, and Olivia Colman. It's the perfect movie that deserves all of the love it can get. And I mean all of it.",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "last night i was babysitting my mom's friend's kid when she asked to watch \"Arga mobiltelefonen\" (Angry mobile phone) i look at her confused as she tries to explain what it's about until i finally connect the dots and realize she meant this one. \n\nthis is by far one of my favorites. definitely a must see!",
    "date": "2025-10-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best movie.",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Just seen this film today .. it’s fantastic ! Possibly the best film of its type I’ve ever seen. The pacing and script are brilliant .. some real laugh out loud moments .. a must see film !",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "O filme não aborda os personagens o suficiente e fica enrolado ao arco principal. Temas infantis demais, que pode ser pra toda família, mas não a quem quer achar um filme bem cativante.",
    "date": "2025-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "An artistic & amazing family movie.\n\nThe casting was nailed. Abbi Jacson as Katie Mitchell sounded very realistic as an 18-year-old as I hear them. Maya Rudolph is obviously, the mom who is Linda. It was funny to have a grown man, Mike Rianda, portray Aaron, the youngest. And Olivia Coleman was the best with portraying the evil phone device/AI who was PAL.\n\nThe animation is also creative & artistic: the general looks so like clay 2D but it is working. Then there is editing with 2D drawings/collages adding onto scenes so a Mitchell made this movie more appealing & live action cutouts.\n\nIt is real humorous. Many quotes from it will go down in history. The portrayal of PALs fate in a glass of water was hilarious (the way she reacted) - these do not always have to be dark & brutal.\n\nAnd the characterization is the best part. Katie is a filmmaker & used to have a great relationship with her father (who was technophobic) but got strained & the family was dysfunctional. The Mitchell's were not ideal unlike others (I.e: the Poseys). When PAL would be sending away the \"foolish\" humans, this dysfunctional family must function to save humanity. Those Mitchell's had outsmarted AI - they are wierd & according to the movie \"Spies in Disguise\", the world needs anybody wierd - wierd can be cool.\n\nSo - natural/human intelligence can be better than Artificial Intelligence.",
    "date": "2025-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Si ok bello ma rimane superficiale per la sua banalissima trama e per la sua morale un po' troppo semplice e poco originale.",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love this movie, I keep watching it over and over again",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Some of the plot points got resolved really quickly but one of the funniest pg movies of all time",
    "date": "2025-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Terrible.",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Awesome. Both my kids were glued to it. Really entertaining",
    "date": "2025-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is a great story for children and adults alike to enjoy. The characters are extremely lovable and the story is gripping.",
    "date": "2025-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It's a really fun and delightful movie. Surprsing it lost to Encanto at the Academy Award for Best Animated Feature",
    "date": "2025-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "With impressive animation and a heartwarming story, The Mitchells Vs. the Machines is both funny and packed with action that will satisfy anyone.",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This movie is genuinely amazing, it has a touching story, hilarious comedy, and amazing animation. This movie made me cry",
    "date": "2025-07-20"
  }
]