[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "definitly a learning to walk production with no sense of what happens next. its all to simple minded to be believeable.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "As a fan of Westerns and of Clint Eastwood, I was doubly disappointed by how awful this movie was. The story was trite, the characters unlikable, and the ending predictable.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "A film that has largely the same quality as the \"movie of the week\" fare being cranked out by the television networks during this era.  Supernatual elements aside it's just a weaksauce revenge tale in a western setting, something that had been done many times before even in the early 1970s.  \"Once Upon a Time in the West,\" anyone?",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "High Plains Drifter is a dark, daring, and entirely memorable Western that rewards viewers willing to embrace its experimental edge. While its controversy at the time may have distracted some audiences, the film is best appreciated as a stylistic exploration of revenge, morality, and the supernatural, rather than a moral lesson.\n\nClint Eastwood delivers a stoic, enigmatic performance as the Stranger, perfectly suited to the film’s bleak, dangerous world, where justice is ambiguous and violence is inevitable. With its haunting atmosphere, unsettling imagery, and morally complex narrative, High Plains Drifter stands as a masterful, almost allegorical Western — dark, suspenseful, and impossible to forget.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1.75 hours!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A cowboy comes from nowhere. And takes revenge of someone he definitely knew. Movie has some really funny scenes too. Amazing...",
    "date": "2025-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "An unprecedented approach in a form of an antihero judgmental gaze, glaring at societal corruption without much collective justifying depth to deter the involuntary sympathy as it’s become a conflicting ground for mere characteristic establishment. Critically routine upfront, but what Clint Eastwood pulled off story-wise is rather a unique injection that doesn’t disrupt his usual stance amid a typical showcase when uncovering a tangible meaning with elaboration. (B)",
    "date": "2025-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A classic Clint Eastwood western with a weird twist. Unique, if you will.",
    "date": "2025-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "One of Clint Eastwood's best directorals, in the western genre of course.",
    "date": "2025-06-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "A load of crap best left in the 70s.  1 star is a gross exaggeration",
    "date": "2025-05-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A classic from another time.  Stylish cinematography, an intriguing story where everyone is the bad guy, good performances, even from Clint's hat.  Just loses half a star from me due to the bright red chilli ketchup used for blood.",
    "date": "2025-05-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Claramente inspirado pelos faroestes spaghetti do diretor italiano Sergio Leone que ele estrelou, mas sem perder suas raízes e características estadunidenses, Clint Eastwood inicia \"O Estranho sem Nome\" no estilo de um faroeste como qualquer outro, mas o diretor e protagonista sutil e gradativamente transforma o filme em um misterioso conto de vingança, com uma leve pitada de terror sobrenatural. E o resultado é um dos faroestes mais singulares do gênero.",
    "date": "2025-03-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The best ducking Western of all time and i will die believing in this. I will not spoil anything, just watch.",
    "date": "2024-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "A terrible film, highly misogynist. Can't imagine how you can give it such a high rating. Its worse than a thrash movie. Doesn't deserve to be watched in this era.",
    "date": "2024-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Lot of caricatures and a hero that starts the action with by raping thhe first woman he sees. I watched. this movie because so many say it is Eastwood's best and maybe it is. It still bad though. I guess it is the supernatural element that elevates it for some, but I have never seen supernatural made more one-dimensional. By the way; a ghost with nightmares? Seriously...",
    "date": "2024-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie as a western horror story truly stands out, something like this could never be made in the modern day with current cancel culture making it a true once in a lifetime experience. Truly a gritty story that holds nothing back, if you're sensitive don't watch",
    "date": "2024-05-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Very strange movie.  Starts out great and very promising, but devolves into a loose story peppered with caricatures and cliches.  Eastwood is in excellent form.  On screen he does as expected throughout.  As usual for these films he has very scant dialogue.  But dialogue is not the point.  The revenge aspect is muddled and in the end we get it, but it never earns the audience rooting for the hero.  Vengeance is delivered, but without a compelling purpose.  Not an essential western by any stretch, but good for fans of Clint Eastwood and the \"mysterious gunman\" trope.",
    "date": "2024-03-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The Man with essentially No Name is back as a vengeful ghost. Dominating the town that allowed him to be killed, and paying back his killers. With the help of Mordecai, Lago fully pays for its sins. Even to the point of being rebranded as Hell.",
    "date": "2024-03-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "A ham-fisted and vomitous peak into Clint Eastwood's degeneracy. Atrocious.",
    "date": "2024-02-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This spaghetti western was great. Clint Eastwood, Verna Bloom, Marianna Hill, Billy Curtis, Geoffrey Lewis, Jack Ging, Mitchell Ryan, and the rest of the cast did a great job in this movie. The plot of the movie was thrilling and dramatic. It's about getting revenge for a town corrupted by outlaws. If you haven't seen this movie yet, check it out sometime. It's a must see.",
    "date": "2024-01-31"
  }
]