[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Right at the beginning is stupid ,if she can get her hands between her neck and the noose ,she can call for help for the cop who is her bodyguard ,lookout guy stupid off the bat",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I don't understand why this movie gets such good press. Sure the cast is great but there are no characters, the plotting is slow and laborious, and it's trying to be a silence of the lambs clone but it's got none of the charm or style. I was intensely bored the whole time.",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A really enjoyable psychological horror thriller similar to Silence of the Lambs. Although I liked Copy Cat just as much and the cast was fantastic!\n\nThis is the type of movie that I have missed seeing in movie theaters in recent years: strong ensemble casts(with movie stars), good quality across the board.\n\nThis movie could fall into the horror or scare category, as what is more scary than knowing these people exist in the world!",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "\"Copycat\" is a satisfyingly atmospheric film, an exhilirating experience, and an inspiring production that captivates spectators from the beginning to the end credits. The creators selected a cast that elevates the quality of the production, a score that renders it a feature that I consider to be a classic of its own genre enthralling, and sets that immerse you as a viewer in its universe. With fascinating characters, an astounding cinematography, and a compelling narrative, Copycat's producers provided us with an ambitious project that showcases that smartly combining aspects of visual storytelling can generate a production that is ambitious, unique, and that has the capacity to have spectators caught up in an experience that is entertaining, gripping, and appealing to most that enjoy cinema.",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was incredible. As french people learning english and having a clichee look on american movies we were surprised to see an actual plot with an exciting course of events. WE RECOMAND IT . And the cast was amazing as well",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very, very underrated thriller. I've seen it a few times - it's not as good as silence of the lambs, but it's the same type of movie and really pretty good - if you liked lambs, watch this, you'll enjoy it.\n\nBeware - a little scary, graphic violence",
    "date": "2025-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Better than I thought it was gonna be 💯",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Filme: Copycat: A Vida Imita aMorte\t\t\t\tAssistido: 13-7-25\nElenco: @sigourneyweaver.hun @glam4lyf @dermontmulroney @williammcnamara108 @harryconnickjr \nModelo: #suspense #policial\nDuração: 2h\tAno: 1995\nMinha opinião: Este filme Sigourney interpreta Hudson, uma escritora de serial killers, que os estuda. E em um dos ultimos casos que ela estava ajudando a policia ela foi capturado pelo serial Cullun (Connick), mas ele a deixou viva e foi preso. E desde então a dra. fica traumatizado e fica presa em seu apartamento, sem conseguir sair. E inicia umm nova onde crimes que imitam vários famosos assassinos que é investigado por M.J (Hunter) e Reuben (Mulroney). A as investigações levam eles a pedirem ajuda a dra. Hudson. MAs o serial que imita outros Foley (McNamara) esta atrás da dra. sendo ela a cereja do bolo de seu plano. E invasão do apartamento da dra. e o terrorismo que ele causa a ela. será que ela irá superar? Em uma emocionante caça a Foley. \nVale apena assistir? Uma boa atuação de Sigourney, vale apena assistir. Um filme de suspense policial.\nNota: 7",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This was my kind of movie! So fun!",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Gripping the whole movie",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Copycat features a captivating mystery and two powerful female leads that pull you in, generally working as a typical crime thriller, even if its a bit too theatrical in its presentation.",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Brilliant old school thriller that's still awesome to watch today",
    "date": "2025-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Weaver and Hunter were fabulous together. I did not recognize Harry Connick Jr and he gave one creepy and scary performance. \n\nStory was typical but had enough twists in it to keep it interesting.",
    "date": "2025-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 2 hours and 3 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $31,300,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Já me cansei desses tipos de filmes, mas por ser retrô a minha opinião é que: é um bom filme.",
    "date": "2025-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A well paced 90's classic, holds up 30 years later.",
    "date": "2025-06-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Though serial killer mysteries and thrillers often never seem to disappoint, Copycat does fail to deliver interesting protagonists despite featuring an unsettling villain. Directed by Jon Amiel, Copycat is a film that follows San Francisco homicide detectives that enlist the help of an agoraphobic criminal psychologist to find the disturbing serial killer whose victims are murdered in same way as previous victims of known serial killers. Starring Sigourney Weaver and Holly Hunter, Copycat spends majority of the film building the trauma of its protagonist rather than establishing depth. \n\nWhile I think that Sigourney Weaver is consistently fantastic in all of her films, the major flaw of Copycat is that the film does not deliver substantial a characterization for its protagonist. Personally, I think Holly Hunter was slightly miscast. Dermot Mulroney is unfortunately forgettable. Besides Sigourney Weaver, the cast of Copycat is rather dull with minimal risk-taking. Copycat does succeed in establishing some unsettling moments. When the film is portrayed from the point of view of its agoraphobic protagonist, the intensity and tension created is impressively high. \n\nOverall, Copycat is an entertaining mystery with some haunting moments, but the overall story is one that feels cliché. Sigourney Weaver commands the screen but her character is underdeveloped.",
    "date": "2025-06-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Just not believable.",
    "date": "2025-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I have been finding that my taste in movies in series so many times lead me to poor choices. This one on the other hand is refreshingly \"outdated\", before even the internet was popular. It is great to rely on good acting and good filming. I am still watching but have been enjoying it a lot - cheering and engaging in the action.",
    "date": "2025-06-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie. Excellent cast and acting. McNamara was outstanding as the\"copycat\". I consider it a must see thriller.",
    "date": "2025-06-22"
  }
]