[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was sincerely the most hysterical piece of preposterous cinema to ever be created. I couldn't have been more entertained. Impeccable piece of work, no notes.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "i like this movie the interactive rom com scenario was really good",
    "date": "2024-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "this movie didn't make me choose love, it made me choose suicide.",
    "date": "2023-12-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I thought I would go crazy watching the same unabbreviated scenes over and over and over near the end. What started as a decent movie lost my interest quickly.",
    "date": "2023-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very cute and fun movie.  I had never done an interactive before and really enjoyed getting to choose.  I chose the very cute Maori boy, of course!",
    "date": "2023-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I just finished watching CHOOSE LOVE, and it was so great! Picking my own ending for Cami was actually rather empowering as a woman, and made me think about my own choices as well.  It's caused a lot of discussion amongst my friends, and we all really enjoyed it and can't recommend it more!",
    "date": "2023-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "\"Choose Love\" was the BEST movie, and I thought the concept was so innovative and fun!  First, I watched all the endings by myself, and then I watched it again with a large group of friends.  It was so addictive - we actually saw all the endings again!! It was so well done, and couldn't have been more fun.  And Laura Marano was just so wonderful and endearing.  Netflix should definitely do a sequel and more interactive programming! We all just LOVED IT!🥰",
    "date": "2023-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It was very awkward and boring for me i wanted to skip everthing i hated rex so much hes so weird and boring jack is ok his weird but mid paul is mid to just a lil boring",
    "date": "2023-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This movie was so cute and fun! would totally recommend watching in a big group of people because the choice points are much more entertaining when you have different opinions of where to go.\nCami was great at breaking the 4th wall and the guys were all so cute. loved that they kept coming back! only wish it could have been longer and we could have seen more from each story.\ndoing a rom-com as an interactive is such a smart idea, i hope we see more of them soon!",
    "date": "2023-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "We had a great time playing along with this little interactive movie on Netflix. My wife and I enjoyed the film; always finding ourselves going back to Paul. This movie isn't going to win any rewards, but we found ourselves going back to the movie over and over again to try and find new paths in the story. It was a fun time and wish Netflix would do more like these.",
    "date": "2023-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Poor, boring, the worst Marano's movie I've ever seen. The interactive thing is a good idea with a terrible execution",
    "date": "2023-09-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This movie is good in the sense that one gets to interact and make decisions. Although I'd rather make the decision to turn off the tv so I don't have to watch it.",
    "date": "2023-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Worst than Kaleidoscope, so…… nothing good is here",
    "date": "2023-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This movie feels like a teenagers fantasy, and not a good one.",
    "date": "2023-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Better than I expected reading the critics scores. It's a cheesy rom-com, but the pick your own storyline makes it fun. Don't think too deep, just watch it and have fun.",
    "date": "2023-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "What a waste of time ! So cheesy and really bad acting, Laura sounds so cheesy and fake.",
    "date": "2023-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "So much fun to watch with a group and argue over choices! What a wild ride, and the acting and writing are so compelling, we just keep playing!",
    "date": "2023-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Interesting and enjoyable. A heartwarming rom-com with a blend of humor and romance. I appreciated the witty dialogue and feel-good moments...it's a good pick-me-up for a cozy movie night \nI watched it first without making choices, then made a few the next time, it was better with my choices lol.",
    "date": "2023-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I think an interactive romantic comedy has the potential to be something great. While I do feel like the gimmick is kind of fun in \"Choose Love,\" this movie is as one-note as the genre can get. I went through the story with the choices that made sense to me, but I feel like regardless of who the main character ends up with, I was kind of indifferent. I could see the movie being a terrible one if it wasn't interactive, but I don't think the interactive feature does much to completely save it. Overall, I still would love to see more of these interactive films from Netflix, but maybe in a more exciting and engaging way in the future to come.",
    "date": "2023-09-01"
  }
]