[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not the greatest holiday movie but I enjoyed it.  It’s predictable but I thought it was a decent watch for the evening.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "From the moment Herb cheated & she can still smile & no human feeling at all + those two kids who doesn’t feel anything like a normal human being or a children, this make me sick. Literally not a Christmas movie. Naked, sex. Urghh give me break",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Such a disappointment. The story line and the acting was horrible, I gave it one star because it made me laugh out loud once. Other than that chuckle I could not wait for it to end.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Bland plot, not great acting. Predictable movie with no substance to look forward too. Tons of makeup. very noticeable.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie is genuinely so so bad. And I love cheesy Christmas movies. \n\nI know everyone is throwing shade at the acting but you've got a relatively solid cast and a TIKTOK skit quality movie. \n\nThat's a writing problem. \n\nThat being said, I'm continuing to watch it because I'm masochistic and hate myself.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The actors in this film all deserved better than this bland script, doesn't help that everyone is over make-upped , there are some ok laughs, but it really should have been funnier. \n\nSilverstone and Hudson have great chemistry. Melissa Joan Hart whose company produced this film is under used. \n\nPierson Fode is actually quite good with his limited role, he is one to look out for, hopefully he will make the move to serious movies, he has the looks to match Ryan Gosling and Chris Hemsworth, lets hope he can find an indie to show his acting chops.\n\nJameela Jamil did okay as well she has more screen time than Fode but is stuck in the role of the 'other woman' and isn't given much to do with it and unfortunately doesn't make the role a memorable one.\n\nOverall just very bland not one of Netflix's better Christmas movies.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Aimed at an older crowd who know what it’s like to make compromises and have regrets. Silverstone is excellent and I hope we see her more often from now on. And Chet is a laff riot!! I feel some negative reviews must come from young people just setting out to change the world. Just remember, the grass is always greener on the path not taken.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's worth watching",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I wanted to like this movie, but just couldn’t do it, in fact, I couldn’t even finish it. Poor acting and poor plot.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It made me laugh you know but I'm going to say it could have done a lot more I mean it's kind  basic story ex to get back with a former lover",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Wasn’t good. Terrible ending. Acting was not great either.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Zero laughs. Zero Christmas charm. \n\nThe beginning of the film promises a newly divorced woman in her late 40s claiming her life back from her awful husband now her youngest kid is grown. She gave up her dream job to live in a small town and in her words, basically be a single parent for 20 years. Her ex treats his new girlfriend like trash and wins his wife back by thanking her for making him the kind of man that could be a good husband and father for someone else? She gives up a second chance at her dream job in a new city to stay with the man who only wanted her after she was finally getting out. \n\nThe acting feels as though everyone got their lines the morning of filming.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's a cheesy Christmas movie. If you don't go into it expecting more than that, you'll like it. Having Alicia Silverstone do a rip off of the beginning dialogue from Clueless was a bit lame though.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Funny just not the best ending",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "One of the absolute worst movies I've ever seen. It started out pretty well, but then, my god. The script, the acting, the direction. Why was this made?? Just awful. Like, WHY IS everyone so mean to the mum?? The dad is literally off shagging someone else ten seconds after they separated and she decides to move house to pursue the dream she gave up for that loser so everyone then rags her to tears about it. Terrible.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I was really looking forward to this movie. Especially when I saw Alicia Silverstone was the leading lady. I was really disappointed in it though. Once you’ve seen the trailer, you’ve seen the best bits. It’s really not that funny, it’s not that entertaining and it’s not that moving. A Christmas movie in my book needs to be all of those things. Hate to be the grinch but it’s a no from me.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Although I love the actors in this movie, I did not like the movie. I can’t really put my finger on what I didn’t like about it, other than the fact that I just didn’t like it.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny movie… worth the watch",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "A Merry Little Ex-Mas is a 2025 American Christmas romantic comedy film directed by Steve Carr 🎄 \n\nI knew after five minutes this was not going to be good…\n\nCan’t recommend it. \nOof, this isn’t good 🙁\nProbably give it a miss 👎🏼\n\nAll Kate and Everett want for Christmas is an amicable divorce and one last holiday as a family, but new flames and old feelings complicate their plans.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "5 Star for fun Xmas fun. But I downgraded it fully for the writing. Woman gives up her dream, raises family while husband furthers his career. \nWoman decides to pursue career after allowing the entitled family to excel themselves to her  detriment and ultimately then DOES NOT FOLLOW HER DREAM because she goes back to being the dogsbody for the husband and family. Was this written by JD Vance?",
    "date": "2025-11-21"
  }
]