[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "You know what I like in a movie? When an actor is top billed as one of the stars, but is hardly in the film at all. But wait, the bad guy that they are hunting, is always cloaked in a mask or hidden from the camera. Gee, I wonder if... I'll just ask Cary Elwes.",
    "date": "2025-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Despite having a stellar cast the movie is unable to showcase their potential. The soundtrack and cinematography tries and fail at convincing the audience with a lukewarm plot with incomprehensible police work.",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Freeman as Alex Cross is a winner - but Ashley Judd just didn't seem to have enough to pull of the victim in film. She's all over the place.",
    "date": "2025-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great acting and great plot.",
    "date": "2025-04-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A good movie but nothing too special",
    "date": "2025-04-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I forgot that Cary Elwes is in this movie! And I am reminded that I must read the Alex Cross book series when possible.",
    "date": "2025-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "So cops know where she was found on the river so would know the area that she came from but don't do a complete search of that area? Eg for old mines, old estates, caves etc. The perp would have to have access via road to some point near his lair. But no put their best witness in front of the press so the perp knows she's alive and well and come get her. Then take the victim out to the woods with only two other people. Sorry just lost it after that.",
    "date": "2025-01-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Es una película mala, mala a secas y es que está película con una premisa tan pero tan intrigante daba un potencial enorme, con un actor tan inconico como Morgan freman, se reduce a una película mediocre, con una excelente premisa mal ejecutada y con una co protagonista, la doctora Kate, que rompe con el realismo ya que como alguien secuestrada y aprisionada este metido en las escenas del crimen y buscando al secuestrador, es como si la trama la forzará al personaje a participar en la trama pero no cuadra para nada, en la vida real es imposible ver una víctima trabajando con la policía, es simplemente estúpido, el villano simplemente está mal y es que villano debería ser de las cosas más importantes en este tipo de películas policiales pero simplemente se rebela en el final con un plost malísimo y nada impactante, por último está película empieza de manera excelente pero decae estrepitosamente ya por la mitad y pierde todo el misterio e intriga y que siempre se rompe el tono, lo único bueno de la película es el inicio y por supuesto Morgan freman que hace una buena actuación aquí pero nada más que decir.",
    "date": "2024-12-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It feels like a story written by three different people who didn't catch up too much and was then shot by a Director who gave each writer their stories own space.\n\nEither the place is crawling with cops and feds or there is hardly anyone around.\nThen there's the muliple baddies, who just seem, like the three writers, jammed in.\n\nThe acting performances are okay...but what a story.",
    "date": "2024-12-14"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I’d say it’s a good movie, not jaw-dropping, but enjoyable.\n\nAshley Judd stood out with her strong performance, balancing vulnerability and determination really well. Morgan Freeman was great too, his calm, confident presence fits perfectly in roles like this, and he definitely carried a lot of the movie’s weight.\n\nOn the other hand, William Converse-Roberts, who played Dr. Wick Sachs wasn’t very convincing. For a character tied to such a disturbing element of the story, his performance lacked the intensity or depth needed to make it truly impactful. It felt like a missed opportunity to add more tension to the scene.\n\nThat said, the movie overall was cool. It had a solid pace, good production values, and kept me engaged throughout. While it’s not one of those thrillers that blows you away, it’s worth a watch",
    "date": "2024-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The critics score on this one is just like those wine tasters that tell you there's a hint of 'pick your unidentifiable flavour' in your wine. Only they see what they see, which makes their opinion pretty worthless",
    "date": "2024-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Adapted from the novel of the same name, 1997's 'Kiss The Girls' brought the character of Alex Cross to cinemas for the first time.\n\nSYNOPSIS: 'Police hunting for a serial kidnapper are helped when a victim manages to escape for the first time.'\n\nThis film gets a lot of criticism, as does its sequel, but for me it's a solid crime thriller which is carried successfully by Freeman and Judd.\n\nAt times the tension is really genuine and the crimes are frightening, though we see a lot worse on TV nowadays.\n\nAn entertaining, by the numbers thriller, that ticks all the right boxes.\n\n7/10",
    "date": "2024-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Stellar: no. But enough suspense to stay entertaining, and with Freeman and Judd you cannot completely go wrong.",
    "date": "2024-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Definitely worth a watch for me. Did they rush it at times? -Yes, but the plot was good",
    "date": "2024-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It had everything to be good, but it isn't.",
    "date": "2024-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Better overall than Along Came A Spider, though still not as finessed as we're now used to with a lot of crime thrillers. It does benefit from having AJ with MF, making for a great pairing and good viewing, as well as the source material being gold",
    "date": "2024-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I have now become involved with the mind of James Patterson. As an action movie, KISS THE GIRLS knows what it takes to make it all work, but as a mystery thriller, it literally takes the action to a whole new level.",
    "date": "2023-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Considerando la base di partenza, con un romanzo di successo e pieno di suspense e colpi di scena, si poteva fare meglio.\nLa sceneggiatura ha numerosi elementi e dettagli che rendono piena la storia e soprattutto funzionano bene i continui cambi tra sequenze di azione e sequenze di indagini e dialoghi.\nI personaggi non sono sviluppati bene, i villain vengono troppo messi in secondo piano e le indagini sono un po' sommarie.\nAnche la regia è deludente, il montaggio caotico soprattutto nelle sequenze di azione dove si susseguono fotogrammi alla velocità della luce.",
    "date": "2022-12-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A very suspenseful movie with great locations and sets and even though it had a predictable ending I was thoroughly entertained throughout the run time of this movie.",
    "date": "2021-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Callous, unemotional, and morally depraved psychopath genius with collector's sophistication & detail of investigator. Never underestimate a women's determination. Lots of fun enjoyable detective works, both lead casts are fantastic",
    "date": "2021-05-24"
  }
]