[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "You can argue all you want, but I reckon Collateral is Cruise's best ever work. He is at the centre of every scene – and is incredibly impressive throughout.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Excellent for this crime genre, as the screenplay is fresh, Foxx and Pinkett-Smith are great, and the big spread out LA  at night is wonderful.   \n\nCruise is a bit too decent at times to be a psychopathic hit man, and the ending is a bit thin and too conventional -- for a movie that built something special, in terms of existential struggles and questions of meaning.  However, the movie is so strong, these are not more than mildly off putting.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Another great tom cruise movie. Clever story. Jamie Foxx is great, he plays a cool confident cab driver that then becomes a wreck after driving for tom cruises character.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "That was awesome \nLove it",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A solid thriller. It has it all. Great story. Superb cast on top form. First class filmography. Last but not least, a script that delivers.\nDon't see a lot of these currently. More the shame.",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Really enjoyed I just didn’t like the story",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Astonishingly good camera work and cinematography.  \n\nGood but not great story - the stakes should have been raised a little higher for the Cruise character - hard to understand why he didn't cut and run when things got tough.",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "One of Michael Mann's trademark thrillers with a good performance by Tom Cruise",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Lots of violence and killing. Very weak storyline and little to commend it.",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It was difficult to follow and the ending was incredibly underwhelming. Cruise made what could have been a badass villain into a mediocre bad guy at best.",
    "date": "2025-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Collateral pairs two big names- Tom Cruise and Jamie Foxx, in a gripping and unexpected way. As a fan of Jamie Foxx (less so of Cruise), I was delighted to see him portray a softer, hopeful character trying to find his way, while Cruise plays an intense, relentless hitman who pushes Foxx’s character to grow. \n\nBy the end, Foxx evolves into a confident hero, protecting the damsel in distress, played by Zoe Saldana (curiously, Jada Pinkett is mentioned in the cast, but she isn’t in this film).\n\nWith plenty of twists and turns, and strong support from actors like Javier Bardem and Mark Ruffalo, Collateral is a fun and engaging watch. A real treat!",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "All Time Classic. You know the cinematography is really good but it can be a bit dull looking and basic. It's all on location and looks great still. The action scenres are really good too. Everything else is just first rate and this has Mann's style all over it. The story takes twists and turns you'll never see coming and buids perfectly. The ending is on the edge of your seat thriller stuff of the highest order. Everyone should give this a try once.",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of my favorite films of all time.  Tom Cruise as a bad guy is top notch along with a powerful script and excellent acting, you can watch this one many times over.",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Tom Cruise makes a great bad guy, and coincidence and contrivance in the script aside, this is an excellent thriller.",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Collateral showcases Tom Cruise’s most somber performance of his career, complemented by a commendable Jamie Foxx performance as this Michael Mann thriller ensnares you in its gripping narrative, leaving you eagerly anticipating the story’s resolution.\n\nGrading: A",
    "date": "2025-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of if not my favorite movie of all-time. Every time I watch Collateral, I like it a little bit more. Both Foxx and Cruise are great and the film delivers tons of amazing scenes from such a simple set up.",
    "date": "2025-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "3.5 stars; A good thriller. Michael Mann is certainly comfortable when he is in his niche. Jamie Foxx made an excellent transition from comedian to serious actor. In this case, he played a simple cab driver who gets caught up in a whirlwind of murder when he picks up a hitman for a fare. Tom Cruise did his usual professional job, giving a believable portrayal of a ruthless hitman, hired to eliminate witnesses for a crime boss. Foxx was able to create empathy for his character, who's a loner with big dreams, seeing them fly out the window when he falls victim to circumstances. I realize the plot is a little bit of a stretch in places, especially the ending... but hey, it's a movie. Enjoy the ride!",
    "date": "2025-06-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "What's the best way for me, a stealthy hitman, to continue being a stealthy hitman? Oh, I know, I'll rope a random cabbie into my assassinations, screw about with his personal life, then lose the plot when he makes a mess of my livelihood. What could possibly go wrong?",
    "date": "2025-06-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The main plot along with Cruise was great. Only three  stars as the character played by Fox was not real. I understood he initially wanted to escape, but for no believable reason, he morphs from a nobody cab driver dreamer into hero who believes he can take on a professional assassin an save the life of a woman who he briefly met, putting the life of his mother at risk. That was unforgivable. This morphing into an hero was ill-conceived and tragically pathetic, ruining what otherwise was an interesting thriller.",
    "date": "2025-05-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Two lost souls gather up in LA. Taxi driver is lost and sort of lying for himself while the serial killer is a conscient sociopath. The soundtrack is just perfect. Great crew of actors. Great scenes and pace. 10/10.",
    "date": "2025-05-31"
  }
]