[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The storyline for this movie was very good, and I thoroughly enjoyed it. However, throughout the film, I didn't feel any of the main characters' romantic connection or sense of tension. It felt very dry from both sides.",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This did things for me that I didn’t know I needed",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Cute romantic comedy. Sexy , funny, cute in general. It’s ok to binge watch over ice-cream",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I enjoyed Alexandra Shipp's performance.  No one else managed to do anything rewarding to see with the poor script.",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I liked Glen Powell in Hidden Figures.  The premise of this  movie peeked my interest, however the  constant barrage of sophomoric  F Bombs throughout the movie drove me to turn it off.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Lukewarm garbage. Glen is the only redeeming attribute.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A classic rom-com with the charm of Glen Powell and the wittiness of Sydney Sweeney - this was such a feel-good watch even if it may not have been anything unique \n\nYou could feel the tension between Bea and Ben in every scene they shared (the chemistry was unreal ). Hats off to Sydney and Glen for carrying this movie effortlessly.\n\nThroughout the whole movie, I just kept thinking, “please just get together already!”\n\nOverall, a heartfelt and fun movie that makes me want to find my person 💕🥺",
    "date": "2025-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Watched it last night. Beautiful picture. Very funny. My wife and I laughed throughout. It also got the mood right for us. Great movie. The actors were all superb. Right amount of cliches and originality. Watching again definitely",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I don’t know how this is rated so highly. Unreal scenes. Bad acting. Beyond predictable. The writer thinks we’re all idiots. Some characters die in a car crash and nobody in the family connects the dots that they were having an affair? Stupid narrative.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Screwball Rom Com cashes in on sex appeal, he/she said tropes, BFFs and a fantasy vacay.  Enough chemistry and one liners to search and rescue popcorn night.  If you like champagne, slapstick and a few hits under the belt.   *Upgrade to: Something About Mary, Groundhog Day",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Not very interesting movie very predictable I feel like I've already seen movies like this one and I don't care for the lead characters sorry but what I like about this is that this movie triggered the hell out of Clingy girlfriends online 😂 that was more entertaining to me than this movie that's why the 2 ⭐⭐ I see and hear things that others don't😉🍿👀",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Rating: 6.5/10\n\nAnyone but You is a breezy, beautiful, and old-school romantic comedy powered by the undeniable chemistry of Sydney Sweeney and Glen Powell. While the film is predictable and clunky, the charm of its leads makes for a fun and watchable romp.\n\n\nAnyone but You is a fun and enjoyable romantic comedy that succeeds despite its weak script, thanks to the charisma of its leads. It's a solid watch for fans of old-school romantic escapism.",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's RomCom cotton candy - but Sweeney and Powell are fun to watch.",
    "date": "2025-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Wish I had my 90 min back. Actually fast forwarded some parts as it was truly embarrassing to watch. The uninspired acting along with poorly written character development was worse than I expected.",
    "date": "2025-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Acting is awful, story is very predictable.  Felt like this was a Hallmark movie.  Avoid, even if your girlfriend or wife really wants you to watch it with her",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Does the 'dopey white guy' cliche real well, but that's about it.",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "it was really fun to watch but they keep the joke too long",
    "date": "2025-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The acting in Anyone But You feels really forced — nothing about it comes across as genuine. It’s pretty clear they were more focused on pushing a certain “woke” angle than just telling a good story. Honestly, I’m not even sure why I expected anything different at this point.",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "So bad.   Every part of this movie seemed forced.    We laughed about how dumb it was!",
    "date": "2025-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Soo good and funny 🔥",
    "date": "2025-10-11"
  }
]