[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Esse filme é excelente e Robert Downey Jr. está perfeito nesse personagem. Um drama familiar envolvendo o relacionamento conturbado de pai e filho e que foge das resoluções óbvias.",
    "date": "2025-10-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The Judge is a riveting drama that features remarkable performances from Robert Downey Jr. and Robert Duvall, but its narrative may not quite live up to the expectations of some audiences, who might be yearning for a more complex and engaging crime storyline rather than a more conventional family drama that, although well-executed, feels a bit too common and predictable. Nevertheless, I found the exploration of the family dynamics to be impactful.\n\nGrading: B",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Decent story about family - made you think about the complexity of parental relationships. Could have been a bit shorter and more to the point. Maybe some scenes or arcs could have been tightened up. \n\nBut overall a good film and worth watching.",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Es un film muy conmovedor, me recuerda como el tiempo no perdona y que este tampoco perdonara a nuestros padres, un mensaje que me lleva a apreciar cada momento junto a mis seres queridos.\nLas actuaciones son perfectas; mi favorito, RDJ y Robert Duvall.\nSin duda una película que recomiendo en lo absoluto.",
    "date": "2025-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "These kinds of films rarely gain a cult following or win an oscar, however some do like On golden pond. The acting is A-1, and the scenery will make you want to move to Indiana, lol. The story has like 10 different ones all packed into the film and I loved it!",
    "date": "2025-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is one of my favourite movies with Robert Downey Jnr. He’s acting is wonderful to watch, the script is superior and the story flows wonderfully. And the depth of all the actors supporting is phenomenal.",
    "date": "2025-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This is a heavy movie. It is well done and interesting. RDJ really is one of the best and Duvall is a legend too. Good movie.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Probably the best work of RDJ. This movie is touching and extremely well shot and directed. The love story/sub plot is pretty useless and steals time and rhythm to a movie otherwise very good",
    "date": "2025-06-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Once again, the artsy fartsy pretentious critics blow more smoke up each others arses, and those that believe their arrogant opinions will miss watching a really entertaining flick. Good story, great acting, great cinematography.  Just a really solid, very interesting and entertaining look at a semi-dysfunctional father son relationship.  Don’t listen to the pinkie up pretentious critics.  Watch this.  You’ll be glad you did.  I don’t even bother looking at the critics scores anymore.  Just leave it to us common folk for some honest appraisals.",
    "date": "2025-03-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Movie is a great family watch. Just because I think it may be cliche and predictable, I know the average is human and is like “wow, good flick.” Robeert Downey is in top 10 on conversalist if that’s a a word, but he kills it and it, I think it’s a flick worth throwing out to fams or couples that haven’t seen it. Just sayin",
    "date": "2024-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The \"top critics\" must be miserable people. This is one of my favorite movies. Great journey through the story, character development, and impressive acting. It brought both tears and laughter.",
    "date": "2024-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Relatively good script but then add Robert Downey, Jr. and Robert Duvall and now we have something worth watching. Overall I very much enjoyed watching, just thought the ending could have been different/better.",
    "date": "2024-07-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "They didn’t spend enough time in the beginning with the main character for you to like him. For me personally I have the exact same relationship with my father so it was hard to watch. The best thing is just to cut people like that out.  The brother of the main character wasn’t cast correctly either.  They should have had a more leading female in the mix.",
    "date": "2024-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great movie. I did not really care for the ending though.",
    "date": "2024-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I won’t say this movie is stellar because it’s not. I do think the audience score is a bit more fair than the critics’ reviews.",
    "date": "2024-06-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Great movie! Writing, acting, directing is top notch!",
    "date": "2024-06-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I think it’s an amazing movie- sentimental for sure but so what? It wasn’t corny - had a great soundtrack that HOLDS UP! And acting is pitch perfect. What actors!  How can the reviews suck this badly?!",
    "date": "2024-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This a great dramatic movie that tells the story of a son (Robert Downey Jr.) who lost the favor and love of his father when he was a teenager, and his aging father (Robert Duvall) who has less time on the clock of life, but is keeping it a secret.\n\nI don't want to give away the story, go watch it; it's heart warming.  It's an excellent film, excellent acting and filming.\n\nI recommend this film.",
    "date": "2024-06-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Ignore the critics. Cliché?  Maybe but this movie has everything an audience loves, portrayed by an absolutely outstanding cast of actors. Robert Downey, Jr. and Robert Duvall never disappoint.",
    "date": "2024-06-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I considered turning this movie off towards the beginning but am glad that I didn't. The beginning of this movie, and, actually, a good deal of it is difficult watching—a lot of family conflict. But the acting is superb, especially, by Robert Duval (as always). So, I hung in there. The plot is engaging. And the characters are engaging. Robert Duval was nominated (for the 7th time!) for an Academy Award and should have won it. The screenplay, also, is spectacular, though challenging to the audience. I highly recommend it unless you like feeling comfortable throughout a movie.",
    "date": "2024-05-31"
  }
]