[
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Vapid dialogue. Dumb decisions. Wasted opportunity on a decent premise.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A survival thriller in which the killer is in trouble. Definitely entertaining for a movie night at home.",
    "date": "2025-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Not sure why the bad reviews. I enjoyed the movie, watched alone. Completely caught me off guard and the ending was not predictable. Watch and enjoy.",
    "date": "2025-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Lame, farcical plot. I just wasted two hours of my life.\nHow on earth this gets a 92% rating on this shitshow of a ratings system is beyond me.\nNote to self: Ignore Rotten Tomatoes ratings.",
    "date": "2025-04-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This is simple no more than a one star movie and that's pretty generous. I'm even sure they fixed the wrong window! Serious continuity issues! BS!!",
    "date": "2025-02-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "How in the World did rotting tomatoes give this anything above 50% Yikes ? Always go with viewers!",
    "date": "2025-01-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This film does a good job at not giving anything away.  There were a few surprises and a decent script (with a few incredulous moments) in this tidy little horror movie.",
    "date": "2024-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "In a sea of movies, we often hit hidden gems, most of them pleasant to the eyes. It is common, likewise, that the gem turns out to be just glass after care polishing. Cold Meat starts strong with a great opening scene but lost itself in the long run. \n\nThis movie is also a great example of false advertising. I had to rewatch the trailer to see if I was not going insane; is it that I completely misinterpreted the trailer altogether? \n\nNope. The trailer advertising and the final cut are completely different stories. That would be fine if the final cut was at least interesting, but it isn’t. \n\nCold Meat starts with a voiceover telling of a legend about bad people and Nature’s justice. Pay close attention to this info because you will only get to see it again by the end of the movie. \n\nThen we get to a great opening scene showing huge traits of characters David and Ana, our main characters in this mess of a story. I will give it that the acting is at least good and commendable. This scene is the only good thing about this story, like chewing a sweet gum that ends up spilling spicy pepper sauce all over your taste buds. \n\nThe rest of the movie takes place in one setting without much happening, which would turn out interesting if the psychological aspect had better details. The dialogue is just plain and boring, not enough to keep us hooked. \n\nAnd yet, I persevered. I endured because I’m that person, I wanted to see the end of the tunnel. \n\nTurns out the light was a freight train coming my way. \n\n90 minutes of downhill uninteresting plot points until a huge, unexpected Ex Machina, one that, although kinda foreshadowed, just comes out of nowhere, a cheating player or a breaking bug in a software. \n\nHad the movie used its own advertised premise as the main theme for the story, I think Cold Meat would have better chances. As it is, I can’t see a valid redeeming factor about this story.",
    "date": "2024-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I was really surprised by this movie. It was really effective at building tension.",
    "date": "2024-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Good little thriller. The makeup work towards the end is spot on.",
    "date": "2024-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Effective thriller. Nice twists. Held my interest until the end.",
    "date": "2024-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I’ve had diarrhea that was more enjoyable than this movie. Horrendous waste of time.",
    "date": "2024-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Don’t waste your time with this movie you will be disappointed. It is overhyped terrible terrible movie.",
    "date": "2024-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Admittedly, I was expecting a lot more given the hype over this movie. \n\nThat said, Cold Meat is a decent thriller, with some horror undertones, with strong performances from the leads, particularly Nina Bergman.\n\nIf you’re looking for straight out horror, you really need to look elsewhere… this is more a thriller then a horror.",
    "date": "2024-06-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It was definitly a twist. Totally fooled me in the beginning. It was a pretty good movie. I wondered what that thing was at the end..(semi-spoiler)",
    "date": "2024-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very entertaining and suspenseful for most of the movie. The little bit of supernatural just didn’t fit with the rest of the movie. Great acting.",
    "date": "2024-06-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Tinha tudo pra ser um bom filme. Mas daí apareceu uma fantasia e o filme ficou péssimo",
    "date": "2024-05-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Good suspense at first, and nice lead to introspection thoughts. Almost the full movie develops inside a car though, which makes it a little bit cheap, kind of slow & somehow predictive (?). I would recommend it, but wouldn't watch again.",
    "date": "2024-04-14"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Mediocre at best. Acting poor. sad stories we've all heard before. Waste of time.",
    "date": "2024-04-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Predictable plot makes the movie less interesting. Scenic beauty revealed of cold location",
    "date": "2024-03-23"
  }
]