[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great movie but still most hated",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Horrible.  The  human characters don't walk,they hop but my favorite part is the end credits part. so this is one out of 10 and why is the mom's butt so thicc? Why did the animators do that and almost like it was made 20 years ago. But I like the original one better, and all he does in 2022 is that he loves to fart, and eat,eat,eat,and eat!  \n\n I give this a rotten rating . So literally why? We owe Pete Davidson and J.K Simmons an apology! Netflix was a little crazy. And Netflix made this pretty choppy. Just chopped. Like the animation is pretty choppy. #1 hated movie.  0% good, 100% 🤮 The 2010  version is better than this cat poo poo! 🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮 Pete should NOT have been in this cat poop! Same for JK Simmons! This is pure SLOP!",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This is a shitty dog",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The story is an incoherent mess. Even my kids who will watch nearly anything were bored. The animation looked pretty choppy, all the characters were very choppy.",
    "date": "2025-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "One of the worst movies of all time 😂😂",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Marmaduke changed my life. Marmadukes character arc of going from a drug addict to savior of the city is insanely inspiring. My two-month old son got out of his chair and applauded until his hands fell off. The subplot with Omni-Man shook me to my core. Had me quaking in my boots. Now Pete Davidson took the already good performance of Owen Wilson in the live action movie and cranked it up to 67. \nHere let me show you guys the screenplay to one of the scenes.\n\n\nMarmaduke: NOO OMNI MAN WHY DID YOU KILL MY FAMILY GRRRRR\nOni mean: Are you sure?\nMarmaduke: yes their dead bodies are right there\nOn meme: Are you sure?\nMarmaduke: STOP TOYING WITH ME I WONT FALL FOR IT\nUNO man: Are you sure?\nMaramudke: Yes now shut up!!!!!!\nOmni ma’am: Are you sure?\nMarmaduke: Alright I didn’t think I’d have to do this but I’m bringing a CELEBRITY CAMEO\nMarkiplier: Hey everybody I’m Market pliers and today we will be playing five nights at Freddy’s\nOmmnom man:  Are you sure?\nMarket pliers: I’m not dealing with this *Grabs Marmaduke and throws him at omniman, killing them both in a suicide bombing*\n\n\n10/10 movie but would not recommend to those faint of heart.",
    "date": "2025-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Disgusting, just disgusting. I can tell he loves to fart, which is absolutely disgusting… and he also loves to cause natural disasters.. and he loves to eat eat eat eat eat! and after that he eats some more, and after that he eats so more! So yeah, I'm just gonna give this a 0/10….",
    "date": "2025-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "absolutely tragic movie",
    "date": "2025-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love this movie, it’s quite exquisite.",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The movie is painfully so bad that critics gave it a zero and I can see why. That one scene where marmaduke  lets out a huge f*rt (I’m censoring this because it’s disgusting)  is really unnecessary and disgusting. This whole movie is disgusting, the humor is not funny, the animation is not that good and the story is just not great, it’s bad. There are no emotional moments, there was one but I wouldn’t call that emotional. I don’t know what to say about the ost but it is mid.  I get that this is a kids film but kids don’t deserve to watch this slop, they deserve something better, not a movie with unfunny and disgusting f*rt jokes. If you want to watch a film about pets or animals in general then I would recommend the Secret life of pets 1 and 2, the Garfield movie (2024), lilo and stitch or Madagascar (a actual funny film with no fart jokes). So yea, this movie is hot garbage.",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "When I saw this movie I thought it was going to be EP ca but it only has weird jokes about farts, flatulence and obesity. I mean the movie is so bad it seems like an NPC came up with the idea of creating it. This crap because this movie is so bad instead of the character winning a Chinese wins as if the Chinese care more and ridiculing the Mexicans I do not recommend it",
    "date": "2025-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Holy moly guacamole. I was entranced by the beautiful dog, so I immediately printed an assortment of photos of marmaduke. I worship them, and I am not ashamed. I am not using dog shampoo? Hmm, so so special. Yes come to the big show, come see the next world dog champion, Zuess. I like when he flooded the city I laughed really hard, and marmaduke is pretty. :) watch it",
    "date": "2025-05-31"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie is so shitty that I didn't even watch it completely. I don't know how they managed to hire some famous actors for this movie.",
    "date": "2025-05-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "God a Toaster could write and render something phenomenally better than this. Absolutely abysmal.",
    "date": "2025-05-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It is bad. But not as bad as I thought it would be. It’s not terrible, but it’s bad. It’s really just a waste of time.",
    "date": "2025-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Netflix, YOU OWE PETE DAVISON AND JK SIMMONS AN APOLOGY! Yeah this was kinda awful. All the characters are just straight up boring, along with the movie being boring. Why is the animation so bad, and why is the Mom's butt so thick? Netflix just sucks at making originals sometimes.",
    "date": "2025-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "THIS MOVIE IS OKAYYY",
    "date": "2025-04-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Wow just wow this is a steaming pile of dog s**t if I was 1 I would still hate this movie did they dogs was funny because...ITS NOT pete Davidson sould have stayed far away from this movie. It sucks I hate it if I could post 0/5 stars I would",
    "date": "2025-04-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "i have never seen a more attractive movie as Marmaduke. My wife threatened to divorce me if i didn't stop sleeping with my Marmaduke body pillow every night, so of course i divorced her on the spot. Marmaduke's sheer beauty is only rivaled by Garrett \"The Garbage Man\" Garrison. also the story is cool or whatever. i could only give it 5 stars, but i would give Marmaduke 69 if i could.",
    "date": "2025-04-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Marmaduke is an almost unwatchable movie, with it's bad animation, and humor that couldn't even grab the attention of a 2 year-old. Would not watch it ever again. It's literally rated a 0.5, get the memo.",
    "date": "2025-04-13"
  }
]