[
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A sequel definitely wasn't needed and kinda worsen the original's ending. However while this movie isn't as great as the first one (and i don't think was intended to be) it's still an okay watch, not great, sometimes dumb but it's not horrible. It's just very different and don't view it as a chicken run 2",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The movie answers the question, can an unnecessary sequel be good? And honestly? Yes it can, I really enjoyed this movie and thought it was a solid continuation of the chicken run story, but it definitely has it's problems",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "In my opinion, Dawn of the Nugget is seriously underrated and is one of the most unfairly hated films, I understand that some people don’t like it because of the lack of returning cast members, but hear me out… this film is amazing!\nI love this film because of its genius story, brilliant visuals, interesting usage of CGI and some incredible scores.\nAlthough the stop motion animation makes the film look like a TV Movie, I think this was a great sequel that was worth the wait.",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "What in the world happened to you, Aardman? Once you were churning out the best stop motion movies possible, like Wallace and Gromit the curse of the were rabbit, and Chicken Run. But now, with your Chicken Run sequel, you have ruined your streak of good films. Nothing is good about this follow-up to the 2000 film. The animation is much brighter (in a bad way), all the voice actors were changed, it had no heart, the plot was bad, and lots of the film was just annoying. While Dr. Fry was a nice addition, I can't say the same about Frizzle or even Molly herself, who were not very interesting characters. While this may appeal to the younger audience, having seen the original, it just can't compare for me. Plus, aren't you giving chickens the wrong idea, that they should attack farms across the country? The first one was justified; this is pure madness. Sorry, but Sam Fell was better at directing Flushed Away.",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Consegue continuar o clássico do antecessor, mesmo com uma história mais fraca, mas consegue surpreender.",
    "date": "2025-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Chicken run 2 was pretty good! It wasn't amazing nor was it a masterpiece! But its still good! But why did the have to have Ms. Tweedy in the trailer? Aardman should've kept that as a surprise they just went stupid! 😡 and also it did add some uninteresting characters and like did we really need a chicken run sequel? But I still think it's pretty good! 7.5/10",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The original \"Chicken Run (2000)\" is one of my all-time favorite animated films, but that first movie was so well crafted and self-contained with a definitive ending, l never really wanted, let alone expected, Aardman to do a sequel. \"Dawn of the Nugget\" had some interesting ideas from a visual standpoint, but suffers from creative bankruptcy with its story that falls WAY too hard on tired family movie clichés. When people say this movie feels like one of the direct-to-DVD Disney sequels from the 2000's, I can definitely see why (I got A LOT of \"Little Mermaid 2\" and \"The Lion King 2\" vibes watching this).\n\nWith that said, I didn't hate this movie. It obviously could've been a lot better, but it wasn't a total bore to watch, either. It did manage to keep my attention for the duration of its runtime, which is more than I can say about most of the direct-to-DVD Disney sequels. It's definitely watchable.\n\nPersonally, I view \"Dawn of the Nugget\" in the same vein as \"Ghostbusters 2\" and \"Bill and Ted's Bogus Journey.\" It's not terrible, but it's definitely a step down from the original.",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I mean it's entertaining enough. The climax is great and the action is suprisingly fantastic for a movie about chickens. It's kind of a buzzkill that Mr. Tweedy didn't murder Mrs. Tweedy in the first film, but, ok. It's a little above average.",
    "date": "2025-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I used Netflix all for an Aardman project (when I always went to a movie theater & never streamed).\nOnce again, this a movie that can be as 👍 as its predecessor. The 🐔s are back & breaking into another society of 🐔s having a similar experience of what our origional friends did - it is also more disturbing because these chickens get brainwashed in some way to be slaughtered into another type of chicken food: 🍳 nuggets. It is crazy that Mrs Tweedy is back with vengeance. Well, if she could still survive falling into 🍞crumbs, maybe there can be a finale twisted trequel where she lives her target for the last time 💀☠️.\n\nThe only problem is, the unfair re-casting of Ginger - she sounds so different. The original voice still wanted to & had been able to reprise her role.",
    "date": "2025-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Quite strangely I found this film more stressful to watch than endearingly  fun.  There is a very good storyline here especially the first 1/2 with amusing sequences, but feeling longer than its running time, there are too many jumbled & silly plot twists the second 1/2 to find ultimately satisfying.  Ends up in a kind of mechanical-ish mishmash of loud chaos with too much happenstance to develop any needed hero-imagery of the main characters.",
    "date": "2025-04-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie should not have the Aardman name attached to it. It's like they sold the rights to the Chicken Run names and had an AI write a script to fill the time. It's not even entirely claymation. I honestly hope that Aardman got to pay some bills with this and that their A team gets to work on more cool stuff for the future.",
    "date": "2025-04-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "While the first film stemmed off of the “Wallace & Gromit” popularity as a renowned classic and timely testament, this two-decade follow-up not only recapture the charming delight that flowed previously but also surpasses with a sweeter heart tendered by delicately rejuvenated form and fine hilarity, gesturing as a fun invitation for families ranging grown nostalgia seekers and equally curious sprouts. (B+)",
    "date": "2025-02-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Chicken Run was a surprise to the eye, this sequel isn’t. It is entertaining in a bit, but it feels rushed and unnecessary. The storyline doesn’t really know where to go. The inside of the chicken factory feels like borrowed from Squid Game. The plot is predictable. But for a couch bench session in the evening for the smaller ones, I guess it can do.",
    "date": "2024-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "pfff, una película un poco del montón. Eso sí, la animación es increíble.",
    "date": "2024-12-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It is a good easy to watch movie, granted that it is for kids, this is not a bad thing. Just sit back and enjoy the british chickens.",
    "date": "2024-12-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The film definitely delivered from start to finish… It was amazing! Had all the charm and comedy of the first film with even more added to it to keep you glued to the telly! \n\nMassive shoutout the the voice actress of Frizzle! By far the best character in the film… she absolutely smashed it! Brought so much personality to the character! Definitely think she needs her own spin-off film!",
    "date": "2024-12-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This movie is a big downgrade from the first. The tone and color of this movie is a lot brighter, alot of the characters are no longer what they were like in the first , and the movies no longer feels as British as the first one. Very disappointing, probably one of the worst movies Aardman has ever made.",
    "date": "2024-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It has been 23 years since the previous Chicken Run. The original was a pivotal movie in the creation of the \"Best Animated Picture\" category at the Oscars. Aardman was a pioneer in the stop motion animation genre, earning 4 Oscars, usually with their duo of Wallace and Gromit. This sequel does not live up to the prestige of the original, or to the caliber we know this studio is capable of. But I know that if I were a kid, I would have liked this one more than the original.\n\nI love me a good prison break movie. Heist films like \"Mission: Impossible\" are always a good time for me. This film wastes no time in getting to the point. At about the ~10-minute mark of the film the movie presents its central conflict, and the rest of the 90 minutes is spent doing the heist. With that set up, this movie is full of suspense, action and still a good amount of classic Aardman comedy. The first film focuses more on the romance between Rocky and Ginger, where this one is far more focused on the action.\n\nThe new voice actors do a good job in their roles. It can be hard to have the same voice actors 23 years older, so I can understand the recast. Zachery Levi does not feel like he is doing a Mel Gibson impression, but he still captures the spirit of Rocky.\n\nOne of the problems of the film is in the set up. It is very...\"Little Mermaid 2\". The main characters of the previous entry are now the overprotective parents of a new protagonist. And instead of just having open and honest communication with their daughter, they shroud in mystery their reasons.\n\nNot the greatest animated film, but it a pretty decent flick. It's much like fast food. It's perfectly fine stuff, and it may come with a nice toy for the kids.",
    "date": "2024-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It truly is amazing how Aardman can bring back a classic and make us remember the lovable characters after 23 years.",
    "date": "2024-11-13"
  }
]