[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Está película es un gusto culposo para mí,haci que hay van mis poderosisimas 4.5 estrellas.",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Why even bother portraying a watered down version of Carnage in a movie bottlenecked by a PG rating purely due to corporate greed?\n\nPulp style cinema with a 90's feel and grit, R-rated ala Paul Verhoeven with the kind of aesthetique and dark comical moments of Starship Troopers and Total Recall would be an instant classic,\n\nThat was NOT Carnage.\n\nGrow up Sony.",
    "date": "2025-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A pretty entertaining sequel.\n\nVery much a switch off your brain and enjoy the ride kind of movie... think about it too much and you'll find plenty of holes.",
    "date": "2025-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "As good as the first one just amazing",
    "date": "2025-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A lot of people think it’s the best of the trilogy, but I think it’s the worst. The potential of Venom and Eddie being separated is there, but like the entire universe, it needs Spider-Man to work.",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It's funny and interesting for the Marvel symbiontes fans (like myself), great fights, great special effects and soundtrack, but in contrast, the story is weak and the same that everyone knows.",
    "date": "2025-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Tom Hardy really plays a great Venom, and if Venom himself wasn't such a loser, or this film was actually folded into the MCU this could be a great series. Woody Harrelson makes for a fun and fantastic Carnage. This movie is arguably better than the first, and the fight scenes are a lot easier to watch and understand than the fight scenes between Venom and Riot in the first film.",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "venom let there be carnage he's a really good movie because it continues where we left off venom to where we see for the first time carnage comes and starts causing chaos which caused venom to confront carnage and take down Cletus Kasady who wants revenge on Eddie Brock and his love interest wants revenge on the police chief that shot her",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Ami me gusto es mi favorita de las 3",
    "date": "2025-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Waisted potential and waaaaaaaaaaaay to rushed... This movie should have been R-rated.",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I am biased bc I love Venom so much, if I wouldn't this movie would be rated lower. But let there be carnage really brings carnage (pun intended). 66%",
    "date": "2025-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Marvel is stupid people who do not care for money if they cared about making money spider man woulda been in venom let there be carnage fighting carnage with venom but no marvel do not care about money",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It was cool, first one better",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 26 minutes!!!!!!!!!!!!!!!!!!!!! Rated PG-13 for Disturbing Material, Action, Intense Sequences of Violence, Some Strong Language and Suggestive References!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $213,500,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A bit of a step down from the original but still a solid movie",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I liked the first one. \nThis one,  not so much. \nFelt too forced and twitchy.",
    "date": "2025-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I guess you can say this is one big epic action movie.",
    "date": "2025-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Yes better then the first one! Carnage is a great Villain, More action and more story and a lot of good Humor.",
    "date": "2025-05-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Kinda whack. Love seeing venom but made little use of the amazing talent that is Tom hardy and woody Harrellson",
    "date": "2025-05-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Disgusting. A disgrace to Venom as a character and all the poor actors who played in it. The second half is semi-watchable, but the former not only has terrible VFX, but lacks in character building (especially of Shriek) and relies mostly on one-liners that rarely land. They just want to get to the fighting. There are virtually no redeeming qualities of this film.",
    "date": "2025-05-05"
  }
]