[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Solid movie about the game stop scandal!",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Energy builds nicely throughout, super funny. Likeable and grounded characters screwing over billionares is the kinda thing that's fun to route for as an audience.",
    "date": "2025-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A funny, fast-moving, and surprisingly human take on one of the internet’s wildest financial stories .This movie turns a modern financial rebellion into an entertaining crowd-pleaser.",
    "date": "2025-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "DUMB MONEY skillfully employs a character-centric approach to convey the complicated details of this oddly-inspiring real-life underdog story, delivering an intelligent dramedy with real social insight that packs a punch without ever taking itself too seriously—arguably just like the short squeezers themselves. Though the film doesn't tell the full story, it's an impressive, educational, and entertaining dramatization.",
    "date": "2025-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Movie was good. A really nice watch. Based on a true story...",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Really good movie.  Entertaining, fast paced, great feel good story.  Worth your time.",
    "date": "2025-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Held a few shares myself from early 2021 to early 2024. Although I lost about a third, it was worth every damn cent. Diamond Hands!",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Pretty fun! The moment in time it occupies is super palpable: mid-pandemic and not that long ago. The soundtrack nails that time and ties it all together nicely. The movie is fast-paced, slick, and just an enjoyable watch. Diamond hands!",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "They should’ve called this “Dumb Movie”",
    "date": "2025-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The 85% are paid actors",
    "date": "2025-06-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Not a good movie.  Dumb story that goes nowhere.   The casting is horrible.  You would have to pay me to actually watch it again",
    "date": "2025-04-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "And of course, after finding collusion by the two major Wall Street giants in e-mails, the FCC did nothing. No fines no jail time just the usual $7$; :$&@    !!!!! \nGood movie to watch when working hard at two jobs, you still can’t pay the bills.",
    "date": "2025-04-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "you have to love that movie, everyone loved the story back in 2020. stellar cast but the music is insufferable. what is it with everyone and their love affair for this idiotic rap music? it's plain, basic and boring. is this the zeitgeist? because if so, we are in the toilet.\nnext time please don't ruin a great movie with such a nerving soundtrack",
    "date": "2025-03-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "La historia es muy buena y creo que fue desaprovechada al hacerla tan sencilla y cómica, entiendo que el hecho de querer que la película sea algo digerible ante un tema tan complejo como son las operaciones en la bolsa de valores pero se perdió mucho así como el final se siente muy abrupto, por otro lado el elenco es genial y Paul Dano siempre destaca.",
    "date": "2025-03-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great cast, funny at times, and seems to stick to a truthful telling of the event. I enjoyed it.",
    "date": "2025-02-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I remember hearing about this story years ago and was really intrigued that a move was made to futher tell the story. I was excited to watch this movie, but it didn't quite line up with my expectations. I thought all of the acting was really well done, but some of the production I thought kind of missed the mark. I found that the soundtrack often came in at times and overpowered some of the acting that was going on in the scenes. That made me lower my review a bit for this film. I'm glad that I watched it, but it probably won't be one that I will rewatch to be honest.",
    "date": "2025-01-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A very entertaining and fascinating biopic about the very recent bizarrely cathartic class warfare between Reddit and Hedge Funds over the fate of GameStop through a clever series of clever financial tactics using Wall Street’s underhanded stock market tricks against them. The cast is excellent and share solid chemistry and witty banter. It’s surprisingly investing despite all of the cringey at-the-time trendy Reddit/TikTok slang/memes of the time thanks to its emotional core of the story that treats all of these characters as real people with real personal struggles that lie behind the surface that keeps them motivated to support this GameStop revolution in the first place. It’s certainly not going to be everyone’s cup of tea, but I personally had a great time watching this and would definitely recommend it.",
    "date": "2025-01-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Glad that someone decided to make a movie on the meme stock phenomenon and gladder that it turned out to be so good.",
    "date": "2025-01-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "At a glanced face value when it occurred, it piqued and acknowledged but nonetheless scrolled pass, even when its unprecedented stir proportionated. This film’s intellectual dive satisfies in clarifyingly elaborating the structural details surrounding the systematically cracked rebellious stunt with aspectual thoroughness of the affecting spree. It engages like any factually complex subjects with a deft hand and sharp, energetic performances to pure entertaining results, even when not fully interested in stocking up knowledge about the market. (B+)",
    "date": "2025-01-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Mostly B grade actors (except America Ferrera), and a script dominated by so much swearing that it takes away from the point of the movie. Set during the Covid pandemic, you can't hear the dialogue behind those wearing masks. Don’t waste your time.",
    "date": "2025-01-05"
  }
]