[
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Antonia Is..... Great",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I've been waiting for this film for three years. Unfortunately, it's very hard to love. The violence is surprisingly tame, and no murder is shown on screen. (Beware, Terrifier fans!) It's not even PG-13, it's borderline PG. The recent trend of making films as desaturated and bleak as possible has plagued Time Cut as well, which simply makes no sense since the 2000s were famously colorful to the point of tastelessness. The editing is another issue-it's too twitchy to ignore. The killer teleports so much even Jason Voorhees would get uncomfortable, and his mask is some Max Headroom knock-off. Most importantly, the script itself is so increasingly fatigued that the third act can only be described as anticlimactic and unsatisfactory.\n\nThe silver lining is that it has a variety of modern Canadian scream queens: Marina Stephenson Kerr (in a clearly reduced to blink-and-you'll-miss-it role; Channel Zero), Sydney Sabiston (All Fun and Games), Megan Best (Elevator Game) and Summer Howell (in what might be described as a cameo; Curse of Chucky). Alas, the lead actors didn't impress me that much. The soundtrack is decent and full of familiar songs of the era. The only truly satisfying thing might be the clothes-they were on-brand for the decade. The costume designer is arguably the only person involved who was actually invested in her job.\n\nAll and all, no matter how you look at Time Cut, it's just not enough. It lacks some of the vital skills of a horror film, such as being scary. It's not funny, it's not smart, it's not totally killer, and it's not even trendy. Ugh, as if!",
    "date": "2025-10-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Sayang oras, Oks sana un concept kaso andaming butas. Isa na dun e kung pano napunta sa future ang killer at ang motibo nito. Na enjoy ko naman kahit papano nang dahil sa soundtrack",
    "date": "2025-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love this 👍🩸🍿🔪",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie is horrible so dumb. So many plot holes it’s rushed doesn’t make sense at all. Characters are dumb and everything was painfully obvious and they still have to spell it out. The writers should be ashamed and change careers",
    "date": "2025-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I don't have anything to say about this movie.\nI will, however, suggest another movie with the similar time travel plot - 'Totally Killer' starring Kiernan Shipka, which is so much better than this one. It was funny and really enjoyable.",
    "date": "2025-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Interesting idea terrible execution. Didn’t enjoy the main characters acting, super monotone.",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I was going to do a long winded review instead I will say just watch Totally Killer instead",
    "date": "2025-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Surprisingly it was really good. Loved it and quin was really good actor.",
    "date": "2025-06-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Taking, \"Totally Killer\" and making it worse.",
    "date": "2025-06-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Stupid movie ever made, whole story line doesn’t make sense at all",
    "date": "2025-06-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I’m trying to find meaning in this film, I really can’t see sense even tho may be a good movie but… honestly the story is actually weak.",
    "date": "2025-05-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "More plot holes than a slice of Swiss cheese. Acting was not too bad, but they really had difficulty making the early 2000’s aesthetic believable. Script dialogue was all over the place.",
    "date": "2025-05-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Honestly, I was a pretty good movie up until the end... they ended it with way too many plot holes! They said that if Lucy saves Summer she would never have been born. But when she goes back to the future she still some how exists but her parents don't even know who she is... so she goes back to the past and lives there. How is she still existing if she doesn't even have any parents ? Her parents are apparently not even together! So she's an ophan with literally no biological parents? I don't understand... Anyways, when she goes back to the past, she tells the dude that she killed the slasher which was himself from the future and he's like, ok awesome, and then they end up being best friends. That was a little bit weird to me... But, also, why does the slasher not kill the bully, Ethan for throwing him in water if that was part of his problem with his life??\nIdk, the whole ending was just weird and confusing to me... fun movie, but too many questions.",
    "date": "2025-04-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "For a movie called “Time Cut,” the pacing is terrible. \n\nAs far as the dialogue and acting goes, imagine someone, in a very monotone voice, saying, \n“Yeah… so I went over there, and did this one thing. Then I did that other thing because I just had to, you know?”\nThat’s how it felt. \n\nNow, picture something that's supposed to be a very dramatic moment:\n\"How could you do that?\"\n😐\n...\n...\n...\n...\n😐\n\"I'm sorry.\"\n\nThe next time you're bored, and you let out a sigh, think of this movie; that's exactly what just came out of your mouth.",
    "date": "2025-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The actors did an amazing job but the story wasnt well written.  It was made clear Lucy wouldn’t be born if she saved her sister but somehow in the end she was created miraculously - disappointing really.\n\nThen the killer who is obviously 3 times the size of Quin is revealed to be the killer goes back and kills everyone but Ethan the guy who threw him in the water… if that happened why didn’t he drown?",
    "date": "2025-04-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It was a good movie with a small twist. Spoilers. It’s a girl that goes back in time when she finds the Time Machine if you call it that and goes back 11 years to stop a killer from her time line. When she does that she saves her sister and few other but changes the future. So when she save the day she decides to go back and live in the past.",
    "date": "2025-04-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Time-Travel has already made its way into the early 2000s. Unfortunately, this take suffers from the TikTokification of the early 2020s.",
    "date": "2025-03-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "A take on the “time travel paradox” that is illogical and sits at a pre-teens soapy level, as does the plot and screenplay.  The weakest component was the script writing …. hope they don’t do another movie.  The science, special effects and the minuscule budget “time machine” … woeful.",
    "date": "2025-03-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Extremely inoffensive which isn’t a good thing in this case. A concept which has been done a few times and this didn’t push it any further than the previous films and therefore felt tedious and boring. If you hadn’t seen any of these other films you might enjoy this one more than I did.",
    "date": "2025-03-14"
  }
]