[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "What a sweet film. Very well-written, delicately handled, and focused mostly on relationships, not the Men In Black trying to get the alien.",
    "date": "2025-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's all about connection. What an adorable movie is!",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Had so much potential. Weird film and the alien had no personality at all.",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This would have been a great movie if they would have just stuck to the story about the alien and this group of friends interactions with him but as with so many films these days, someone had to destroy it by inserting their social agenda into it even though it's completely irrelevant to the plot.",
    "date": "2025-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "First, I think it's important to note I've never taken time to write a movie review, but this movie compelled me to write my first. Jules was unique, heartwarming, and funny. I think it'll take a special type of person to appreciate it. Give it a chance and I think you'll enjoy the ride.",
    "date": "2025-06-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Acting the underrated.",
    "date": "2025-05-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I don't  get out to see many movies because it seems they are all cartoons, tv remakes or comic book characters. I happen to accidentally  see \"Jules\" and I felt something unusual while watching it. It felt original.\nIt was an original, it was funny, sad, quizzical, scary, hilarious, just so unique. The actors were great, very special each of them in their own way.\nI went back that week and watched it 2 more times.\nIt told story and you left with a lesson learned.\nSome might say it's  just a version of others, but I loved it.",
    "date": "2025-05-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Cute movie. I enjoyed it",
    "date": "2025-05-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This is a cute, easy to watch movie with a good vibe to it. Very family friendly also. The end was a bit meh, but overall worth a watch.",
    "date": "2025-04-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Perhaps it was my love of cats that spoiled this movie. Why dead or dying cats? Any road kill would have done or avoid it all together. I could have written a better ending.",
    "date": "2025-04-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's not often I watch a movie that captivates my attention. A twist on a story as old as sci fi tales have been around. The humour hooked me in, but the connections kept me watching.",
    "date": "2025-04-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Horribly boring and pointless.",
    "date": "2025-02-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great an insightful view of old age in our civilisation. I love it!.",
    "date": "2025-01-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "After being disappointed by the movie Oppenheimer, I came over this absolutely unknown movie. I guess it was the calm atmosphere that drew me in. How calmly the characters handled catastrophic situations reminded my of House Boat or To kill a Mockingbird, both some of my favorites. I give this movie a five star rating, while I would give only one star to the Hollywood movies currently in the theaters. Marvel movies just kill my brain, whereas Jules soothes my spirit.",
    "date": "2024-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The whole cat sacrifice thing was super disturbing I just dropped  the movie, they could have replaced it with any inanimate object, the character is so emotionless and looked like a human in costume, the movie did have a potential , I like that they were discussing aging and loneliness,but it turned very disturbing.",
    "date": "2024-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A very warm and interesting way to look at an ugly subject, that being the loss of ones faculties as they age. An uplifting and enlightening look at being old presented in a very unique way.",
    "date": "2024-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Love, understanding, and compassion are universal, in every place you go (and every planet you visit!). There is no need for word spoken.",
    "date": "2024-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Jules is a tightly contained movie concerning aging, loneliness, and purpose and nails exactly what it’s trying to be. Milton (Ben Kingsley) lives in the Western Pennsylvania town of Boonton (actually filmed in Boonton, NJ) and was living a life of concern for crosswalk and motto changes when a UFO crashes into his azaleas (he’s very concerned about the azaleas). The alien (Jade Quon), who Sandy (Harriet Sansome Harris), an acquaintance of Milton’s, names Jules, is a projection of each character’s desires in their old age. Milton appreciates Jules’ company and seems to derive enjoyment from feeding it apples, but if Jules were messy, reckless, or loud, I couldn’t imagine Milton would put up with the riff-raff. Sandy, on the other hand, dresses Jules in shirts from her daughter, who isn’t so much estranged, but just seems neglectful and preoccupied with her life out in Seattle. But despite its diminutive stature and plain, prepubescent features, Jules wields an uncanny power of the Scanners variety that it uses to full-effect sparingly. In fact, Jules was on the precipice of a DNF and landing itself on this list had it not shown restraint. What we do get is something touching and merciful. The climax and falling action are a mess and underwhelming given the possibilities of a UFO-featured movie, but the final scene will put a smile on your face just like Milton’s. It’s the beginning of a beautiful — and bizarre — friendship.",
    "date": "2024-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "They do not make movies like this anymore. It was a story! A beautiful, whimsical story!",
    "date": "2024-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Always great acting by Ben Kingsley, and a good cast. Even the mute alien is intriguing.",
    "date": "2024-10-01"
  }
]