[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Another reboot,  remake,  reimaging of a tale we've seen hundreds of times.  Tom's ego driven character is on full view as usual,  let's be honest hes Tom in everything.  Some really good and vfx and cool idea's,  the undead looks great and the crows are quite different however the complete over the top settings of set pieces gets tiring fast,  the plane sequence is just Micheal Bay fever dream fuel.  Its a watch and forget for me ! Its not the worst film and was originally planned as a springboard for a dark cinema franchise of films , including wolfman, dracula and frankenstien however this flopped hard . Watch it ,and just know Brandon's films was much much better.  Its alright at best.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I don’t get the hate for The Mummy. It has action, some jumpscares, and monsters, and is an entertaining action thriller.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The Mummy (2017) is one of those rare blockbusters that manages to implode under the weight of its own ambition. Starring Tom Cruise, the film was meant to launch Universal’s “Dark Universe,” an interconnected world of classic movie monsters reimagined for modern audiences. Instead, it served as a cautionary tale of how not to reboot a beloved franchise. What was once an exciting concept about ancient evil resurrected in the modern world becomes a jumbled, incoherent spectacle that forgets what made The Mummy franchise fun to begin with.\n\nThe biggest problem here is tone. This movie can’t decide what it wants to be. At times it tries to channel the adventurous spirit and humor that made the Brendan Fraser films so beloved, but those moments are immediately swallowed up by grim attempts at world-building and overblown action sequences that feel ripped straight out of Mission: Impossible. The result is a movie that feels like it’s constantly at war with itself—half supernatural horror, half blockbuster espionage thriller. None of it fits together.\n\nTom Cruise, normally one of the most reliable action stars in Hollywood, feels completely miscast. His character lacks charm or direction, and it’s hard to tell whether we’re supposed to root for him or not. He’s too smug to be likable, too selfish to be heroic, and too inconsistent to be compelling. What’s even more distracting is how much of the movie feels built around Cruise himself. Every scene feels tailored to showcase him rather than the story, and that ego-driven focus drains the film of any real character depth or horror atmosphere.\n\nThe screenplay doesn’t help matters. It’s chaotic, unfocused, and full of ideas that never go anywhere. The plot jumps from ancient Egypt to modern-day London with no sense of rhythm or purpose, throwing in mythology, curses, secret organizations, and forced romance all at once. By the time the movie tries to introduce Russell Crowe as Dr. Jekyll—a clumsy attempt to tease future spin-offs—it’s already clear that the “Dark Universe” was dead on arrival. The dialogue feels rushed, the pacing is exhausting, and the story itself is buried beneath endless exposition.\n\nDirector Alex Kurtzman, better known for producing than directing, struggles to maintain any kind of consistent vision. The movie is full of big, loud moments—planes crashing, sandstorms, and supernatural fights—but none of them leave a lasting impression. The horror elements are watered down, the adventure aspects lack charm, and the few attempts at humor fall completely flat. It’s a technically polished film that feels completely soulless.\n\nAt its core, The Mummy should have been a thrilling blend of mystery, horror, and adventure. Instead, it’s an overstuffed attempt at creating a cinematic universe before earning the right to do so. It sacrifices story and character for setup and spectacle. Even with its massive budget and star power, it never recaptures the magic that made audiences fall in love with the franchise in the first place.\n\nIn the end, The Mummy (2017) is a perfect example of Hollywood’s tendency to chase trends rather than tell good stories. It had the resources, the cast, and the potential to reboot a classic in spectacular fashion—but instead, it became a lifeless, overproduced mess. It tried to be everything at once and ended up being nothing at all.",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Saw it when it came out and watched it again recently years later. Like most “bombs”, when the dust settles it actually was a pretty decent movie. No where near the OG ‘99 film, but still fun popcorn fare.",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Almost no character development, no chemistry between the cast, and a weak story. Almost no memorable moments either which is crazy because this is a mummy movie. It wouldn’t even be hard to make a single scary scene, but it never happened.",
    "date": "2025-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I would have been disappointed if I had paid money to see this movie, however, watching it on a streaming service I’m already paying for made it not so horrible. It’s a middle of the road film ok to watch but don’t go out of your way for it.",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "CALL ME BASIC I DON'T GIVE A F I JUST REWATCHED THIS FILM AND IT'S LITERALLY A GOOD MOVIE I DON'T REALLY LIKE ACTION MOVIES BUT THIS ONE IS FIRE LIKE BFR RN THIS MOVIE IS GOOD THAT'S ALL I HAVE TO SAY IMMA JUST LEAVE THIS RIGHT HERE",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I can´t remember if I have ever seen this 2013 movie before today. If I did I totally forgot about it. And it is fair to say I will forget again. Nothing in it is remarkable. I fastforward all the action, explosions and rubish content trying to stop on content. There were none. The only thing I took out of this movie was its breef mention to British Crossrail archaeology in the introduction credits. I google it and that was much more interesting! Recomend a google search to London's Crossrail findings.",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "One of the worst movies I've ever seen.",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Tom Cruise trying to mimic Brendan Fraser...terrible",
    "date": "2025-09-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Horrible movie in every way.",
    "date": "2025-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "the mummy 2017 is a good reboot for the mummy series but not a good start for universal dark universe trilogy and the mummy 2017 does not have the main cast in the movie that's why fans of the 1999 the mummy did not like the 2017 reboot with Tom Cruise they felt like it was just a reset to the mummy trilogy and not a direct sequel set after the mummy tomb of the Dragon emperor",
    "date": "2025-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1 hour and 47 minutes!!!!!!!!!!!!!!!!!!!!!!!!!! Rated PG-13 for Partial Nudity, Action and Scary Images, Some Suggestive Content and Violence!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $157,100,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Tom cruise should stick to mission impossible and not ruin other movie titles",
    "date": "2025-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Underrated but nowhere near as good as Fraser’s",
    "date": "2025-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Not CGI slop from Tom. I had no clue this had its own 'universal dark pictures' studio logo and a full Jekyll and Hyde character. Setting up Cruise as the actual mummy for the franchise is just an awful decision, no wonder it died off so quickly.",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Fun start that loses its vision",
    "date": "2025-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The Mummy (2017) is a Tom Cruise film with its action and explosions. This travesty is a complete nonsense that lacks the same fantasy and adventure as the first 1999 film.",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The 2017 version of the mummy gets a bad wrap.  I don't really understand why critics could call this one of the worst movie's of the year.  The mummy is actually really creepy and funny at the same time.  Is it better than the Brendan Fraser movies? I think it is in my opinion 🤔 but those movies have their good entertainment value as well.  I would give this movie an 87/100 for what it is.",
    "date": "2025-07-18"
  }
]