[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Love. It so much it is so good",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It’s too serious who wanna watch this garbage this is barely a movie anymore",
    "date": "2025-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Direção: Ruim\nAtuação: Ruim\nRoteiro: Ruim\nCaracterização: Ok\nSoundtrack: Ruim",
    "date": "2025-02-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This movie was good; but, the acting especially the kids seemed really forced and not the best. But the theme and overall premise of the movie was great!",
    "date": "2025-02-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Corny and ultimately unconvincing on all levels. Some very bad acting except for Barkhad Abdi, who deserves better roles than this.",
    "date": "2025-01-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Garbage movie not even close to reality",
    "date": "2024-12-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Some decent acting by the main character is utterly demolished by terrible sports scenes and a completely unbelievable plot. In his first run ever, Tyson collapses after a gentle lap around the track, but a week later he runs 15 miles. Extras portraying elite marathoners look like gym rats and  offensive linemen doing 8-minute miles. The finish line scene is stupefyingly unrealistic—Tyson catches up and overtakes the lead runner by clocking several consecutive four minute miles. In the final 100 meters they are glaring at each other instead of looking straight ahead: No middle-school cross country runner would make that mistake, much less elite marathoners. Looked it up afterward and sure enough: The claim of being based on a true story was totally false.",
    "date": "2024-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Worst movie I have ever seen. The acting is so bad I almost started crying. I feel like I am watching a corny Disney show. If I could give this movie negative stars I would. I would rather eat dog poop than watch this movie again. I hate this movie. This movie is so unrealistic it is sad.",
    "date": "2024-05-20"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Really, really, really bad. It could have been better, just by being more real. Tyson has a lot on his plate including an awful father, overprotective mother; but we have to pile on. Unrealistically bad bullies, unsupportive teachers, and a villainous mayor.  Not to mention the rattle snake.  The message of the film is winning is all that matters. Finishing a marathon isn't good enough. You have to win.  Otherwise no one will love or accept you. Terrible. As an actual distance runner who has run multiple marathons I found it insulting in its depiction of the sport and spirit of the event. Only few can compete to win (I could not even come close); but that's not what motivates someone to months of training. We are all winners, just for coming together to share a challenge and cross the finish with our heads and hands in the air. How about that as a message?",
    "date": "2024-04-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Not worth the time. Overly dramatic and not a good depiction of a person with autism. Not based on a true story!!!!",
    "date": "2024-04-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I love the idea of it, but all of the young actor's acting was horrific. They could have casted way better teens for the job. Their bad acting looks almost on purpose. I don't know. I need a actor's to draw me in and make me believe the words they are speaking.",
    "date": "2024-03-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This sports movie was really good. Major Dodson, Amy Smart, Rory Cochrane, Barkhad Abdi, Layla Felder, and the rest of the cast did a great job in this movie. This true story about a teenage boy with autism running in a marathon was dramatic, inspirational, and heartfelt. It's about doing what you love and proving to others that even though you're mentally challenged, you can still accomplish your ultimate goals in life. If you haven't seen this movie yet, check it out sometime. It's a definite must see.",
    "date": "2024-03-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Very sweet movie, I enjoyed it a lot. Though it claims to be based on a true story, it is in fact not at all based on a true story but rather true events. The portrayal of the struggles families face when it comes to having a child on the spectrum in high school was very realistic. It can be very nerve wracking and stressful especially when it comes to bullying and being  overprotective. I also really loved the development of the relationship between Tyson and his father during the movie, it was incredibly moving and powerful. Tyson's willingness to approach people and make friends with Aklilu, which inspired him to train to run in the marathon was in itself very inspiring. This movie has you rooting for Tyson from beginning to end and hoping for only the best possible outcomes for him and his family.",
    "date": "2024-03-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The acting was painful to watch. Rory Cochrane as the dad was one-dimensional and robotic. The movie was filled with cliche moments with acting that was forced and amateur. It was so bad that it actually made me angry! I couldn't watch it through to the end.",
    "date": "2024-03-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "There are just too many parts of this film we have seen before, and done much better. It gets really schmaltzy with the ever so wise and perfect Akilu. In addition, Tyson's body type did not match that of a marathon runner. It just seemed wrapped up too nicely, with all the suspense of an old \"After School Special\".",
    "date": "2024-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Feel good running movie.  Everything about it was cheesy, from the sob stories to the feel good vibes and the speeches about not judging people.  I didn't care for it at all, but I could see why someone might like it.  The one about the kid who ran the Boston Marathon to get his mom out of a coma was better (and oddly felt more realistic!)",
    "date": "2024-03-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The storyline was fine but I could not get past the horrible acting.",
    "date": "2024-03-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Heartwarming and full of moments that will leave you jumping from tears to cheers. Don't miss this little gem of a movie!",
    "date": "2024-03-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "One of the worst movies ever made about running.  Unrealistic in every sense, from a boy that can barely run a lap around the track, who in a few months can now run sub 4 minute miles at the end of a marathon, WOW.  The back story about the running store owner who has been banned because of blood doping isn't even plausible.  He claims he was disqualified because of misunderstanding the label on the cold medicine he took, that's not blood doping that's a PED violation.  If it actually happened he wouldn't be banned for life, but for a year at most.  Garbage movie.",
    "date": "2024-03-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Let's start with the story of the marathon...no kid of 15 is running 9 minutes for two miles near the end of the marathon...and the implied 4 minute mile finish is ludicrous.  Then there is the acting...hopefully except for tyson and the running shop owner, none of these folks will ever be on the screen again...the script is okay, but the story too over the top to be believed...even the father's multiple state championships is unbelievable...school kids are the most believable. Enough Said...save yourself the time, don't watch.",
    "date": "2024-03-20"
  }
]