[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This whole movie is a mistake",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "JUST HORRIBLE when I head about the megamind 2 movie i got so excited just to be unbelievably disappointed the animation is just so lazy the humor is just unfunny and corny the story is weak as well all i got to say.",
    "date": "2025-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "There is no Easter bunny, there is no tooth fairy, and there is no megamind sequel",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "In the history of cinema, a sequel must feel as genuine as the first film. Else this would cause huge complications. Well, I feel sad for DreamWorks because the Megamind vs. the Doom Syndicate is a sequel that was entirely ruined. This is likely due to the choppy animation style and the rushed planning, leading to a direct-to-video television animated film. Strange name right?\nLet's just say DreamWorks wanted to keep the budget silent enough, because they knew it was not going to work. So they distributed the film primarily through Peacock, which supports the direct-to-video television production. This is a red flag that tells you the movie is not worth it. But anyways, the visual style looks like DreamWorks evolved backwards for a bit. The first Megamind had clear visuals, realistic textures, professional rendering and sound creation, and supported the stereoscopic 3D viewing format to push the limits of cinema. The animation had feeling, just like Pixar, and wasn't a cashgrab. The second one, once the trailer was seen, felt choppy, cringe, full of animation glitches, unrealistic like it was a decade ago, and was rigged by streaming platforms. This is what happens when the direction isn't interested in the movie, leading DreamWorks employees to disrupt the entire project. I feel dissapointed about one of my animation companies when they fumble a sequel to a successful movie.\nP. S. You should've brung Metroman to do the arm swings too",
    "date": "2025-10-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Megamente vs o sindicato da perdição mais conhecido como meramente 2 e maravilhoso a animação e linda o roteiro e bom a trilha sonora e boa as piadas são boas os vilões são bons e muito engraçados o meramente tá muito bom nesse filme e a Rosane Rocha também eles fazem um casal perfeito o truta tá ilario eu ri com todas as piadas dele meramente 2 e 10/10",
    "date": "2025-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "it's hilarious that rotten tomato's decided to add a movie that just straight up does not exist. what a cool little thought experiment.",
    "date": "2025-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie does not exist okay? It does not exist!",
    "date": "2025-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I wish I could give this 0 stars. THIS SUCKS! DELETE THIS MOVIE OFF OF ALL MOVIE SERVERS NOW!",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Yeah I do not recommend it",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I cant get this thing 0 Stars\n\nThats the perfect example of how to ruin a good Movie, bc of greed.",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The animation is a major turn-off for me because it’s just so 'wonky,' and I've seen that a lot of other people feel the same way. The movements are off, and it really ruins the viewing experience.",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie is so bad I couldn't even have the heart to goon to my king megamind. 😢",
    "date": "2025-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is the reason why DreamWorks can't be trusted with long awaited sequels more than a decade in the making.\nThe CGI is terrible, the villains are rip-offs of Miraculous Ladybug and no returning cast members.\nThis was never meant to be made, it was only done because DreamWorks wanted a Bad Guys TV series on Netflix, but for some reason it didn't materialise.\nBut this is a blasphemous disgrace to Megamind, end of.",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The things I’m starting to realize about sequels… THERE NOT NEEDED SOMETIMES. This movie is the opposite of persuasive it’s unconvincing. Its literally looks like a toddler wrote and directed this piece of nothing",
    "date": "2025-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "So I watch it last yea a lot of people said it terrible but me personally the casting , the story , the show was just straight up  so what decent overall I gave it a 90/5",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Oh, no. Something went wrong.",
    "date": "2025-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I didn't even watch it for like 10 minutes and it was already terrible. My bro is so chopped, how on earth did they go from peak entertainment to terrible garbage. I refuse to believe that's the actual sequel.",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "They slaughtered him.",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑😑",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "mega shoulder dislocation",
    "date": "2025-07-23"
  }
]