[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Let's start with the fact that I fell asleep while watching this movie. I watched it till the end this morning and I gotta say ... It's boring af and unnecessarily long.\n\nBased on the true story but over the movie frankly not much is going on... Don't waste 2 hours of your life I guess, Idk... & because of acting, acting wise it wasn't bad at all.",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Can’t remember what I thought of it tbh . Think it was good",
    "date": "2025-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I was slow to watch this movie for awhile.  It just seemed like it would drag on a bit.  I was actually enjoyed it. It was well directed and very well acted esp by Jessica Chastain.  Although predictable, the tone was creepy  and dramatic enough to keep you on edge.  It’s worth your time",
    "date": "2025-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent acting. Scary story of people being killed by a night nurse in ICU",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The movie was fine, a well rounded scripted, good actors and actresses, and even a mysterious score that loomed over the film. I just feel that this film dragged a bit too much. It just got so slow near the middle when he’d already committed all the murders, you think “well, I guess now we are getting close to the end of the film. Not much else they can do right?” WRONG! 50 minutes left. This would have been a great tv movie with an hour twenty runtime. 3/5 stars.",
    "date": "2025-06-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "good movie, Eddie Redmayne is so underrated, and Jessica good as always",
    "date": "2025-04-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Very slow. I watched half of it then I got tired of it.",
    "date": "2025-01-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "“You think you know somebody”, a deceived line that became a basic foundation for plotting suspenseful thrillers – to a particular heightened extent – whereas the protagonist must grapple acquainted senses towards another’s swift malevolence. Alfred Hitchcock certainly characterized around that very saying while occasionally placing a macguffin that traces connective malicious intents to the now-weary protagonist who must tread carefully, and survive, in preventing the spree from going further. With that in mind, filmmakers seem to have acknowledged the formulaic effect with enough grounded realism to immerse and captivate viewers into the structural dimension akin to how it would occur situationally. There was that kind of potential over the factual coverage for “The Good Nurse”, but it seems instead your ordinary showcase that excels rather than thinking inspired creativity.\n\nWhat truly intrigues how much the narrative is lesser known despite the subtle notoriety undermining the medical industry to go into contractual silence just to protect their trustworthy integrity. The film acts as a crime thriller in a differential environment you wouldn’t expect to occur then built as a platform to scathingly remember the circumstances that question ethics (amid sporadic criticism towards the very industry), and the surrounding artistic license jointly aims to assist in forming a grasp of the leaning themes. As indicated, this film is based on a true story about a nurse named Charles Cullen, thoughtful and empathetic approachably upfront but questionable when suspicions arise in the events of many patients’ mysteriously sudden deaths when put under his care (the paperwork afterwords were filled cautiously and unethically by his supervisors to avoid scandal). The method he’d used was injecting another dangerous chemical into the IV bags, prepped to replace the emptied usage for the patient’s continuous treatment, whether or not initially prognosed to make it through. He’s been doing that for 16 years across multiple hospitals he kept moving to, before eventually fired over trivial reasons, but the actual push is rightful suspicions the heads couldn’t handle anymore. His later confession’s snide remark states that they never stopped him. He’s currently serving 18 life sentences, from confirming many identified deaths, per cleared memory, amounted at double-digit that could go high as 400 patients he’d killed under the radar.\n\nCullen’s serial killer spree was driven by his own mental instability, no matter how basically experienced and knowledgably educated he is in the field that maintained his employment from one hospital to another. Those who haven’t seen the headlines, probably due to buried history but not forgotten to prevent from ever repeating, are nonetheless lured to this true crime story promisingly thrilling, till Cullen’s complexity evokes one’s own glancing at the facts regarding his life story to decrypt his psychoanalysis. (Although, much of this might’ve gotten covered in the complemented documentary “Capturing the Killer Nurse”). Who finally saw through him was Amy Loughren, a single mother and compassionate nurse who struggled the demanding night shift in the ICU trying to build up her eligibility for health insurance to cover her life-threatening heart disease, which she kept disclosed from her peers. When Charles entered the picture, not only did he lighten her load but the two developed a strong friendship as she trusts him with her condition in secret whilst becoming her life’s main support. But once the mysterious deaths set off an investigation that points out Charles as the main suspect, Amy at first readily defended his innocence till a shocking find forced her to risk her life and her children’s safety to uncover the truth in two-folded secret.\n\nStraight-forward in factual deliverance that manage to thrill at a minimum under impeccable dramatization to slightly be taken as character study if not equipped with background information that insisted imperative depth. Between expectations and how it turned out, the proper form director Tobias Lindholm should’ve taken when helming the story to visual life is actually considering Hitchcock’s approach that could replicate the weighing atmosphere to suspense over studious caution. Perhaps just obtaining background information midway through duration must’ve damped the given structural narrative, but anyone already aware of the story would observe against speculation and/or memory akin to being informatively equipped either way that opened up what could suggestively make it all the more authentic. Lindholm arguably did just that but to lesser convincing with zero shock value when leaning towards the obvious. Are we seeking to see how the story unfolds or to find any sort of thrills justified? This could also suggest how factually-based coverages with lingering sensations become noteworthy adaptations to be approached differently than coasting on existing facts related to being spoiled. Besides, Lindholm actually did replicate another renowned endeavor in his 2015’s “A War” after Stanley Kramer’s “Path to Glory”. Score composed by Biosphere and Jody Lee Lips’ observative cinematography backs up the chills when decently built by Krysty Wilson-Carins’ somewhat subpar screenplay.\n\nEddie Redmayne’s ever remarkable talent in embodying ranges of heavy desires with eccentric calmness as his charm did the most diving in embracing his troubled character with stunning ascendence. And Jessica Chastain has a credible stature to match Amy’s humane compassion and conflict so perfectly that it puts us in a vulnerable grip. The agreeably well-matched pair outstandingly leads the film’s uncertain flow of events, alongside Nnamdi Asomugha’s provocation in challenging the (medical) industry’s problematic ethics which further show how nuanced the reactivities are as they lend their own criticism. Those affected hospitals will forever be haunted by how they should’ve handled then actually addressed those concerns rather than worrying about their credibility due to a potentially unfathomable scandal that already made newly arrived patients uneased, especially unable to know what’s next when departing those beds either physically or spiritually. “The Good Nurse” excelled as a typical showcase with slightly chilling buildup whilst resurfacing a story to generally spread awareness to sharpen many appliable focuses, despite not also envisioning a more effective approach to mirror those flattened shocks. (B+)",
    "date": "2024-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Good movie about a killer nurse who goes to every hospital that something would happen.",
    "date": "2024-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A well performed but familiar story we’ve all seen before, only this lacks the suspense of similar films.  It’s a Lifetime movie with a better cast.",
    "date": "2024-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I got one question does anybody know that this is based on stuff that actually happened. I'm pretty sure there's another movie about this same thing. But the murder nurse was a real person. And he really did get away with it for like 10 years.",
    "date": "2024-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This was such a alow moving movie, I almost fell asleep several times.",
    "date": "2024-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Watched this movie today. I absolutely loved it!! I thought I recognized Eddie redmayne from Les Miserables. (He did great)",
    "date": "2024-06-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Sometimes, the people who are supposed to care for you are actually a lot more dangerous then any ailment! Amy Loughren is an overworked nurse whose friendship with the charming Charlie Cullen seemingly takes a load off of her, only for her to suspect that Charlie is actually a lot more sinister then he presents. The story of the notorious serial killer who watched his patients die manages to hit the right amount of paranoia and fear!",
    "date": "2024-04-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Very hard to watch, my boyfriend and I couldn't even finish the movie we got so bored. Very slow paced and not enough thrill into the movie. DONT WASTE YOUR TIME ON THIS MOVIE LONGEST MOVIE EVER. I ABSOLUTELY DO NOT RECOMMEND IF YOU OR YOUR MAN HAVE ADHD!! I CANT I CANT I CANT ✌🏼",
    "date": "2024-04-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Intense movie that got me at my core of how someone could do what he was doing but grateful for the good nurse!",
    "date": "2024-03-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Chastain and Redmayne are very good in this and they carry the film. The real villain of the piece, though, is not Redmayne but the medical \"system\", which allows all the evil to carry on by just moving it along and making it someone else's problem. Alongside this, Chastain's character can't pay for (and so cannot have) her own life saving surgery. \nReflect on the fact that this is a true story. If there was ever an argument for the NHS, this is it.",
    "date": "2024-03-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Well acted but this feels stretched out for no good reason. I think there's a tighter and more dramatic version of this story",
    "date": "2024-02-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "\"The Good Nurse\" is a film portraying the life of real life serial killer Charles Cullen (Eddie Redmayne), who is one of the most prolific serial killers of all time. Suspected of killing up to 400 patients during his sixteen years of practice, nurse Cullen is a quiet, awkward nurse who arrives at the hospital ward of fellow nurse Amy (Jessica Chastain). At first he is incredibly helpful to her and her kids, but after a suspicious death of a patient, local law enforcement becomes involved. With their hands bound by red tape and litigious hospital administrators, two intrepid major crimes detectives (Nnamdi Asomugha & Noah Emmerich) dig for the truth. It is only with the help of nurse Amy that they finally uncover the truth, not only of nurse Cullen's horrific crimes, but of the series of hospitals that negligently suppressed their suspicions and quietly released him, allowing him to continue his spree for years.\n\nOverall, those who are familiar with the case ahead of seeing this movie will be entertained, as it adds some emotional backdrop to the tapestry of events that take place within this film. If you are unfamiliar with the backstory it may have less of an effect, but is still worth watching due to the superb acting and cinematography, although the dialogue is a bit stilted at times. I rate this movie 3.5 stars and would definitely recommend this film, however there is no need to rush this to the top of the list. Still, it is definitely worth a watch.",
    "date": "2024-02-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Intriguing movie that showcases the harsh truth and also the conflict deception.",
    "date": "2024-02-13"
  }
]