[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It doesn’t help that the perpetrator has no reasonable purpose and the movie doesn’t attempt to characterize his motivation.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "gripping thriller that kept me hooked almost the whole time",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "An uncommon premise with the famous Cat-and-mouse theme. A story that personifies the angel of death and nature's authority over all things living. Great aerial views of the vastness of woodlands. Realistic performances by the cast playing the two major roles very well. Excellent sound and visual effects. Don't Move is brilliant in it's simplicity and keeping the audience hitched with it's relentless agitating.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "a solid and gory thriller, not particularly scary but a great revenge/survival story",
    "date": "2025-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This was horrible. There is no purpose to it and it makes 0 sense. The guy saved iris just for his motive to kill himself again. I would NOT recommend, you will wait for something to happen and nothing will and the dumbest stuff happens. Richard gets shot 4 times and can somehow still swim it’s so dumb",
    "date": "2025-09-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I really wanted to like this movie.it starts off interesting but quickly becomes predictable and boring. I could guess how every turn of the story would go, and I want to be surprised watching a new movie. It's a slow burn, too slow.\n\nThe ending is, well, predictable as well. I don't think a serial killer would give someone this many chances. I would have loved seeing this play out more in the eyes of the serial killer. What's his drive? What's the story? The script isn't as psychological as many other movies out there, and it falls pretty flat.",
    "date": "2025-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was a very good movie I absolutely enjoyed it I’d totally watch again!",
    "date": "2025-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Not terrible. Finn Wittrock is such a great villain, also was great in AHS. He makes this movie better than it should be.",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Enjoyable movie with an interesting concept. For the most part, nothing new or inventive with plot though. The movie plays out pretty much like you would expect.",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Bro, it feels a lot like other suspense movies I’ve seen. That was my first reaction watching Don’t Move. The truth is, the film even tries to innovate in its theme—and it does, partly. It brings tense scenes, moments where people with anxiety (like me) will feel rage, will scream. But that’s not enough. The movie slips badly in the script. The cabin scene goes by in a flash. Well, of course—it’s not very long, and the film’s pacing gives off a lazy writing vibe, as if each scene just “happens,” with no strong purpose. There’s a lack of clear motivation from the killer, no backstory for the victim or the serial killer, and no explanation of how he got there: to the park, the cliff. Sure, with everything I pointed out, the film would need to be a bit longer. That weakens the whole experience.\nIt’s not just about suspense or jump scares. It’s about building tension with substance—and Don’t Move doesn’t do that. Nowadays, a lot of what we see isn’t about quality, but quantity. And that seems to be the case here: a movie with few actors, few locations, and probably a limited budget. Did something come out of it? Yes. Good? I don’t think so. Watchable? Like all of them, yes.",
    "date": "2025-06-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Enjoyable in a distasteful way. Neat concept. Some good cinematic moments",
    "date": "2025-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Worst movie I've EVER seen, whoever wrote it, directed it and decided to act in it should seriously get checked up, Andrew, Richard or whatever his name is, is NOT so tuff bru idc who tf he lost, Typical movie where the killer is so smart and cunning but dies in the last second of the film, Andrew somehow is so physically strong to survive a car crash, fighting an old man, fighting a cop, a knife to the neck and three bullets, AND he still manages to swim to shore! Wow! Bravo really. No backstory at all as to why he's doing all this or what he was going to do with Iris if all these things didn't happen, besides learning about a dead chic named Chloe. The actors did a good job, but seriously get real",
    "date": "2025-06-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Absolute nonsense. Always knew she would survive, so it became more about what fantastic situations she would get out off. Expected her husband to have rocked up to save her because he tracked her watch or some nonsense.",
    "date": "2025-06-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Paced well and tense.  Wish the girl would have stopped moaning from time to time.  Got annoying after a while",
    "date": "2025-04-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Despite the difficulty of perception and the lack of a denouement, this is a very good film in which the genres of drama and horror are masterfully intertwined, and many fans of these genres will be interested.",
    "date": "2025-03-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Nothing new here, woman with emotional trauma is stalked by crazy white guy in the wild with very weak motives, only to outsmart and overpower him rather easily in the end after spending half the film as a chemically induced dead fish. The ending is abrupt and unsurprising.",
    "date": "2025-03-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "El genero survival horror no es tan apreciado como debería porque de vez en cuando mete estas joyitas. Historia simple pero que si logra engancharte emocionalmente desde el principio ya tiene el trabajo hecho para tenerte una hora y media al borde del asiento. Buena dirección, tan así que te muestra hermosos planos de un paisaje espectacular mientras te hace sentir encerrado por lo que esta aconteciendo. Excelentes actuaciones. El contenido de streaming que vale la pena ver.",
    "date": "2025-03-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I honestly just didn’t enjoy it. I appreciate what the story was meant to represent how it was executed. I just didn’t care about it.",
    "date": "2025-03-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I don’t think it deserves all the bad reviews to be honest. It’s not a spectacular movie but it’s worth a watch.",
    "date": "2025-03-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Unbelievable. Dull. Boring.  Very similar to 2020's thriller called Alone but not nearly as entertaining.  Maybe the ending was worth it but I wouldn't know.  After 45 minutes I couldn't take it anymore.",
    "date": "2025-03-12"
  }
]