[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "What the frick kind of name is Gonker",
    "date": "2025-05-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This could have been a feel good story, but main character is very irritating and self absorbed. The script was grade D at best. Not worth the watch. I only made it part way though.",
    "date": "2024-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I Loved it, yes sometimes it could feel over reacted and very unreal but as someone who’s dog was ran over I know the feeling of technically losing a dog and I would do anything to get my best bud back.",
    "date": "2024-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Overly dramatic & cringy at times, basically a wealthy couple help their coddled & snowflake of a young adult son find his lost dog. 🙄",
    "date": "2024-03-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Sometimes you know instinctively that a movie is not good in a critical sense, but you feel it working on you in spite of yourself. There's nothing to do but sit back and let it happen. This is one of those occasions. Based on a true story, although a lot of liberties were reportedly taken to make it more family friendly, I found this to be a simple but effective little movie. Schmaltzy? Yes. Cliched? Yes. But effective. And I'm happy to recommend any decent family movie, although I think smaller children might grow bored with many of the scenes not featuring the pooch. Even at a mere 95 minutes, it does feel a bit long, and it could have used a bit more editing. Flashbacks involving Williams-Paisley as a child could have been excised. This is basically a Hallmark version of events - even the direst of moments feel overly sanitized, including a potential bar fight that is unintentionally funny. All that being said, I started preparing myself halfway through the movie for a couple of teardrops to be shed by the end. And I wasn't wrong.",
    "date": "2024-01-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It was a sweet story. It's not great. It's not bad. It definitely passes time. I'd recommend.",
    "date": "2024-01-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Painful to watch. The worst of all is that this is based on a true story.",
    "date": "2023-12-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Wow! This movie was bad. My kids liked it well enough, but the characters, storyline, and themes were all so cliche and over the top that I couldn't resist mocking it as we watched (which actually made it fun). Rob Lowe must have owed someone a favor for this role!",
    "date": "2023-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Dog Gone is a somewhat charming but mostly cheesy movie that is about a dog named Gonker that goes missing and the owners go through major lengths to find him. This movie really shines with the cast, which primarily consists of the family members Fielding, who is the dog's owner, played by Johnny Berchtold, the Dad which is played by Rob Lowe, and the mom which is played by Kimberly Williams-Paisley. All three of the actors have this great family dynamic, especially the Dad and Fielding who struggle to get along throughout the movie but as they search for Gonker together, their adventure kind of brings them closer together. And I feel like as the family is searching for the dog and we get to develop these other plots to keep the story going, it kind of feels like the movie sort of loses its identity and tries to be a dog story, and a father/son story. There's also a lot of other factors to the movie where they try to keep you watching but at the end of the day, the story is just mediocre which has to do with the writing mostly. This movie had interesting ideas that might have sounded great on paper but the execution failed for the most part. If you were going into this movie expecting a dog movie, this isn't what you'll get honestly since it does deal with the dog going missing. Overall, Dog Gone has charm and has some great moments between characters that will touch some people but the writing, the story, and the movie in general is mediocre. C+",
    "date": "2023-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Dog Gone - 7/10. I love dog oriented films! I'm a sucker for a movie where the dog is a main character. Dog Gone is a \"based on a true story\" film about a young college kid who adopts a dog while at college. Trying to find his way in life, he and the dog go back home after college, as his parents and friends unintentionally pressure him to figure out what to do in life. Though initially not wanting to have the dog in the home, the parents warm up to the idea as the dog brings joy and all with its presence. After an incident where they find out the dog has an auto immune disease that needs to be treated with medicine once a month, the dog gets lost one day, and the dad and son must go find it in a race against time before the medicine wears out. Its a simple film, not an amazing one, but it captures some things really nicely. Its definitely one of the better Netflix productions in recent times, and it is a good family friendly watch. An okay film with an adorable dog as one of the leads!",
    "date": "2023-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Waaay too sappy . Great premise and set up , but it's like a script out of 1975 Disney.  Maybe the dog ran away because his family is too corny lol. Still, it's a positive dog movie and I love dogs so that's worth an extra star...",
    "date": "2023-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Anyone who knows me would know that I love dogs and pretty much any animal which is why I watched this movie and because it's based upon a true story. I don't really watch these types of movies anymore like I used to do back then but, this one was really good and I don't think I've seen any Dog related movie that was this good since Marley & Me.",
    "date": "2023-04-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Ultimately, Dog Gone is a rather dull story, without any meaningful surprises. The protagonists are uninspiring, making it at times difficult to root for their success. However, the story is, at its core, inspiring, showing the lengths people will go to under  certain circumstances, which ultimately saves this movie from being truly awful.",
    "date": "2023-03-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The movie tried so hard to make the dog so quirky and different from other dogs. The part where they rushed the dog into the vets with a bloody stretcher has me dead, the dogs not eating or playing it wasnt seizing on the floor and no way any respectable vet clinic would pull out a stretcher assuming the worst case scenario before preforming a health check. The only good part of the movie was Oji! the dog is like any other dog and his humans are just too narcissistic to see otherwise, if one more line saying \"hes not any ordinary dog\" or anything along the lines of that i would of died. The movies good for a hate watch and you will have a good laugh at how unbelievably stupid it is!",
    "date": "2023-01-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Not good.  Rob Lowe has some good moments and there is some comedic delivery that lands.  And there is also some decent emotion at some parts.  But apart from that, Dog Gone was just dull and boring for most of the runtime.",
    "date": "2023-01-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "If you want to see a movie about the world's most entitled young adult complain about people wanting him to do something with his life, while disliking the parents that room and board him, pay for all his dogs needs, support his expensive search, and basically do everything but remove a limb for him... all while he tells them they don't love him, then this is the film for you.",
    "date": "2023-01-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This Is a very good and sad movie\nThen when I saw Feilding Fall I got scared",
    "date": "2023-01-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A feel good movie indeed!",
    "date": "2023-01-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved this movie!!",
    "date": "2023-01-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Cute dog. Cool true story. Unfortunately Dog Gone treads lightly on the drama, and you don't feel too deeply for the young man that lost his dog in the mountains. Lowe and Williams-Paisley as parents are good...but it's a stretch to make this tug on the heart strings.",
    "date": "2023-01-22"
  }
]