[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "While the film was good in production, it just felt so messy. They were adding random storylines that feel very rushed and thrown in our faces. I wish they had taken their time with each storyline or had slowly fed it to us in other movies.",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "WHAT A BAG OF SHITE, All those big stars and not an ounce of a decent film, how can the big stars think this was a good film, it was disgraceful, I know the films are tongue in cheek,  but JESUS this was ridiculous,  whatva waste of film making money, and people's time to fall asleep while watching diarrhoea. I wouldn't pay anyone to be in this film. SHITE......",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A solid cast with a good enough story it’s a good movie for the franchise but is too slow at times to be anything above a 6/10.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Mediocre story and too long at some parts.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Just stop already. They should've stopped after the second one. Not to mention anything with Vin Diesel is going to be bad. He ruins movies with his inability to act. He's literally the same character in every movie he does. I turned it off after thirty minutes.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Love the fast and furious",
    "date": "2025-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Same opinion as Fast and Furious 9",
    "date": "2025-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "What a snoozefest. Left with a cliffhanger to boot.",
    "date": "2025-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Seemed to be same story line as all the others. A lot of far fetched scenes with the cars. I mean, come on the car isn’t gonna fly, smh!",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Movie is fine but the fatigue of this franchise pulls it down",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The franchise has been increasingly bonkers and over the top, but remained watchable (barely). This one however must be one of the silliest films I've ever seen. I'm just glad I had my phone to distract me as I quickly grew bored of the pointless cameos and mind numbing explosions and CGI.",
    "date": "2025-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely great mimosa’s amazing",
    "date": "2025-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Worth a watch if you've followed the series. The female totty increase and a few old faces return from the \"dead.\" Didn't rate Jason Momoa as Dante Reyes. Bonkers, warped, deranged and downright nuts (he wears a tutu/skirt fgs and tries to be a ballerina I mean WTF?). Genuine shock at the mid credits scene. Sets us up perfectly for the series finale next year.",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Comedy sequels don't have the best track record. The structure of comedies do not lend themselves to follow ups. Jokes are never as funny the second time you hear them, and this comedy repeats a LOT of jokes from the first one. To complicate matters further, it has been about 30 years since the previous movie. That makes this a legacy comedy sequel. It has a similar problem to \"Space Jam: a New Legacy\". The final act of both films involve some nonsense version of the sport. It makes it hard for the audience to follow or feel any suspense when they don't know by what rules they are being measured.\n\nThe cameos they have, particularly with the professional athletes, are very funny. The new villains present an interesting foe for Gilmore. And the new character stuff for Happy is... an inconsistent tone. Like, this is material that isn't good enough to be serious and is too serious to be funny.",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Written by ChatGPT and it’s not fast and furious. I mean Harry Potter from the first to last movies you know what to expect, Harry and hogwarts. With this Paul walker street racing in a skyline to John cena flying canoe boats out of flying planes, like what is this. It’s a completely different franchise now, and the script was absolutely terrible. Some of the most cringe lines I’ve ever heard. Don’t bring a part 2 out, end it there.",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Worst entry in the franchise so far.",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I can't wait for Fast X Part 2!",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "End it please it is only getting worse",
    "date": "2025-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It’s time for the family to retire.",
    "date": "2025-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Fast X amps up the action with over-the-top stunts, fast cars, and explosive showdowns. Vin Diesel returns as Dom Toretto, facing a new villain played by Jason Momoa. The film leans into family, loyalty, and revenge as central themes. Though the plot is wild and chaotic, it delivers pure entertainment. A thrilling ride for fans of the saga.\n\nThomas fandiño franco",
    "date": "2025-07-16"
  }
]