[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Much better than expected! This movie has everything, Drama, suspense and Action. \nSet forth on an idea with a very realistic circumstance that could very well actually happen and possibly did, of course there were a few scenarios I found unbelievable which was the last chase scene which clearly couldn't have been that close to each other from where the chase started then at the Police station were apparently had no cell coverage or phone? Lastly the police officer probably is the worst shot in any movie I have seen where police are shooting at bad guys then apparently he falls into a canyon and survived without breaking an ankle or leg? Aside from that I won't waste my time scouring a dictionary trying to find obscure and very descriptive words to make my review read more professional, instead I'll just say watch it and don't judge a book by its cover or in this case the experts negative reviews.\n\nI found the movie very entertaining and kept my attention throughout, it delved into the main two characters of the film who started at opposite spectrums (Good vs The Bad) then built an understanding between the two characters who both were dealing with their own emotional issues and struggles which brought them together at a crossroads in their lives and literally on a road in the middle of a desert.",
    "date": "2024-01-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Enjoyed most of it, but the ending was ridiculous.  Did the character die?  No one will ever know, or probably care",
    "date": "2023-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Low budget, very simple and common script, but engaging (beats the hell outta some of the boringly shallow and repetitive super hero fare).",
    "date": "2023-10-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Bad acting, implausible, and just awful. Don't waste your time!",
    "date": "2022-05-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I liked it.  It certainly isn't award material but was an an entertaining story.",
    "date": "2022-05-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Worth the watch. Decent plot and good acting.",
    "date": "2022-05-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "She's researching desert flowers (dull) when a little mini-plane with drugs and a newbie drug transport (hispanic) crashes and holds her hostage. The sheriff sucks and doesn't do anything to save anybody.",
    "date": "2022-05-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A botanist meets a teacher turned narco smuggler in the desert. Pretty interesting premise. Lucy Hale portrays the botanist. Pretty surprised this didnt turn into romantic comedy. It has it's moments, but it's very slim. To the point. I enjoyed it.",
    "date": "2022-05-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Trust the 1 star. It is that bad.",
    "date": "2022-05-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Worst movie I have ever watched. I created a Rotten Tomatoes account just now to save people some time by telling them not to watch this. The story line could have made for a possibly great movie but wow was this horribly executed.",
    "date": "2022-05-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This desert-set run-from-the-bad-guys feature has its moments, but generally underperforms. \n\n\nAside from good performances from Lucy Hale, Jorge Jimenez, and Leynar Gomez, the rest of the cast just doesn't seem up to the task and—despite doing the best they can with a script that almost makes it—can't carry the movie over the finish line. \n\n\nThe best part of \"Borrego\" is the first 45 minutes. The setting is established nicely with some gorgeous desert photography and a great atmosphere of isolation that foreshadows the adventure to come. \n\n\nNow, perhaps I blinked at the wrong time, but I entirely missed the setup for the relationship between Alex and Elly. I'm never sure if they know each other or not before this chance encounter in the desert. Are they sisters? Cousins? Friends? As far as I could tell they were perfect strangers, yet later Alex speaks of her by name as if they've known one another all their lives.\n\n\nMaybe they have? But the scene is written in such a way that I entirely missed it, even after watching it again. \n\n\nAnd if they know each other already and Elly is local, why is she staying in a hotel room? \n\n\nThere definitely feels like there's some connective tissue missing and the script should have cleared up these confusions later on, or at least reiterated the relationship between these characters in some way.\n\n\nThe relationship between Alex and Jose never feels like a father-daughter bond, the writer would have done better to make them siblings. \n\n\nAnother point of confusion comes when we see an angry, drunken Guillermo sitting alone in his trailer, examining a picture of someone we're led to believe is his daughter. Aside from the anachronism of anyone that age being depicted in a printed paper photo in the modern day, there is nothing to focus on and his subsequent rage feels entirely unprovoked.\n\n\nIf this is an attempt to reveal the motivation behind Guillermo's brutality, then I'd have liked some more details. \n\n\nBy contrast, when we hear Tomas's backstory, we're given a touching narrative that—although cliché and exactly what you'd expect it to be—comes in the form of a monologue that is so masterfully delivered by Gomez that we see New layers of humanity in him that greatly aid the film's climax.\n\n\nOnce we're into the adventure itself, the movie's engaging images and massive desert shots give way to tight, claustrophobic photography that is always full of sallow sand and bleached rock. \n\n\nI can't particularly fault the director for this—it is a piece that takes place largely in the wilds of So-Cal border territory—but the only other location we see for the last hour and change is an exterior shot of Alex starting her dirt bike in front of a school. \n\n\nAgainst such a monotonous backdrop, there needs to be more action, more adventure, more of, well, anything at all taking place. \n\n\nBut instead it's pretty much just walking. Walking, stopping for water, walking, stopping to rest, and walking some more. \n\n\n\"Borrego\" has every opportunity to use the harsh,  unforgiving wilderness it takes place in as a villain even more nefarious than Guillermo himself—but just as it resigns him to the status of a flat, Central Casting-sent mustachioed bandido with an old pickup truck—it relegates the scariest monster of all to mere sand to be walked on.\n\n\nIn the way I was taught in my screenwriting class to \"throw rocks\" at your characters once you've got them stick in the proverbial tree, I kept waiting for something to happen to Tomas and Elly as they trudged across the landscape, but it just…doesn't. \n\n\nBy the time the movie was over its message was obvious: With drugs, nobody wins. It's a worthwhile theme that deserves to be explored and examined in nuance, which is something that \"Borrego\" does well. It just needs to make more of a spectacle of itself in the process to succeed as a more of a movie and less of a PSA.",
    "date": "2022-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Very touchy movie. Good acting. Keep me up till 2am to finish it. I subtract 1/2 star for some cliche committed by trillions of film makers in the world, including Hollywood, Korean & Hong Kong.",
    "date": "2022-05-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Hail Lucy. It wasn’t the best but I was entertained for most of the duration.",
    "date": "2022-05-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved the film, and thought it was masterfully made. Not sure why  this movie is getting more play. I really enjoyed it!",
    "date": "2022-03-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was gritty and real and showed the unglamorous side of drug running. I loved the way it was shot, made me feel like I was there.",
    "date": "2022-02-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie and very relevant. Solid story and characters, Lucy Hale was great! While rough, a necessary and important subject that demands more attention.  Well done!",
    "date": "2022-01-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The movie has a palpable sense of place.  Afterwards, I felt I'd been to the desert.  Lucy Hale seems authentic throughout as a botanist taken hostage by an inexperienced drug mule (played by Leynar Gomez).  Gomez aptly accomplishes the tricky task of transforming from a hostile and threatening character to one of integrity and sympathy.  (One critic described his last scene as \"heartbreaking.\"  That was my reaction.  I'd like to see more of his work!)  Some have found this movie slow, but taking time with these people gives the movie heart, elevating it above routine action films.  It will stick with you.",
    "date": "2022-01-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Love it. The whole thing was intense and keeps you engaged the whole time. I went with a group of friends and everyone loved it. Recommend 🔥",
    "date": "2022-01-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Had some edge of your seat scenes. This movie did an excellent job portraying the desperation that drugs and money brings out in people. It sheds some light that even in the darkest hours of their life, people can connect and gain redemption through goodness.",
    "date": "2022-01-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Awesome movie!!! Definitely need to go see it! You won't regret it!!!!",
    "date": "2022-01-20"
  }
]