[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "How to make a single plot point movie so tedious that you fall asleep, even during the fight scenes. Watch John Wick Chapter 4 to find out. No story, no narrative arc. When style tries to make up for a lack of substance this is what you get.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The music and action was incredible",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie indeed. My boy John Wick, I'm always happy to see him.",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie!! Action from wire to wire",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "John Wick 4 effortlessly earns its place among my all time favorites. It’s a visual ballet of violence and elegance. Every frame a work of art, every fight a symphony. The music paired with a rich sound system? Transcendent. Each beat, each gunshot, each echo wraps around you like silk and thunder. It’s more than a movie… it’s an experience, a masterpiece carved in motion. 😙🤌✨",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved the club scene and the music. Along with his partner from Japan too",
    "date": "2025-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Beautiful movie, especially as a participant in precision sports, it was enjoyable seeing the realism of the firearms",
    "date": "2025-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "“The bloodshed was the point” Just creative ways to kill. It’s not even that creative anymore, though at this point it’s all been done.  The only new gimmick is Donnie Yen’s blind weapon master shtick. They should’ve stopped when John Wick lost his motivations. At this point it’s more of a Constantine movie than a John Wick movie. Glad it’s done.",
    "date": "2025-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fun through and through",
    "date": "2025-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "\"I am Klaus.\"\n\nThe German rave scene was wild. Everyone kept dancing while people got axes to the face right next to them.\n\nThe Paris sightseeing was a highlight, quite a tour. The sets and locations are incredible, very slick, and the overhead, video game–style sequence toward the end was such a cool, stylized way to show the action.\n\nThe action and choreography, while still fun, I gotta say felt a bit off in timing. Some of it seemed unnaturally staged, with pauses or hesitations by the actors that made it seem noticeably staged. Minor concern, but more obvious compared to previous entries in the franchise.\n\nThe Arc de Triomphe car scene was a mind-blowing blend of CGI and stunt work.\n\nAlso gotta say that the blind assassin character was a bit over-the-top. Too gimmicky.\n\nOverall, satisfying showdown and ending and a fun action-packed time.",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "the 4th film of the franchise has the best action scenes and dialogue. Never have I ever experience a movie theater where everyone was literally engaged to this movie. It was amazing",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great yoooooooooooooo",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The introduction of Caine is fantastic! Can't wait to see the sequel based on him",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is the best one of the series. It has great fighting scenes, the dialogue is unforgettable, the new characters and action sequences are phenomenal. The way that John is fighting for his freedom and returns to his wife is an emotional moment. It's sad that John wick has to die, I thought he was going to be the man who cannot be killed, but I guess nothing lasts forever. I'm wondering how they are going to make John Wick 5 now that John is dead. That is my only question to the series.",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I love violent action movies but find the wick movies don't hold my interest.  \n\nPositives:  the filming style and settings are incredible, the fight scenes at least start out great, and the ending was good.\n\nNegatives:  slowly paced long conversations where little is said, fight scenes tend to get repetitive, and it's way too long.",
    "date": "2025-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "After the 35th or 50th kill, the spectacle stops serving story and slips into something almost cartoonish — except instead of slapstick pies and pratfalls, it’s headshots and knives.\n\nIt’s a kind of over-saturation of violence. In older action films, the kill count usually escalated toward a climax — the audience saw danger and payoff. With Wick (and films like it), the sheer repetition blurs the line: Are we still watching a character fight for survival, or are we watching a violent ballet just for itself?\n\nThis is a ‘’Disney fantasy gone wrong” l — it’s the same formula: a heightened, stylized world where rules don’t apply. Only instead of enchanted forests and talking animals, it’s assassins in nightclubs and endless ammunition.",
    "date": "2025-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I simply could not get past an hour and a half of this ridiculous movie. If you are a fan of overly choreographed fight scenes that go on forever than maybe, just maybe you'll enjoy this flick. I found the first three previous movies to be fun but this was way over the top. The plot stalled to make room for all the endless fight scenes and there was really nothing to hold my attention.",
    "date": "2025-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Worst in the series by so far.  It was just as bad as matrix 4.",
    "date": "2025-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "John Wick 4 was released in theatres in 2023 and again stars Keanu Reeves in the title role killing his way through his enemies with style. Starring alongside Reeves is Bill Skarsgard as Marquis (bad guy), Donnie Yen, Lawrence Fishburne, Hirouki Sanada who I've liked since Last Samurai, and others. The movie is shot in different countries around the world and the fight scenes reflect these differing locations. There's not much to discuss with the plot as it's stayed the same for the last few movies. The Table, the shadowy organization that apparently controls the worlds crime families, wants John Wick dead and in turn Wick wants to \"kill them all\". There's lots of fight scenes, lots of shooting, chases, clever dialogue, interesting characters, and more dogs (who doesn't like attack dogs biting bad guys). But for me this has all been done in the previous three movies. A lot of this felt forced and didn't have the fun of the first two movies, which were my favorites. It was a good, not great, action movie but Reeves as usual was fun to watch. If you're a fan of the John Wick franchise, or just like action movies in general, then this is definitely for you.",
    "date": "2025-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Just pure violence with no redeeming qualities like John Wick one and two have, in abundance.",
    "date": "2025-08-28"
  }
]