[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Sweet movie and one of the only MLM christmas movies i enjoyed. It kept me on the edge of my seat waiting to see if the two main characters would end up getting together. The supporting characters and the love triangle trope added to the excitement. Only issue is the acting could’ve been a tad better but the movie was still great!",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Terrible. Shocking acting. Just wank",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "better than I expected it to be but still not great in my opinion not my cup of tea but wasn't  a bad watch just wouldn't go out of my way to watch it again I would rate it 76%",
    "date": "2025-03-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Such a great feel good movie for the holidays! Full of wonderfull happy characters.",
    "date": "2024-12-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Love love love this!!! Why are you making me WAIT SO LONG FOR A SEQUEL! Hurry!",
    "date": "2024-12-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Everyone is trying hard here but I have to say its one of the most boring and uneventful films I have seen for a long time. Charming yet charmless and empty as a Boxing day stocking.",
    "date": "2024-12-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I’ve watched this Movie around 10/11 times. It gives me warm cosy funny vibes. Good pacing- problem free, Top cast, The only reason I’ve not given it 5 is that I would reserve that for my top three movies of all time, such as The Terminator. Happy holidays, enjoy.",
    "date": "2024-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Super cute and funny! Great Christmas movie!",
    "date": "2023-12-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This is a perfect cheesy Christmas rom com. Yes, of course it's predictable but I really enjoyed it. Great cast. Cute movie.",
    "date": "2023-12-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Single All the Way ist eine romantische Weihnachtskomödie von Michael Mayer (Regie) und Chad Hodge (Drehbuch)... Der Social-Media-Manager Peter reist jedes Jahr an Weihnachten zu seiner Familie, die ihm alljährlich auf die Nerven fällt, weil er noch Single ist… Ein cooler und süßer Weihnachtsfilm… ein homosexueller Weihnachtsfilm… ein kitschiger Film, ja, denn voll unrealistisch…  die Geschichte ist vorhersehbar und unoriginell – aber trotzdem irgendwie süß… Kurz gesagt, ein unterhaltsamer Weihnachtsfilm.",
    "date": "2023-12-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "cool and sweet xmas movie",
    "date": "2023-12-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Unwatchable and unfunny. Pretentious and patronising.",
    "date": "2023-12-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "One time I was kissing a guy in Via down Canal Street and a girl popped her head over his shoulder to congratulate me.\n\nThis movie felt like that moment.",
    "date": "2023-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I didn't know I needed this! It's so cozy and cute and Jennifer Coolidge is perfect!",
    "date": "2022-12-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Worlds longest Taskrabbit commercial. They got it into nearly every scene.. if you can't afford to make the movie without it being an advertisement maybe the movie isn't good enough to be made..",
    "date": "2022-12-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I found it a very cheesy movie! None of my gay friends behave like that.",
    "date": "2022-12-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Single All the Way manages to smash barriers while dodging cliches for this perfectly timed LGBT holiday hit. Michael Urie and Phileman Chambers offer delightful chemistry with comedic support by Jennifer Coolidge. I'm smitten with this Christmas rom-com --- and possibly a little biased as a gay, former resident of NH that loves to see the representation on screen. Charming, heartwarming, and entirely modern, Single All the Way is a must-watch newcomer to the holiday scene.",
    "date": "2022-12-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "this was super cute; it's your typical Christmas-themed rom-com - the story is predictable & unoriginal - but it was cute nonetheless.",
    "date": "2022-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A real unique christmas story.",
    "date": "2022-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "If you want a corny Christman movie, this is the film for you. Personally, to me, the problem I have with this film isn't unique to the film itself, but many LGBTQ+ films that depict interracial relationships: so much attention in terms of complexity and nuance is given to a white character than a POC, particularly the black character. The film centers on a white protagonist's need for love and romance. Though I can't change that premise, I do wish there's more attention given to his black \"friend\" in terms of what he wants in a relationship or at least a nuanced discussion of how he felt being that black friend in a predominately white space.",
    "date": "2022-03-25"
  }
]