[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent movie, great acting. I truly enjoyed this movie.",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Had the potential to be another Stand and Deliver.   Moved too fast with many expected clichés.  This would have been so much better as a 2 1/2 hour movie with an awesome build up.  Love the story. A remake is necessary.",
    "date": "2025-01-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A very good movie 👌🏻👌🏻👌🏻",
    "date": "2024-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "An emotional filme what show us how the life is a very big chessboard.",
    "date": "2024-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Loved this movie so I was very disappointed to see the low critic scores.  Why do we even have critics? Who even cares what they say? The audience score is what matters not some wanna be movie expert without a real job.  Eliminate the critics.",
    "date": "2024-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved this movie.  I love teacher movies like To Sir with Love.  This one has a slightly different premise and found cool moments btw the teacher and students.  Cuba Gooding Jr is a great actor.  I can't wait to watch this one again.",
    "date": "2023-12-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "73/100 - Not a bad film, comfort food. Decent plot but the characters need better development for it being such a long movie.",
    "date": "2022-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Good movie. Good message, all the more so for being true. The man portrayed (Eugene Brown) has a short cameo near the end. I play chess, so I would have liked more about chess, but I still enjoyed it. Another demonstration of \"people don't care what you know until they know that you care.\" I thought the ending was excellent.",
    "date": "2022-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was an uplifting inspirational movie. This is a good example of rising above your environment and your past. I recommend this movie to anyone.",
    "date": "2021-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Good story. Well played. Cuba and the rest turn in splendid performances.",
    "date": "2020-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The people who run Rotten Tomatoes are liars. This was a great movie, and NO ONE will tell me it wasn't.",
    "date": "2019-01-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Nice happy feel-good story. For once Cuba Gooding Jr isn't caught over-acting.",
    "date": "2017-05-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Sad yet heartwarming tale of an inner-city teen's rise to success. The unrelentless efforts of Eugene Brown to better his community are an inspiration to us all and Goldberger does an excellent job dramatizing this. This movie left me with an urge to begin playing chess!",
    "date": "2016-12-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Life of a King feels a bit too cliched than any film based off of a true story has a right to be but with the charming presence of Cuba Gooding Jr. in the lead role and a heartwarming dramatization of real events make this a sporadically amusing biopic.",
    "date": "2016-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "\"Think Before You Move\" \n\nIt's been a while since I've had a film impact me in a way like this one did. Life Of A King is simple but interesting and thoughtful, especially that it's based on a true story and Cuba Gooding Jr. is a phenomenal actor as most of his roles verify.",
    "date": "2016-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Based on true events. A movie about a game and life itself and how the two are inseparable.",
    "date": "2016-05-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Excellent movie! True story about a life making a difference.",
    "date": "2016-04-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Good inspirational story.",
    "date": "2016-04-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "My beef with movie critics starts here again. Although movies such as Melancholia (depressing as hell) and The Godfather trilogy (which glorifies crime, greed and murdering you own family for money) get the high ratings from them, they give low ratings to an inspiring film such as this one, which is well acted and glorifies a man who rectifies his mistakes wiithout self pity and spends the rest of his life giving meaning to the lives of young people, who might otherwise have fallen through the cracks that led him astray when he was young. The message here is hopeful and positive, so naturally critics find it \"formulaic,\"  \"predictable,\" and a \"twisted parody of high school and mentoring whose achievements are entirely accidental.\" This from a man who criticizes people for a living and has probably never taught a day in a public school in his life. Well, I have, and let me tell you, trying to redirect young people bent on being part of a group of \"cool kids\" is never accidental and a very difficult cause to which to devote your life. Doing so while correcting your own mistakes is incredible. The number of people willing to dedicate their lives to helping students in impoverished inner cities to find a more meaningful path in life than gangs and drugs and money that comes at a cost of one's soul is to be lauded, not criticized. Instead of complaining that it so \"common\" to try to make a difference in the world, get off your lazy quasi-intellectual duff and try to improve the dire situation in the world today yourself. Only then will you be qualified to criticize such an effort by someone else who is really dedicating his life to others.",
    "date": "2016-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Inspired by true events, this movie shows how anyone can turn the worst of their past into the best of their future. We can all use our stories to change others' lives.",
    "date": "2016-03-11"
  }
]