[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Great historical movie. Great story. Keanu Reeves is a Saint.",
    "date": "2025-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The movie was really good the critics suck and are wrong.",
    "date": "2025-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Underrated by Rotten critics. This is a good movie. Incredible costumes, nice fights, nice portrayal of some Japanese ceremonies.",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This is why real critics suck balls. \n\nI have no idea why people hated this movie when it came out. WHAT A BANGER. I put it on as background noise while I was working and I got zero work done. The only recommendation is that it should be in Japanese with subtitles. The fact that it is based on a true story is mind blowing, samurai history is so fascinating. What a group of absolute badass warriors!",
    "date": "2025-09-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Don't know why it is so negatively received, it is a fun movie with a good cast. Sure not the greatest film ever made but it's definitely entertaining. Story is descent, good action and a mix of magic and fun. If you haven't seen it definitely give it a watch.",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It's your standard big budget Hollywood fantasy film but this time its set in Japan. If you haven't seen it you're not missing much.",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "47 Ronin (2013) could have been a great film but it is just a big disappointment. The central error is very weak, the beginning is the best part and then it just falls apart.",
    "date": "2025-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I really think this is a great movie even in 2025 even though a lot of it looks dated, the actors do a good job building suspense and the story is interesting to me and I would recommend if you need a good movie to sit back and watch without expecting 2025 quality.",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I would definitely not say this is an academy award winning movie but if you go in looking for entertainment then this just might be enough to have some fun with I enjoyed this movie call me crazy but I find it fun",
    "date": "2025-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Started out well , but there is so little dialogue in this movie . It was just boring",
    "date": "2025-03-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A masterpiece that reunited Keanu Reeves and Hiroyuki Sanada. Fighting side by side, between fiction and honor, and making of this movie one of my favorites ever.",
    "date": "2025-03-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is  such a great movie!!! I absolutely love it.  It has great actors, Hiroyuki Sanada and  Keanu Reeves in their first movie together! The acting, plot and scenery is awesome! It's a shame about the ratings. My family loved it so much that we bought it and revisit it yearly.",
    "date": "2024-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not nearly as bad as critics made it out to be but still far from great, 47 Ronin is a fairly standard samurai-action-fantasy film that's slightly elevated thanks to gorgeous visuals, a stellar musical score and a scene-stealing performance from Hiroyuki Sanada.",
    "date": "2024-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Very boring fantasy added to a well known japanese story. Wooden acting. Incorrect history and rediculous costumes. Why is the shogun wearing a gold bucket on his head? Why is Keanu Reaves even in this movie?",
    "date": "2024-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Love, emotions, courage,  loyalty, adventure, action, u can find everything in this movie. Acting, direction, story everything is epic. One must give it a shot.",
    "date": "2024-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "tại chị phù thủy keo quá nên t cho 2 sao chứ không là cho 0.5 sao rồi",
    "date": "2024-05-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Very entertaining, but boring and favorite, it has many bad points, the reviews are bad, and it's true",
    "date": "2024-05-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "It was nauseating. I feel a small portion of my life was wasted. They're samurai, then they are not, then they kind of are, then not, but then they die a Samurai's death.  Yep.",
    "date": "2024-04-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Way better than any Marvel movie out nowadays.",
    "date": "2024-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Making a fantasy/horror movie of a fake legend with horrible acting and plot was a big mistake. Avoid at all costs.",
    "date": "2024-04-06"
  }
]