[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I am a Latin American with more than two decades in the US. I think this film uses many silly stereotypes, not only about latinos but about women. And there is some conflict between parts of the plot, like how much and when the main character knew about his mother's relationship with a neighbor.",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Super cute. Way better than expected",
    "date": "2025-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Well worth a look. Different but excellent",
    "date": "2024-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was hilarious definitely worth watching",
    "date": "2024-12-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Both this and the original have the same problem: The valet and the main girl don't end up together. I know this was done to subvert expectations and avoid cliches, but some cliches work- like the main two characters ending up together. Watching a movie like this where the main two characters don't end up together is like watching an action movie where the main hero and the main villain never fight each other.",
    "date": "2024-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Me encanta mucho la película The Valet. Eugenio Derbez siempre nos sorprende con gran talento que siempre muestra en cada producción que realiza.",
    "date": "2024-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "An endearingly told tale about family and loyal friends, the ones that you will love until the absolute end of ends, those who help you park your problems, build great runways that they extend, involved in all of life's precious moments with unsurpassed, kind, dividends.\n\nA wonderful piece of sincerity transcribed into film.",
    "date": "2024-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "LOVED IT!! I love every film that Eugenio Derbez is in!! Should've gotten higher ratings! And I didn't want the movie to end! I never seen an ad or trailer for this I just found this typing 'best movies to watch' and I thought to give it a shot since my favorite actor is in it. (:",
    "date": "2024-03-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Great movie, hilarious and enjoyable.\nSpectacular work from both starring actors, and the plot suits them perfectly.\nBetter to watch if you understand both Spanish and English, as there are some slang words and expressions that fail to generate the corresponding effect on the audience when translated. (My qualification is based on the knowledge of both languages).\nThere are some tedious scenes, but it is overall entertaining.",
    "date": "2024-02-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It's a good comedy, the acting and the background story of the protagonists are nearly mediocre but decent.",
    "date": "2024-02-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "BEST  film of the year……FUNNY AS F AND HEARTWARMING AS WELL. in English and Spanish only word word describes it. BRAVO!",
    "date": "2023-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "it's a nice movie, good feeling movie. this one is definitely worth watching if you don't want anything too serious and just want to relax",
    "date": "2023-06-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This is a movie you have to see. Not often you will see a remake that is slightly better than the original. This one is. After seeing \"La Doublure\", I had to see this one. Thinking what do I have to lose, right? Well this movie is surprisingly funny and uplifting. The jokes are everywhere, in the words and also in the non-verbal communication. The interactions between Antonio's mother and Mr. Kim are unexpectedly sweet (she speaks Spanish and he speaks Korean and neither speaks English) which results in an amusing translation of their communication. The plot and subplot (the gentrification) twist you can see coming from a mile away but that does not have any negative impact on the storytelling. This is mainly due to the fantastic cast as a whole and the outstanding performances of both Eugenio Derbez (Antonio) and co-lead Samara Weaving (Olivia), YES, related to Hugo Weaving but she is playing the role of her lifetime. Also an excellent performance from Betsy Brandt (Breaking Bad Maria Schrader), who plays Kathryn Royce. And Kathryn is not happy to be the wife of a cheater and puts down an amazing performance. Even the side story with the two detectives who are rivals but become good friends is very well executed. At first glance, the film is just another romantic comedy. But soon you will realize that this movie (or version of The Valet) will defeat your expectations, whatever they are. This is a perfect example of \"Gestalt\" , a configuration or pattern of elements so unified as a whole that it cannot be described merely as a sum of its parts. It is more than the sum of its parts. But you will have to go and see for yourself. I rated this movie 8.1/10. A slightly higher rating as the original from 2006. As 8.1 is not allowed, ended up with 8/10. And highly recommended to watch.",
    "date": "2023-05-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Derbez is a great comedian and a decent actor, and you can't see any of that in this movie due to a poor script, bad editing and awful direction. I guess most reviewers reacted positively because of the social message embedded in the story.\nWell,  telling a story that portrais the social divide between the white elite and the latin community is not enough to create a great movie. You need to write it, direct it and edit it in a great way as well.",
    "date": "2023-03-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A terribly implausible rom com that offers a lot of sweetness and laughs along the way. A famous actress uses a local valet to cover up her affair with a married man and ends up learning how to be human again after he and his family treat her with respect and dignity. Culture clashes and language barriers abound, and it's truly a great peek into the many layers of LA life.\n\nI'm thankful they didn't go full-on fairytale ending, but even as it stands, accepting the plot is a difficult stretch for any viewer.\n\nOne thing I like about this movie is the affirmation of sincere, non-romantic relationships between people who care about each other. It's also just really funny. If you're in the mood for a laugh and something heartwarming, this one's got your number.",
    "date": "2023-02-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Comercia romántica con el plus de contar con la acción de Eugenio Derbéz y el twist de que el 'underdog\" que \"conquista\" a la chica en la historia, es un migrante en Los Ángeles que resulta ser valet parking. Palomera.",
    "date": "2023-01-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Like a breath of fresh air compared to the dross that has been churned out of late. Both leads are engaging and there is a synergy in their joint scenes. Samara Weaving shows a gentler side from her entertainable roles in Ready or Not, The Babysitter, etc. and coupled with a delightful script you have a feel good movie that leaves a warm glow with chuckles aplenty along the way, especially from the lead's mother.",
    "date": "2023-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The algorithm has claimed more victims.",
    "date": "2023-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Came across this movie in my HULU search. Read the audience reviews, not the critics, and loved the reviews. The critics gave it good reviews too though. Gave it a watch and was pleasantly surprised. Laughed out loud several times. Great movie and a great cast! Worth watching!",
    "date": "2022-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The Valet is a cute little movie. Something to make you laugh and give you the feels on a Sunday afternoon.",
    "date": "2022-10-18"
  }
]