[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "filme legal, não tem um peso tão grande como outras obras do Clint mas legal, o que eu mais gostei foi o fato de não me deixar entediado sabe filme com muita barriga aqui não foi bem divertido e emocionante.",
    "date": "2025-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Such a great movie plus Clint is in it. Definitely a must see. Its got a little something for everyone in it.",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "While Clint Eastwood's performance in The Mule was noteworthy, the film's dull pace and unremarkable direction detracted from its overall impact, making it a less engaging watch despite being inspired by a true story.\n\nGrading: B-",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Brilliant! Great storyline, very well directed and brought to screen. Whole cast excels in character. Very good cinematography and visually pleasing. Very memorable movie filled with lots of emotion, highly recommended",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Let ok I’m biased. I’m a huge Clint fan and this is another late great performance from the guy. A Western of sorts, playing the loner as always but who plays this role more poignantly? Very emotional but warm picture. Watched on Amazon Prime.",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Personalmente no me gustan las películas que hacen referencia al narco, es un tema que no aprecio para nada, pero los actuación de Clint Eastwood es muy buena. Es uno de mis favoritos.",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Something went wrong with how the scenes were organized. And some parts of the story are like just brushed over with little depth. It has too many characters and their stories. Think of how few characters were required for Gran Torino or Million Dollar Baby. The storytelling suffered a bit in this move. it felt ruseg.",
    "date": "2025-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "enjoyable plot but some of the acting is pretty bad in my opinion.",
    "date": "2025-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Clint Eastwood is superb in a role that he produced, directed, and was the lead actor. He successfully bridges a bygone era with modern sensibilities, playing in a role that aligns perfectly with his age. The Mule is raw and edgy at times, but with a heartfelt mission to redirect us to what truly matters in life: family.",
    "date": "2025-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1 hour and 56 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated R for Language Throughout and Brief Sexuality/Nudity!!!!!!!!!!!!!!!!! The USA grossed over $103,800,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I liked this one a lot.   I'm iffy on Clint Eastwood movies, I like the playful ones, but not the Westerns, nor Dirty Harry movies.  \n\nI enjoyed his acting, he's finally learned how to.   Really, he's always been more of a one note actor, his talent is Directing and giving audiences what they want.  \n\nBut he was vulnerable and funny here.   I think more interactions with Bradley Cooper would have been enjoyable.   Great supporting cast.  \n\nClint Eastwood isn't a Mule, he's a goat.",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Really good movie. I've been watching him since he was Rowdy Yates in Rawhide. Great director and actor. Literally grew up with him.",
    "date": "2025-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Clint Eastwood is just amazing. His film as actor and as director are always good",
    "date": "2025-05-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "An absolutely great movie. The story was great...",
    "date": "2025-05-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Superb! Stunning performance as ever from one of my all time favourite actor and storytellers. If you love Clint in his later years as I do, you'll love this. The ratings and critics don't do it justice.",
    "date": "2025-04-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Good, thoughtful movie. Clint is the perfect old guy for the part.",
    "date": "2025-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Unfair audience rating here I feel, a solid film and well worth a watch",
    "date": "2025-04-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Awesome it’s a must see movie",
    "date": "2025-04-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "\"Don't let the old man in\".",
    "date": "2025-04-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great cast.  Clint did a good job as always with direction & production.  Script was compelling.\n\nIt didn’t leave me wanting for more or anything else.  A complete & masterful film.",
    "date": "2025-03-05"
  }
]