[
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "It’s a 1940s movie without John Mills that has been colourised?",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I got bored during this.",
    "date": "2025-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Allows the astounding true story to play out without much tinkering, and delivers a solid spy thriller in the process.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Operation Mincemeat has vast potential as a love letter to one of the most interesting operations in counter-intelligence in history. This should have been one to add to the very best of WW2 films in The Battle of Britain, The Great Escape, etc. Unfortunately, through its own self-doubt, it squanders its own potential and (unlike the allied invasion of Sicily) snatches defeat from the jaws of victory. \n\nThe acting line-up features tried and tested actors in Jason Isaacs, Colin Firth, Penelope Wilton and many more. These actors are so tried and tested, it's next to impossible to imagine anything less than required and, indeed, the collective performance is excellent. The acting talent is supported with top-grade costume and set design. Perhaps there might be a slight issue with the colour palette, which makes a selection of scenes look washed out and sanitised, but that aside the filming allows the cast to thoroughly show off their acting chops. \n\nUnfortunately, the script just doesn't support all the great work they did.\n\nFirstly, and it's a minor niggle, the Ian Fleming problem. The script takes a delight in Ian Fleming's involvement in the operation and thinks it can sell itself by showing off the Bond connection. This means that Fleming is inserted into far too many scenes for a junior officer who never actually seems to do anything of substance. More irritatingly, someone on the cast generally announces him in each of his scenes as if he were some sort of royalty. He also gets a cringeworthy \"spy story\" line at the end of the film which had my toes curling. The only way the script could be less subtle about Fleming would be to put up an announcement saying \"IAN FLEMING - YES, THE BOND WRITER\" on screen during every appearance, and perhaps that would break the immersion less.\n\nMost importantly, the writers have gone away from the original Ben Macintyre source material. It shows, because these scenes stick out like a dead body floating along the Spanish coast, and are really badly written. For example, there's a tedious episode where Glyndwr Michael's sister turns up, leading to a drawn-out and needless exposition about what they're doing with the body. It is very disrespectful; according to the eponymous Macintyre book, Michael's family never looked for him after he died. Furthermore, it strains credulity as a grieving relative would not be diverted to the leaders of a secret operation, and an aide would not burst in during a conversation with an obvious 3rd party to announce Churchill had given his approval for the operation. It is horribly bad writing. The film does this over and over again. There's a love triangle which kills the film's momentum stone dead, and there's a confusing and garbled insertion of a German double agent into the storyline around the end of the film. It's such a shame. So much potential is squandered, given over to fiction which is tedious at its best. \n\nIn summary, this film is a passable piece of entertainment. The great pity is that by having faith in its viewers and sticking to its own message, it could have been so much more.",
    "date": "2025-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I like to call this \"A Tale of Two Darcy's\" - with a Mr. Knightly included for good measure. All joking aside, this was a great telling of this true story. With the top tier actors I'd expect nothing less. There were a few places I got lost but the point was always clear eventually.",
    "date": "2025-07-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Yet again, here they are - loads of positive reviews! Are these friends of the producers?\n\nWhere was the war? For almost all of the film you'd never know there was a war on. The two main characters however did maintain stiff upper lips, never unbuttoning their jackets and spent most of the time sipping drinks with good looking women in lovely clubs. There wasn't even the sound of bombs dropping despite the fact they were in London.\n\nI can tell you, if I had been around then, that's the kind of war I would have chosen! No getting shot, blown up, half starved and racked with pain and exhaustion like most brave military personnel of the time. Just looking at loads of lovely women, whilst wearing immaculate uniforms.\n\nMy rating...\"unbelievable\".",
    "date": "2025-06-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Could have been so much better. So slow, and the fictitious love triangle didn’t serve the story. Good actors but plodding direction.",
    "date": "2025-06-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Director John Madden never disappoints. More cerebral than many WWII stories, this intelligence drama has wit and a delightful cast.",
    "date": "2025-06-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "2 hours and 8 minutes based on an actual war. Rated PG-13 for Disturbing Images, Brief War Violence, Smoking, Some Sexual Content and Strong Language!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The thought process behind this movie must have been “stick Colin Firth in a period piece, collect and few bucks and be done with it.” Budget for the movie was relatively low, and it showed. Unnecessary, and unbelievable, love triangle muddled an otherwise interesting story. Also, it would seem Operation Mincemeat was orchestrated by two dudes, the woman they both desire and the housekeeper in the attic of a building.",
    "date": "2025-05-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This was a good movie. The unexpected turn of events after using a corpse to pass false information to the Germans was very interesting. A successful endeavor used again for D-Day.",
    "date": "2025-04-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I really didn't like this version, having seen \"The Man Who Never Was\" back in the 1950s.  The real life story itself is fascinating, and was very well portrayed back in 1956.  This remake I found more like a tedious soap opera, more about the character played by Colin Firth and his mates.  It is a long film, dragged out with irrelevant material.  After about an hour, when very little about the actual events had happened, I abandoned it.  A pity, since I enjoyed \"The Man Who Never Was\" as an 11 year old.",
    "date": "2025-01-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "How any war film can be so boring is beyond me.",
    "date": "2024-12-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I really enjoyed the story that I knew little about. Incredible what they went through to try to pull of the ruse and more incredible that it worked.\n\nI felt the love story between the two leads was forced and thought it another \"Midway\" type add-in, but did read that historians believe it to be true (not the triangle, just the two) and later in life Jean did not confirm or deny the relationship. I did not feel the triangle angle was needed nor the mysterious German spy that appears at her house at one point, which has no factual basis. (Really, the actual story is intriguing enough. The need the  writers/directors feel to add subplots like this to \"based on history\" movies is maddening. \n\nOverlook those two points and it is a lovely flick for a WWII buff.",
    "date": "2024-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A very intriguing film and comparable to the original. I love fact based movies and find this one exceptional",
    "date": "2024-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A solid enough movie that doesn't really hit any great heights. At times the pacing can be a bit slow and the romantic subplots did seem a little unnecessary.",
    "date": "2024-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This film is at its best when focusing on the details of the real story. The tension and jeopardy in the second half is palpable. Sadly, they decided to pad it out with an unnecessary love story.",
    "date": "2024-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Has all the components of an excellent true war story - but it is so SLOW, the romantic elements so contrived and implausible and the details so slack and un-thought-out: would a top secret plan ilke Mincemeat be discussed in the Gargoyle Club? Amazing that a war plot as gripping as Operation Mincemeat should be made into a film this dull.",
    "date": "2024-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Could have been an hour shorter.",
    "date": "2024-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Watched this in the cinema when it came out and again at home last night. The positives were that they stuck quite closely to the facts and represented the real people in the story really well. When I looked up the true story, I found that all the things that were negative distractions, or didn’t work in the film just happened to be the made up bits. \n\nThis story would have been much stronger without the speculative love triangle, the expansion of Jean’s role (she was less involved in reality), and the subsequent downplaying of the other female team members - the code breakers and Hester’s stories could have been developed more. The comic British spy who seduces his way around Spain was also unnecessary. Film-makers consistently fail to understand that a true story can be told well, without invented elements. Still a good film, though.",
    "date": "2024-08-26"
  }
]