[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Deserves 0 stars. Cheap rip off of Fatal Attraction. More interracial bad movies.",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "For some reason there is no suspense and no chemistry between the characters. The actors may be great but the movie is just not believable.",
    "date": "2025-03-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Hilary Swank is a total miscast and does not fit in this movie. I get that she produced it but they should have got another actrice. He has cheated on his wife with her..yeah right like that would happen in real life. They don't fit together at all and she has no sexyness at all. So what's the erotic part? Maybe the stalker part fits her but the femme fatal part absolutely does not",
    "date": "2025-02-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "So bad on every level, from the acting to the plot! What a waste of time! I don’t get what Hillary thought she needed to be in a b-movie 😵‍💫",
    "date": "2025-02-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The whole movie feels like a school project. It's jumping from one scene to the other without any real feel to it. It evokes no feelings except boredom.",
    "date": "2025-02-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "If I had known that my grandma was going to die an hour after I saw this movie then I wouldn’t have gone.",
    "date": "2024-12-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It was decent! I did check the time left 2 or 3 times, but overall, for free, it was worth the watch. Hillary was great as usual and the story kept me interested. No, it's not close to Fatal Atraction, but what is?",
    "date": "2024-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Bored on a Sunday morning looking to see if this movies is as trash as I thought it was, and yes it is. But hey Ealy and Swank are names that make you want to watch until you can’t get past the club scene where he’s into her and she’s into him, they didn’t pull that off which sets up the entire movie for ALWAYS missing the mark, I want to unsee it and I saw it for FREE well some of it, I switch to Lioness which is my new favorite show",
    "date": "2024-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I was never gonna intentionally watch this movie, but it was showing on TV, had nothing to do and I remember how bad movie seemed at the beginning , acting and music in particular. But....then all of a sudden Hilary Swank appeared and I was glued to the TV. This is a guilty pleasure for sure - cliché and predictable - but still enjoyable for only one reason - Swank! Amazing actress.",
    "date": "2024-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The title is a warning: This movie could fatally  wreck your brain cells",
    "date": "2024-03-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "this was a movie i did not expect to like but i enjoyed this movie Micheal Elay and Hilary swank are both good actors and there acting is good lots of twist and turns but a good movie",
    "date": "2024-02-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Nothing new. A waste of time really. Watch fatal attraction instead. Can't wait for this to get over so I can go back to watching something good.",
    "date": "2024-02-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It is bad enough to actually be entertaining. Pretty sure it's not intentional. If you decide to watch to see how bad it is, imagine the old SNL skit The Californians when the 2 main characters are talking.",
    "date": "2024-01-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Good twists and turns with solid performances from its lead actors!",
    "date": "2023-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Acting is good but can't save a mess of this movie with an implausible plot, it's so ridiculous it only happens in the movies.",
    "date": "2023-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Only made it through the first 15 minutes. Just bad and was like a lifetime movie. Writing was terrible.",
    "date": "2023-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Decent film awesome acting from Hilary swank felt like she carried the movie loved the story line twists and turns all the way through would recommend. 7/10",
    "date": "2023-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Not your traditional \"affair produces a psychotic ex-lover\" story; I appreciated the original twists on a not-so-original plot, as the film managed to keep me guessing as to what was going to happen next all the way until the end. I would have rated it a bit higher, but I didn't feel that any of the characters had that much realistic on-screen chemistry together. Still a pretty solid watch.",
    "date": "2023-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A solid thriller, but nothing completely new.  While it held my attention, I guessed right at nearly every turn.",
    "date": "2023-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I can't understand the good reviews for this movie. Each scene is so predictable. There's nothing that I liked it. Don't waste your time.",
    "date": "2023-08-17"
  }
]