[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "What an utterly pretentious waste of time becomed painful to watch. Well acted sure but pointless and senseless. There is no plot to speak of and the characters were not developed enough for the relationships to make any sense. Avoid this unless really good acting by Olivia Coleman is all you need. Perhaps it's a powerful novel that just should not have been made into a movie.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Guess the lead was ''too unlikable'' for audiences",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 2 hours and 2 minutes!!!!!!!!! Rated R for Sexual Content/Nudity and Language!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Beautifully cinematic and perfectly acted, this is one of the best of 2021. Leda is complicated for sure, but you don' t need to love her to appreciate this movie. Olivia Colman & Jessie Buckley are superb playing the older/younger version of Leda. Gyllenhaal did a wonderful job directing this gem. I look forward to seeing more from her. Some criticisms state that \"nothing happens\" but I feel that there's SO much happening in every scene. I really loved it.",
    "date": "2025-04-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "An interesting psychological portrait that's a little unclear but well made.",
    "date": "2025-04-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Olivia is the only strong point in this film but she also saves it at the same time",
    "date": "2025-03-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "If you are looking for some amazing plot eg Seven or shocking ending eg Seven then just select next on your streaming service. If top acting,  intense dialog scenes and uncomfortable closeups are your thing then look no further. Yes this is a movie that a lot of people will hate because the synopsis tricked them into thinking this is about \"seeing dead people\"....it is not. It is an outpour of motherly love, hate, selfreflection and self loathing all drizzled with a lot of booze. I loved it I found it hypnotizing to look at. It made me feel good about myself for not being any of those people. Amazing debut for Maggy and almost getting anxious to see her next project.  For the people who gave half a star. It is a confession of how little you know about life.",
    "date": "2025-01-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "An absolute rip off of a movie",
    "date": "2025-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "so meaningless there is no “moral of the story”",
    "date": "2024-12-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Why do Americans never get non-American films? Not everything is a lesson, and there is a big world out there!",
    "date": "2024-12-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I don't understand why this movie was made.",
    "date": "2024-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The Lost Daughter drags on with little payoff, pretending to be a mystery when it’s just about a woman reflecting on abandoning her children. Ed Harris’s character has no real impact, his presence changes nothing. The pacing is painfully slow, and the ending offers no resolution, leaving you feeling like you’ve wasted time on a film full of awkward moments and missed potential. So to save you some time, don’t waste your time on this movie. It’s pretty much clickbait.",
    "date": "2024-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I'm sure there's a plot somewhere in the movie. When you find it, please tell me.",
    "date": "2024-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I adore this movie. The acting is stellar from Jesse Buckley and Coleman in particular. It’s a study of life and behavior, just sit back and enjoy a harrowing but moving experience.",
    "date": "2024-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Watched this after seeing the reviews. I fall squarely on the boring, pointless side. The young mother immediately having a fixation on the older woman was just weird. We're told the people \"aren't good people,\" which goes nowhere. I guess it's generational torture of having kids that is the point. I'd write some more; but I just don't care. Pass.",
    "date": "2024-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Just to watch Olivia Coleman squeeze the most out of this complex role is enough to warrant a viewing but the way the plot unfolds is exciting and breeds tension.",
    "date": "2024-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Sorry fell asleep that was so dull ,the most exited thing was a worm crawling out of a dolls mouth .\nWhat exactly was the point",
    "date": "2024-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Great acting by Olivia Colman but plot seems to wander snd left me with more questions than answers.",
    "date": "2024-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Waited for this film to reach some kind of emotionally satisfying conclusion \nIt never came \nDakota Johnson’s character is underutilized and underperformed \nOlivia Colman makes all the right choices but to no avail as the film has no substance \nThis is a very empty hollow film\nThere is no real story or point \nVery far from the overrated reviews\nJust because it’s Maggie Gyllenhalls debut does not make it worth watching",
    "date": "2024-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "One of the worst written films I have ever seen, the story was pointless, the camera shots were amateur, the plot slow and quite frankly non existent, whatever the directors direction was it seemed to be the equivalent to walking circles in a desert. It dresses itself up as a cutting edge film from Oscar nominees and veteran actors only to crash land into a crumpled mess",
    "date": "2024-03-24"
  }
]