[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Justice for Justin Baldini.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Quite entertaining to watch, but does not do justice to the theme of domestic violence. Many inconsistencies.\nThe perpetrator is a neurosurgeon who suffers mental blackouts and completely loses self control as a result of PTSS, having accidentally shot his younger brother when he was a little boy. Having worked in theatres with neurosurgeons, I regard it as highly unlikely that a person with these character traits would be able to complete his specialist training or be considered for a staff position.\nThe victim is a glamorously dressed girl who runs a small flower shop. She wises up and decides to break up with her abuser, and she choses to break the bad news to him while he is holding their newborn for the first time and there is no chaperone around. Very unlikely.\nAlso the backstory with her first boyfriend is strangely incongruous and there is absolutely no chemistry with her old flame.\nBest part of the film: the balcony scene. Otherwise forgettable movie.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "It's not the world's greatest film, but I loved it. Heartwarming real and poignant.",
    "date": "2025-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Blake Lively stars in this sobering reflection on the self-destructive relationship patterns we inherit from our parents.  \n\nA completely predictable outcome from a rather obvious first two acts. \n\nYet, for all the script weakness (and the awesome behind-the-scenes chaos) this film worth the watch just for Blake Lively's Oscar-worthy performance.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It ends with Us is a very emotional and powerful adaptation of Colleen Hoover's novel. This movie was very heartfelt and it handles the very difficult response of the topic about domestic abuse. While some scenes were different from the book or were condensed it story's impact had still remained strong. The movie flowed very well and still had most of the aspects from the movie in it as well. Overall, this was a very good movie to watch and people should definitely watch it if they like Colleen Hoover's books.",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Loved it! I wasn't expecting that I would enjoy it as much as I did especially after almost falling asleep during the first hour. But the second half of the movie, when everything starts to get out of hand...\nThat part really gave me food for thought. The execution was very good.\nTo put it plain and simple, the movie is about domestic ab*se. Every character was portrayed very well. I know that this movie is surrounded with a lot of drama that eventually went to court. It al has to do with the main cast members, Blake & Justin. I don't wanna get into it. I'm just here for the movie. I am not giving any spoilers, just watch it. In the beginning there's a lot of soap but the real butter starts after the first hour of the movie!",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Literally this is the worst book/movie adaptation I’ve ever watched don’t recommend at all",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Like it ends with us book🌸 \nAwesome👏",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "If you;ve ever scoffed at the idea of karma, here is an intimate portrait of how it works.",
    "date": "2025-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "left before it was over. terrible",
    "date": "2025-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Terrible adaption of an important novel.",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I went into *It Ends With Us* without ever touching the book, just curious about the hype and controversy. First off—everyone looks way too old for these roles. The lack of chemistry between Blake Lively and Justin Baldoni is painful, especially when the younger flashback actors manage to sell it better. That’s not a script issue, that’s acting. The plot itself is decent but dripping with clichés, and while the drama and abuse storyline is handled better than the romance, it never hits as raw or intense as it should. Blake is easily the weakest link here and drags the whole thing down, while Baldoni and Brandon Sklenar actually deliver. Honestly, Sklenar shines so much I get why he’s rumored for Batman. On the bright side, the soundtrack slaps. This film is obviously flawed, maybe even miscast, but it’s not the disaster people are calling it. A solid, if frustrating, 3 stars.",
    "date": "2025-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "If this movie did not have so much controversy surrounding it, I would have never gotten around to watching it, at least not this soon after its release. Maybe on a bored day ten years later. But it was the controversy that brought me here. And it was a chore! This is not my cup of tea, and they had better be glad that there some kerfuffle surrounding this movie to bring attention to it. Overrated by a mile!",
    "date": "2025-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Brilliant film though a sad story. Blake lively is amazing very thought provoking",
    "date": "2025-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The initial interaction on the rooftop was off...the night scenery was beautiful but the vibe was off...movie doesn't better until Atlas shows up. I would recast. The movie doesn't seem like one vibe and seems like a mix of actors and mix of dialogue or lack of.\n\nAlso, Lily's character had no personality. There was a disconnect from the props showing us a flower shop and scrapbooks to who the character was suppose to be. I was just confused overall about what her personality was suppose to be. Was she suppose to be quirky? Or boho? Or nice? She wasn't lovable or nothing special\n\nPlease note, I didn't read the book so I can't compare this to the book. I'm giving my opinion as a movie watcher only.",
    "date": "2025-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I read the book first and LOVED it. I heard the movie didn't do it justice and oh my, the movie was a train wreck! The chemistry between the actors was non existent and Blakes acting was horrible. If I didn't know any better I would have thought that this movie was her first acting gig. \n\nThe movie was rushed and so disconnected. I literally made an account here just for the desire to share that it was such a terrible movie. My mum saw the movie and doesn't even want to read the book because the movie was so bad. \n\nDo yourself a favour, read the book and leave it at that.",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Not into Chick flics but this one was great. Will definitely watch again.",
    "date": "2025-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Blake’s portrayal of lily is mediocre at best, she just didn’t create a strong enough character that would allow you to forget the actress and start seeing lily. It was almost cringy.",
    "date": "2025-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Feels like it was written and directed by someone who's never actually experienced abuse 🙄 almost couldn't bother finishing it. 2 hours wasted.",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "the movie touched my heart and could not stop watching very eye catching",
    "date": "2025-08-14"
  }
]