[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very entertaining with amazing action and great visual effects. It has everything I want in a movie.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wonderful movie. Absolutely wonderful. I actually didn't think I was going to like it all that much, but this stupid film wormed its way into my heart and has become one of my all-time favorites. Wonderful acting, wonderful story, wonderful work. Great plot, really satisfying ending. This movie (ahem, Chris Pine, ahem) is very quotable. Really great.",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I didn't even really like the board game that much, but as a movie fan, watching this movie changed my perspective. Not only does this movie have great action, special effects, characters, and acting, but it also has comedy that is actually funny.",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A very family friendly movie that I had much fun watching it. The acting is ok, the story, yet generic, it's fun to watch. It's just an ok movie and really fun. I missed this kind of movies that it's just a fun story with likable characters.",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Definitely surprised! This movie is really fun, but also knows how to take itself seriously when necessary, highly recommend",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Good, excellent story, but it borders on comedy, leaving aside the seriousness of fantasy, even so there are moments that maintain seriousness",
    "date": "2025-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I am truly glad they finally made a big budget, enjoyable, and worth Dungeons & Dragons movie. The 2000 D&D movie is amazing, but in the opposite direction as this one. This one has a great cast, is produced well, and has an enjoyable story that ebbs and flows properly. The action and effects in this film are tons of fun, and it really holds true to a D&D tale.",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I don't know anything about Dungeons & Dragons and my brother plays it all the time. We watched this together and both really enjoyed it. He said the writers and director understood the assignment. That D&D is supposed to be goofy and plans never go right and there are always weird adjustments and they nailed that in the movie. For me, I just thought it was fun with some quirky twists and turns and endearing characters. Chris Pine is so charismatic and charming and funny and yet still sympathetic. He is fantastic. Michelle Rodriguez is always great as a tough lady. The cast and performances are great. It's an good time.",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Possibly the dumbest movie I've ever seen. I love the fantasy genre and DND, and yet I can't for the life of me figure out how this garbage has such a high rating.",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Basic and entertaining",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Verrrrrry funny\nJONATHAN!!!!!!!",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Refreshingly pleasant and good-natured with some inspired and hilarious scenes.",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "No DnD knowledge required. A general familiarity with fantasy will do the viewer just fine. The winking humor towards DnD fans is great if you catch it, but if you don't, you generally won't realize that you missed anything. Well written.",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Chris Pine was very funny.",
    "date": "2025-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great Movie. Very funny",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Not gonna win Oscars, but I had a lot of fun watching it! As a DND player, I found it very relatable!",
    "date": "2025-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Adventurous, humorous, creative.  Good entertainment.",
    "date": "2025-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The film nails the spirit of an actual D&D campaign: inventive set pieces, snappy banter, and unexpected comedic moments. However, the runtime stretched over two hours. Despite its humor, pacing issues and occasional over reliance on CGI effects, especially in creature-heavy scenes was hard to watch. And while nothing felt poorly executed, it wasn’t exactly award material. Solid entertainment, but not groundbreaking cinema.",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I never played D&D but really enjoyed this movie. Great cast, great story, great humor, great visuals and score. Overall very good and hilarious fantasy adventure.",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I wanted to love this movie, but I didn't. The lore of this world is so rich, but so much is just continually missed. I don't see a sequel for this one in the future, still a fun ride.",
    "date": "2025-07-21"
  }
]