[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This tell-all surface Netflix documentary profiles one of the most famous women of the 1990's and 2000's, and covers the exact same material that I, a non-fan, have seen before. Think of it as \"The E! True Hollywood Story (Now with Bewbs!).\"\n\nVickie Lynn Marshall was from Mexia, Texas (which is filmed like it's one of Dante's Circles of Hell). Born in 1967, she was a beautiful child who attracted attention almost immediately. She married early, had a child, and ran away from an abusive homelife, ending up dancing in strip clubs in Houston. She met another stripper there who would become a lover, and Vickie changed her name to Nikki. Pictures of Smith (her married name) made their way to Playboy and Guess Jeans, and a model was born. Now known as Anna Nicole Smith, she descended on Los Angeles, taking modeling gigs and an occasional film role (she was offered only $50,000 to appear in \"The Mask\"?!), and becoming more and more famous for not doing very much. Behind the scenes, she was seeing and married an oil billionaire sixty years older than her. Drugs became a part of Smith's life, starting out as pain medication for her breast augmentation surgery. Her son, Daniel, was by her side as she saw billionaire J. Howard Marshall, and the stripper friend, before her life began to spiral out of control- which was caught on camera by ever-present paparazzi, and eventually her own infamous \"reality\" show. She died after giving birth to a daughter in 2007, but her life made tabloid headlines even years after she was laid to rest.\n\nOne of the many flaws in this documentary is an odd one- it's not long enough. We get six hours on serial killers and their \"unheard\" audio tapes, but less than two hours on a household name who was literally in the public eye for fifteen years? Smith had a rough upbringing, and an hour could have been spent on her parents alone, instead of a gotcha moment that seems tacked on to the end of the film. The film makers could not get some important interviews that could have opened up the documentary either, so Howard K. Stern and Larry Birkhead are relegated to \"archive footage\" roles. Smith seemed to be surrounded by enablers, some of whom do talk, but she's as much a mystery after the documentary as she is before. Talking about her deep love for Marshall while she was having a fling with her stripper friend is given a pass, as is footage of Smith presenting a giant, inappropriate semi-nude picture of herself to the old man while her toddler son is standing there. Was Smith a pathological liar, an innocent, a narcissist? I don't know, and neither do the film makers. Instead, we unironically get old footage of shamed newsman Brian Williams lecturing the mainstream media and public for treating Smith's death with so much attention before playing video from other news outlets. It's a fine balance between giving the public what they want, and shoving this exposure down our throats. We finally got rid of hanging on Paris Hilton's every move, yet she still tries to get back in the spotlight every couple of years. Is it any better today? No, one of the last articles I saw on Fox News' website was about Demi Lovato's difficulties sticking to preferred pronouns. How many hours did people waste watching Smith's show, or news stories about her daughter's questionable paternity? Or the case that went all the way to the Supreme Court about her husband's estate? What did you do with that knowledge? Just like me after watching this, you hopefully cracked open a book and moved on with your life.\n\nI never saw her \"reality\" show, or paid much attention to her when she was in the news. I don't hate her, I think it's sad that a person would go through all of this to become rich and famous, and to have that same fame completely destroy her life, and the lives of those around her. This isn't a cautionary tale, because very few celebrities today are taking this caution and leading fulfilling lives. I hope her daughter is being raised \"normally,\" and everyone caught in the hurricane existence of Anna Nicole Smith has moved on as well- including the producers of this documentary.",
    "date": "2023-06-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I only watched 20 minutes of this disappointing documentary about Anna. Money making schemes.  Well if you pay attention to the playboy representative you'll see why I stopped watching soon after.  Her outfit was from a thrifty store,  she was high and omg HER HAIR! WTF? Unraveling braids? Homeless much?\nCrap cast. So sad.",
    "date": "2023-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This was a rote documentary about the model. It fills in the details of her biography but doesn't delve too deeply into anything.",
    "date": "2023-06-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I found myself more captivated by the tragic story of Anna Nicole Smith than I thought I would. I found the documentary compelling and watchable. This could so easily have fit into the Kenneth Anger \"Hollywood Babylon\" mode but it was objective and let the story play out polemically and it's a pretty sad story. She attained a level of celebrity known to few and yet her own humanity did not evolve in a way that she could take advantage of the opportunities that were presented for her in a healthy way. Her heartbreaking reunion with her disgusting father seemed to trigger the downward spiral but her shallow self centered focus seemed to be there all along from throwing her Mother under the bus and lying about her childhood, to kicking her longtime devoted GF to the curb to the ridiculous relationship and ultimate marriage to the 90 year old Mr. Marshall. Her attorney trying to spin that relationship into an actual love affair had me gagging, I mean come on. If she had actually pulled off that coup and gained half a billion dollars she would have been perhaps the \"Greatest Golddigger Of All Time!\" Alas it was a revealing and embarrassing insight into what really motivated her, fame, greed and avarice. This documentary could be a cautionary tale to any beautiful young woman with dreams of stardom as a textbook of how not to do it. All in all like watching a slow moving car accideng, hard to watch but hard to look away.",
    "date": "2023-05-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's a real person behind this. So it's always worth a watch. But the details are too much about the public image, and less about the personal journey. I give it to them that new personal footage is extremely hard to come by. They could have used professional comments maybe?\n\nUltimately it is up to us whether to watch this for entertainment, or to learn something about ourselves. To look into the mirror, and see what elements of our character are harmful to us.  To see what we do that should be arrested, and become a better person. And with such an extreme character, it can be easy to say I would never do that. But would you do a bit of it?",
    "date": "2023-05-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "once again it shows that netflix can do documentaries better than movies (most movies)",
    "date": "2023-05-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Informative and sad. Another celebrity who dealt with repressed trauma through escapism and paid the price with human life, including her own. Would've liked to hear from some of the other main characters like Howard K. Stern etc.",
    "date": "2023-05-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It could have done with some trimming and being 1 - 1.5 hours but it was still a fascinating watch of how her tragedy unfolded",
    "date": "2023-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I enjoyed the movie and was breathless, as I am sure many were then, in the presence of her beauty. I always believed that she and Marshall had a real thing between them, and she deserved something as his wife upon his death. I feel the movie might not have been based entirely on facts, and I am still unsure about many things that occurred during her life. She was undoubtedly 'damaged' and related to MM because of a similarity in need. They both wish to be loved and admired, perhaps because of past abuse. However, that remains vague even though she seemed stuck in childhood with her breathy childlike voice and ways. I guess we will never know the truth. So sad.",
    "date": "2023-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It's a poor reflection on Anna.  That old lawyer is trying to clear himself and trying to make Anna's daughter's Dad look bad. I don't believe a word of him trying to clear his name and Anna's mother trying to clear her name too. I'm sad they're all still trying to make money on her dead body.  Sucks!!",
    "date": "2023-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A girl who had a vision of being the all American dream. A good story to revisit because this story usually has the same building blocks every time. Anna's relationship with the wealthy & aged oil Barron gets set as the make & break of Anna's life. His happiness & Anna's happiness seems unusual and in both cases explores the question does money make you happy. \nMaybe the joy & ultimate disappointment of finding her real Father added to Anna's downfall. A story that shows how fame & \nsuccess surrounds people with leeches and users. What was missing in Anna's life was family and solid financial advice. Yes Anna got her dream life. This is a story of be careful what you wish for.",
    "date": "2023-05-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "\"You don't know me\" … really? This documentary added nothing new about to what we already knew about her, before she passed away.\nComparing to Love, Pamela - what changed my opinion about the witty, self-aware, likeable, and relateable Pamela Anderson - this doku was a huge flop.",
    "date": "2023-05-16"
  }
]