[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Can’t remember the last time I laughed this hard. Such a beautiful movie which brings up a lot of emotion and endless laughter. One of a kind",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Started well, ended badly. Really badly. Why do American \"comedies\" always have to take things to such extremes?",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "much better than I expected. While I didn't laugh a lot, I smiled and felt warm inside.",
    "date": "2025-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I cried so I'm not sure about it being a comedy. It made me cry a number of times starting at the piano 🎹 scene and I think the goofy comedy got it there by making everything that was silly and fun fall into place unexpectedly in a very sweet way. I rather like the ending, I've made up my own idea of what happened Spoiler Alert: She moves to Cali because she wants to show that the travel concerns to see eachother on a regular basis wasn't the real problem it was the lies in the truth of the real feelings being had, and they lived happily ever after, till the end of their day's.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Literally watching now for the second time.\nIt gave everything that was supposed to give.\nExpectations were met. Great acting.\nIt was really funny & it just made me feel lots of emotions.\nI mean that's what movies are suppose to do right?\nIt was creative & actually I can't remember myself seeing the similar comedy, which means that you are not watching with the feeling that you already saw the entire movie and know where all of it's gonna go. That's the part that I love the most about this movie!",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This movie is sooo good it perfectly captures the feelings of a person who wants a connection before having sex and a wild hookup party girl. The director did an amazing job and Jennifer Lawrence was perfect for this role.",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A fairly silly movie with solid performances from Lawrence and Feldman.",
    "date": "2025-10-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A delightful movie. Don't miss it.",
    "date": "2025-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I normally like J. Lawrence, but this movie she totally over acts. The full frontal nudity was absolutely unnecessary. Probably one of the worst movies I've ever seen.",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Guilty pleasure and relatable as I am in my 30-ties and the character’s look into the dating, parties etc is pretty close to home\nRespect to Jennifer Lawrence to step up to this role which in a ways is not flattering but she is just hilarious \nEpic beach battle scene will haunt me",
    "date": "2025-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Goofy and stupid but also kind of sweet.",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Fun movie to watch at home blockbuster vibes",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "An entertaining funny watch. Had no preconceptions and throughly enjoyed it. Jennifer Lawrence is excellent. Need a chuckle? Need a lift? Need something lighter in a dark world? Watch this.",
    "date": "2025-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "De las mejores peliculas de comedia-romance que he visto los actores supieron hacer el papel a la perfección tanto que uno puede empatizar mucho con los personajes y el perrito que sale en la peli le da un toque diferente a las demas peliculas que he visto sin duda la recomiendo mucho.",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Couple funny moments and quite a wild plot.",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It isn't my usual type of film romance/comedy but after watching the trailer I was already hooked. I'd never seen Jennifer Lawrence before either. Great acting and loved the storyline. It left me feeling really sad at the end when Maddie and Percy didn't end up together 😭💔. I think Maddie cared for Percy and loved him as a friend.",
    "date": "2025-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This movie picks out several tried and true tropes from the genre and sticks to all of them. It’s an OK movie with several plot holes, but it has enough bright spots to at least keep you watching the first time through.\n\nJennifer Lawrence didn’t really come off as a comedic actress in this film and the guy wasn’t quite pathetic enough to really believe it. The whole driver of the plot gets lost as it’s a typical pay to date scam that’s been done 100 times.\n\nThis isn’t anything I’ll watch again, but I managed to make it all the way through without rolling my eyes hard enough to knock me out. That will have to do.",
    "date": "2025-07-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 43 minutes!!!!!!!!!!!!!! Rated R for Language, Brief Drug Use, Sexual Content and Some Graphic Nudity!!!!!!!!!!!!!!!!!!! LOL, ROFL and YOLO!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This film is great, very funny, lots of action & I think Jennifer Lawrence was awesome 👍",
    "date": "2025-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Ummm… this movie isn’t good.",
    "date": "2025-05-11"
  }
]