[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Sickkkkkkkkkkkkkkkkkk",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very entertaining movie, Liam Neeson is awesome!",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Cheesy script and terrible storyline. This flick had nothing to offer.",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I think the film was really good. Love Liam Neeson's film. Just 1 thing, what the hell happened in the end? Dis he end up going to prison?",
    "date": "2025-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It's alright for a one time watch...",
    "date": "2025-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Bottom of the barrel film. \nComplete and utter rubbish",
    "date": "2025-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I really like Neeson’s acting.  It is a bit hard to believe that a serial bank robber could be anything but a sociopath (which makes unlikely any relationship between him and the girl}, but nevertheless, because Neeson is the actor the movie is very watchable..  any Neeson film is watchable.",
    "date": "2025-07-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Under-rated. There are any number of familiar plot points, but overall, the story feels somewhat fresh. \n\nDirection is good, disciplined. Camera angles/placement make for smooth cuts and action sequences. Not choppy at all, as so many action films tent to get. And nobody is gooing beyond the believable. The actors are staying within themselves, so to speak, as they should. This is an experienced cast that knows when to push an envelope and when not to. Of course, Neeson sets the standard here, and the Universe is set. \n\nThe movie rolled out logically, felt  the way you'd imagine a real life case of corruption would go down, the kind we read about in the papers from time to time. There was some dialogue I would have liked to see re-written; some of the lines were too common. We've heard them before, so find another way to say the same thing, but differently.\n\nPeople have commented on the pace positively. Didn't feel false, and the pedestrian sequences were nicely filled with information and relationship. \n\nI think this film is good entertainment.  Some of these HIGH energy films are exhausting, and I don't always want that. Just a good story, characters I like, competent story-telling by writer and director and actors. This film has all of that. Quite likable movie.",
    "date": "2025-07-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "1 hour and 39 minutes of action starring Liam Neeson. Rated PG-13 for Crude References, Brief Strong Language and Strong Violence!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "\"Honest Thief\" features Liam Neeson in a role that feels familiar, typical of his filmography, yet this installment offers a slightly different perspective. It allows viewers to see him in a new light, showcasing his talent in a character that still aligns with his usual action-hero persona.\n\nNeeson is undeniably a fantastic actor, and while many of his films share similar themes and plots, they remain entertaining enough to watch. They're not necessarily ones you'd revisit frequently, and they certainly don’t reach the heights of \"Taken,\" but they maintain a level of enjoyment.\n\nThis particular film is decent enough for a one-time viewing, though I wouldn’t go out of my way to highly recommend it. It’s the kind of movie you might watch to pass the time rather than savor. The performances from both Neeson and the lead actress are commendable, but the overall story feels somewhat lackluster. At its core, it’s a classic cop narrative with the typical good guy versus bad guy dynamic.",
    "date": "2025-05-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "(CASTELLANO) Si ves el nombre de Liam Neeson en el cartel, ya sabes bastante bien lo que te vas a encontrar. Un ladrón honesto no engaña a nadie: es una película de acción modesta, con su buena ración de persecuciones, tiros y un protagonista atormentado que, en el fondo, solo quiere hacer lo correcto.\n\nLa historia arranca con una idea que podría haber dado más de sí: un ladrón legendario que decide entregarse para limpiar su nombre. Suena bien, pero enseguida la cosa se desinfla en una trama que no arriesga nada y que se mueve entre tópicos como quien sigue una receta demasiado vista. Todo resulta demasiado sencillo, demasiado cómodo, como si no quisieran complicarse más de la cuenta.\n\nEso sí, Neeson sigue teniendo ese carisma que consigue sostener películas que, de otra manera, se caerían a pedazos. Él hace su trabajo, aunque da la sensación de que podría interpretarlo dormido a estas alturas. El resto del reparto cumple sin destacar y la dirección de Mark Williams es correcta, pero poco más.\n\nNo es un desastre, se puede ver sin sufrir, pero tampoco deja huella. Una de esas pelis que, si pillas empezada en la tele un domingo por la tarde, igual te quedas a verla... o igual te echas una siesta.\n\n(ENGLISH) If you see Liam Neeson’s name on a poster, you already know exactly what you’re getting into. Honest Thief doesn’t try to fool anyone: it’s a modest action film, packed with car chases, shootouts, and a tormented main character who, deep down, just wants to do the right thing.\n\nThe story starts with a premise that could have gone further: a legendary thief deciding to turn himself in to clear his name. It sounds promising, but it quickly deflates into a plot that doesn’t take any risks and moves through clichés like someone following an old recipe. Everything feels too easy, too safe, as if they didn’t want to make any effort to surprise us.\n\nThat said, Neeson still has enough charisma to carry movies that would otherwise fall apart. He does his job well, even though it feels like he could probably play this role in his sleep by now. The rest of the cast is fine without standing out, and Mark Williams’ direction is competent but nothing special.\n\nIt’s not a disaster—you can watch it without suffering—but it’s not memorable either. One of those films you might catch halfway through on a lazy Sunday afternoon... or maybe you’ll just fall asleep instead.",
    "date": "2025-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Honest Theif.   Not as fun as Retribution.  Stilll ok.   3.0 stars",
    "date": "2025-04-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Liam Neeson doing what he does best. Kicking ass. Never disappoints.",
    "date": "2025-03-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "While certainly nothing we haven't seen Liam Neeson do before, an above average script and solid work from his supporting cast make this version of Taken well worth a watch.",
    "date": "2025-01-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very entertaining, well written and lots of stars doing a fantastic job. Lots of action with a little bit of humor at just the right time.",
    "date": "2024-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Liam Neeson deserves better.\nAlmost 2 hours of my life I'll not get back.",
    "date": "2024-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Liam Neeson please STOP taking these scripts. Surely you have enough cash stashed away from Taken outtakes to move on. \n\nFilled with pointless gun pointing, a derivative script and unlikely characters poorly paced with zero arc and a feel good ending which doesn’t make the viewer feel good at all combine to make this filler instantly unforgettable.",
    "date": "2024-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "3.25 stars.  Nothing much new in the plot, but a solid action thriller that, as usual, Neesam delivers.",
    "date": "2024-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A Solid Heist with a Touch of Heart (Spoiler-Free)\n\nHonest Thief offers a refreshing twist on the classic heist film. Liam Neeson sheds his usual action hero persona to play a reformed thief with a conscience, and the film explores themes of redemption and second chances. Here's what this flick steals your attention for:\n•\tUnique Premise: The idea of a \"good\" thief trying to go straight adds a layer of intrigue and makes you root for the protagonist.\n•\tNeeson's Subtlety: Liam Neeson delivers a nuanced performance, showcasing a vulnerability not often seen in his action roles.\n•\tA Touch of Romance: The unlikely romance between Neeson's character and a quirky art dealer adds a surprising charm to the film.\n•\tAction with Consequence: The fight scenes, while well-done, have weight to them, highlighting the toll violence takes.\nHowever, Honest Thief doesn't quite crack the vault on a perfect score:\n•\tSomewhat Predictable: The plot unfolds in a fairly linear fashion, with few surprises for seasoned film viewers.\n•\tLimited Character Depth: While Neeson shines, some of the supporting characters feel underdeveloped.\n•\tUneven Pacing: The film drags a bit in the middle section, before picking up the pace again for the climax.\nHonest Thief is a decent heist film with a surprisingly heartwarming core. Liam Neeson brings his star power to the role, and the film offers a unique twist on the genre. While it might not be a mind-blowing cinematic experience, it's an enjoyable watch for a relaxed evening. Earning a 3.5 out of 5 stars, Honest Thief is a solid choice for those looking for an entertaining action film with a touch of heart.\nWorth the time investment!!!\n\n-\tMatthew",
    "date": "2024-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Terrible acting, totally unbelievable plot, horrendous special effects (fire scene you will know)....but mildly entertaining if you have absolutely nothing to do.  And by nothing I mean nothing.",
    "date": "2024-02-28"
  }
]