[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I can officially say I will never bet against Rian Johnson (not that I ever did).\n\nAn even better sequel to Knives Out than Glass Onion.\n\nMy only complaint is that Netflix needs to get off their streaming high horse and put these movies in theaters (thank god I found a theater near me).\n\n2nd best movie of the year (Avatar: Fire and Ash is auto number 1).",
    "date": "2025-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Such a surprisingly BEAUTIFUL movie!! Shows the TRUE purpose and beauty and gift of the priesthood, and the mercy of God. And wonderfully entertaining - great twist - did not see that coming!!",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Very disappointed in this. Was really looking forward but not o be.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie and great cast lovely twists as usual",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It was a little, and by little I definitely mean little, more violent and dark than the last. I hope it does not veer further down that path. I enjoy the humor and mystery with only slight elements of darkness and violence that are integral to the plot. Overall though this is a very entertaining movie.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It’s honestly okay. Great acting, but important to remind myself going in that it’s a fun elevated murder mystery comedy and not some pre-Oscar buzz. Solid B+",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Thoroughly enjoyable.  Brilliantly written and wonderfully directed.  An all-star cast that really gets into the spirit of moment.  Whats truly tongue-in-cheek and real messaging is left to the audience to decide.  Loved it.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Go see this on a big screen with an audience. It is brilliant.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie, wonderfully entertaining.\nHave to rewatch the first one to decide which one is better 👍",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Another great entry made by Rian Johnson. While I could guess the killer, I could not guess how they did it. Mystery did almost seem impossible at moments. It's pretty opposite in tone and style to Glass Onion, so if that's your favorite one, you might not prefer this one, but I like how each movie has a different vibe. Great reveals, nice acting! I hope to see more movies in this franchise!",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I can appreciate a good murder mystery. I thought the original movie was very good so I decided to give this one a go and found it incredibly boring, lifeless and lacking. The attempts at humor fell flat and I never really felt connected to any of the characters. This film could have and should have been shaved down to 90 minutes instead of almost 2 and a half hours.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Keeps you guessing throughout the movie. This movie was made well and the clues are there upon rewatch. This movie differed from the first two movies as it focused more on the two main characters as opposed to the cast as a whole. I thought it had a nice mix of humor, suspense, and had the \"Whodunnit\" factor.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "To clarify: I am not religious, but was raised Catholic and know cursory things about the priesthood. There are charming moments in this movie. Some good performances. But the script is so bad, guys. How did this guy even become a priest? Literally: killing someone is automatic nonstarter to becoming ordained — an actual rule. And he’s like this naive Everyman, but there is no way on Earth this guy would be a priest in NY. It is wildly difficult, time-consuming, so much eduction and discernment required. It was a plot device that didn’t stand up to the slightest scrutiny. There are so, so many holes in this story besides. I found myself rolling my eyes on several occasions, and I LOVED the first two movies. So many loose threads that they didn’t bother addressing even with the silly-long runtime. You have to suspend so much disbelief to just enjoy the movie, which is a big turnoff for me. I’ll overlook a lot for a good movie. But the foundations here are way too thin and shaky for the convoluted mess they tried to build atop.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wake up dead man is the best knives out movie it was fascinating to see how it all played out it is the most dark one if you have young children it could be scary but it is rating pg 13 in the USA or 12A in the uk",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I'm a sucker for a good religious story, and this felt like the best 'mystery' story line of the three Benoit Blanc movies. The cast was excellent, as expected, but not nearly as fun as Glass Onion or as widely appealing as Knives Out. As long as Rian Johnson makes these, I'll be there.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It was okay but a long way from being gripping - in fact it dragged in several places. Excellent actors all hamming it up, creating a film that for me was significantly less than the sum of its parts.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Energetic and entertaining the whole way through and a welcome return to top class form from Johnson. Definitely the funniest of the 3. Stronger in its setting and themes this time around. Craig and O'Connor have an incredible chemistry together. The majority of the side characters are fairly weak and the wrap up isn't fully satisfying. As long as Johnson and Craig are willing this series can never end.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Another winner from the Knives Out franchise, the most complex and maybe the best yet.  Daniel Craig outdoes himself and the entire cast is having a wonderful time.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great plot with excellent acting and character development",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A fun romp with a great cast. Daniel Craig is a treasure.",
    "date": "2025-12-01"
  }
]