[
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "From the movie preview, I thought they were in the business of running scams on people (which would have been more exciting) which is why I got excited about watching it; only to find out they just play people only to sleep with them, like waaaaht!.\n\nAnyway, getting to the part of the double date, they never played with each other like that at other times, no, not even when they were alone but at the double date, that was the only place they played with each other and showed us they knew so much about themselves and from there it became very predictable. Well, I wouldn't recommend this movie.",
    "date": "2025-05-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This the thing, if you are already dont need to watch this. This show is all about being player women since young age. I prefer to watch American Pie instead here sorry I dont like the story",
    "date": "2024-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Trite little tale that fails to amuse or entertain",
    "date": "2024-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Players - 6.5/10. This is a \"shrug\" film (a movie you won't remember or care for in the future). Though, its still a good enough watch and will pass the overall time you spend on it. Gina Rodriguez is charming and great here, and she lights up the screen every time she's in a scene. But Players reminds you so much of other better films, and that's its downfall of the film. Its funny enough and charming enough, with the vibe of the film and the camaraderie of the group is what makes the movie better than your run of the mill romcom. Its story is a bit cliched though, and you kinda know where it will end up going near the halfway point of the film. Players is another one of those Netflix romcoms that will be enjoyable enough and good enough to watch, though, you shouldn't expect anything genre changing here!",
    "date": "2024-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Well done. Well done. Lots of great camaraderie and jokes to keep this movie fresh, gets a little too mushy and predictable towards the end but had to happen, don’t need a La La Land ending on this one. Now back to my falafel.",
    "date": "2024-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is one of the worst films I've ever had the misfortune to stumble across. Unlikable across the board and makes out deception is acceptable.",
    "date": "2024-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is the worst thing I’ve ever watched.",
    "date": "2024-06-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Started great but unfortunately ending boringly- it was obvious who would end up together. They used so many lines from ‘How to Lose a Guy in 10 Days’ that it began to feel like a shabby remake.",
    "date": "2024-05-31"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Just a really bad movie with bad morals and nothing to it.",
    "date": "2024-05-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I could only endure the first 18 minutes of this ethically repugnant and witless rubbish... but teens with an emotional I.Q. bordering on sociopathy might enjoy it.",
    "date": "2024-04-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Sorry but found this really hard to watch. Obviously, I hadn't realised that this was geared to teens. Was hoping Tom Ellis had a more interesting role worthy of his talent. He must have been asked to be in this to create audience views. Actors were good, but plot so immature, who acts like this not even teenagers surely?  Net flix does do some filler movies and this was one of them.",
    "date": "2024-03-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I love Gina Rodriguez in \"Not Dead Yet\" so I gave this a shot. It's a lot better than I expected, given the reviews. Better named \"The Wingmen\", the main two twists that made me rate this a strong B+ is due to the writing and Gina's great acting. Not to downplay the great acting by the rest of the cast, but I recognize no one in this movie other than Gina. That said, I thoroughly enjoyed this fast-paced romp. If you like rom-coms, watch this! ❤️",
    "date": "2024-03-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great way to spend an evening watching a fun movie with the great Gina Rodriguez and all the other actors/actresses that made this a very fun romp. It ain't Shakespeare, but who cares! It was highly enjoyable. We need fun, light diversion during these times. MAKE ALOT MORE OF THESE MOVIES!",
    "date": "2024-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Worst movie in the world 🤮🤮🤮👎🏼",
    "date": "2024-03-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thought this movie was great, You can feel the chemistry between the actors. It feels real. Even though the love story was predictable it still felt fresh and kept me watching throughout.",
    "date": "2024-03-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Such a feel good movie, super hilarious & smart! I love this movie! Had me laughing & crying & the love story 😍 Definitely recommend the watch!",
    "date": "2024-03-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A wholly harmless and alright rom com, filled to the brim with absolutely fake people that don't exist in any known universe.",
    "date": "2024-03-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Not so good. Interesting story line but the acting was poor. It was a whole lot of nothing…..",
    "date": "2024-03-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I stopped watching this movie at 20 mins Gina Rodriguez doesn't appear one single scene with the abs not showing. Is she the executive producer so she can say  let's show off my body and make sex scenes with all the guys? I gave one star, unoriginal, tedious and predictable.",
    "date": "2024-03-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It came around in the second half but like others have said they were garbage people/sociopaths, early on I'm the movie and generally speaking.  Makes you kinda not care what happens and it was trying a bit too hard to be cool with all the references to \"plays\". Still somehow charming.",
    "date": "2024-02-29"
  }
]