[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I really don’t understand the reviews I’ve read about these movies being so negative. I almost didn’t watch these; as I don’t like obvious mostly cgi movies that are basically constant shoot outs and fight scenes with no real story just the same old boring poor excuse to make a dumb movie purely to show the ‘pow pow pow’ and backflips on repeat or these days even unnecessarily disgusting scenes. But I was pleasantly surprised, the story actually has a lot of potential and I liked the depth of the worlds that have been set up and I’m really interested to learn more about the worlds and universe. I liked it so much that I watched both movies back to back and I’m the kind of person that sci-fi can bore me and not hold my attention to the point I zone out and miss most of the movie. This had me captivated throughout and feeling fortunate that I was able to watch them back to back and the story continued really seamlessly. I will say though that it felt like one movie and not two so the experience may have been different for those watching these separately. These movies set an interesting foundation, I would like the next movie to add depth to the story and tell us more about the mother world and the universe set up and its history. It’s a very good start but feels like the first few chapters of a book and I want the rest!  I don’t think this series of movies can be judged until they next one or two are made - the treatment of the next instalments will evidence the level of depth the story has and whether it is good overall.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I didn't think that the first movie could be better than another movie, but it turns out, it could be better than one movie, its sequel. The pay off for this was totally not worth it. I almost want to watch it again just to feel my pain.",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Posting in the 2nd movie as well I just fully watched in un sitting both movies I don’t get why people are hating it, yes it was more visual effects than character development however this has the potential of becoming a great universe, if they actually do create the 6 movies or more it will be awesome, people need to understand that now a days you first need to capture the eyes of the audience if you’re doing something from scratch and then slowly develop it into a full universe, most movie universe that we have are based on books or comics but this is something new with inspiration of things that we have seen but still has its own uniqueness so I’m excited to see what they bring next!",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Worse than part 1 - I didn't think that was possible but here we are.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a amazing action movie",
    "date": "2025-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Somehow even worse than the first Movie.",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I have watched this movie last year and this is a great movie besides I love the action in this movie.",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Director cuts are the best version to watch.",
    "date": "2025-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I had a awesome time watching this movie.",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Perfect action fight dark tone love it",
    "date": "2025-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Calling this movie a mess is an insult to the notion of mess. It's chaotic, without any passion for the story or the characters. Whether or not its technically well done is irrelevant because its such a bore watching cardboard characters engaged in a cliche of a story.",
    "date": "2025-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Zack. Please stop with your \"Star-Wars\" rebooted movie. It's not gonna help.",
    "date": "2025-06-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "buncha slow motion doubled down and the story is dull",
    "date": "2025-06-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great follow up in an amazing story. The world building and character building is incredible. In the same way LOTR extended cut adds  depth I recommend the directors cut for this movie if you have the time.",
    "date": "2025-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "They made a second one...saw all the complaints about the slow motion and DOUBLES DOWN!! Run time would be cut in half if you normal speed all the slow motion.\n\nDon't bother wasting time on this thing.  It is not one of the \"it's so bad that it's good movies\" it's just plain bad.",
    "date": "2025-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "So boring, I went to tidy up my bedroom and laundry then returned to watch. Still boring. Time to prepare my dinner.",
    "date": "2025-05-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I really enjoyed this move both part 1 and 2 are off the charts action and adventure. Over the top visuals brings great depth to the action parts of the film. I did watch both of the directors cuts of the film i think that its the way to go if you take time to watch part 1 and 2. Highly recommended especially if you are a sci-fi movie fan!",
    "date": "2025-05-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I really don't understand the bad reviews, if you look at the effects and the story.",
    "date": "2025-05-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Don't understand the bad reviews at all. If you like sci-fi movies and hero stories you'll absolute like the 2 Rebel Moon movies with a good and entertaining story although it's not original at all. It's Netflix streaming movies so they're not perfect and probably don't have a huge budget but they're absolutely much better than the latest Star Wars movies. Watch it!",
    "date": "2025-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Unfortunately, it is not much of an improvement over the first part. Once again the action sequences and scriptwriting were poorly done, but the movie had amazing visuals and some enjoyable moments. It was definitely fun to watch, and I would put it in the 'it's so bad it's good' movie category. While the Rebel Moon saga has its flaws, I am curious to see how the rest of the story unfolds, so I am fully on board with Rebel Moon: Part Three.",
    "date": "2025-04-12"
  }
]