[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 02 hours, 05 minutes, and 40 seconds!!!!!!!!!!!!!!!!!! Rated R for Strong Graphic Violence and Some Language!!!!!!!!!!!!! The USA grossed over $47,000,000.00!!!!!!!!!!!!!!! Starring Mark Wahlberg, Michael Peña and Danny Glover!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Story was meh and not believable.. Levon Helm had the best part but was only 3 min long. . The movie felt rushed., and jumped around too much. I spent most of it thinking “What?..No way!”\nThe gun battles  and action scenes were what kept me watching.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Mark is an incredible actor! One of my most favorite movies from him. Action packed thriller!! Classic in my opinion.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Some obviously unrealistic bits but definitely a great movie in my opinion!",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This is a very fun movie! Does it have plenty of plot holes and unrealistic scenes? Yes, absolutely. But if you go into it without trying to pick apart every scene, it's just a blast from start to finish. \n\nIt has funny and likeable characters, many satisfying scenes, and some disturbingly convincing villains. Put your tinfoil hat on and enjoy the ride!",
    "date": "2025-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Exciting all the way through. Justice prevails. What more can you want?",
    "date": "2025-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "\"Shooter\" (2007) is a good action thriller from the director Antoine Fuqua. Mark Wahlberg stars here as US navy shooter that get cauth in a conspiracy. The plot here is pretty good and kept me involved until last frame. It does go a bit beyond typical good guy vs. bad guys here, but not that much. Were this film shines are in great cinematography, good editing, solid acting, and good directing. At running time 2 hours I did find this film to be engaging. All off the snipers stuff here is also very interesting to hear and to see.\n\nOverall, \"Shooter\" is one of the best films made by Antoine Fuqua. It's a solid genre film.",
    "date": "2025-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Best Mark Wahilberg movie I've seen from him",
    "date": "2025-04-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A run of the mill action film but it is a fun time all round.",
    "date": "2025-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Decent action, ok acting, some decent moments. Story was not amazing and mostly forgettable. First half of the movie was a tight mystery/detective  movie, but the second half lost all the logic and just went into shooting/fighting.",
    "date": "2025-03-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's a decent movie. Don't be fooled by the critics score. They gave a movie about 3 people walking through the woods, stepping on leaves and arguing with each other for an hour and a half a whopping 86%. What was the name of that trash again... I can't remember... Oh yea, THE BLAIR WITCH PROJECT",
    "date": "2025-02-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Great action/entertainment movie as Mark Wahlberg outsmarts the government morons that think they're in charge. Great casting with a lot of familiar faces playing good roles. Levon Helm was perfect in his role. A well written script and quick pace makes this a very enjoyable movie.",
    "date": "2025-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "47% from the Critics!? Haha! That's why I never give their opinions a grain of salt. The audience opinion is all that matters, unless they're real people posing as idiot critics anyway. \nThis is a GREAT movie!!!",
    "date": "2024-12-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I had seen this film a while back and recently revisited it. While it's not groundbreaking cinema, it's a solid action thriller that delivers on its promise of suspense and exciting action sequences.\n\nI'd say the film works primarily because it's based on a strong novel, and the film adaptation was a straightforward job, not trying to be anything more than it needed to be (for better or for worse).",
    "date": "2024-12-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I was like 13 when I've first seen this movie it was my favorite movie for a long time and I can still rewatch it with the same joy every now and then 100% suggest to watch",
    "date": "2024-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A great movie constantly shown on cable tv despite the critics’ reviews!  What do they know?",
    "date": "2024-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I felt like I've watched this same character from Mark Whalberg many times before",
    "date": "2024-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "While I really like Antoine Fuqua and think that he's one of the most underrated directors, this is not one of his best movies. By far.",
    "date": "2024-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "In my opinion, the movie uses very good camera and audio visual equipment and the crew members and the filmmakers have played their roles very well. I really liked it.",
    "date": "2024-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "It was so adventure and bot bored",
    "date": "2024-07-30"
  }
]