[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Freaking hilarious. True to our day and age. A bit predictable but that’s the genre of the movie: an easy going comedy with no filters",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This movie had three different plots running at the same time. The writing was chaotic and it just did NOT flow. I love Bill Burr and his humor, but there was not much of it throughout the movie.",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "All around pretty fun movie, especially for Netflix standards.. This movie is definitely worth a watch! Don't let critics negative reviews sway you away.",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I think it’s an alright movie. I love Bill Burr as a comedian but I always have to take him with a grain of salt. This movie is just very political and most of the takes seem very “old head- right wing”. Very old school, overused jokes and takes.  Some parts had me laughing , others had me rolling my eyes. Some of it seems pretty forced to fit the narrative. If you don’t like Bill Burr , this movie is definitely not for you. I am part of younger millennial, elder gen z demographic and although I found a lot of the jokes refreshing and funny, I also found my self viewing this as if my grandpa made a movie on his political views.",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie pissed me off. It's so boring, and the ending is just straight up infuriating. Once again, bad job, Netflix.",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This an absolute must must watch if you love comedy. It reminds me of older comedies from the early 90's for some reason that eludes me.\nBill Burr is a standout. He's a comedic genius and when he hits his jokes they hit hard.\nThe plot could be about anything because of the level of bill's performance.\nWatched it for the 3rd time today. A movie that's re-watchable for me comes in about 1 out 30 movies. A fun movie for the whole family! If you don't mind your kids being exposed to Bill's very occasional cursing. \n5 stars",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Pros: Bill Burr's acting has become seamless and believable. His comedic mind is one of the best of his generation. The first half of the movie is like the first half of his career: brutally honest, on the edge, uncompromising, blunt, masculine and brilliant. A comic at the top of his game. \nCons: the second half of the movie is like the second half of his career. Timid, tepid, apologetic. The brilliant mind remains but he seems as if he has to ask permission now for his balls to hang out. The three men characters compromise at the wrong times for the wrong reasons to overbearing, narcissistic wives and girlfriends, sealing over the cracks the men created to reseal the bubble of denial and disillusionment these women inhabit and require of their men too. Choose solitude and loneliness next time, guys! When the main character in the end is kneeling and crying with a baby in his arms and saying he'll go to therapy, instead of it being touching, it is as if he's accepted the values of the cult and is begging at the altar for absolution. Burr has officially become the post Yoko John Lennon of comedy.",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "If you love Bill Burr you will love this movie!",
    "date": "2025-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "He does use some expressions that are considered inappropriate when talking around seniors, but he doesn't talk to older people in the movie other than the one who does it even more. He was not inappropriate at all. My personal opinion is that he was not angry enough in the situation his character was in.",
    "date": "2025-06-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "hmm, can't imagine why all the typical critics don't like this film??, anyway maybe some points and observations made in a bit of a blunt, not to subtle way, but overall a well acted, decent film",
    "date": "2025-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This one hit close to home not only because of the aged fathers but the relatability of trying to understand the current generation.",
    "date": "2025-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I love Bill Burr, but everyone was so ridiculously/unrealistically unfair to his character in this movie that it made it hard to watch. I get that it's supposed to be a bit farcical and make a point. And there is a bit of justice at the very end. I also think Burr's message about needing to take responsibility for how one reacts to situations (e.g., lashing out when angry versus not) is important—I'm just not a fan of the \"everything the main character does is wrong\" trope.",
    "date": "2025-03-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Being the age of the dad's in this one it hits home with most of the jokes. It could have actually taken more risks and been even funnier.",
    "date": "2025-03-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It was ok.  I used to live bill burr, being a Boston guy myself.   He used to have a hard edge, which he does in the movie and basically shows what I think happened to him in real life.  He got married and had kids and moved to LA and drinks the kool aid.   His wife in the movie basically cuts his balls off when he points out the bullshit he sees around him and at the end, he changes into a pansy.  No wonder kids grow up to think their all very special unicorns and can do no wrong.",
    "date": "2025-02-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Good fun worth a watch , it misers that mark on a few jokes but over all enjoyable",
    "date": "2025-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "He was funny in this but I wish it didn't take itself so seriously at times.  Could have been way funnier without a message.",
    "date": "2025-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Old Dads is funny. Some critics are taking it too seriously. True, the film doesn't say much that hasn't been said before, but it doesn't need to. It's a steady serving of laughs.\n\n    The pacing is iffy at times and the runtime is on the long side for a romp, but the length is justified by the three-act structure that sees each subplot through.\n\n    Granted, this is not the culmination of cinema. The Netflix-style close-up to close-up coverage can get tiring during dialogue. The family drama might feel less conventional if it was allowed to breathe like a stage play, which Katie Aselton and Bill Burr could certainly pull off.\n\n    As it is, the threat of blandness is still mostly defused by convincing acting. The ensemble cast is solid throughout and the main characters well-written. Miles Robbins is an unexpected highlight as the millennial villain. The Gen Z characters can sound like caricatures, but this is an egalitarian film: no one's safe, and the old dads are often just as ridiculous.\n\n    Burr delivers regular laughs in the classic comic's role, an asshole version of himself  — although Jack isn't a comedian but an everyman entrepreneur with dubiously good mic technique. The script Burr co-wrote sometimes serves as a prop basket for his tirades, but the film knows when he's the asshole. If you look past the f-bombs and coarse hilarity, Old Dads carries a genuinely warm undertone of familial love.\n\n    Definitely worth a watch, but I'm a biased long-time listener just checking in on ya.",
    "date": "2025-01-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "U like Burr, but he seems like he’s a little out of touch on this one, ironically.",
    "date": "2025-01-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "What a great comedic statement about the growing cultural divide in America. What is even more interesting are the pompous critics who slam the film because it hits too close to their thin skin.",
    "date": "2025-01-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "When a movie delivers on its promises it can never be a miss. Critics will tell you that this is no cinema classic piece and to them I say \"no sh*t sherlock\", it's a Bill Burr film.\nIts great entertainment, good jokes, great laughs and a \"I don't give a damn\" attitude for people who would feel offended by it... Great! Someone has to!",
    "date": "2025-01-04"
  }
]