[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The Bad Guys 2 is an absolute blast from start to finish.\nThis sequel doesn’t just match the energy of the first film—it elevates it. The animation is slicker, the jokes land harder, and the characters feel even more confident in their chaos.\n\nThe story is fast-paced without ever feeling rushed, blending heist-level tension with that signature charm that makes the whole crew impossible not to love. Every set-piece is bigger, bolder, and more inventive, and the film somehow manages to deliver heart without slowing the momentum.\n\nWhat really makes it shine is how effortlessly it balances humour, action, and genuine character growth. It’s one of those rare sequels that understands exactly what made the original great—and doubles down on it.\n\nIf you loved the first movie, this one will feel like a gift.\nFun, stylish, and wildly entertaining—The Bad Guys 2 is pure joy.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is absolutely hilarious! Would recommend to anyone",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie for kids.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Funny and action-packed, The Bad Guys 2 is a worthy successor to The Bad Guys.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Bad Guys 2 was good. I enjoyed how the animals mimic real people and real problems. It’s such a cute kids’ movie to watch with children. Sometimes I wish the movie had a different animation style or different animals because it reminds me of Zootopia. The comedy was chef kisses  Snake was my favorite character in this movie. I would definitely recommend giving it a watch.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Spectacular. Absolutely phenomenal. It was all the magic that made the first one so hilarious and fun, but with even more excitement. Incredible characters, the art style, music, sound effects, voice actors, animation…no notes, perfection. These movies are so underrated, truly top tier movie, I LOVED IT.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "love it",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie is the worst movie me and my family have ever seen",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "DreamWorks expertly builds off of the per-established Bad Guys gang in this thrilling adventure for all ages. The newly introduced characters take some time to develop. While there are a few moments where side plot tangents continue for a little too long, the action is always plentiful when its moments come.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very cool, fun, and enjoyable!",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie hilarious! Perfect for family night, and my preteen likes it to! Win 5 stars!!",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The Best Movie Ever",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "just bring on zootopia 2",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Love it! The movie is so good, it's a absolute must-see!",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "As a fan blockbuster movies I truly loved this movie so much♥️♥️♥️ I recommend you watch it if you're looking for an animated thriller movie for your kids I tell you, you won't be disappointed 😍",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Good movie, I enjoyed watching with my 8 year old",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I was a big fan of the books. But they changed the lore! Why do Dreamworks movies do this?!",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "VERY VERY VERY great movie!!! I absolutely loved it and I thought it was better than the first! DreamWorks really needs to make a third one! \n\nThe blend of comedy, action and some romance was really great! The post-credit scene shows that there is a high chance for a third movie and hopefully it is going to happen! \nOtherwise, great movie!",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Witty, sharp, and whimsical silliness that takes you and the family in a wild ride from start to finish.",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "it's good I like it 😁",
    "date": "2025-11-10"
  }
]