[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was one of the best acting I’ve ever seen. The lady was tops.",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I'm really glad this movie exists.",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolute gem of a film! It follows the life of a drunk woman and just when you don't think she can be redeemed, there's a cute love interest. The acting is superb. Literally no criticisms at all.",
    "date": "2025-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing! The movie is a slow slog into redemption with great acting along the way.",
    "date": "2025-02-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The acting is phenomenal, but you do have to suspend disbelief that an annoying,  self-destructive, self centered  drunk can turn her life around like that....but a nice, tear-jerking,  finale anyway.",
    "date": "2025-01-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This is a film where not too much happens, don’t expect plot twists and car chases.  However Andrea Riseborough’s performance is completely mesmerising. She captures the essence of the character and has a decent script to work with. The rest of the cast does a very good job too. Worth a watch.",
    "date": "2025-01-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Spellbinding acting. Showed a hopeless drunk and how they let everyone down. The turn around was pretty unrealistic but acting saved it",
    "date": "2024-12-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I was able to tolerate 37 minutes. There is a convincing description of a middle aged woman who behaves like an irresponsible teenager. She is a mother as a result of having a uterus and not about showing any interest to protect and raise a child. Her basic objective is to get money, not by holding a job, so she can afford to drink. It looks like occasional prostitution could be part of the plan, but I am not interested to find out. Essentially she has a psychopathic personality. She steals from her own son and his roommate because right and wrong for her is based on what makes her feel good. According to Wikipedia, later on she reforms, which most psychiatrists would consider highly unlikely. I have watched many depressing movies, but this exceeds my tolerance.",
    "date": "2024-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's impossible to overstate what a remarkable role Andrea Riseborough plays in this deeply moving and thoughtful drama.\n\nHer careful and not overacted part as an alcoholic who left her only child for the bottle at just 13, it’s a study in a balancing act between hope and destruction.\n\nThe role of Marc Maron shows the sadly too rare kindness of strangers…it is out there, it just doesn’t always come to the fore, in today's society.",
    "date": "2024-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Oh, I just loved this so much. Wonderful in every way, from start to end. Bravo!",
    "date": "2024-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Powerhouse performance by Andrea Riseborough hearkening back to the glory days of independent cinema. Cinema really doesn't get any better than this.",
    "date": "2024-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Incredible performance by Andrea Riseborough and Marc Maron.  The first 2/3 of \"To Leslie\" are painful and heart-wrenching.  We've all seen friends and colleagues fall apart due to drugs or alcohol.  And Leslie hits rock bottom.  There's when Marc Maron comes in, playing an older hayseed.",
    "date": "2024-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The actress in To Leslie was phenomenal.  What a wonderful actress.!",
    "date": "2024-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "STINKIN' VEGGIES IS RIGHT ABOUT THIS ONE and the audience missed considerably. TO LESLIE isn't monumental. That said, although it's difficult to watch in places, it's an excellent story and screenplay with Andrea Riseborough knocking it outta the park and onto the roof across the street with a very seriously difficult performance that probably took a toll on her pulling it off. And Nancy Janes slightly understated performance is top notch (it's easy to see why she's managed to win and Academy Award. Those looking for something real and well done, TO LESLIE will fill the bill.",
    "date": "2024-06-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Excellent performances and a pretty good story, but quite slow and boring at times. It could easily have been twenty minutes shorter. Viewers don't need to see so much of someone being messed up to understand that she's messed up.",
    "date": "2024-04-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "a riotous gem of a film! this little independent film never got its rightful recognition from all the awards ceremonies with the exception of the academy awards and rightly so. andrea riseborough is absolutely mesmerising as a mother struggling to save herself from a lifelong addiction with alcohol. it is this struggle along with her character's determination to rehabilitate herself primarily driven by her love for her son that enables riseborough to fully disappear into the role and allow the audience to believe in her pain and struggles and to secretly cheer her on toward a better future. a phenomenal performance by andrea riseborough.",
    "date": "2024-03-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The movie takes an interesting narrative middle road where it's neither misery porn nor overly sentimental. In short it earns the redemption arc for the central character.",
    "date": "2024-02-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A cinematic masterpiece! Gritty, powerful and gut wrenching story. A must see for anyone who appreciates the lost art of filmmaking!",
    "date": "2024-02-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Mainly unlikable characters and.slow moving story line left me wondering about all the rave reviews.",
    "date": "2024-02-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Great performances with a strong directing style that will make you tear up.",
    "date": "2024-02-06"
  }
]