[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I love that they are training pedigreed Labradors to be service dogs and other breeds, pretty much purebreds who were raised by their mother from birth. What about our rescue who was abandoned by their mother or neglected by their owner.  How do we help to see inside their mind?  Would love a reply.",
    "date": "2025-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Inside The Mind Of A Dog - 10/10. Dogs are the best! No other pet better than them (in my opinion). This great doc shows our favourite friends as we understand how and why they do and act the way they do. The good boys and girls are as complex and as communicative and expressive as we are. If you’re a dog lover like my self, you will love this doc. Its a great watch to understand the mentality of the species, and also understanding the behavioural habits of the 4 legged angels. A great quick doc!",
    "date": "2024-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A moving film that explains and reminds you of what Dogs do and why.  It was informative and moving.  I recommend it.  Saw on Netflix.",
    "date": "2024-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's fine, for kids and adults. It's no frill and facts are sometimes how shall we say, off. But even rudimentary, parents can watch with their kids and that's cool! Final Score: 6.5/10",
    "date": "2024-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This was a cute show, but should have been titled, \"On the road to becoming a service dog\".....I don't feel like it gave much insight into a dog's mind!  It was still enjoyable...",
    "date": "2024-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This show doesn’t rise to the level of documentary because it is so bereft of facts. The links were tenuous and rather than give insights into canine cognition it was a long-winded explanation of how service dogs are trained. We found interviews with academics so superficial that they were pointless. Satisfactory perhaps for a second grade grasp of science but too unstructured for an audience of any age.",
    "date": "2024-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wonderful show for dog lovers!",
    "date": "2024-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Very American. The rest of the world ain't necessarily gonna enjoy it.",
    "date": "2024-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Excellent topic for a documentary but dumbed down to made cute.",
    "date": "2024-08-11"
  }
]