[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Good movie to watch on a weekend",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Rating: 5.6/10\n\nNew Moon is a slow, depressing sequel that suffers from the absence of its main star, Edward Cullen.\n\nHighlights\n- Faithful Adaptation: The screenplay captures the core theme of Bella's depression and isolation.\n- Strong Performances: Taylor Lautner shines as Jacob Black, and Michael Sheen is delightfully campy as Aro.\n- Visual Style: Director Chris Weitz brings a new, warmer visual style, and the score is elegant.\n\nCriticisms\n- Weak Plot: The story sidelines Edward Cullen, making the central romance grind to a halt.\n- Passive Protagonist: Bella becomes a passive, moping character, lacking agency.\n- Slow Pacing: The direction is plodding, making the film a slog to watch.\n\nVerdict\nNew Moon is a commercially successful but critically-panned sequel that faithfully adapts the novel, but is marred by its slow pacing, weak plot, and awkward characters, making it the weakest entry in the saga.",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It's long, boring and stupid. If in the first film there was a constant blue filter so you couldn't understand if it was day or night, now there's a new yellow one so it always looks sunny. Also, they killed off the old man that looked like Kung Fu panda. I liked him. Jacob looks like a lesbian mom of 6 with short hair, and also doesn't seem to own a shirt.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Breakout for Jacob!  Finally the Volturi make their presence know and the cliff hanger!",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love all the movies in the twilight series! I’ve been obsessed with them since I was a kid and I’m still obsessed with them as an adult!",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This is not my favorite book nor movie, but hot damn is it still fun to see in theaters. This movie is light on the Cullen's which I think is the downside. Bella is the worst and Jacob and Edward deserve better. Charlie also deserves a better daughter.",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The movie was great but the crowd tonight was not as into the movie as last nights TEILIGHT crowd..so it wasnt as fun as it could have been",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Even better than I remember, I love this movie",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I am huge fan of the Twilight Saga, so happy the movies came back in theaters for the fans to enjoy.",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's film No. 2 in the TWILIGHT saga.  And Best seen on the Big screen.  It was Awesome and brought back a lot of Bella, Edward and Jacob memories from seeing it the first time around.",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great story line, awesome cast, and great vibes! This is one of my favorite movies in the Twilight Saga.",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Es una pelicula espectacular muy romantica con un buen toque de misterio y suspenso, la pareja protagonica es excelente.",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 2 1/6 hours!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Ages 13 and older!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The worldwide gross is $712,111,133.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I have read the books now and now I love this movie even more. I think this is the best of the twilight franchise in terms of film and book. If you’re a twilight fan, I believe you would love this movie as much as I loved it when I first watched it, I didn’t like it, but I after reading the books. I liked it.",
    "date": "2025-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Sparkly vampire leaves girl",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Okay so the acting of Kristen Stewart and Robert Pattinson definitely improved in this movie. And I really liked the movie",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I think this is the best movie out of all the twilight series. I love the duo of Jacob Black and Bella Swan.",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Probably the worst movie from all the franchise.",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Just ass (its not a opinion ITS A FACT)",
    "date": "2025-06-29"
  }
]