[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved this movie just as good as the other two. I you like either of the other two movies you will love this one.  A must see.",
    "date": "2025-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Wasn’t a fan of the accent used by the actor who played the villain.  Other than that the movie was very good",
    "date": "2025-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Honestly I loved the storyline and how they pulled me into the movie and kept me on the edge of my seat for the whole film!   I already want to see it again!",
    "date": "2025-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie...suspense, mystery..not boring....",
    "date": "2025-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was a really good movie with some funny moments.  if you liked the first two movies, you'll definitely love this one. A++++",
    "date": "2025-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "We thoroughly enjoyed it. Maybe not as good as the others and a bit over the top but still a ton of fun, right when we need something like this during the fascist takeover and takedown.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Movie for kids, waste of time. Ai can write a better script",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Sorry but this was the worst of the franchise. Number one was a brilliant film. Two was so-so and this one just didn't cut it. Awful storyline, very disjointed, lacked the mystery and slickness of the first movie. Wouldn't watch a fourth film.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Entertaining, although maybe a bit too much \"fan service\"",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Still a very good franchise. Lots of action, cool magic and a nice twist at the end. Great movie!",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "honestly it was really entertaining Magical it maybe up for a Ocar nomination",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I enjoyed how the eight characters worked together, even though it seemed like they didn't want to at first.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Ugh this was hokey and dumb with very poor performances. Save your money on this one. More of the same lame content that leaves you wondering why they bothered at all.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Wanted to like it but it was BAD BAD BAD. So disappointed with this very uninspired experience.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Too long a gap between the previous part and this one. The audience has changed. The narrative feels forced. Too many characters, acting feels rushed. Set pieces are pretty pedestrian. Wait to watch on streaming, or just skip it.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thought it was really good :)",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I liked the humor, the action, the plot and the characters. I feel like it was very consistent with its predecessors in terms of keeping you interested and guessing.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fast and Furious but make it magic. I’ve scarcely seen actors do so much with so little. Horrid dialogue. Weird direction. Shamelessly recycled plot line. Loved every second.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The dialogue in the movie was so bad and therefore made the acting unbelievably bad.  Not sure what they were trying to do but I wanted to leave after 30 min.  Thankfully, the movie got more interesting but the bad script took away from it.  And finally, kinda predictable ending",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "it potentially could've been a good movie, but the screenplay was really bad and some of the acting was very subpar",
    "date": "2025-12-01"
  }
]