[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "i love adam sandler here but eh honestly its just like the first movie and it dont really get to me",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This one’s just a tad bit better than the first one now murder mystery wise, The first one is better because more characters and more harder to pinpoint who it is, but even though it’s name (mm2), it doesn’t have to be a great mystery. It gets the jobs done while being fun. Found some of the characters to be really funny. I didn’t like how how all the side characters who survived in the first one were in it because you knew they weren’t going to be the murderer and if they were that wouldn’t make sense I think if they brought them in, they should’ve at least killed one of them.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Murder Mystery 2 is still funny and has a lot of beautifully shot locations, but the story is very similar to the first one.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It was as entertaining as watching old people eat.",
    "date": "2025-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "In comparison to the first movie, I'd say that based on the general subjective state of the person at the moment, one might be better than the other for some while for some others the opposite. I myself enjoyed this one more. I laughed for most of the movie, as I saw that the friendly rom-com chemistry between the actors and their body language or words not only effected the viewer, but also the events to come. I totally recommend it and advise any film makers out there for more works like this.",
    "date": "2025-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Adam Sandler and Jennifer Aniston share a remarkable on-screen chemistry, making Murder Mystery 2 a pleasant watch for those who generally enjoy Sandler’s films, even the ones that fall short. It’s a simple comedic delight that doesn’t require excessive attention to detail or a desire for a more refined, golden-written script.\n\nGrading: C",
    "date": "2025-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I liked the first one better",
    "date": "2025-06-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "In short, not a good movie. The cast is made up of a lot of the same annoying characters from the first movie, with the new additions, being even more annoying. The plot is pretty typical, but they make no connection between the main villain and the crime that took place. It’s just a person that randomly shows up and then we’re allowed to believe that they had a part and everything. Not a ton of laughs and an ending that supremely drawn out with no upside whatsoever. I’m sure tons of people watch this and while I funded it with my Netflix subscription I’m so glad I didn’t pay money to see this in theaters.",
    "date": "2025-04-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Le retour de Jennifer et Adam ! Le scénario n'est toujours pas incroyable, mais le duo m'a bien fait rire.",
    "date": "2025-04-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Es más divertida que la primera",
    "date": "2025-03-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Switch off your brain, sit back and enjoy the nonsense. Funny and likeable",
    "date": "2025-02-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "LOL!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2024-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fue mucho mejor que la primera película Fue buena",
    "date": "2024-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A fun and hilarious sequel to the first one, bringing back a bunch of characters. The first one is still better.",
    "date": "2024-12-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The cinematography is good, enjoyed the mix of actors. But the comedy is lacking. It comes off as they are desperate for a laugh to a point it’s annoying. Too much back, and forth banter. The story line is lacking as well.",
    "date": "2024-12-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "You need to go into the movie with the right expectations. This is a straight to Netflix Adam Sandler action comedy. If you aren't a fan of Adam Sandler comedies, this isn't going to be the movie that wins you over. This follows the same tired tropes that Happy Madison Productions are known for. The movie does come across as an excuse for Sandler to go on vacation with some friends. Most of the humor comes from Sandler and crew riffing on each other and then reacting to the action movie events pointing out how absurd the circumstances are. If that type of humor is not for you, this film isn't going to work.\n\nI enjoyed this one more than the previous \"Murder Mystery\" movie. I thought the story was paced much better, the story was less convoluted, and the two leads bickering did not get on my nerves as much. The movie had a great action comedy sequence in the middle that was quite good. And, sans one glaring plot hole, the final action scene is surprisingly clever and suspenseful.\n\nI will say I didn't hate the film, but I acknowledge that it is not a good movie. The movie relies too heavily on the same jokes. All characters introduced are definitively one note. Sandler and Aniston spend the vast majority of the runtime being the one couple you do not want to hang out with at the party. Also, from a murder mystery standpoint, the movie does not give a compelling mystery or reveal.\n\nIf you are looking for something like \"Knives Out\" but dumber, this may be the movie for you.",
    "date": "2024-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It is definitely not as good as the 1st due to the fact it just doesn’t have as much true action and not as much suspense it felt like, still, at least it won’t waste your time.",
    "date": "2024-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "No second part was needed, and that says a lot. Essentionally pointless all the same.",
    "date": "2024-09-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Last month, I found myself in an incredibly stressful situation. My business’s cryptocurrency wallet, which held a significant portion of our operational funds, was compromised. I had received a phishing email that appeared legitimate and, unfortunately, clicked on a link that led to my private key being stolen. Within hours, a substantial amount of our funds was drained from the wallet. Desperate to recover our assets, I reached out to Fastfund Recovery based on their positive reviews and expertise in the field.\nThe process started with a thorough initial consultation. Fastfund Recovery’s team was highly professional and empathetic. They took the time to understand the details of the breach and explained how they could potentially help. They provided a clear overview of the steps involved and the likely outcomes, setting realistic expectations from the outset.\nWorking with Fastfund Recovery was a positive experience despite the stressful circumstances. Their expertise, professionalism, and transparent approach were invaluable. They handled my case with the utmost care and demonstrated a strong commitment to recovering as much as possible. If you find yourself in a similar situation, I highly recommend reaching out to Fastfund Recovery. Their team is dedicated to helping clients navigate the complex world of cryptocurrency recovery.\nGmail, Fastfundrecovery8@gmail com\nWebsite, Fastfundrecovery.com\nWhatsapp, 1(807)- (500)- (7554)",
    "date": "2024-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The first one was okay, at best, and here we have more of the same.  It’s a problem when the co-leads have better chemistry with each other than everyone else in the cast does with them or anyone else.  Abbot & Costello or Laurel & Hardy they are not.  The bulk of the conclusion is seen a mile away which negates most of the mystery and surprise.",
    "date": "2024-08-27"
  }
]