[
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The huge plot holes are made up for by the searing performance from the star of the show, Jennifer Lawrence. Wish there had been less drama and more focus on the quiet turmoil.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The main character is a young woman named Grace (Jennifer Lawrence). She’s been psychologically traumatized since childhood, but now her mental state faces a new and severe trial when she and her boyfriend (Robert Pattinson) leave New York to live in a remote cabin, where she gives birth to a baby. Motherhood does not bring her happiness. Grace feels lonely, misunderstood, lost, sexually unfulfilled, lacking any sense of self beyond the role of \"mother and wife.\" She’s like a wild animal taken out of its natural environment and locked in a cage — and now she’s thrashing around that cage, losing her mind. As Lawrence herself says, her character is experiencing \"the death of her former life.\" Her partner does everything he can to help, but after each brief improvement, her fragile mental state plunges into a new downward spiral, more intense than the last.\nDirector Lynne Ramsay (We Need to Talk About Kevin) does not coddle the viewer — the uncomfortable scenes here and there are mercilessly long and physiologically detailed, and Grace’s condition looks increasingly hopeless. That said, credit where it’s due: the film is visually poetic, and the acting is astonishing. The stars of two 2000s teen franchises — Lawrence from The Hunger Games and Pattinson from Twilight — take on bold, unconventional roles that are not destined for box-office success. As Jennifer joked after the screening, \"All producers dream of making an adult-rated drama about a woman with postpartum depression. As soon as they heard about our project, they just started throwing money at us!\"\nLuckily, they had a producer who wasn’t obsessed with profits. That producer was Martin Scorsese. He was the one who invited Jennifer to play the lead. And it worked out — it’s not a film designed for a mass audience, but a very intriguing piece that invites fearless cinephiles to immerse themselves in the terrifying world of postpartum depression.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Jesus, what a BORE. The movie is about two hours too long, repetitive and going nowhere. Good acting, sure, but ultimately who cares. Hard pass.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Die My Love promises much more than it can deliver. Lynne Ramsay creates an atmosphere of constant discomfort, where motherhood, isolation, and desire intersect in a suffocating way, but the narrative quickly loses itself in repetitive cycles, with no clear focus and no real progress.\n\nThe uneven editing and the fusion between hallucination and routine undermine the rhythm, although the 35mm photography and sound design create an impeccable atmosphere. In the end, it is Jennifer Lawrence who keeps the film alive, delivering a visceral performance that surpasses the material itself.\n\nDie My Love has power, but stumbles in its execution. The impact is there, it just doesn't come exactly from where the film imagines.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Absolute horse $h*t. Cannot recommend less. Depressing take on family life? Yeah. But bigger than that, it's just so monotonous, an endless droning of insufferability",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Talented attractive actors are put through symbolic acting exercises without a clear through line.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Exploitative portrayal of postpartum depression is Jennifer Lawrence acting crazy for two hours. No message, no theme, just  crazy for crazy sake.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A movie that explore depression in an unconventionally way. Superbly directly and strongly interpretation by Jennifer Lawrence and Robert Pattinson. A movie that is surely worth watching.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Seeing this in the theatre helped me lock in. An amazing film. The sound, the caft and treatment of time helped take me into the mind set of the main character. What a love story! Done like I've never seen before.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I’m finding this movie a true look at mental illness and undying love to be like WS China trainwreck  that you just can’t turn away from…..and thinking this is the point of mental illnesses—- each person’s id unique.  If intention of this film then there is a brilliancy in Jennifer Lawrence portrayal…painful journey, not comforting as you want much more a fixable solution to the misery…..it never comes",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Confusing right from the start, with a plot that just never showed up. Not even Jennifer Lawrence could rescue this one. Every scene felt random—I found myself waiting for something to make sense, but it never did. I left early and don’t regret it for a second. 🙂 ZERO STARS.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The worst movie I have ever seen. My wife and I kept laughing throughout because it’s that ridiculous and dumb. Neither of us had a clue what was going on. What was the purpose of this movie? She was acting crazy before the child? I didn’t care about any of the characters. I’m pretty sure there were about two sentences of dialogue from the main character for the first hour. We left early, couldn’t take it anymore.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Beautiful cinematography, incredible action in an arthouse fever dream.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Is that amount of nudity really necessary?",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Would give 0 stars if I could. I understand the experience it shows is often over looked but this was just boring and kind of pointless",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "We walked out. I'm not a huge Jennifer Lawrence fan but I love Robert Pattinson and Sissy Spacek. My husband really wanted to see it although I had heard about some mixed reviews. I thought I'd give it a go. I knew within the first 10 minutes it wasn't going to go well. It's super disjointed and there's no real character development so you don't really resonate with anyone. She does some really weird cringe things and I just couldn't relate except for shooting the dog...before you come at me, watch the movie and you'll understand. We lasted an hour and decided to go watch paint dry, instead.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Would give it 0 stars if possible.  Walked out of a movie for the first time in my life.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Half of a star for Jennifer Lawrence. The rest was one major lullaby.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Hard to follow. It was trying to say something that it never said. It made no sense. Just kept thinking \"what is going on\" and that question was never answered.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Didn’t see there a postpartum depression, only a mental disorder. Didn’t expect that though… Film is fascinating — acting, music, images are all perfect — but what was the point? Or they just made a mistake in the press release.",
    "date": "2025-11-22"
  }
]