[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Rust Creek has an interesting plot but aside from Jay Paulson, and Hermoine Corfield, the rest of the character performances and their dialogue make them come off as nothing more than a stereotype.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great! I like edge of seat movies and this one is good for that.",
    "date": "2025-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie. Suspense and action with mystery",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Rust Creek (2018, now on Disney+)\n\nRust Creek is a thriller that I completely forgot about until I stumbled on it again—but honestly, it’s one of those films I end up loving every single time I watch it.\n\nWhat really works here is that it doesn’t depend on A-list celebrity power to draw you in. Instead, it gives newer faces the spotlight, and they carry the story so well that you stay fully invested the entire time. I wasn’t distracted by “who’s in it,” but instead locked into the story that was being told. The director did a phenomenal job captivating the audience, pulling us along this incredible, nerve-racking journey that this poor girl is forced to endure.\n\nI’ve watched this movie multiple times, but I’ll admit—it’s not the most popular or talked-about film out there, so as the years go on, I sometimes forget about it. But when I revisit it, I always ask myself: how can you forget something so great? Because it really is. It’s thrilling, tense, and keeps you right on the edge of your seat the whole time, waiting to see whether or not she’ll escape the men chasing her.\n\nTo give you an idea, it ranks right up there in my mind with movies like Losing Isaiah, An Eye for an Eye, Jennifer Lopez’s Enough, Jodie Foster’s Flightplan (a movie I know a lot of people dismiss, but I consider incredible), and even Nell. Those are movies that might not be the first you think of when someone asks for a recommendation, but when you remember them, you realize they’re absolutely incredible pieces of storytelling and performance. They might not be as loud as the biggest blockbusters, but they stick with you.\n\nThat’s exactly where Rust Creek sits for me—an underappreciated gem, but one that’s executed with precision and intensity. It deserves to be remembered alongside those kinds of films.\n\nVerdict: Cinematic genius in its own right. A thriller that proves you don’t need big names to deliver an unforgettable story. Very high marks from me.",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "If you like to be frustrated by illogical writing this movie is for you. There are some solid performances but even those couldn’t make up for the lazy writing. Your instincts will tell you to shut this movie off after 20 minutes and you should oblige.",
    "date": "2025-04-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "SPOILER ALERT:\n\nGood up until the ending.\nThe Sheriff shoots EVERYONE he has a problem with throughout the film, but wrestles with the heroine rather than just shooting her too. It made no sense. That downgraded it from a must watch to......meh.",
    "date": "2025-03-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Though slow and predictable at times it is also somewhat captivating",
    "date": "2025-03-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Slow, boring, and improbable. No plot twist. Not a B movie, a low grade grad movie that should have been made.",
    "date": "2025-01-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Sometimes you don’t know what to watch and you stumble on a hidden gem and this was it. The casting was genuinely perfect. The storyline development was realistic compared to other similar movies - I didn’t find myself screaming at the TV “run!” Because the character was making poor choices lol.",
    "date": "2024-12-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Low budget film with a well written plot and an exceptionally fashionably revealed twist.",
    "date": "2024-12-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Interesting story line. Very entertaining! Completely caught by surprise at the end.",
    "date": "2024-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Small-scale, B movie, entertaining enough to watch in the background while working.",
    "date": "2024-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Rather slow and meandering with a plot that seemed a little too familiar. However the performances by the lead and main antagonists elevated the film to something quite entertaining. Cornfield did well not to overplay her role. The director paid attention to detail and the cinematography was spot on. I'm assuming this had a small budget in which case it's a top effort.",
    "date": "2024-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's a little bit predictable but worth a watch if you have nothing going on!! I love the heroine because she's scrappy!!",
    "date": "2024-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "5/10. It was ok. Kind of boring, but parts were entertaining. I wouldn’t watch again or recommend it.",
    "date": "2024-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I give it a 7/10. It was predictable and in the middle it was hard for it to keep my attention at times, but it was still enjoyable enough for me to want to know exactly how it ended and watch it all the way through.",
    "date": "2024-05-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Simple, but well-acted thriller that keeps you guessing.",
    "date": "2024-05-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Good movie, good acting and an interesting and unexpected plot line.",
    "date": "2024-05-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The lead actress is really good. Actually all the performances were good. They did as well as could be done with the extremely sloppy and lazy writing. Dumb and/or extremely unlikely things are constantly happening for the sake of facilitating the next thing that needs to happen. \"Why didn't they take that phone?\"... \"Why doesn't he come up with a decent way to hide her?\"... \"Why is her phone screen not shattered anymore?\"... \"How did her pants change?\"... But the movie holds your interest well enough, as long as you don't mind saying, \"Wait--what?? Why??...\" every five minutes.",
    "date": "2024-05-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Poor ending and kinda just stuck in one area for most of the movie. But the build up was great, enjoyed it till the ending",
    "date": "2024-05-01"
  }
]