[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Really sweet romcom with all-star cast. Matthew McConaughey was great and I love the supporting cast. Not a deep plot but well acted and entertaining.",
    "date": "2025-06-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Not believable at all and the match McConaughey/Parker does not work for me.",
    "date": "2025-02-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Classic y2k romcom! Cheesy and funny, the movie fulfills what it proposes",
    "date": "2025-01-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "OK, the joke is obvious - this movie failed to launch, though it was pleasant most of the time. In fact, it was just a minor romcom with major actors a bit before their prime (Matthew McConnaughey, Bradley Cooper) and little chemistry between the romantic pairs, especially Matthew and Sarah Jessica Parker. Brazilians will understand: it was a bit like a Globo movie - nice-looking people and very little depth. And I really didn't understand what exactly the consultant Sarah was trying to achieve or how to get the guy to leave his parents' home.",
    "date": "2024-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "So dumb I couldn't get through the first 5 minutes.",
    "date": "2024-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wish to same thing happen to meee hha, very good rom-com",
    "date": "2024-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Neither a romance nor a comedy - EXCEPT for brief, breathless seconds of joy with Zooey Deschanel. This thing is so excruciating, you gotta wonder how these actors' careers even survived. How many date nights went limp after after this torture of cliches? The acting's fine, but the writing drags it all down like shoes of concrete.",
    "date": "2023-12-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A simply OK film, though the last 20/30 minutes or so does drag a tad.\n\nMatthew McConaughey is good, Sarah Jessica Parker is good, the support cast (which includes an early role of Bradley Cooper's) are good. I didn't overly enjoy what I was watching, but I wasn't particularly bored with it either. I don't really have much to say about it in truth.\n\nAt around 90 minutes, it doesn't overstay its welcome. That makes it a watchable, if slightly forgettable, flick from 2006 in my books.",
    "date": "2023-02-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A fun romantic comedy.",
    "date": "2023-01-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Unfunny cliché and with gender images of the last generation. More of an experience that beloved actors are only as good as the screenplay... Please don't",
    "date": "2022-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "To be or not to be, bachelor!",
    "date": "2022-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The cast does enough to at least make some of the film enjoyable.",
    "date": "2021-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Failure To launch 🚀- plug.\nPull the gage on this and every \"romantic, non-funny\" dramatic, love ❤️ story, ever made, by Matthew and all the women before him - all the girls that turn into ghosts 👻 👻, the vacant way they already are, 👻 and sorting M&Ms in a casual, easy going and talkative way, remembering that you never knew how to talk- or sort through colours bc they all end up on the floor, like your girlfriends, whose name you can't remember - bc they all become crawl the warrior dog or princess tinker/Sophia, probably noting the name of your dog before you, while you call BullSh** 🐃🐄- how romantic. ❤️ the only thing worse than failing to launch 🚀, is failure to launch, an uppity- nose, in the sky ☁️ professional pretending to know dating more than her actual life, so herself, as Carrie, and the only relevant character she ever played, a dating professional, a girl who \"dates a lot\" or as most commonly called \"someone who gets around\" - gets around to making sure to tell \"Matthew\" the lead romantic, that his mother's unnatural, - but she's fine, more professionally sourced, she knows more than the average fuddy Duddy simple mother of a family, just less than the average woman dating around more than her, a hooker so Samantha, making her perfect. Seeing as he's the most perfect in all situations, it's only natural he falls for every woman in a professional standing better than his own so a modern day woman or a gold digger, of fools. The only thing worse than Sarah pretending she doesn't need a roommate or a man- is having one worse than the coo coo birds 🐦 insanity - Zooey, pretending acting is letting out every inch of your insanity - bc shooting birds is perfectly normal, from your window, bc it's natural- to assume everyone can fix your problems- with a wrench and a hammer 🔨 🔨, or from the pleasant way you're the \"girl next door\" - or not - just an open door away from, a constant therapy session, it's not so new - or mocking bird cry - probably telling you something, it sounds better than your music . 🎶 🎶 🎸 in total everything Matthew has done is Oscar worthy, worthy of the gold shimmer to get it there, and that's about it - a scream, cry and good hand dealt from a woman in his favour - lacking value. 🤡",
    "date": "2021-04-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Matt isn't as obnoxious as usual here, but the time line is rather rushed with an abrupt resolve. A few moments here and there but relies on a couple gags too much. Why are animals constantly attacking?",
    "date": "2021-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A cute story with decent galpal / bromance side characters that's entertaining if you don't expect it to be too deep.",
    "date": "2021-04-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Very solid Matthew McConaughey chick flick bc sometimes that's just what you need. Good movie? I dunno about that",
    "date": "2021-03-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This romcom has a good theme, it's really well made and Matthew McConaughey is great as always. The one questionable decision is the casting of Sarah Jessica Parker as the female lead. She simply looks too old to be a good match for Matthew McConaughey. Nothing wrong with her acting, but the physical attraction has to be believable somehow.",
    "date": "2021-03-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Zooey and McConaughey are such charming actors it is hard to hate it even if the script is weak.",
    "date": "2020-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Failure to Launch (2006) continues to sit at the forefront of the rom-com genre over a decade later, thanks to a unique, if unbelievable concept and a solid casting effort from top to bottom, despite a lackluster script.\n\nThe movie stars Matthew McConaughey as a 35-year-old who still lives with his parents, and Sarah Jessica Parker as a woman hired by his parents to date him and get him to move out. \n\nIn addition to its two co-stars, Failure to Launch features a remarkable ensemble cast of supporting characters, including Zooey Deschanel, Bradley Cooper, Justin Bartha, Terry Bradshaw, and Kathy Bates. It also happens that most of those actors are wasted in their roles, but the movie definitely benefits from them.\n\nFailure to Launch won't break your heart. While it has its human moments, including a twist on why McConaughey won't move out, it doesn't carry much weight scene-to-scene. Additionally, it's only average in its humor, and a lot of it is quite cheesy, particularly our protagonist's frequent animal assaults.\n\nDespite only being an average film, it has that \"it factor\" that makes it enjoyable over multiple viewings, even if it won't make anyone's favorites list. I give it 4 out of 5 stars for \"creative and unique situations, funny if comedy, high quality, but not iconic or exceptional.\"",
    "date": "2020-01-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I wanted to put on a movie in the background but this was so bad I couldn't even let it exist in my home. There's no stakes, the roommate character is INSANE, the story is also insane, etc. The story \"takes place\" in Baltimore but they go surfing with dolphins????????? Put on literally anything else. LOL to that there are two Oscar winners in this.",
    "date": "2020-01-02"
  }
]