[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Great everything!\nExcept for the silly comeback of the father that was semi-dead for days. Suddenly, he was strong and energetic. That was the que to opt out.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Another film dealing with the foibles of family when extraordinary life events force a reckoning: and the first two acts follow a winning form delivered so beautifully forty years ago by Terms of Endearment. \n\nThe writing is a little too tightly choreographed and we are often left with tennis-court verbal volleys for most of the film. \n\nThe genius of the final act is in Jay O. Sanders' soliloquy to his daughters, revealed in cuts to be a mis-en-scene sleight-of-hand, but nevertheless delivers a gut punch and is emotionally memorable.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The movie is about, well you guessed it from the title, three sisters with different personalities who can't get along. They got together because their father is very sick and can die any moment. It's a very laid back movie that was shot in one\napartment in its entirety, which makes it feel cheap, boring and very demure. I don't have nothing really bad to say about it but it felt very discreet. Acting was okay. It touched on different\nfamily subjects but overall it was \"lazy\".",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Was a good movie about life and the end of it. Touching on common misconceptions and family issues. Could have been a little better the daughter that was smoking pot didn't really reach her potential in her role. I feel like whatever movie she is in its the same comfort zone.",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I thought it was boring. The characters were stereotypical. I didn't watch it all the way through.",
    "date": "2025-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "His Three Daughters is a film about emotional tectonics that shift quietly in a Manhattan apartment, as three estranged sisters reunite to care for their dying father. What follows is an excavation, of grief, of memory, and of the uneasy rhythms of familial intimacy. Their chemistry is built from friction, history, and all that's left unsaid.\n\nMost scenes of His Three Daughters has its characters occupying one scene at one time. This visual isolation quietly reinforces the emotional solitude each sister inhabits. When multiple characters do share the frame, the tone shifts, either toward chaos or a fleeting warmth, as though the act of being seen is itself destabilizing.\n\nThe camera observes how gestures fray at the edges, and how caretaking becomes both duty and displacement. The apartment becomes a pressure cooker of old resentments and tentative reconciliations. Time is suspended in the practical long days of waiting for death while life awkwardly continues.\n\nWe watch a strange choreography playing on-screen: of adult siblings returning to a childhood space, now occupied by mortality, and navigating the gap between who they were and who they've become. The film assumes that the audience will tune into the emotional undercurrents.\n\nIn the end, there are no neat farewells or dramatic collapses. Just the quiet ache of people trying, and often failing to connect. That failure is one of most heartbreakingly honest gestures the film makes.",
    "date": "2025-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Family dynamics can be difficult to unravel: the splendid acting by all three leads made this film a joy to watch.",
    "date": "2025-05-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What an incredible film. This is one of those cinematic moments that distills everything down.. minimal casting.. minimal location changes.. into just talent. The story is given enough time to breathe, and it still enthralling. Bravo.",
    "date": "2025-05-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "There's a wonderful story happening here, but damn, what an ending that was, I'm in shock and honestly, I see myself thinking about it for the rest of my life.",
    "date": "2025-05-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A beautifully underdone film, His Three Daughters was a powerful character study. Azazel Jacobs' dialogue was wonderfully written, which was necessary for this kind of film. The cinematography in this film was perfectly subtle as to not draw too much attention to it, yet still immensely unique and interesting. The characters were all greatly written too, both the complex main characters and the equally entertaining side characters throughout. This film also has possibly one of the best depictions of death I've ever seen. His Three Daughters was a complex and emotional film that is very well written and directed by Jacobs.",
    "date": "2025-04-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "**Review: *His Three Daughters* – 3 Stars**  \nThis is one of those movies where *nothing* really happens, yet *everything* does. The cast? Stacked beyond belief—Elizabeth Olsen especially shines (always been a fan). It plays like a stage drama, intimate and raw, and the character work is just *chef’s kiss*. All three daughters are so wildly different, constantly clashing in ways that feel painfully real. It’s basically a masterclass in acting and personality collisions. The whole nature vs. nurture thing is fascinating too—they share a dad, but different moms and upbringings, and you *feel* that in every tense conversation.  \n\nBut as much as I admired it, it dragged. Like, *really* dragged. The slowburn became more of a slow *snooze* near the end. Beautifully written and executed, yes—but a thin plot can only carry you so far. Still, if you're into character-driven, slice-of-life realism, it’s worth the watch. Just maybe with some caffeine.",
    "date": "2025-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Trap three of our best actresses together and see how it plays out.",
    "date": "2025-04-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The characters are so lame, I had to stop watching after about 15 minutes.",
    "date": "2025-04-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Pretty typical family drama centering around three daughters and their father in hospice, good acting.",
    "date": "2025-04-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "An authentic, moving, family drama.",
    "date": "2025-04-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Great writing followed by stellar directing followed by three powerful performances. Academy you need to take a look at this ...",
    "date": "2025-03-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The themes of grief and connection are present, but the theatrical dialogue is hard to grasp, and the siblings, though played by talented actresses, feel inauthentically written and missing nuance.",
    "date": "2025-02-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Besides the terrifically cast chemistry powered by the mesmerizingly sharp performances, the resulted soulful heart is convincingly layered with relatability that not only dramatizes the emotional ambience that resonates but also reflective estrangements in the healing midst of connective possibility. (A-)",
    "date": "2025-02-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Slow, thinking film. Not one to watch just anytime, as it works on your emotions, and death is not always something you want to focus on. \n\nThe family dynamics can be easily identified with, and each person is shown in multiple lights that allow for more depth than your average movie characters.\n\nThe ultimate scenes are unique and provide for opportunities to interpret events in your own way, which I found compelling and appreciated.",
    "date": "2025-02-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Elizabeth Olsen was the exact same character in the Netflix series where she murders a mans wife she had had an affair with. I couldn't watch it.",
    "date": "2025-02-01"
  }
]