[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Was very entertaining.  Loved it.   Ending was very powerful.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The film shows us how the world works today: people against other people, faith against science, greed against the future. And no matter how good someone's intentions may be, what people believe depends entirely on them! Just look up!",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Brillante y conmovedor, cuenta la historia de algo que sucede en la vida real! Absolutamente todo el mundo debe verla y tomar conciencia del cambio climático 🙏🏻",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "MAGA revenge, but science proves right and everyone perishes.  Nice going again, MAGA.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Definitely not funny at all! \nMeryl Streep wasted her time here !\nThe only thing right about this film, is that it’s a true reflection of society today ! And that to me sadly made this film unwatchable.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Filme brinca com a comédia e a tragédia, DiCaprio carregando nas costas como sempre, um elenco maravilhoso, apesar de ser um filme de comédia tem momentos extremamentes tristes que mostram como a ignorância humana pode nos levar ao colapso. \nNota 8.0",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Another movie that Rotten Tomatoes says is a comedy but which definitely isn't. Overly long with an extremely depressing ending.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Purposely aggravating. A dry, satirical, antagonization of the screwed up place society finds itself in. More appropriate than ever at this present time. A little long in run time, but a witty and sobering experience.",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A Satirical Skewering That Stings.\n\nDon't Look Up is a ferocious satirical juggernaut that lacerates denialism, but its frenetic pace occasionally mutes the devastating impact. Jennifer Lawrence’s Kate and Leonardo DiCaprio’s Randall form a volatile core, their mounting frustration exploding in McKay’s whip-smart script. Meryl Streep’s Orlean is a venomous delight, Cate Blanchett’s anchor a vapid triumph, and Jonah Hill’s sycophant a pitch-perfect punchline. The 2021 viral satire—TikTok dances, late-night parodies—lands like gut punches, turning the comet into a metaphor for ignored crises. The ensemble, from Ariana Grande’s pop star to Ron Perlman’s rage, amplifies the absurdity.\n\nBut the onslaught of gags can overwhelm, diluting poignant beats into noise, and the climax’s catharsis feels rushed amid the frenzy. What could have been a flawless indictment of complacency stumbles on balance, but its wit and urgency make it a vital, unforgettable mirror to our doom.",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "As both a former broadcast journalist and State Representative (D) this film is on point.  The satire makes it watchable, otherwise, it would be too uncomfortable and cringy.  \nThe reality is we’re living this farcical creation right now, here in the United States, led by narcissistic idiots and sociopaths pushing alternate facts.  Unfortunately, at the time of filming they had no way of knowing the president would now own, quite literally, the networks, the FCC, universities, courts and all branches of government.  He’s weaponized all of them against education, science, medicine, the arts, students, media and our fellow Americans. We’re lucky it was made when it was because in our current apocalyptic situation no one would touch it.  \nThe character development works well with the right balance of sarcasm, disbelief and over the top bad guys.  Sadly, those bad guys look pretty good compared to our current reality.  \nBottom line? It’s a fun watch.  Just don’t think about the reality of it all.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A study of how utterly useless humanity is in the face of extinction level disaster. Constructed as 100 stitched together vignettes in the style of Dr Strangelove. It’s fantastic. To those who say it is less subtle - let me just say “no fighting in the war room”.  The only way this is dated is that politics got even more weird in the interim. One day  it will be a classic.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I know.  I considered this carefully and a half-star seems a bit much.  \n\nDon’t Look Up is less a movie than a two-hour Twitter thread brought to life. Imagine a satire written in ALL CAPS, then repeated just in case you didn’t get it. That’s this film.\n\nThe premise is great: a comet will destroy Earth and nobody cares. But instead of building tension or clever humor, the film goes straight for caricature. Politicians are cartoon villains, scientists are hapless nerds, and the media is portrayed as a 24-hour clown parade. Subtlety? Not invited.\n\nThe cast is amazing on paper—DiCaprio, Lawrence, Streep, Blanchett. However, it’s like watching Oscar winners trapped in a bad improv skit that never ends.\n\nAnd the “jokes”? If you didn’t laugh the first time, don’t worry—they’ll tell it again. And again.\n\nThe real disaster isn’t the comet—it’s the screenplay. Climate change and political dysfunction deserve sharp satire. Instead, Don’t Look Up gives us a sledgehammer where a scalpel was needed. It’s smug, exhausting, and about as fun as actually waiting for the world to end.\n\nAnd to sum this masterclass of cinema.\n\nWriting: Instead of sharp satire, it gave us slogans with the subtlety of a sledgehammer.\n\nActing: Talented actors reduced to one-dimensional cartoons, as if they were trapped in a bad SNL sketch.\n\nDirecting: No control over tone. It swings from smug comedy to heavy melodrama, never finding balance.\n\nPlanning: The whole movie feels like a first draft that nobody dared cut down or polish.\n\nCinematography: Flat, bland, forgettable. Even the end-of-the-world scenes lacked awe or terror.\n\nMusic: Random, distracting, and often working against the mood instead of for it.\n\nWhat were they not thinking? Probably this: that great satire requires respect for the audience. Kubrick’s Dr. Strangelove trusted viewers to connect the dots. McKay’s Don’t Look Up assumed viewers needed to be bludgeoned with the point until it lost all meaning.",
    "date": "2025-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Don't look the movie !",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fantastic movie and story. Great satire on real life society actually",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I like this better than most people, even though it came across a little heavy-handed.  I think many of the people who dislike this movie do so because they see themselve... or are unwilling to see themselves.",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Wow...it's defintely from a certain time period and is kinda shocking how dated it is already. Lots of the clear (and SOME of it deserving) bashing against Trump supporters is very much on the nose and not done in a clever way at all. I mean it is a Adam McKay film so I can't say I'm shocked given he always finds a way 90% of the time to fit in political issues that are relevant to the time. But here....yeah it's so on the nose lots of times it's not even that funny because of it. The music is alright but it's kind of forgettable and it's not really used much and you can kind of feel it at times. The editing is just ok too. Everything else isn't bad though. This is very bloated trying to fit in way too many things. It's a satire of a disaster movie comedy with Sci-Fi mixed in. It's just got so much going on that it tries to fit in that it kind of can't get out of it's own way. Lawrence & DiCaprio (who is good here and the best thing in this) have some good chemistry but than it divides them up and just jumps around with what feels like pointless too an extent personal arcs. Than the politics of \"Don't Look Up\" supporters vs Believers in the facts, the actual comet storyline. The commentary on the greed, stupidity, and laziness of man is all a bit too much to fit into 2 hours. It's crazy this has like 15 minutes of credits. The humor at times is clever and has it's moments but I feel when it becomes too much mocking Trump supporters it really loses any wit and is too obvious and dates itself. Than the \"modern\" shots of tech like the social media feeds, selfies, \"Gen Z\" slang, and the news cutaways all just doesn't fit an actual movie. The Ariana Grande concert and other things again just contribute to this being overstuffed. This works best when it focuses on the core plot, keeps the main duo together, and laughs at the stupidity of man but it tries fitting in sooooooooooo much other things in the mid/second half it loses momentum and can't get out of it's own way. The billionare dude also is more of a chariciture than an actual character I feel also too. And Streep is meant to clearly be a shot at Trump also but she's still not bad. Look if your gonna do this you got to be clever and this is clever only 40% of the time. Unless your a die hard fan of McKay whose direction isn't bad here, any actors in this, or want a unique type of disaster movie, maybe give this a shot. But most could skip this and not miss out on much.",
    "date": "2025-09-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Good film, but too long-winded. The message behind it certainly came across well.",
    "date": "2025-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I do hate mainstream endings. This movie doesn't end with a crew of scientists saving earth. It's a well made movie. Characters are consistent, human nature comes out as it is. If You are more the type \"People are good, everthing will be fine\", don't watch it. You will be disapointed. If You are found on the other side of the viewers spectrum, You'll probabely find it  a great movie.",
    "date": "2025-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The film is at times a brilliant satire on denial of an apocalyptic event from government authorities. It’s brash, moments of pure farce, but ultimately raw doomsday emotion. The cast looks to be using their celebrity status for screen fun and games, but the message is a stinging representation of a galactic event that truly resonates.",
    "date": "2025-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "While it is ironic that the cast is fully stacked with rich people who get richer, the movie is scarily close to real life and shows how action is the only way to save us all before it’s too late.",
    "date": "2025-09-07"
  }
]