[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A brilliant story telling, sad, devastating yet the amazing editing skills will take you through his life journey in the blink of an eye",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Even though it is a documentary, and the story is well known, the connection with the characters is not deep. At least it serves as a warning to think twice before doing a favour for a supposed friend.",
    "date": "2025-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Edge of your seat stuff and remarkable in the power of Graham being able to carry on when it would be easy to lose the plot based on how much harm you can take. Wasn't prepared for the heartbreak at the end.",
    "date": "2025-06-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A great Netflix documentary. Really enjoyed this true story even though heart breaking! Hard to believe a Mum could con her own son. And many others along the way. \nDefinitely worth the watch!",
    "date": "2025-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Great documentary. Really makes you understand why Graham might be pulled along. When you find out he's been away from his wife and baby for two months is a real gone too far moment.",
    "date": "2025-05-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Betrayal and gullibility are equally shocking in this sad story about the trust of some, and deceit of others.",
    "date": "2025-05-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A Captivating and Disturbing Netflix True Crime Documentary. Although ‘Con Mum’ is an undoubtedly effective film, it left me weary of the state of the world and the people in it.",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I hate to admit that this was a great documentary because it was so devastatingly sad what Dionne did to Graham. I had hoped that Graham and his partner remained a couple, but I wonder, why wasn't she enough? Why didn't her concerns matter? I realize his vulnerability to his mum but he made personal and financial decisions without his partner's knowledge. He left her and his newborn son for the first two months of his son's life. \nI knew that Dionne had to have done this before. Details were so intricate. The whole story was just sad. She destroyed so many lives. The legal system works more favorably for the con artists, than the victim.",
    "date": "2025-04-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Another sad story of scamming/deception, but clearly, the promise of money played a big role in all of the sons ‘decisions’. I don’t buy that it was ALL compassion for his long lost dying mother. He chose to believe that he would soon be so filthy rich, that making his newborn son a lesser priority was going to be worthwhile.  But he doesn’t admit this to the audience or himself.  He was played, no doubt. But he was also tested. And he failed spectacularly. I was abandoned by both parents too. But hell would have frozen over before anyone or anything got between my baby girl and I. No amount of money, no promise, no mortal. That is what was glaringly missing here. He didn’t acknowledge his own part in the terrible tragedy that is generational to his blood. I hope his son can one day break the chain.",
    "date": "2025-04-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not the most riveting documentary, but, it is impressive what people put up with a believe blindly from some one they don’t know with the tub of the heart strings.",
    "date": "2025-03-31"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "While it is quite tantalizing and sad, it left me with the feeling the SON is the one who's conned us (the viewers) into paying his debts.\n\n\n***\nWhy? I have a feeling he regrets deeply splurging on his Mum, whom he had to have known was not being honest with him.  It didn't seem to matter how much she kept begging for ( I believe it was hundreds of thousands of pounds), he put her luxuries over his son's future.\n\n\n***\nHe also chose not to be with his newborn the first few months.  Perhaps out of guilt.  But she could have come back to London with him... She deliberately wanted to separate him from his partner and baby.  \n\n\n***\nYes, we can all be conned.  Otherwise there would be no such thing as scammers.  \n\n\n***\nThis, however was / IS his biological Mum.  Therefore... Where's the true con?\n\n\n***\nIt's a story of a family who lent money to the wrong family member and regrets it.\n\n\n***\nAnd now he's using NETFLIX as a means to pay his bills.  SHAME ON HIM!! \n\n\n***\nNope!  \n\n*I too met my real father several years ago.  Oh he was a huge talker, the amazing lies he told.  Gosh.\n\n***\n\nAnd for awhile, we choose to financially help him until we realized he was using us for money and didn't care about myself, his nor his grandchildren.   Heartbreaking for him.\n****\n\nHe has nothing and no one in his life.  And he's basically homeless.  How I wish things were different, believe me.\n\n***\n\nWe walked away.  We had to, moreso due to the emotional strain it out on all of us.    And will always help people, regardless of our own financial loss.  He didn't con us.  We were people who made the choice to give from our hearts.",
    "date": "2025-03-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "\"Con Mum\" is a real cautionary tale that unfolds in five-star settings. It reveals that no matter how intelligent and professionally stable a person is, there may be a predator waiting in the wings with the perfect emotional key to their undoing. This well-produced documentary delivers plenty of high-impact twists and turns and a moving conclusion. If you think you're above being scammed, you'll think differently after watching this film. (And if by the end of this documentary you think Mum should rot in hell, join the club.)",
    "date": "2025-03-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Well its just way too standard & one-sided, I mean come-on yes one would trust 'mum' - but Graham & Heather were taken in by the prospect of wealth, no one questions when someone is gifting them unaffordable stuff but once conned they come making a sad face. ..con mum fizzles way too soon and certain things dont make sense for instance- how did she trace Graham? DNA test in the end proves she is the mum but why wud she scam her own son?",
    "date": "2025-03-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Sad and slow. Lost interest from the beginning.",
    "date": "2025-03-26"
  }
]