[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "bullshjit dont waste y our time",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1.75 hours!!!!!!!!!!!!!!! Rated R for Nudity, Language and Strong Sexual Content!!!!!!!!!!!!!!!!!!! The USA grossed over $100,400,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "'Fifty Shades Freed' is the most boring of the trilogy, even if it probably is a tiny bit better than the original (no. 2 is minorly superior). I am embarrassed to admit that it gave me some goosebumps at the end, I'm such a simp for a montage, I'm afraid; Ellie Goulding's song helped, admittedly.\n\nThere isn't much to note about this, at least in terms of being unique from the two movies that proceeded - very much a copy-and-paste job. I still like Dakota Johnson and Jamie Dornan, without whom I'd likely be rating this film down in the depths alongside the presumed majority.\n\nI did wonder, before and after seeing the first flick, how they managed to stretch this out across three productions. Having now seen them all, I can see they just barely managed to do so. This third release is pretty pointless, they've could've fit all this into a small chunk at the end of #2.\n\nCrazy how these films made a billion at the box office. Turns out sex does indeed sell.",
    "date": "2025-06-04"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Horrible, the most convoluted mess of a film I've ever had the displeasure of laying my eyes upon. Boy was this bad. Stay well away from this stinker.",
    "date": "2025-04-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Movie did not live up to the hype, but I'm glad I saw the last of the trilogy.",
    "date": "2025-02-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "One of the WORST movies of all time. Shallow story line, which they try to compensate for with cheap sex scenes.",
    "date": "2024-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "it was just to finish out the series",
    "date": "2024-12-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A fair film. For a trilogy, it isn’t the worst finale to a three parter to be seen. It’s an alright watch.",
    "date": "2024-12-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "What are you expecting me to say, it's the worst.",
    "date": "2024-12-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Genau wie Teil 1 Kacke.Mehr kann ich nicht sagen.Es ist scheiße",
    "date": "2024-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This film is so good definitely one of my favs🩶",
    "date": "2024-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This is nothing like the books what is this nothing happens like the books are stated",
    "date": "2024-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "La trilogía de E.L. James concluye enfocándose más al romance y menos en el erotismo. Todo comienza después de ver a Christian y Anastasia casarse. Se puede notar que finalmente aprendieron a aceptarse y adaptarse el uno al otro. Christian aún tiene sus gustos, pero se lo nota más sentimental como Anastasia. Por otro lado, Anastasia se la ve más atrevida habiendo aceptado los gustos de Christian y hasta se puede notas que Anastasia se ha vuelto un poco más parecida a Christian. Ella igual sigue siendo la chica con aire de inocencia que solo quiere tener un final feliz.\n\nTodo va bien hasta que llega Hyde a complicar las cosas. La película anterior fue una introducción para este personaje porque aquí empieza a cumplir un rol antagónico importante. Eso fue algo que hacía falta para mejorar un poco la trama de la trilogía y poder darle una conclusión más llamativa. En parte funciona, pero se tendría que haber agregado más momentos de Hyde porque pudo haber ayudado a dar más intriga a la película. Hyde es un elemento fundamental porque se vuelve clave para la liberación de Christian y haber explorado más a este personaje hubiera ayudado a pesar de que lo que pasa en los últimos momentos de película era algo que podía deducir.\n\nLas escenas eróticas son pocas y más suaves. Aquí querían enfocarse más en las emociones de la pareja y su nueva etapa como recién casados. Es cierto que Christian llega a ponerse un poco pesado, pero es por lo mucho que se preocupa por Anastasia con todo el asunto de Hyde. La película hace bien en enfocarse bastante en el lado humano de Christian y se puede decir que encuentra un cierto alivio en su matrimonio, ya que la película anterior era para entender las sombras que lo atormentaban y en esta película Christian es finalmente liberado de esas sombras. Claro que sucede de una manera rápida y sencilla y un poco más de profundidad hubiera aportado. Si hay algo que se puede acreditar de esta película es que supo retratar de una manera realista lo que pasa después del matrimonio o el clásico \"vivieron felices para siempre\". Todo inicia bien, luego vienen las primeras complicaciones y después viene la reconciliación para no perder a esa persona que amas y te da ganas de seguir viviendo. Los flashbacks de las películas anteriores vistos al momento de concluir la historia generan un cierto aire de ternura, dándole a la película una buena conclusión. La moraleja de esta historia es que los hombres como Christian Grey son ese príncipe azul que las jóvenes como Anastasia realmente necesitan y que lo visto en esta película es el final que todas ellas merecen. No es exactamente el final más conmovedor que se pudo haber hecho, pero se agradece que esta película haya tenido menos fallas que las películas anteriores.\n\nEn conclusión, Fifty Shades Freed finaliza la trilogía de una manera bastante regular debido a que se pudo haber agregado más para que fuera un final más emocionante, pero es satisfactoria la forma en que concluye la historia de amor entre Christian y Anastasia haciendo que ellos dos tengan un lindo final feliz. Mi calificación final para esta película es un 8/10.",
    "date": "2024-02-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Has to be one of the worst trilogies of all time. I think it attributes to my absolute dislike of the main characters. Christian Grey??? Controlling and infuriating. Ana??? No self respect because she allows him to be controlling and infuriating.",
    "date": "2024-02-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Love story movie with a different twist than usual - trilogy",
    "date": "2023-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Con esta tercera entrega enriendo porque hay tanta gente incluyéndome que tenemos a esta saga cómo \"gusto culposo\", y es que afirmo que estas películas saben distinguirse de todas las películas románticas eróticas que hay por montones, la fotografía es brutal, el soundtrack es increíble con covers cómo canciones originales teniendo artistas increíbles cómo Ellie Goulding y Dua Lipa entre otros, y la historia siento que es muy entretenida, no es el triángulo amoroso visto hasta el cansancio con sub arcos que tengan que involucrar de manera descarada la masculinidad del protagonista, y no digo que esta saga tenga una historia increíble pero siento que las 3 son muy entretenidas y aunque por momentos recaen en estos estereotipos la honestidad con la que se expresan tanto Jamie Dornan cómo Dakota Johnson hacen que aunque sepas que están mal entiendas su punto.\n\nLa trama se basa en cómo tanto Christian cómo Ana han dado un cambio en su vida de 360 grados, con todo lo que ello implica, otro estilo de vida cómo así adaptarse en la personalidad por momentos tan dispar que tienen con la otra persona, teniendo que ambos aprender a soltar si quieren que la relación funcione. En la que la misma trama rompe con el esquema de hombre idealizado y de cierta forma \"perfecto\" que se había presentado con anterioridad a Christian, al ser expuesto cuando su compañía falla, y al ser robados datos personales suyos importantes, donde las mismas inseguridades con Anastasia que tenían en las películas anteriores siguen igual o hasta en aumento, siendo una desvolución algo forzada del personaje para volver a los mismos tropos que habían funcionado tan bien en las otras películas, pero ahora con la diferencia de que a pesar de todas las comodidades que ahora tiene Anastasia no se siente ella misma, ya sea por el cambio tan abrupto en su entorno, en el que incrementan las envidias externas por creer que todo se le ha facilitado por Christian, ya sea por su nuevo puesto en el trabajo o la vida aparentemente \"perfecta\" que tiene, ya sea exponiéndolo involuntariamente cómo tener un guardia que la sigue a todos lados; y ahí para mi es donde entra Hyde en la historia, este personaje que funge como principal conflicto en la historia, en que de cierta manera expone la fragilidad en la relación de Christian y Anastasia, desde un apartado egoísta, por creer que merece las mismas oportunidades que tiene Christian, dónde es hasta el tercer acto que entendemos más esa represión interna. Partiendo de ahí para ambos darse cuenta de los problemas de hasta ese momento \"perfecta\" relación, en la que se indaga más en lo superficial de la misma, ya que cuando hay un problema serio la misma tiende a desmoronase, siendo en este caso la llegada de un bebé en la que ambos para ese momento no estaban ni en disposición ni listos, aumentando la tensión con la constante auto dependencia de Christian hacia Anastasia. Siendo fundamental el cómo lo resolverán, ya sea ambos juntos o cada uno por un camino diferente. Siento que, aunque obvio tiene que haber escenas de sexo por la primicia de la misma película si me parece que rompen con lo bien que construye la trama, que sí, no es fenomenal, pero es entretenida, pero sí me parece que le acaba afectando sobre todo en el segundo acto cuando más información es expuesta al espectador. Que la película intente resolver el conflicto con un secuestro por un loco cómo Hyde, se siente algo forzado, dónde me parece que lo resuelven de una buena manera, pero si lo sientes cómo un deux ex machina para fortalecer la relación de amos, que repito, no es malo de echo es bueno, pero no se siente orgánico en la trama. Mediante la resolución del secuestro de Mia la película culmina con un final muy redondo para la trilogía, me gustó el cómo se cerró, haciendo un recordatorio por todas las cosas buenas y no tan buenas por las que tuvieron que pasar en todo este tiempo, sintetizando lo fuerte de su relación con la llegada del bebé. Lo que me gustó mucho del tercer acto está en involucrar una conexión tan grande entre Christian y Hyde, volviendo nuevamente endeble a la figura de Christian, lo cual lo humaniza al darse cuenta que el \"villano\" de la cinta vino literal del mismo lugar que él y cómo el tal vez si no lo hubieran adoptado a él y se hubieran inclinado por Hyde su vida podría haber acabado igual, aunque se cierra de una forma muy íntima entre él y Anastasia en el que le menciona que aunque lo hubiera elegido a él la diferencia tan marcada de ideales entre uno y otro habría hecho la diferencia, siendo para mí un último diálogo muy bien estructurado con el conflicto principal de la misma. Esta película a pesar de no tener las escenas visualmente más increíbles de la trilogía, creo que es la que tiene la historia más honesta, que sí, se basa en clichés y giros de trama predecibles (a excepción del último que fui muy fan), pero en general creo que la historia si sabe cómo cautivar al espectador. Sabiendo cómo exponer las inseguridades de los protas y cómo las superan, teniendo para mi cómo mensaje el confiar en los demás y no dejar que nadie externo intente quebrar nuestra confianza con la otra persona, el cómo la envidia se puede volver auto destructiva al estar obstinado con victimizarte por no tener la vida de X persona, aunque tal vez de cierta medida hayas sido tú el principal responsable. Siento que, aunque por momentos el personaje de Christian se estanca, me gustó mucho la evolución de Anastasia en las 3 películas. \n\nEl montaje de esta película sigue siendo increíble, lo mejor de estas películas está en la fotografía y aunque esta queda más pequeña en escala visual con las otras 2 es muy buena, sigue teniendo este toque de comercial de perfumes, pero con una iluminación y una paleta de colores hermosa, con un diseño de producción cómo en las otras 2 películas espectacular, los lugares donde se desarrollan la trama, cómo el departamento o la oficina de Anastasia son hermosos. La dirección es estándar por momentos, pero nunca es aburrida, siempre se juega muy bien con la paleta de colores, y la música de fondo ayuda a crear una sensación realmente agradable. Donde, aunque por momentos el guion es algo impulsivo con las emociones de los personajes, funciona. \n\n50 Sombras de Grey liberadas a pesar de caer en convencionalismos argumentales, la película logra ser entretenida, por momentos logra ser empática y en el 3 acto honestamente, aunque sea muy fuera de sí en la trama el suspenso funciona.",
    "date": "2023-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Oh yeah, I'd totally be okay with living in a house with a room that was filled with sex toys that had been used on 15 previous women by my beau. I might just go lock myself in the room and take a nap because it was so relaxing in there. And I'd be totally fine with him using those toys on me too. How delightful!... Come on! Do they really believe audiences are that dumb? If this was in the book, there's a reason movies deviate from the literary sources. It doesn't translate well to screen. Use that creative freedom when you can! \n\nThe antagonist here is ridiculous. Maybe sounded beter in the book but I felt like I was watching a soap opera that has run out of plots because it's been on air for decades. Didn't buy his revenge plot. And my oh my was he sooooo capable. It was like taking Mission Impossible Tom Cruise and putting him in this movie. Able to leap bounds and defeat all systems. He was a book editor people NOT a highly trained CIA agent with mad skills. And sorry... Blackmail? Seriously? Um, if he showed the sex tapes of the women he'd be incrimitating himself for sleeping with all his employees.  Not believable. \n\nI felt like this movie was trying to knock off Twilight but Grey is not Edward. Didn't buy he was so pained like Edward was. \n\nNo chemistry. Not believable in plot or anything. No romance. She's not going to change this messed up f*cker with a smile and some boobs. Dude needs professional help. \n\nJust all around unwatchable and ridiculous.",
    "date": "2023-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is the worst in the series and has no real story.",
    "date": "2023-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Just when you start to think that things can't get much worse, along comes Fifty Shades Freed, the final chapter, hopefully, of the trilogy.  This time around, Anastasia (Dakota Johnson) and Christian (Jamie Dornan) decide to marry and snuggle into a life of marital bliss, which lasts all of about five minutes.  Faster than Anastasia can recite her safe word, problems arise – he's as controlling as ever, she begins to stand up for herself, they bicker about having a child, and a figure from Jamie's past emerges to cause all sorts of unforeseen problems.  The usual issues continue in this entry, namely horrible dialogue, a strong Hallmark look and feel, all kinds of characters who just don't matter, an annoying soundtrack and score, and a weird swing to thriller mode.  Johnson does her best to salvage things, but this is by far the worst entry in the trilogy, which is saying something.",
    "date": "2023-05-17"
  }
]