[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Definitely better than Nosferatu.",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I have so much to say about this movie. I hated it and it was a masterpiece. Scorsese builds suspense in a way that’s almost cruel. The moment Travis thinks he’s picking up Betsy, and the camera refuses to pan to the back seat for what feels like four minutes, is brilliant. The tense music, the drifting daydream, the slow realization that someone else is in the car — it’s perfect. The same goes for the TV-tilt scene. The way it wobbles in limbo, neither falling nor settling, mirrors Travis’s mind. When it finally tips over, it feels like the moment he breaks.\n\nTravis might be one of the greatest antiheroes ever written. He’s a terrible, weak-minded man with no real thoughts or convictions of his own. He’s the hollow outline of a man without purpose. What infuriates me is that, by the end, he’s celebrated. Even Betsy comes back, almost admiring him. The movie feels like a commentary on how easily society elevates the wrong kind of person.\n\nWatching him as someone who works hard to be the right kind of good makes it maddening. There’s a surreal quality to the final stretch, almost like the whole thing might be Travis’s fantasy — a dream of being recognized because he has nothing else to anchor himself to. And that ambiguity is part of what makes the movie both brilliant and deeply uncomfortable.",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Obviously, everyone who likes movies should see it. But it's definitely one of those movies people love to say they watched, but didn't really. You know, for false bragging rights. But when I watched it, I actually understood it, unlike some of Scorsese's other movies I've seen. And it doesn't have an excessive runtime.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "85/100 - great performance from De Niro",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Did I Just Watch This Crap???? Did I..... Just Watch This Crap.\n\nI Found This Film To Be Wildly Overhyped. It's Strange That This Was One Of The Inspirations For Todd Phillip's \"Joker\" When That Film Is Actually A Better Take On The Decension Into Madness And Handles The Acts Comitted More Appropriately.\n\nThe Ending Here Had Me Absolutely Baffled, The Blood Effects Were Terrible, And The Fact That He Survives And Gets Off Scott Free Makes NO SENSE! A Pretty Dangerous Message To Be Communicating.\n\nC+\n6.7\n\nThis 50 Year Old Movie Isn't Anything You Need To Rush To Watch",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Taxi Driver is nothing short of a masterpiece, one of the greatest films ever made. Scorsese’s direction, combined with Robert De Niro’s unforgettable performance, crafts a dark, searing portrait of urban alienation that remains unmatched decades later. Its exploration of obsession, loneliness, and moral decay is timeless, and every frame pulses with meticulous artistry.\n\nArguably Scorsese’s finest work, Taxi Driver is a film even its own director cannot surpass — a perfect synthesis of narrative, style, and raw psychological intensity. Bold, uncompromising, and unforgettable, it is cinema at its absolute pinnacle.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Honestly, I have no idea how this became a classic. This movie is nearly unwatchable. It does seem to have a good gritty feel to it. The cinematography is outstanding, especially for the time period. But it’s extremely boring really weird and awkward. The main action scene at the end is horrible. \n\nThis is just a check the block movie to say Yep I seen the classic that shouldn’t be a classic….",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This film was a bit of a slog to get through. Well acted and shot, just didn’t connect with the plot or the characters. The ending doesn’t make a ton of sense.",
    "date": "2025-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Despite having a lot of controversy, Martin Scorsese’s Taxi Driver brings a lot to the gangster genre.",
    "date": "2025-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Its unrelenting intensity might overwhelm some, but for me, it’s perfection. Scorsese’s masterful direction, Paul Schrader’s incisive script, and the cast’s raw power make every frame electric. Taxi Driver is a profound, visceral character study and a searing societal critique, a must-see that lingers long after the credits roll.",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The 'classic movie' I had seen the posters of and had heard how it was so classic.\n\nbeautifully shot New York, artsy vibes. Gritty?  Soft and indulgent like a piece by art school students (sorry)  Just been in grittier situations, Harvey Keitel just didn't cut it as a pimp.  Part Woody Allen.  Just a bit disjointed in the end.  Glad I've seen it so I can say I've seen the great classic movie.  Slow paced but wasn't necessarily bored until right at the 'shocking' climax.  Not brave enough to have a tragic ending.",
    "date": "2025-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I came in to this very open minded and an hour in I couldn’t take it anymore.  Painfully boring with barely any plot.  I read breakdowns of this movie afterwards to see if there was something I was missing, but it still doesn’t justify this snoozefest.",
    "date": "2025-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A great character study/story. A mental health story. A cautionary tale. A good one if you like DeNiro. Bernard Herrnann's final score sadly- full of emotion. So glad it was back on the big screen!",
    "date": "2025-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I know I’m not following the script but this wasn’t the amazing movie everyone raves about. De Niro did a good job playing a little crazy. Jodi Foster is, well earlier in her career it seems. So much dead air in this movie it lost me.",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Watching this film for the first time, I understood the meaning of the term \"masterpiece.\" While watching it, I was bored, not paying much attention, and just waiting for it to end. The next day, I found myself on the train listening to the soundtrack and rewatching scenes over and over again. For over a week, I couldn't get that film out of my head; it was stuck there and wouldn't go away. At that moment, I realized that this film was the best I'd ever seen. It had impacted me personally like nothing else. I watched it again years later, one morning before going to university, and that was the definitive confirmation: this was my favorite film, but this time, it entertained me every second.",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Scorsese and cinematographer Michael Chapman create a funky, overripe New York that's like a nightmare Travis can never stop dreaming... But first and last Taxi Driver belongs to Robert De Niro, the most remarkable young actor of the American screen.",
    "date": "2025-09-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "lonelines has followed me my whole life everywhere in bars, and in cars,sidewalks,stores,everywhere,i'm god's lonely man.",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Solid SOLID movie! A must see",
    "date": "2025-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A haunting portrait of loneliness and urban decay. New York becomes a mirror of Travis' mind — and Travis reflects the city's own decay.",
    "date": "2025-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Taxi driver stands as a remarkable cinematic achievement that continues to resonate with contemporary audiences. Even a fourteen-year-old viewer, despite the film’s age, can be deeply moved by its poignant portrayal of loneliness and the protagonist Travis Bickle’s relentless quest for fulfillment amidst his profound isolation.",
    "date": "2025-07-23"
  }
]