[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "CREDIT SCORE BOOST: HIRE A HACKER TO INCREASE CREDIT SCORE.I cant say enough good things about DUNE NECTAR WEB EXPERT — they literally turned my credit situation around when I was stuck and couldnt even apply for a loan. A few months ago, I was dealing with serious financial challenges: missed payments, a high credit utilization, and a credit score so low that every loan application bounced back. I felt frustrated and overwhelmed, but after working with DUNE NECTAR WEB EXPERT, things finally started moving in the right direction.  From the start, their approach felt realistic and professional. They didnt promise overnight miracles instead, they provided me with a clear, step-by-step plan tailored to my specific situation. That plan included identifying errors on my credit report, prioritizing which accounts to tackle first, and providing practical tips to reduce my credit utilization. They also helped me set up a manageable payment schedule and explained how different actions would affect my score over time. Having that roadmap made the process way less stressful. One of the most helpful parts was their careful review of my credit reports. They found a couple of outdated collections and a wrongly reported late payment that I had no idea was on there. DUNE NECTAR WEB EXPERT walked me through disputing those items, provided sample dispute letters, and even followed up to make sure the bureaus processed the changes. Within a few billing cycles, I began to see corrections and gradual score improvements. I went from being basically ineligible for loans to having a credit profile that lenders actually considered. For context, my score increased enough that I could reapply for a small personal loan to consolidate debt, which lowered my monthly payments and gave me breathing room. They were honest. Communication was smooth: responses were timely, instructions were straightforward, and they checked in regularly to track progress and tweak the plan. If you need a service that combines technical know-how with practical, user-friendly guidance, DUNE NECTAR WEB EXPERT is worth considering. They helped me regain control of my finances, improve my credit score enough to qualify for a loan I previously couldnt get, and taught me how to keep improving. Im now more confident about managing credit and planning for future financial goals. Highly recommended for anyone whos struggling and wants a clear, honest path forward.Email — Support @ Dunenectaronlineexpert. ComTelegram: @Dunenectarwebexpert",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "As a crime thriller goes this is a dull and boring film that has Sylvester Stallone (Liberty's Kids, Mandingo) slumming it in usual slop by Randall Emmett (SAF3, Borderland)",
    "date": "2025-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "How in the hootenanny did they get Stallone, Modine, McDonald et al to be cast in this? Not great, lots of C grade content here, not very well written or directed, cinematography is also not top notch. Can not really recommend",
    "date": "2025-06-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This just wasn’t good as the whole amnesia subplot didn’t play out well, and the experimental drug aspect made it even worse.  The story went from serious to ridiculous really early.  Is 'backtrace' even a real word?",
    "date": "2025-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Hard to bear watching.  Stallone was signed for name recognition but probably not paid much because he doesn’t get much screen time.  Poorly scripted half psychological thriller half shoot em up. The gunplay is comical,  way too many rounds for the weapons and just wholly unbelievable and unrealistic, with a cheesy and predictable and also unrealistic ending.  I was cleaning a fish tank during it or would have stopped watching.  Find something else.",
    "date": "2024-07-04"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "An exceptionally bad film in EVERY aspect. If you value your time and happiness at all please avoid this headache and anger inducing fecal matter on celluloid.",
    "date": "2024-06-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Fairly good story, but kind of clunky as we don't really get to know the characters or care much about them including Stallone.",
    "date": "2023-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Total trash, Stallone is just pathetic without a real role. Brought just to boost rating.",
    "date": "2022-04-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Minha opinião: Não sei mas parece aqueles filmes de fim de carreiras de astros. Já acontece com #BruceWillis #Arnold #MelGibson entre tantos outros atores e atrizes. Um filme que Stallone faz de coadjuvante, uma história típica, do ladrão que rouba e tem uma amnesia. E os bandidos vão atrás dele. E Stallone é o policial amigo que ajuda o protagonista a se safar.\nRoteiro: de praxe.\nVale apena assistir? É um filme que se é fã de Stallone e não tiver opção, assita.\nNota: 5",
    "date": "2022-01-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "no termina de convencer 4/10",
    "date": "2022-01-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "So great and cool and fun",
    "date": "2021-03-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is my first time ever logging in and posting a negative review about how I felt robbed of my precious time. It is just so bad that I just had to log in and give this what it truly deserves. Yes, that's how horrible this is. A total waste of fucking time. Mind you this dogshit was made in 2018! And it even has a budget of 6 fucking million dollars. What the fuck did you guys do with that? Did you pay Sylvester Stallone 5 million? Just so that you could put him in the ads and shit? This is truly a disgrace. Mr.Stallone didn't even have a screen time of more than 2 minutes! Then you guys think putting him in every poster, every ads and the trailer is the way to go? But seriously though, It just baffles me why it made it's way to Top 2 in Netflix in the Philippines. It really speaks how most Filipino movie sucks and the audience getting used to them.",
    "date": "2021-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The title of this movie is as about as exciting as the overall viewing experience. A truely dreadful film that never gets off the starting blocks. It must have been the alcohol that got me through the 90 mins or so of self torture necessary to watch this abomination of a film. If it was possible to give this less than one star I would. I can only imagine 99.9% of the budget went to paying sylvester Stallone's over inflated salary, as it most certainly didn't go anywhere near making the actual car crash if a movie this is. Rather bizarrely I feel so aggrieved by the experience of viewing this trash that I could talk about how bad it was for eternity. The only thing left to say is it was a total waste of 99p and if I could get my money back I would. Please save yourself and avoid this travesty of a film at all costs.",
    "date": "2021-02-14"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This is really a Mathew Modine movie, with very little Stalone. It is not confusing but not satisfying at all. Even the end was just another stupid shootout with Stalone being impervious to bullets, as usual.",
    "date": "2020-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Sylvester Stallone and Matthew Modine lead the cast (sort of) in the crime thriller Backtrace.  When a bank heist goes bad the last surviving robber ends up with amnesia after a shootout, and seven years later he's broken out of prison by a new crew with an experimental treatment that they think can help him remember where he hid the bank money.  It's not that bad a story, but it's stretched a little thin and has some pretty predictable twists.  Still, there are some good action scenes and a few intense moments.  Entertaining but forgettable, Backtrace is a mediocre action film.",
    "date": "2019-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This time Brian A. Miller, director specializing in the re-exhumation of mummified actors for zero-budget works, resurrects not Bruce Willis as in the terrible \"The Prince\" (2014), \"Vice\" (2015), \"Reprisal\" (2018), but Sly and Modine for a below average detective film, entirely negligible but not worse than its precursors.\n(Mauro Lanari)",
    "date": "2019-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Not the most believable action scenes but it's a passable low budget movie.",
    "date": "2019-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "this movie is terrible. Do not watch",
    "date": "2019-06-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Backtrace is your pretty by the numbers predictable thriller. Sylvester Stallone is a supporting character in this movie despite getting top billing. The movie belongs to Matthew Modine who actually gives a decent performance and is the main character in the film. Like all of these direct to dvd films, the plot is silly, the movie ends rather quickly, and there’s nothing very memorable about it. If you’re a fan of the cast you may enjoy watching it but it’s nothing you haven’t seen before.",
    "date": "2019-05-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Backtrace is your pretty by the numbers predictable thriller. Sylvester Stallone is a supporting character in this movie despite getting top billing. The movie belongs to Matthew Modine who actually gives a decent performance and is the main character in the film. Like all of these direct to dvd films, the plot is silly, the movie ends rather quickly, and there’s nothing very memorable about it. If you’re a fan of the cast you may enjoy watching it but it’s nothing you haven’t seen before.",
    "date": "2019-05-31"
  }
]