[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's Better Than The Sequel. Like The Sequel, It's a Silly Movie Aimed At Silly People.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "So bad it's unironically funny",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It’s better than that crappy sequel that released a while ago but that’s not really saying much lmao.",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "this is the best movie and fuh all y'all who said it was buns",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie is the one of the WEIRDEST, CRINGIEST, and GROSSEST movies of all time. And whoever made this movie probably did not understand the original Woody Woodpecker cartoons.",
    "date": "2025-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Kindly enjoyable but it jokes can be little weird and silly, but is considered to be a kindly funny flim",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A classic masterful trash bag I loved to watch for some reason",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Even though it introduced me to Woody Woodpecker this is an terrible movie",
    "date": "2025-06-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A failure of a family comedy in 1 hour and 34 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "BEST MOVIE EVER!!!!!",
    "date": "2025-04-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A downright insult to one of the best cartoon characters of all time.\n\nNot recommended.",
    "date": "2025-02-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie is not bad is like \nDevelopment 7.09 \nComedy 8.23\nCharacters 8.04\nWoddy woodpecker 9.01\nVillains 8.24 \nFinal point : 9.08\nThis movie like for kid not bad \nIs 7.2/10 bye 👋",
    "date": "2024-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Beautiful Movie and funny, i don’t understand why people hate first movie… 🙄🙄🙄🙄",
    "date": "2024-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Wacky and zany Woody Woodpecker combats a real estate developer lawyer and cartoonish forest poachers. However, the irritating and destructive CGI bird unintentionally plays villain to the audiences (all ages). He has his film crew and human actors to thank for this regrettable entertainment that's emotionally wooden, unfunny, and hyperactive. You may be watching in disbelief but not amusement. The film features cartoon violence, potty humor, naughty words, property destruction. Woody comically executes a construction worker, bird poops as a weapon, and pecks on heads.",
    "date": "2024-06-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This was rubbish af, I really wouldn't recommend. The children actors are terrible but so are the adults. If you are over the age of 5 then you are to old to enjoy it. DO NOT WATCH",
    "date": "2024-05-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I liked all the movie",
    "date": "2024-05-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Que pena que no se pueda poner 0 estrellas, la película empieza rápidamente después hace gags que no tienen ni chiste",
    "date": "2024-05-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Woody the woodpecker is an amazing comedy film. I like Woody the woodpecker because it  reminds me of my childhood. I support this film because it guides people not to cut trees and not to hunt animals to sell them. The woodpecker character represents people who like the environment and always try to save it, and it represents people who refuse bullying and try to help weak people. The film deserves more than five stars, and its rating isn't completely fair. I like this film and l recommend it.",
    "date": "2024-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Um filme tão aguardado há anos por fans, não chegou nem um pouco perto do que as animações entregaram… Filme horrível atuações horríveis e CGI muito, mais muito mal feito!!!",
    "date": "2024-03-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I don't call what's the peoples said about this movie, i Love Woody Woodpecker, the live action movie is so welsome and incredible, and 3D Woody is so welsome and funny, i Love so much this movie, 🍅100% 🍿100%",
    "date": "2024-02-23"
  }
]