[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "While I do lament the tradeoff of coherent storyline for a higher bodycount that occurs with each entry in this series, John Wick movies have never claimed to be or tried to be anything more than what they are: An adrenaline fueled wild ride at the side of Keanu with a pile of corpses at the end. And they are oh so good at doing just that. They always come up with something new and exciting to give us action wise, one-upping the previous film. Which from a filmaking perspective deserves praise. And Keanu always delivers a performance worthy of the name John Wick.",
    "date": "2025-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "why did john wick go for the balls so much",
    "date": "2025-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "By far my favorite of the series. It had more action overall, but more fight scenes. Plus it included some of my favorite martial art actors",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A very good film with amazing action scenes.",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Ao ranquear uma saga ou a filmografia de um determinado diretor, eu tenho o hábito de separar o meu filme preferido do que eu considero o melhor. Nesses critérios, \"John Wick 3: Parabellum\" se encaixa no meu preferido. Narrativamente, esse não é o melhor filme da saga \"John Wick\" (2014-2025) — embora não seja, de forma alguma, um filme ruim, apenas não supera o primeiro —, mas é, sem dúvidas, o meu preferido. Por quê? A ação. Esse filme contém algumas das melhores cenas de luta que eu já vi, com destaque especial à espetacular cena do corredor das facas. Para um fã de acão como eu, aquilo não é apenas uma cena. É uma sinfonia.",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Another amazing add to the story of John wick but the weakest in the franchise",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Hands down has the best mix of hand to hand combat with firearms mixed in. The movie has a good runtime but does drag at certain points but overall has the best keeping your eyes glued to the screen factor",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Greetings from Lithuania.\n\nAs a pure action film, \"John Wick: Chapter 3 - Parabellum\" (2019) is a 10/10 experience. But the story in here unfortunately does not hold up to the action. Surely it follows the storyline set in a first film, but that was some time already ago and they kinda need to start moving in some other direction with plot. That said, as an action film purely, \"John Wick 3\" is a blast. Fight scenes, action, choreography is a Hollywood at its best. This movie is also very brutal, like in a knife scene in museum - you won't see this kinda stuff in your average flick. But it is not a gore fest, thankfully. Mark Dacascos is in this movie and he was a pleasant watch. Halle Berry has a short but spectacular scenes - the fight involving dogs is completely something new. \n\nOverall, \"John Wick: Chapter 3\" is a spectacular action movie that start to loose its steam a bit because of the story. I know its for a dog, not a simple dog but common.",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "My personal favorite of the John Wick series; peak cinematography, action, acting, and set pieces. Absolutely beautiful.",
    "date": "2025-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Beautiful action movie from start to finish. Spoiler alert, the dogs live!",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The plot armor is insane…",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Chapter 3 proves an in improvement over its predecessor with well choreographed action and fun performances from all…especially Keanu!",
    "date": "2025-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I just watched a grown man use 3 horses as a weapon. \n\nAs I go through this rewatch one thing is clear, these movies are getting better as they make them. More creative action sequences, new weapons, and a universe that continues to expand. \n\nThe knife fight in the history museum is one of my favorite scenes in all of these films. Not to mention the use of dogs in this one. You would think that they would lag the action scenes behind a little bit but they don’t. They fit into the scenes like water. \n\nOne thing I did notice in Parabellum is that the last few assassins that fought John Wick actually had a chance to kill him. They were just so obsessed with fighting the legend that they wanted to keep it going. In the end, that saved some of their lives.. others not so much.",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Everything you expect from a John Wick movie. Top notch action sequences. Ending was really good. Middle of the movie felt a bit boring because of the weak storyline but the action compensates for it. Overall a pretty good watch.",
    "date": "2025-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing masterpiece again!",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This film is much better than the last better plot and story focus same action heavy but this time more dialogue involve. What I like about this film is just a great action film rather than just shooting  it focuses more on action without shooting and more of character and world building. First film where John Wick got my attention and made the watch worth it.",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "While I loved the visual style, music and the expansion of the John Wick lore, I didn't feel all the characters as much as in the previous 2 movies. Much like the Elder in John Wick 4, I was not a huge fan of the Casablanca part, while I did love how they explained the marker and coin origin, but the accents... But the book killing, the countdown, the Continental showdown, it was all pretty cool.",
    "date": "2025-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "John Wick Chapter 3 was a great movie!",
    "date": "2025-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This John Wick movie is the best movie before the fourth one. The entire movie is based on action. What's also fun is that they finally get out of New York.",
    "date": "2025-07-09"
  }
]