[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Already classic in my Christmas 🎄 movie compilation. It has soul, heart, cast and a lotta good darkish humor. Can't explain why the f the rate is so low.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Razor-thin plot but both leads did their best to elevate this hot mess. While all the Botox is distracting, this is top shelf Christmas nonsense.",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I don't care what people say, this movie is light funny and i love every single glitch of this movie!!!",
    "date": "2025-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Netflix Christmas films are Lohan’s new niche. One of the many Christmas movies produced by Netflix, “Our Little Secret” generated buzz during the 2024 holiday season by delivering exactly what the public wants from a casual Christmas film: some laughs and some heart in a predictable, yet entertaining package. Lindsay Lohan is learning the art of being charming even in simple, seasonal films from Christmas movie veteran and co-star, Kristin Chenoweth. This film has plenty of plot holes and overused tropes, but it’s palatably enjoyable for the diverse audiences that gather for the holidays. Lohan is going to be cashing checks every December like Mariah!",
    "date": "2025-05-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Boring, boring, boring. Two previously involved couple are reunited at Christmas ten years later with their new significant others, who just happen to be siblings and have a faintly sinister mother. Stuck under the same roof, the old flame rekindles, which is clearly to be expected.\nWhile the plot might be foolproof, the presentation was not really funny where it was supposed to be and I found myself laughing at things that were not really funny. I suppose it was schadenfreude.\nIt wasn’t worth watching. The acting wasn’t up to par and I found myself wondering why Lohan would lend herself to such a tawdry spectacle.",
    "date": "2025-05-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Lazy movie...made to simply catch the Christmas crowd. Predictable plot, hohum dialogues, terrible acting by all, even worse direction. Was anyone even doing their job?",
    "date": "2025-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "D'accord le plot est prévisible et le scénario pas incroyable, mais ça reste un bon film de Noël comme on lest aime avec une belle complicité entre Lindsay Lohan et Ian Harding.",
    "date": "2025-04-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Lindsay Lohan seems too old to play the part in the 1st act (a 20 something career girl) and perhaps even a bit old to play the “10 years later” character.  The lead male actor, Ian Harding, although the same age as Lindsay looks somewhat younger.  Reasonable acting.  Plot acceptable.  The credits don’t say who the principle directors or producers were.  Why ?  Somebody close to Lindsay ?",
    "date": "2025-03-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This movie was cute. I really enjoy seeing Lindsay Lohan back on the big screener and making a full recovery. I think the plot is pretty typical but the movie itself still remained pretty interesting. I would recommend this movie.",
    "date": "2025-02-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Incredibly cheesy. Felt like a Hallmark movie.",
    "date": "2025-01-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A little to cheesy the charaters can barely be taken seriously but it has its good and funny moments.",
    "date": "2025-01-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The intro of the movie shows that the two main characters are deeply and hopelessly in love with each other. Past that point I do not ever see a sliver of this \"inseparable, deep love\" between these two actors and their characters. They're stiff, it's uncomfortable, and I don't want them in the same room together. If she were so deeply in love with him and they were so perfect together why would the first proposal scene be met with such visceral negativity. The male love interest is shown in the first couple minutes to be manipulative, blaming her for *his* drinking, for moving away to chase her dreams, vandalizes things and has a tantrum. It's not a movie for me, but I didn't go in with high hopes anyway.",
    "date": "2025-01-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "your typical romantic comedy with some twists and laughs. easy watch",
    "date": "2025-01-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Wow, this move was terrible. There's not enough plot to keep the viewer watching, so they had to trow in a series of clichés just to keep the movie going. Nothing good to say about this one. I've seen some stinkers, and this might have actually been top 5 worst ever!",
    "date": "2025-01-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The trailer looked fun so I saved it to our Christmas movie watch list.  I haven't seen a movie with Lohan in it for years so was looking forward to her come back story. Her acting was so bad I am not sure if she was always this bad or the facial fillers have frozen her face so much she can no longer act? The worst part was that the person she played would surely have been much, much younger? The ditzy comic act she played in years gone by does not work anymore for a woman of her age. The storyline totally predictable. The dialogue was bad. 'Oh it feels so Christmassy when it snows'. Seriously.  Bad wigs, bad makeup and terrible fake tans just added to this flop.",
    "date": "2025-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Would probably be better if Lindsey Lohan was still capable of making facial expressions.",
    "date": "2025-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was more fun than the last Lindsey Lohan Netflix Christmas movie!",
    "date": "2024-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I feel bored, the colour effects used on this really bugged me, I get it you’re trying to make her hair as orange as possible but it ruined people’s tans and outfits and faces it just looks so vile",
    "date": "2024-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I honestly had a great time with this movie. I would absolutely recommend watching it with the family. The story is nothing crazy and sometimes predictable, but the movie is still filled with plenty of fun moments to get over that.",
    "date": "2024-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It was fine.  There were a number of time throughout the movie I was thinking this doesn't make any sense.",
    "date": "2024-12-28"
  }
]