[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The Rock might be strong, but he can't climb buildings with one hand. Give me a break.",
    "date": "2025-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "THIS MOVIE SHOULD CONTINUE AS PART 2 & SHOULD GET RATINGS. THE ROCK DID AN AWESOME JOB.",
    "date": "2025-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I didn't expect nothing of this movie, but at least I had a goot time watching it, I recomend it if you want to be entertained, but there are much better movies to pass the time.",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "5/10 means good",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it! Great cast who all excels in character, amazing cinematography and CGI. Action galore and enough twists and turns. Great viewing, surely recommended",
    "date": "2025-04-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie and has some thrill to it which makes the movie enjoyable.",
    "date": "2025-04-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Its a cool movie, well done, worth a watch",
    "date": "2025-03-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Meh…kind of cliche but it was still enjoyable.",
    "date": "2025-01-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Mire like Shitscraper. Good special effects but script and acting are predictable. The Crock is his usual terrible self.",
    "date": "2025-01-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Visually stunning. The Rock does his thing but its done so well, you can't help but get drawn in. And we need pure good guy characters some times. I like that his wife is no damsel in distress either though.",
    "date": "2025-01-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Kinda mid if im being honest",
    "date": "2024-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "One of a kind tough guy specialist gets caught in the wrong place at the wrong time and after much ado \ndodging bad guys and explosions and highly improbable \"turbine\" stunts everything fails and death is imminent until his multi-lingual wife stumbles across some obscure controls and saves the day by \"turning it off and on again\".",
    "date": "2024-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Ich bin wohl zu alt dafür. Der Sprung vom Kran ist so übertrieben und dann jedes Klischee erfüllen. Ich habe aufgehört zu schauen. Langweilig und übertrieben und tausend mal in anderen Filmen besser gesehen...",
    "date": "2024-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A great action movie that full of excitement",
    "date": "2024-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love all the movies of this actor",
    "date": "2024-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Will Sawyer is a former FBI agent and U.S. war veteran who now assesses security for skyscrapers. While he's on assignment in China, the world's tallest and safest building catches on fire -- and Will gets framed for it. Now a wanted man and on the run, he must find those responsible, clear his name and somehow rescue his family members when they become trapped inside the inferno.",
    "date": "2024-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It’s a really good movie.",
    "date": "2024-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "When you think of a stereotype film containing The Rock, this is it. A lot of noise, a lot of action and stunts. That is all it is. It is not a story that will pull you in and leave you wanting more.",
    "date": "2024-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "At times, I was genuinely having a good time with \"Skyscraper.\" While it is basically a B-movie version of \"Die Hard,\" I think there are some sequences here that feel unique and enjoyable. The problem is that the movie is just kind of boring and I never really got into the characters and felt invested. I think Dwayne Johnson is fine in the lead role and he fits in well for a wacky action movie like this. I think if the movie was trimmed down to maybe about 80 minutes and more focused on the action and mayhem, there is something more entertaining possible here. Overall, as it stands, it is just a forgettable action movie that doesn't really justify itself when you could just rewatch \"Die Hard\" instead.",
    "date": "2024-07-05"
  }
]