[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Worst movie ever. Heather Graham was awful! What happened? Her acting was off and terrible the entire time. She had no clue how to act her character. Brandy was a lil better. Not much tho. Just so disappointing. I expected a fun movie with real actors and it was worse than any bad Hallmark. Im not sure where her ability to actually act went but it was completely gone here.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The worst movie u have ever seen. I did enjoy making fun of it though.",
    "date": "2025-01-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Mid Movie\nNot great, not bad. Felt like I blacked out, at the end of the movie I was like what happened? Watched it with my family and they usually like these kinds of movies but they thought this movie was only okay. Good for background noise, would not recommend if you want to get actually invested in the movie.",
    "date": "2025-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "What is this why is this when did this where did this mess of cheesiness arrive to are planet please do not watch this if you are human. If there is one thing I love doing it’s watching Christmas movies during the holiday season. They said this movie was extremely entertaining enjoyable and exciting the only exciting part is waiting for the movie to end this movie needs to be erased from the world get it away from humanity even aliens are scared of this movie now and why is there a fake Adam sandlar do not watch this ever like Evers seriously you are going to pass away as soon as the movie turns on ……… this movie is absolutely garbage nobody wants to watch it ever not even if you think the trailers were good the movie was not🥺🤬🤬🤬",
    "date": "2024-12-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One,you guys are weird. It’s Christmas,it’s supposed to be lighthearted and cringe and cliche. Gosh.\nEnjoyed it from the beginning to the end. Nothing I didn’t expect",
    "date": "2024-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Do not watch. This is terrible on all aspects",
    "date": "2024-12-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Very cringe and hard to watch. We did have a good time making fun of it 😆",
    "date": "2024-12-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "An entertaining enough Christmas film.",
    "date": "2024-12-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "So bad, so very very bad. The acting, the storyline, the production… evening about this was just SO BAD!",
    "date": "2024-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Very light entertainment. The plot is very predictable and cliché. If you‘re looking for some Christmas movie that feels like you‘ve already watched it, you‘ve made the right choice. It is cozy and very family friendly.",
    "date": "2024-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I really like all the actors in this movie, but I can’t say I liked the movie. I take that back. I liked to the beginning and I liked the end. The middle sucked.",
    "date": "2024-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Best Christmas ever! \nMore like worst movie ever! This movie cost me electricity. Horrible and predictable.",
    "date": "2024-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I thought it was a lovely film that probably only Christians will enjoy.  From what I see from the professional critics the ideas of forgiveness, kindness, patience, and love is ludicrous.  It’s a reminder not to give up on people even when they’re difficult to love.",
    "date": "2024-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I’m a big fan of Jason Biggs because of the \"American Pie\" movies, but not even he could save \"Best Christmas Ever\". The plot is so generic and predictable, and I barely laughed, maybe chuckled a couple of times. There are so many cringe moments, and the child actors are really bad. I didn’t care about any of the characters at all. The story felt like it was written by AI, and some of the emotional stuff, like the death of a kid, made me laugh because it was so unbelievably written.  \n\nHeather Graham was the highlight, though, and probably the only good thing about the movie. Mary Lambert once again proves that she is incapable of directing a film. It also doesn’t know what kind of movie it wants to be; comedy, drama, or something else. Overall, it’s just really badly written and a total waste of time.",
    "date": "2024-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Bad acting. Bad script. Not best Christmas movie ever.\nI was expecting better from Jason Biggs…",
    "date": "2024-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Bad movie, a waste of time. The purpose of this movie was to place a few brand deals like Cheetos and red bull, and make it intentionally bad so people would talk about it. Bad publicity is still publicity.",
    "date": "2024-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Will not be adding this one to our annual Christmas list.  The kids were begging us to turn it off.  Don't waste your time on this one.",
    "date": "2023-12-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "would rather watch grass grow",
    "date": "2023-12-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Unfortunately this movie was not worth the 81 minutes spent watching it. While the initial premise was lightly based in reality, what ensued was absurdity after absurdity. The characters had absolutely no depth, and we experienced no background to understand their shallowness. Take a hard pass on this and rewatch Elf.",
    "date": "2023-12-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The cringey, cliche-ridden dialogue, robotic acting, and a manipulative plot twist did not put me in the Christmas spirit.  It was nice to see these actors get a paycheck, but so sad to see how far Jason Biggs and Heather Graham have fallen to be in this mean-spirited garbage.",
    "date": "2023-12-24"
  }
]