[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The first half of this movie is insultingly bad, it's a chore to keep pushing through, but it does get its footing at the end. It's not just the glaring plot-holes (a drug-addict journalist \"exploring\" alone forbidden caves with no discernible equipment nor support team, who has no passing understanding of the local culture she supposedly hails from, and doesn't speak a word of the local language is just a ridiculous premise, no matter the later twists), it's the clunky dialogue, the passive protagonist showing no curiosity about the mystical world of brujas and spirits she's supposedly there to uncover, the ham-fisted themes. It's the off-putting acting: the lead is stiff and fake in every way, from her atrocious body language always and only trying to serve helpless and oh-so-sexy, with coiffed hair and bloody rags, to her terrible delivery of her character's not-great lines. It makes for a painful watch, even if the supporting cast does its best to give credible performances, Brigitte Kali Canales is so bad in this role to throw you off any suspension of disbelief for most of the movie, and she isn't helped by a direction that wants her in perfect mascara even when delivering her final transformation. This movie is a waste of what could otherwise have been a fun, interesting exploration of creepy folklore. Fun enough to actually warrant a decent remake, someday.",
    "date": "2025-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Sayang oras. Kinulang sa horror. Konting sindak pa sana e swak na horror movie na sana",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Shut it off after 12 minutes. Insultingly dumb, schematic, primitive screenplay, copying the worst Hollywood cliches in an imbecilic way; dumb wooden characters brought to life by some of the most atrocious, wooden acting I've seen in years. Excrutiatingly bad dialogue. Lollipop-commercial visual asthetics for shooting a dirty pricon cell. Impossible to take this seriously for even a moment. Rarely does one come across a movie whose every single aspect is so unforgivingly bad.",
    "date": "2025-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "My whole family loved this movie! We would all greatly enjoy watching a continuation to find out if Cristina & Miranda \"got better\" at what they do.",
    "date": "2025-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The Old Ways (2020)\nThe Bruja and the Demon Postehki\n(11,860 – 28 Jul 2025 – by Claudio Carvalho)\nThe journalist Cristina Lopez (Brigitte Kali Canales) returns to her hometown in Veracruz, Mexico, to prepare an article about ancient rituals and La Boca caves. She wakes up chained in a cabin, and the responsible Javi (Sal Lopez) forces her to drink goat’s milk. She asks him to call her local cousin Miranda (Andrea Cortés). When Miranda arrives, Cristina learns that the bruja Luz (Julia Vera) saw the demon Postehki inside her, and she will leave only when the demon leaves her body. The skeptical Cristina does not believe in the beginning until weird things happen in the hut. \n“The Old Ways” (2020) is a different American movie directed by Christopher Alender. Exorcism movies following Catholic rites are very common in the industry, but a movie with bruja exorcising the Demon Postehki following the Mexican old ways is quite original. In addition, there is the personal drama of the Mexican American heroin addicted Cristina Lopez. The film is scary and well resolved. My vote is six,\nTitle (Brazil): “Ritos Ancestrais” (“Ancestral Rites”)\nMy Blog: https://maniacosporfilme.wordpress.com/",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The Old Ways unfolds on an interesting premise, delivering a solid experience for the folkloric horror genre. Its primitive setting, the backdrop for the fantastic horrors of the region, works to create the atmosphere that the audience expects. In the aspect of the genre itself, The Old Ways is good.\n\nThe story follows journalist Cristina who decides to return to her homeland in Mexico to investigate a history of healers. However, locals kidnap her on suspicion that she is possessed.\n\nI think that only those who have witnessed events of a supernatural nature can understand the power of this film. Those events that you can even rationalize, but that always leave a seed of doubt deep in your subconscious. And if it was real, no illusion? I say this because Cristina, in The Old Ways, goes through this questioning for the first half of the film. Is her supposed possession real or just a trick of fanatics? An interesting thing that hooks us to the film.\n\nNow, Cristina herself is a dubious character. Her external demons are clear, but her internal struggle is perhaps the only flaw of the film. The connections that the story tries to create with her past are questionable, superficial; and Cristina's primordial flaw, although strong, proves to be easy to overcome. \"Oh, you know what, I don't want to make mistakes like that anymore\", and, presto!, case closed.\n\nI enjoyed, however, seeing Cristina's overall growth, her development to the apex of her arc. The way she transitions from \"passive\" to \"I'm going to solve this game now\" works satisfactorily.\n\nAs a folk horror story set indoors, The Old Ways delivers what it promises.",
    "date": "2024-12-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A journalist (Brigitte Kali Canales) awakens to find herself held prisoner by a bruja and her assistant.\n\nAn exorcism tale that begins as psychological horror then morphs into a creature feature.   I loved how it infused Mexican culture and lore into a common tale of wrestling with inner and outer demons.",
    "date": "2024-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The film had a good start to it, it get its audience hooked right away with suspense. The only thing that I found wrong and disrespectful was the ending. Aside from being a lame ending, I found it to be disrespectful, as if they are mocking that  culture.",
    "date": "2024-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The movie uses the typical horror tricks and gimmicks right from the start. Yes, there is a good acting and a dark atmosphere but put in the service of a mostly trivial story with a ridiculous ending.",
    "date": "2024-05-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "WOW from start to finish this was a trip, the entire time you are fairly unsure of what's to come next and the audience feels as conflicted as the main character. The ending was fantastic and I wish more movies had such a strong story line that truly keeps you captivated at every moment.",
    "date": "2024-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This film carries forward a common horror movie concept which has been redone countless times, this in turn does make it quite predictable. Most of the film is spent in one room and the jump scares appear to lackluster.\n\nNonetheless, the movie is quite interesting as it brings the protagonist into a very relatable situation and the film dabbles in the idea of tradition vs new customs/ideas. The acting isn't all bad and the movie does string viewers into the horrors quite well.\n\nI wouldn't watch it again but it's a good weekday watch with pizza and a blanket.",
    "date": "2024-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I don't know how this movie got a 95% rating, but it was NOT good. The acting wasn't in any way believable, the plot was hollow and predictable, and the flick ran about 40 minutes too long. Save yourself the cringe, skip this one, folks.",
    "date": "2024-01-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Vastly overrated, it's the same ol' same possession movie. The old way indeed.",
    "date": "2024-01-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Just terrible dialogue! I couldn't make it all the way to the end of this rubbish 😒",
    "date": "2023-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I don't understand why the audience didn't like this movie, I thought it was awesome. I really liked the ending and all the themes running through. I found it quite compelling.",
    "date": "2023-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I liked the atmosphere, a refreshing look at exorcism horror genre.",
    "date": "2023-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Very forgettable movie. This was not scary at all. Moved at a slow pace. Predictable and silly ending. Interesting story that failed to develop into anything meaningful due to subpar acting and a poor script.",
    "date": "2023-02-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Donkey farts.  Viva La Caca!\n\nFails to get full attention at any point.  It was clear that it was going to need something jaw dropping to just get it above water and it didn't have that.  The blood and gore was all it really had going for it when not shot in the dark.  Very generic.",
    "date": "2022-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This movie heavily relies on gore and gross-out scenes. Beyond that, it tries to frame possession and exorcisms as ancient mesoamerican indigenous beliefs, which they aren't, they merely take catholic beliefs and ideas and dress them up as indigenous. Very lazy all around.",
    "date": "2022-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Love a good possession movie. This was watchable and entertaining with some good performances.",
    "date": "2022-08-01"
  }
]