[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Hop (2011) I found the movie quite enjoyable to watch, however the script is quite poor and sometimes fails to deliver any good humor. It's very complicated to create an animation that blends with the real world; some films work, others don't.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Always been a good movie.",
    "date": "2025-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Will you please stop dancing? Carlos is a fantastic villain.",
    "date": "2025-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Il miglior film di Pasqua",
    "date": "2025-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "😐 why just why, EVERYTHING ABOUT THIS MOVIE MADE ME WANNA DIE",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Its nice we get a Easter movie for once but this one is just so boring",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Es buena para ver %57🍅",
    "date": "2025-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "it has the blind boys of alabama so its peak",
    "date": "2025-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "LOL, 1 hour and 35 minutes of humor. Rated PG for Some Mild Rude Humor!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I absolutely loved this movie when it first come out. How could I not bunnies adorable, Easter island factory oh yummy candy, and an adorable bunny that love music. If you love all Easter, bunnies, candy, and music then this movie perfect for you.\nSpoil alert\nThis story is about E.B. who loves to play drums. His dad is the Easter bunny now but when E.B. grows up he will be the Easter bunny. E.B. isn’t sure he could do it. Fred a human kid on Earth sees the Easter bunny one night. Years later Fred is all grown up and his dad is mad at him for not having a job. His sister helps him get possibly another job and to watch her boss’s house for a few days. Fred agrees. E.B. now all grown up still playing the drums. His dad comes and demands him to become the Easter bunny. E.B. decides to follow his dream to become a drummer. He goes to Hollywood. Meets Fred at the boss’s house. The next day E.B. tells Fred he’s the Easter Bunny. Fred’s job interview doesn’t go well. Sam holds E.B. unaware he is a real and talking bunny. Fred and E.B. perform a song at a school play. E.B. tells Fred who he really is and that he doesn’t want to be the Easter bunny. Fred wants to be the Easter bunny. Fred and Carlos train to be Easter Bunny/Easter Chick.  E.B. is close to getting his dream but the Easter bunny’s guards come so he leaves Fred behind. Unaware that Fred was kidnapped and taken to Easter island for the death of E.B. finding out that he didn’t kill him. Carlos shows his true colors to the Easter bunny that he wants to be the Easter chick and locks them up. E.B. goes back home and saves everyone on Easter island. E.B. and Fred become the Easter Bunnies. Fred and his dad make up. E.B. and Fred go back to Easter island",
    "date": "2025-04-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I Think This Is The Most Best Easter Movie",
    "date": "2025-04-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I don't understand the negativity towards Hop.  it is a great, fun kid's movie that adults can enjoy too.  I look forward to watching every easter.  The animation of E.B. is well done.  Along with great music, it's a must see for family fun.",
    "date": "2025-04-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Super cute for the kiddos. Go ahead and rent it.",
    "date": "2025-03-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "\"Hop\"? More like \"Slop,\" am I right?",
    "date": "2025-03-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Worst and dumbest movie of all times. Do not watch this movie.",
    "date": "2025-03-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Underrated as heck fr",
    "date": "2025-03-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "AMAZING LOVED IT SO MUCH A CHILDHOOD CLASSIC",
    "date": "2024-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Hop, it stands for Horrendous Outrageous Piss",
    "date": "2024-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "When I first picked up the movie to watch, I turned it off after less than 5 minutes and now I regret it. After watching it in its entirety, I really liked it. Sweet movie, great humor and music selection. Also great animation. I recommend it to everyone.",
    "date": "2024-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie! We need more Easter movies like this!",
    "date": "2024-06-14"
  }
]