[
  {
    "user": "Marissa Hill",
    "rating": null,
    "text": "If you're interested in learning about someone who might not have been covered in your history books, it could be an enlightening watch.",
    "date": null
  },
  {
    "user": "Ronda Racha Penrice",
    "rating": null,
    "text": "Not only does [King] don Chisholm’s clothes, adopt her hairstyle, recreate her distinctive smile, and attempt her Bajan-tinged accent, she digs at the core of who Chisholm was in that moment—principled and fearless.",
    "date": "2024-08-07"
  },
  {
    "user": "Jack Martin",
    "rating": null,
    "text": "Shirley is a well-meaning political biopic that features a strong central performance by Regina King, but a reliance on the same formula as Netflix’s similarly safe Rustin ultimately renders it unmemorable.",
    "date": "2024-08-05"
  },
  {
    "user": "Rory Doherty",
    "rating": null,
    "text": "It's an anxiety-inducing relationship drama that dives headfirst into the responsibilities and ethics of creative writing, and I can't wait to revisit it again and again.",
    "date": null
  },
  {
    "user": "Chuck Wilson",
    "rating": null,
    "text": "In a movie overstuffed with men, Jackson and King spark off one another, and share one of the movie’s best scenes.",
    "date": null
  },
  {
    "user": "Dominic Griffin",
    "rating": null,
    "text": "“Shirley” is a watchable-enough affair. But it doesn’t feel like anybody involved quite realized how sad and bittersweet a tale they were telling.",
    "date": null
  },
  {
    "user": "Jane Freebury",
    "rating": null,
    "text": "If the real Mrs C, a former teacher, had worked on the screenplay she would surely have made it sharper and pithier, but the story of her tilt at the presidency decades ago is interesting, raising difficult questions",
    "date": null
  },
  {
    "user": "Verne Gay",
    "rating": null,
    "text": "\"Shirley\" plays like the last episode of a four-part TV series, and a pretty good one at that.",
    "date": null
  },
  {
    "user": "Stephen Silver",
    "rating": null,
    "text": "Like great political biopics of the past like Selma and Milk, Shirley is mainly about political strategy",
    "date": null
  },
  {
    "user": "Frank Swietek",
    "rating": null,
    "text": "Unlike its subject, “Shirley” is more dutiful than exceptional.  Terribly respectful and equally stolid, it’s a dry history lesson energized only by King’s committed turn and some solid work from the supporting cast.",
    "date": null
  },
  {
    "user": "Reginald Ponder",
    "rating": null,
    "text": "Regina King is masterful as Shirley. However, trying to focus on a point in time & covering many aspects requires the writing to be tight directing to be on point, & editing to be great... \n fell a bit short of making “Shirley” as great as the person.",
    "date": null
  },
  {
    "user": "Jennifer Green",
    "rating": null,
    "text": "Nonetheless, Shirley provides an entertaining enough and well-produced introduction to a preeminent historical figure.",
    "date": null
  },
  {
    "user": "tt stern-enzi",
    "rating": null,
    "text": "It is such a faithful and straightforward adaptation of the story, it would've been interesting if they'd found a way to make it a little more unconventional -- because she was an unconventional woman.",
    "date": null
  },
  {
    "user": "Moira MacDonald",
    "rating": null,
    "text": "Regina King, also a producer of the film, is an inspired choice for the role, and her Shirley is made up of endless strength, kindness and courage.",
    "date": null
  },
  {
    "user": "Wenlei Ma",
    "rating": null,
    "text": "The script paces along briskly and John Ridley’s efficient filmmaking choices spotlight the key moments.",
    "date": null
  },
  {
    "user": "Rohan Naahar",
    "rating": null,
    "text": "You get the sense that you’re being presented with a fully formed person from the very first frame. The screenplay doesn’t give Chisholm much of an arc. She’s strong-willed in the first scene, and she remains just as resolute in the film’s final moments.",
    "date": null
  },
  {
    "user": "Armond White",
    "rating": null,
    "text": "[A] sometimes touching but fence-sitting portrayal of Chisholm... Yet, midway through Shirley, both Ridley and King seem to have finally realized their folly and, like responsible pop artists, give Chisholm flashes of integrity and complexity.",
    "date": null
  },
  {
    "user": "Michael Phillips",
    "rating": null,
    "text": "With “Shirley” we’re close to almost-not-quite territory, and visually, Ridley sticks with conventional shot sequences of characters in frame, alone, either speaking or reacting. This makes fluidity and interpersonal flow pretty difficult.",
    "date": null
  },
  {
    "user": "Alex Maidy",
    "rating": null,
    "text": "I appreciate what this movie is trying to be, but it never builds the same momentum as the participants in the actual event. Maybe if Regina King had directed Shirley, there would have been something more vital than what Ridley could produce.",
    "date": null
  },
  {
    "user": "Dennis Schwartz",
    "rating": null,
    "text": "A well-made but pedestrian political docudrama.",
    "date": null
  }
]