[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Maze Runner stands out as a surprisingly engaging sci-fi adventure that manages to keep viewers invested from beginning to end. The dialogues are well written, even if many of them follow familiar patterns. What makes them work is the pacing and the tension that builds with each exchange, making the story flow naturally rather than feeling forced or overly dramatic.\n\nThe visual effects are truly remarkable - the CGI is so convincing that it gives the impression of a real, colossal maze built specifically for the film. Every environment feels alive, full of texture and detail, contributing to a strong sense of immersion. It is clear that the technical team put immense effort into crafting a world that feels both futuristic and grounded.\n\nThe performances are competent and believable. Despite most of the cast coming from projects that didn't achieve much success, they all deliver solid work here. The chemistry between the characters feels genuine, especially during the moments of tension and teamwork.\n\nThe story maintains a fast rhythm, keeping the audience constantly curious about what lies ahead. The mystery behind the maze is unveiled slowly but effectively, ensuring that the suspense remains until the very end. Although the final plot twist leaves a few questions unanswered, it works as a smart setup for the sequels, which promise to expand the universe and clarify what remains hidden.\n\nIn the end, Maze Runner surpasses expectations. It combines strong visuals, consistent performances, and a sense of intrigue that keeps the viewer hooked. Even with its flaws, it delivers a thrilling experience that feels both entertaining and thought-provoking.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Without a doubt, it's one of the best movies I've ever seen in my life. Both in terms of realism and the quality of the monsters. All three films were a great success with all types of audiences. 10/10",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I think the acting in this isn’t there. Or maybe it’s the writing. Either way, it’s just trope after trope, but the world-building has something intriguing that makes me still want to know what happens. This is the first of three movies, but this is the only one with the maze—which is the most intriguing part. I would say this trilogy isn’t as good as the Hunger Games, and probably on par with the Divergent series (a series that I’m not sure was even finished). Still worth a watch though, but definitely not on the top of my list. But it’s not at the bottom either.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "So good I loved it how is this not higher with Rotten Tomatoes and audience score its paced so well",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Le plot est plutôt intéressant et j'aime la volonté que Thomas a de vouloir découvrir ce qu'il y a au-delà du labyrinthe. Je trouve cependant qu'il y a trop de questions en suspens ce qui m'a sorti un peu du film.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Perhaps if I had never read the book I could give this a higher rating. But the translation to movie format lost SO much of the character development, and the Grievers and actual challenges were very different from what the author created with his imagination.",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Casting was amazingly well put together. As a comparison to the visual image of certain prominent elements like the walls and the freaky spider robots one gets from reading the book, the movie didn't disappoint. Credit to the writer.",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Está muy bien, las secuelas no dieron la talla.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Maze Runner is very fast paced and contains many elements in this movie. It really shows how people can work together to get out of a situation, and how it's not all about yourself but about the people around you. When working together with everyone it will be easier to help you and other people around you. This is a great movie and I encourage others to watch it.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It is intriguing as heck, even if you have already seen it!! The entire movie is like a 2 hour brain game! It's a shame the other two installments didn't even amount to a quarter of this one.",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Solid foundation and storyline building up to the events that took place \n\nThe first movie was by far the greatest, and I enjoyed the book as well. Probably a little more than I should’ve!",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Filme: Maze Runner: Correr ou Morrer\t\t@mazerunnermovie #mazerunner\t\t\nElenco: @imdylanobrien @samohtsangster @kayascods @willpoulter @kihonglee @dexterdarden @alexjflores_1 @amlameenbaby\nModelo: #ação #ficção\nDuração: 1h 53m\tAno: 2014\nMinha opinião: Mazer Runner: Correr ou Morrer (2014), Prova Mortal (2015), e Cura Mortal (2018). Esta triologia que marcou os jovens teens. Nesten1º filme se passa em uma aréa totalmente fechada, que de periodo em periodo abre um portal que criaturas vivem e quem se desafia em entrar dentro dela, a maioria não volta. Onde de periodo em periodo um adolecente novo é enviado para a arena que ja tem jovens la. Até o dia que Thomaz (O’Brian) é enviado e alguns dias depois Teresa (Kaya) também. Como sempre conflitos ocorrem e grupos são formados. Até o momento que desafiam entrar no labirinto e la Thomaz descobre que ele se mexe, mudando de forma. Lutam e conseguem matar uma das criaturas. E como não sabem de onde vieram e para onde vão. Novamente desafiam entrar no labirinto. Enquanto outro grupo não. E assim descobrem que existe uma saída. E assim vão, com várias momentos de tensão, e muita ventura e suspense os garotos conseguem sair. E assim termina o 1º filme. Neste suspense e deixando várias ???????\nVale apena assistir? Muita emoção, ficamos perdido da mesma forma que os personagens, então vamos desvendando junto com eles. Isso nos deixa preso na poltrona. Ótimo CGI, estória e enredo. E interpretação dos atores.\nNota: 9",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "always a goodd watch lovveeeeee",
    "date": "2025-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I absolutely love this movie along with the rest. I have watched it several times since its release. You feel for the characters and what they are going through. It is a nice twist to a dystopian future that keep you glued to the screen. I wish there was a little more to some of the characters but the movie(s) would have been longer. I wish more movies put in the work to make great movies such as this. For myself, it is up there with all the other great trilogies of the past couple of decades.",
    "date": "2025-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Entertaining and mysterious. Most of this movie is awesome to watch. The ending felt off but I guess that is probably how the book ended too. Either way really great until the end.",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The Maze Runner was a great movie with a very cool mystery and great characters. I enjoyed this movie a ton with the action, mystery, and society they had created for themselves.",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "It was a spectacular cinematic movie but I still don’t understand how W.C.K.D. is considered “good”. The ending was so worth the wait, though I am confused about how trapping kids in a box would cure a disease.",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved this movie personally. It was very good I had fun watching it and I was sitting at the edge of my chair at moments. Defo  recommended watch.",
    "date": "2025-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Ridiculous tripe. I thought I might be wrong, I said to my wife, \"where's the chick\"? Suddenly she appears and a beautiful one of that, of course. It employs the typical Hollywood cliffhanger action modalities where somebody almost falls off a cliff but suddenly is saved by something miraculous. The bugs splat themselves magnificently though, I must say. But why are they so ineffective against our heroes? Answer is, as always, in all Hollywood action films.",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Having read the books, I can speak for the film’s adequate adaptation of James Dashner’s thrilling series. The acting was especially compelling and really helped the story flow. All in all, the whole movie really built up hype for sci-fi fans. This might top the Hunger Games.",
    "date": "2025-09-01"
  }
]