[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 02 hours, 06 minutes, and 21 seconds!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated R for Terror and Gore|, Language and Violence!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $25,600,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Annoyingly Slow Slow Paced movie...Arrogant and slow idiot people...",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "when someone tells me they enjoy horror movies, this is of my favorite movies to tell people to watch. i always get a kick out of someone who contacts me after watching the movie, they say “why would you make me watch that”?\n\nthe effects are not good. it’s from the 00s so cut it some slack with that. the acting is between not bad and fine. i will say, it kept me on the edge of my seat. it was easy to hypothetically insert myself into such a terrifying situation.\n\nif you haven’t had the ending spoiled for you, you’re in for a treat. it’s the only movie where my friend and i sat in silence for the duration of the end credits scene, unable to speak. \n\nstephen king himself said he prefers darabont’s ending. i have read the book and i liked the book ending as well, but for a different reason. it was open ended and made me pine for answers with a sadness of not knowing how the characters ended up. a wistfulness and hopelessness of not knowing. \n\ndarabont’s ending turned the mist from a movie nobody would’ve watched to something that goes through the movie discussion grapevine as a must watch. not the greatest movie of all time, but the ending is what makes it truly memorable.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This film manages to be scary, tense, exciting, and even reflective all at the same time.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "una de las mejores películas y el final joder es brutal y asombroso",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This Movie is Fantastic to witness by the eye of the viewer, not horrible as most movies these days, and for those that have seen it before and judged it a few years ago I would advise to rewatch and compare it to any other movie you deem awful.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "While The Mist may not be the most thrilling ride, I applaud its creative effort. The ending, though, is a bit of a, well, mist-opportunity – it falls short of expectations, but I most certainly appreciate the film’s innovative approach.\n\nGrading: C+",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "If you’re bothered by creepy insect like monsters like me then you’ll love to be creeped out by this movie.",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "So bad. Do not waste your time or happiness with this movie.",
    "date": "2025-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Good movie, ending made me sadder than that dream I had where I got my earlobe amputated. Justice for Ollie. Also frick you for putting the spiders under my skin,",
    "date": "2025-09-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Weak plot, poor acting and weak special effects",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The Ending just horrible & doesn't make sense",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This one is way overrated.\n\nBelongs in the trash.",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I'll never get back that 2 hours. The entire things was pretty dumb, but the ending made the rest look like an Academy Award winner. Skip this by all means.",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The dumbest ending I ever seen. He didn't hear all those trucks and tanks? As I thought, Stephen king is an overrated author, his stories are garbage.",
    "date": "2025-06-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Such a dark and honest view of what humans do in a crises. Not your typical Disney movie with sweet characters and a happy plot. It's real and ugly and you can't stop watching and thinking \"What would I do if I were in that situation?\" I love this type of movie!",
    "date": "2025-06-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The film has something very unique that, because of the plot twist, becomes something good and memorable.",
    "date": "2025-05-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I liked it. It’s low-budget, for sure, but the film wisely chooses to focus on the interpersonal relationships of the characters rather than the monsters and the lore. In a lot of ways, the threat itself is secondary to the film and could easily be swapped out with any other mysterious force. The politics of the trapped townspeople get really interesting, elevated by mostly good performances. I especially appreciated the religious allegory of the hate that’s become so prevalent in our society. The ending was a surprise (in a good way) and feels very Stephen-King. It’s a tight film that, despite some hit-or-miss CGI and plot-driven logic, proves effectively scary and leaves you thinking.",
    "date": "2025-05-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The ending is literally unforgettable.",
    "date": "2025-05-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very creepy, leaving a bitter aftertaste, The Mist is an absolute masterpiece of horror genre (best horror movie of 2000). Thomas Jane is amazing in this movie. The final rips the heart to pieces.",
    "date": "2025-04-11"
  }
]