[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Worth a watch, such an interesting/mystery story based on  elements of a true story.",
    "date": "2025-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "It’s hard to believe the low ratings by some people for this movie. I thoroughly enjoyed it ,as it harks back to a time when movies were sumptuous, and the dialogue and acting were as important as the action. Probably showing my age , but i can understand the younger generation would find this not to their taste. It’s certainly no Indiana Jones model.. but more restrained and thoughtful and beautifully shot. The fact it is a true story makes it even more poignant. A feast for mature movie buffs.",
    "date": "2025-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A good reminder that no amount of glory can replace failures at home within your own family. Robert Pattinson was underutilized.",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The movie adaptation of the David Grann book, The Lost City of Z, bites off more than it can chew. While Percy Fawcett was a trailblazing explorer and honorable soldier he ultimately abandoned his wife and children,  and in so sacrificing his oldest son to the jungle in satisfaction of his ego and blind obsessions. It’s a story of a man with a lifelong chip on his shoulder who places self aggrandizement over family. \n\nThe movie dispels with all but the most obvious Amazonian “green hell”jungle hazards thereby losing texture of the central theme of the movie.",
    "date": "2025-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Looking for the \"El Dorado\" again!",
    "date": "2025-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Interesting story, though it was long and spanned many years it kept me paying attention. The ending was a little disappointing but I get why they made it how they did. Crazy to imagine the vast unknown that existed back in the 1800-1900s before technology enhanced our capabilities.",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Why don't Hollywood studios make more of these.",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not a bad film or story line but it is very slow paced throughout.",
    "date": "2025-04-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It took some time to get into it, Charlie Hunnam's English accent is offputting, and the ending - while I realize it is based on a true story - ruins everything. Through the heart of the movie though, it was enjoyable.",
    "date": "2025-04-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The first 10 minutes or so I just didn’t find it interesting , but if ur of European descent then this movie will fancy your European American/canadian prejudicesism",
    "date": "2025-04-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I think it was a brilliant movie. Attention to detail the movie just draws you in. Loved it",
    "date": "2024-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "wooden acting, cliched story line, so dull I could only watch the DVD in 2 min bursts.  These lack of qualities may reflect the nature of the book on which it is based",
    "date": "2024-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The Lost City of Zzzzzzzzzz.....It is very dull and dreadfully miscast and acted. \n\nWatch Aguirre Wrath of God instead. A true masterpiece",
    "date": "2024-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Terrible film Terrible acting!",
    "date": "2024-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It is almost impossible to imagine how a duller or more boring movie could have been made from what is fantastically dramatic and astounding source material. It is an interminably slow slog, with no payoff. Despised it.",
    "date": "2024-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Having loved David Grann's \"Killers of the Flower Moon,\" both the book and the film, I dove into other books by the author and stumbled upon \"Lost City of Z.\" I have to say, this book was incredibly hard to put down. It was like a binge-worthy TV show—every page had me hooked. As I read, my spirit of adventure was reignited, and I found myself reminiscing about past travels in South America and the Amazon, trying to connect with Colonel Percy Fawcett. The book had me daydreaming all day and night, completely engrossed in its adventure.\n\n was really torn about whether to watch the movie adaptation of \"Lost City of Z.\" I wanted to see how the film portrayed the depth of the forest, the tribal costumes, and the illnesses, comparing it to the vivid images I’d built up in my mind. On the flip side, I loved the character and challenges I had imagined myself, without any screen influence.\n\nOne lone night, when my movie partner (my wife) wasn’t around, I decided to give it a go. The deciding factor was the cast—Charlie Hunnam and Robert Pattinson, two actors I really enjoy watching. Those two ended up being the only reason that i can say i could sit through the movie in the end. \n\nOverall, the film felt pretty shallow—lacking real emotional depth, character development, and a strong plot direction. It seemed loosely inspired by historical events but missed the chance to delve deeper into the characters' lives and the complexities of the time period. Compared to the book, the film deviates significantly. The book intertwines two parallel journeys: one of Colonel Fawcett in the past and the other of author James Gray retracing Fawcett's route in modern times. These parallel stories, despite being separated by time, share similarities and challenges. This whole dynamic was missing from the film, leaving out a key element that could have added much more depth.\n\nThe film's pacing was all over the place, with lazy dialogue and crucial details left out. For instance, one moment a companion is being eaten by piranhas, and the next, there’s no mention of him at all. The movie barely touches on the horrific illnesses or the unique traits of the tribes encountered. Overall, it felt like a hot mess, failing to do justice to a beautiful and riveting story. \n\nI don’t think I’ve ever been more let down by a film adaptation of a book. The film didn’t just fall short; it felt like it missed the essence of the book entirely. What made the book so compelling was its depth, the rich detail, and the way it captured the spirit of adventure and exploration.  It’s frustrating when a film adaptation fails to live up to the highs of its literary counterpart, and this one was particularly disheartening because the potential was there, but it just didn’t deliver. 4/10",
    "date": "2024-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Charlie Hunnam was miscast as Fawcett. Needed to be either Daniel Day-Lewis or Christian Bale. Decent movie otherwise.",
    "date": "2024-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Heard a lot about the movie before watching, not a bad story, the concept was great.",
    "date": "2024-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of my all time favorites. When people say movies transport you to a different time and place, these are the movies they are talking about. Can the lack of clear answers be frustrating? Perhaps. But isn't that the cost of discovery and progress? So much time and energy spent towards things you may never know the answer to. So many journeys taken only to still have that void in your soul.",
    "date": "2024-03-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It's really entertaining, a good old-style adventure film.",
    "date": "2024-03-12"
  }
]