[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thought the story of the movie was excellent it showed how a younger soldier turned out to be the hero of the movie. Casting was also excellent Russl Crow was fabulous, the cinematography was also fabulous",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I enjoyed it. First half was better than second half.",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I was lost at first at their mission, I do not see it is well executed explaining their goal. But overall, it was a must watch movie for all action seeking viewers. Every moment is intense, and no dead air.",
    "date": "2025-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It was a solid movie, decent action and good characters. A high body count and plenty of violence. I thought it could've been cut down a bit especially in the first half. But it's a satfisying watch.",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Bref ça tire de partout et ça se tape. Basique mais sympa. L'avantage de ces films d'action c'est que le suspense est constant et qu'on ne peut pas vraiment s'ennuyer. Ça m'a fait plaisir de voir Ricky Whittle dans un nouveau rôle, j'adore cet acteur.",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A good film in the gunfire and explosions genre set in a world of military action and survival. It features a very interesting cast, including the Hemsworth brothers (Thor family), Milo Ventimiglia (the eternal Peter Petrelli), not to mention the immortal Gladiator. The plot, focusing on the acrobatics and tricks of the drone universe, was the highlight.\nIt's worth checking out.",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "All because they wanted to save a arms dealer's kid",
    "date": "2025-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The Land of Bad Acting while watching Russell Crowe destroy his career. Unwatchable",
    "date": "2025-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The movie is meh and confusing  . In the movie they supposed to recuse a CIA agent but at the mystery agent magical change to a JSOC member. That's don't even make sense at all.Master Sgt. John, Sweet thing. Apparently I just watched Russell Crowe’s character run errand for his wife.",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Land of Bad (2024) is directed by William Eubank, who has been gaining respect for his previous films at film festivals that don’t have much showbiz focus. In recent works such as Underwater (2020), The Signal (2014), Crave (2012), Love (2011), and House of the Rising Sun (2011), he earned titles and was nominated several times.\nHowever, his films are not widely known since they are not blockbusters. Even so, Land of Bad features Chris Hemsworth’s relatives — Thor himself. This film also includes Russell Crowe in a supporting role. Even in a secondary role, he would have deserved a Best Supporting Actor award. Without Reaper, Kinney would have failed the mission, and the CIA would have shut down the operation.\nRegarding the script, the film follows a rescue and survival storyline. Screenwriter David Frigerio wrote Crypto in 2019, but there were three people on the screenplay, which may have hurt that film.",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Another great military movie!",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Much longer than what was needed. It flirted with depth, culminating in the JTAC using a knife then a rock. But ultimately, no, it didn't do it for me.",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The action kept me watching for nearly two hours. Then the worst ending in history. Weak would be too strong a word. Russell Crowe needs to retire. If he had “just mailed it in”, that would have been an improvement.  Bad movie.",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It was a very good special operations movie not the best but good. The action was there the acting was good, Russel Crowe did a bang up job. The reason this is only get 4 stars is the militia’s aim was about as good as stormtroopers in A New Hope and I think this could have been better and would have made the action scenes a little less one sided.",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Great movie with intense actions scenes. Great movie to watch when you don’t know what to watch. Definitely recommend!",
    "date": "2025-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I came across this movie on a whim and I’m glad I did! This was absolutely incredible. If you have a military mind and understand the capabilities involved in operations, this movie will not disappoint. The acting was superb, the story had a really good flow. Only thing that had me a little perplexed was the whole basketball thing. Glad that 9i took care of that. This one had me glued for the entire movie!",
    "date": "2025-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The slow motion gets the movie cool",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie rushes to action without caring about the characters. I didn't care about them and neither the writers. This makes all the plot boring and pointless, with americans starting to shoot \"because they are always the good guys\". I've just seen it in 300 movies before, don't waste your time.",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Boom! That was an enjoyable watch. Russel Crow was great, entire cast was good. Kept me on my tows.",
    "date": "2025-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "So bad I had to make a rotten tomatoes account. I’m not criticizing the actors because what were they supposed to do with that script?! Nothing makes sense. If you’re ex military or just knowledgeable about anything military this film if going to upset you viscerally. What blows my mind is the positive reviews on here what the f*** are you people talking about?!",
    "date": "2025-07-05"
  }
]