[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I didn't know much about SpaceX prior to seeing this film. It was really inspiring to see such a talented group of scientists and engineers get the USA back in the space game so to speak. Such a monumental task called for technological breakthroughs that were not inevitable. Very well done and informative film.",
    "date": "2024-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A space program catch-up documentary that covers all the bases, including where humans fall short, and still provides some sense of excitement for what's to come.",
    "date": "2023-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I didn't know much about SpaceX prior to seeing this film. It was really inspiring to see such a talented group of scientists and engineers get the USA back in the space game so to speak. Such a monumental task called for technological breakthroughs that were not inevitable. Very well done and informative film.",
    "date": "2023-02-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Sience Fiction coming to life.",
    "date": "2022-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I didn't know much about SpaceX prior to seeing this film. It was really inspiring to see such a talented group of scientists and engineers get the USA back in the space game so to speak. Such a monumental task called for technological breakthroughs that were not inevitable. Very well done and informative film.",
    "date": "2022-05-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Documentaries aren't really my thing, but I still ended up enjoying this one. \"Return to Space\" does suffer from the poor acting that documentary films usually bare, however, it does also give a pretty good insight on the life of Elon Musk and what can be expected in years to come. Overall, I liked it: wasn't great, but wasn't awful either.",
    "date": "2022-05-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Of course, the bad ratings are not on the actual film itself, but rather on Elon Musk. Seems unfortunate as it is really captivating and amazing!",
    "date": "2022-05-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Netflix's SpaceX documentary Return to Space is a work of love and hope and wonder – at least when it's not stroking the fevering dreams of Elon Musk.  Here is a documentary for and about one of the wealthiest men in the world, a man whose dreams of returning to space dance in his eyes as he talks about things that most of us deem impossible: returning to the moon, colonies on Mars, etc.  I admire it for that.  I admire directors Elizabeth Chai Vasarhelyi and Jimmy Chin, who won the Best Documentary Feature Oscar two years ago for Free Solo, for keeping things on a hopeful note.\n\nThat's kind of the spirit that keeps the dream of space exploration alive; the future, after all, belongs to the dreamers and to the foolhardy.  It is also a little bit vain and silly to think of reigniting the space program at a moment of crisis on our planet: racial problems, a global pandemic, a brutal war in the Ukraine and, here at home, a childish nightmare circus of political in-fighting.  Can anyone really afford to do this?\n\nThe bigger question posed by Return to Space is, can we afford not to?  Earth may be the cradle of mankind but we haven't moved very far outside the cradle and if it takes a starry-eye dreamer like Elon Musk to get things moving, then so be it.\n\nThe film chronicles the launch of Demo-2 in 2020 with the mission of transporting astronauts from American soil to the International Space Station for the first time in nearly a decade.  Leading up to it are the massive complications, failures and concerns that kept things from moving forward.  Always at the center is Musk's dream and the mission's primary number one concern: getting a crew into space and returning them safely to the Earth.  Those concerns come to us with heartbreaking reminders of Challenger in 1986 and Columbia in 2003, lessons learned the hard way from the people working for SpaceX.  Musk's involvement comes to us through constant reminders of how America has pulled away from the space program due to budget concerns and also general public indifference.\n\nOne element that Musk is able to provide is money, something that is just no longer feasible for the government to handle (and to which this year's documentary Summer of Soul pointed out, is crazy given the level of poverty still present in the American landscape).  Musk established SpaceX in 2002 in order to get a better handle by reducing the cost of space travel.  We learn, alarmingly, that America has spent $350 billion on space travel since 1969 and that there have been 350 people that we have sent into space, meaning that space travel has cost about a billion a person.  That's part of reason that the space shuttle program was shut down in July 2011 and its part of the issue that Musk wants to correct, by making space travel and space exploration more affordable.  It sounds crazy, but then so does space exploration itself.\n\nThe team's massive idea is to do away with the old method of having a disposable rocket that detaches and then burns up in the atmosphere.  The new design would be more like Star Wars, in which the rocket could be reused and return to Earth using grid fins.  As insane as that sounds, it makes sense when it you see it.  And it becomes all the more real when you see test after test fail as they struggle to get it right.  Yet, no matter how many times things fail, Musk always holds fast to the idea that it can work.  He is hopeful and that's what keeps things going.  That's what makes the joy of the success of Demo-2 all the sweeter.  \n\n \nAnd of course, hovering over this whole enterprise is the question of the necessity of space exploration itself.  Vasarhelyi and Jimmy Chin want to keep things hopeful and forward-thinking, so the question of whether or not these resources aren't better spent elsewhere are never addressed.  Here we are in the third decade of the twenty-first century and mankind is still killing one another, still maintaining wealth for some and poverty for others, still struggling to find ways for us to understand each other.  Where, you may ask, does space exploration fit into all of that?  Should our attention be focused elsewhere?  Is now the right time?  Ah!  Therein lies another question.  If not now, when?  Can we wait until the world's problems have subsided before we look to the stars?  I don't think so.  I think Musk is looking for mankind to discover that it can be better than it knows it can be.",
    "date": "2022-04-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Really well made... It's kind of a dramatized documentary (so I don't know if the word documentary is correct for it... since it's mixed like a feature movie)... but more of an inspirational movie... great for kids to watch",
    "date": "2022-04-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is an absolutely incredible documentary. Ignore the low reviews, those are just people who don't like Elon and who haven't seen the documentary spamming low reviews because they cant understand the wonder of SpaceX and the hope for the future. If they actually watched the documentary with an open mind and a decent understanding of spaceflight, maybe they would act differently. This documentary perfectly encapsulates and displays the miracle of SpaceX, the struggle behind their successes, and the humans that work day and night to keep the American space program running and at the top of the world. A must watch for space fans and the everyday person alike.",
    "date": "2022-04-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Clearly all the Russians bots are hating this movie.  That and a few other politically ideologues. \n\nThis is really a great documentary about the recent history of space flight, and some of the behind the scenes events that got us here...\n\nThe hillarious part is the critic from some reviews that this is just 'Elon Promotional Material', is from people who all don't get engineering, or space flight, any anything that isn't a political motivated agenda.  The reason this comes across so positive about Elon is just how revolutionary his work has been, and if you don't understand engineering you might just right it off as promotional overselling, but this documentary undersells if anything what Elon has accomplished, both through his leadership of a team of super brilliant people who he inspired, and himself technically and through force of will.\nAll the people attacking him, not one of them would sacrifice their car, let alone their house, or even more so, their entire netwealth to achieve a goal for humanity. These are all people who themselves pretend to be above money, but are all wealth people who you can bet would never sacrifice that for any of their 'ideals'.  Elon in the 4th attempt at launching a rocket, was also dealing with Tesla also going bankrupt.  His entire family, his accountants, his best friends, all told him to sell both companies and keep the remaining portion of the money he got selling paypal.  But instead Elon risked his entire fortune, all of it, nearly 300 million dollars in total over the years he invested in both companies, and he was down to his last something like 40-50 million, the amount that could only keep space X alive for one more launch, and only a few months keeping Tesla's doors open. Most people in the world would have walked away with the money he had left, Elon because he believed in these projects for humanity, Tesla because he believes Climate Change could utterly wreck the planet, and society, and Space X because he believes this may be the only window in humanities future where we can develop and start a colony on another planet, and if we don't do it now, we never ultimately sealing humanities fate to be that the next big asteroid that hits the Earth will end all human existence. And given that could be in 1 year, or 1000, but it is guaranteed to happen, that is how Elon sees it and has talked about before.  So to him, it was that frame which he made this decision in.  And because of the importance he saw with both endevours, he risked his entire fortune. An amount of money that could have let him enjoy life to the max , buy some island somewhere, giant yacht, huge lifestyle, etc. He gave that up, and risked even being able to put a home above his kids heads. And luckily Space X succeeded, on it's fourth and what would have been final launch if it had failed, and Tesla, managed to pull a miracle and get a EV car engine in a Mercedes Smart car in one weekend, and prove that their engine could work in those cars, impressing a meeting Mercedes was only doing as a favor, so much they invested 50 or so million into Tesla helping put ev engines into their cars, and that got Tesla enough to keep going until they got a loan at the same time GM, and FORD did, except they got about 1/1000th of the size of a loan, and they paid back all of it, unlike GM who never paid back theirs, despite GE execs giving themselves bonuses, just like Wallstreet did with their bailout, money, and FORD was still paying it back last I heard last year.  So Elon is someone who people who attack him just can't relate to, because he actually believes in his principles he espouses, unlike his critics who do so for money, and their own personal wealth.  So when Elon does something they project their own issues onto it, like \"he is just promoting himself', because they don't understand he really honestly believes in these goals, and it is that drive that revolutionized space flight, so it comes across as promotional, because of how big a deal Elon is in that industry, and what Space X and their team there has accomplished, but it isn't because they set out to promote Elon, if they did that, there is far far more they didn't go into, that would make Elon look even better.  But people who refuse to see, and close their eyes to it, won't even see it..",
    "date": "2022-04-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I felt this film captured the gravity of SpaceX's historic 2020 launch and more importantly Chai and Jimmy did a good job of humanizing Elon.",
    "date": "2022-04-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "To all the engineers and 'doers' of spacex - Congratulations.  Where is the mention of God - who Created this blue marble?  To the financiers of spacex - hope you enjoy the show.  The progression into space is interesting but keep this perspective:  in 1969 USA successfully went to Moon and returned with its current technology.  Over 50 years later spacex goes to space station and replaces batteries.  This is only the beginning is an understatement.  To all the 'doers' - the mathematicians, the engineers, the 'doers' - goes the Congratulations.",
    "date": "2022-04-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Awesome documentary.\nThe hard work of Elon and entire spaceX team  is pretty incredible.",
    "date": "2022-04-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Incredible film. I only wish it was longer. hopefully this story is just getting started",
    "date": "2022-04-07"
  }
]