[
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "A movie that for teenage viewers will love. Very old jokes and old story line!",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Good and a real funny movie",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's the kind of movie that you're not in a hurry to see. Only when you can't think of what else to watch, and it just happens to be on your DVR. One time watch is good.",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It had a good start and end, but the middle was horribly dull. The plot was lost and they kept repeating the same gags over and over again, like they are trying to pad the movie so it can be 90 minutes long. It would have been a decent watch if it was 60 minutes.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I’m sure Seth and his mates had fun making this but it’s a bit self indulgent. All the in jokes and laughing at yourself, if overdone just comes across as conceited. It’s almost ironic but that’s how it comes across. The general plot, which is weak gets lost amongst the overplayed self deprecation. Kinda just boring and not particularly funny in the end. The Emma Watson scene made me laugh though. Watched on Amazon Prime.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "If you’re a fan of this group of comedians then this movie is gold.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Hilariously raunchy comedy filled with a MORE than star-studded cast!",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I can't comprehend how people can find this movie any good at all, let alone >80% positive. It's absolutely unrivalled and matchless in its stupidity and its blatant, literally \"in your face\" raunchy toilet humor. It is so lowbrow, mindless and stupid that every single minute of this movie hurts watching if you have more than a single working brain cell. The only half comprehensible positive aspect is that you can see how much fun some of the actors had creating this piece of junk. \n\nCall it art if you like. I call it a total waste of time and resources.",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The last time I watched this, I was smoking a spliff in a park and watching it on my iPhone during a college free period. Either way, this is still really fun—a whole lot of fun from start to finish. The casting is insanely good. I absolutely love Danny McBride, and that end sequence still, to this day, the best. Definitely recommended!",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Filme foda, o roteiro é foda, as cenas são fodas, a história é legal pra caralho, o elenco é foda, e a maioria ajuda a melhorar o filme, os personagens são fodas por que são eles mesmos, e cada cena louca atrás da outra, teve o encontro do tres personagens principais do Superbad, sangue, morte, escravidão de atores famosos, e muita outras coisas, com tudo isso, eu recomendo muito esse filme vale muito a pena assistir.",
    "date": "2025-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "THIS IS THE END has some great self-deprecating celebrity gags early on—most of which you'll see in the trailer—which makes for an engaging opening. Things then swiftly devolve into a frat house at the end of time, with dudes yelling insult jokes at one another. The commitment to the bit (that this the actual apocalypse) elevates the effort, but it really feels like the actors may be having way more fun than the viewers. It's probably comedy gold for young men of a certain age, but not otherwise.",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This will forever be my sequel to Pineapple Express.",
    "date": "2025-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Really funny. Danny McBride in this is my favorite.",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was frickin awesome. A bunch of A Lister's taking the piss of the Hollywood scene and themselves, while truly making me laugh the whole time. It seems like these fellas really enjoyed making this film and were able to have creative control. Special effects were awesome. \nThere's a great message for us all in the end scenes. Thanks for the laughs! Needed it.",
    "date": "2025-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This movie as alright, for a once time watch, the Jew squad, lol...",
    "date": "2025-06-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is so entertaining and funny. It has such a good plot and setting. It also has a very funny ending.",
    "date": "2025-05-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A charming and backhandedly clever satirical take of modern day celebrities. Also some surprisingly sharp directing at times.",
    "date": "2025-04-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Saw this movie recently for the first time and loved it. One of the best casts ever assembled for a comedy and the chemistry between everyone is great.",
    "date": "2025-04-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It wanted to be this generations Mars attacks but it lacks the charm.",
    "date": "2025-03-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Far too self-aware to be funny.",
    "date": "2025-03-19"
  }
]