[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A atriz principal tem potencial se estudar mais. Além de ser muito bonita. Fora isso, o roteiro tem um conceito interessante mas com uma profundidade de um pires. Os personagens rasos e burros fazem querer que morram logo. Primeiro temos um pouco de publicidade da praia local, depois clichês do homem mal e muitos clichês sobre como tudo é feito porcamente. Pulando muitas partes temos um momento que o homem mal pensa que a mocinha quase morta quer transar com ele ?! Melhor parte? O trabalho da guarda costeira. Ah temos também uma participação bem especial de 2 cenas do pai se importando, rsrs",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I didn't think it was that bad.. definitely not one of my favorites and not going to be very memorable, but not a terrible way to spend a Sunday afternoon. I will say that they teased some scenes out a little bit too long, and I'm not crazy about all the body shots that the camera person was doing over the main character who supposed to be a teenager, but the movie was interesting enough to hold my interest for most of it. Kind of a different concept.",
    "date": "2025-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I thought this was a good movie.  It is very suspenseful.",
    "date": "2025-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This 'film' is utterly ridiculous. I haven't seen a movie this bad for a long time. Everything about it is terrible. Please save your time and energy and go do something interesting or exciting, anything apart from watch this utter tripe.",
    "date": "2025-04-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Película de suspenso bastante regular. De bajo presupuesto y con ritmo lento pero cumplidora. Nunca es la gran cosa pero se desarrolla bastante bien, aunque los últimos 5 minutos me parecieron decepcionantes.",
    "date": "2025-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "okay, not too bad. A bit slow but a decent payoff.",
    "date": "2025-04-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Other than the lead none of them can act  just came off as cheap.",
    "date": "2025-03-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I expected less. Overall well executed and actually believable. They pushed the ultra ultra long suspense button. That’s a tight balance.  Enough and there is tension and too much you start to say enough. (Aka the beacon in the water scene or the shooting the spear gun). I liked all the actors and quite a handsome villain.  You almost felt sexual tension at the same time you felt horror.  Well done.",
    "date": "2025-02-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It is a low budget movie that is not particularly bad but not good either. It is a whole lot of boring. It tries to build tension but it really does not work. I cannot recommend spending time with this one.",
    "date": "2025-01-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Poor acting, incoherent plot, and inconsistent scenes make this film a frustrating and confusing .",
    "date": "2025-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Horrid acting. Shallow characters. Even worse ending. \n\nOddly enough the story would have been a great concept (similar to Traffik with Paula Patton) but it's like the writers did everything in their power to NOT flesh out this story. \n\nIt was definitely a waste of time lol. Set sails away!",
    "date": "2024-12-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "In my 30 years of living, I’ve never paused a movie halfway through just to express my absolute disdain for it—but here we are. This entire movie can be summed up as 100% just showing one character’s body from different angles. That’s it.\n\nThe plot? I get it… I think. But does the plot even realize it’s supposed to be a plot? I’m 44 minutes in, yet it feels like I’ve been watching this for hours. I’m genuinely confused about what’s happening.\n\n0/10. Would not recommend. Good night.",
    "date": "2024-12-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "SPOILER:\n\nWhere do I start, great concept. AWFUL execution! The tan guy’s lines and acting was awful and corny, the main characters best friend was in agonizing pain in one scene then squirming around painlessly the next. \n\nTowards the end it only got worse, the girl was stabbed with a quarter of a pocket knife and it leaves her immobile? Then from the second deck of the boat, throwing a square plastic device onto a wet plastic boat edge, there is ABSOLUTELY NO WAY it sticks to the edge of the boat from that trajectory, I don’t even think if you dropped it from 3ft straight down it was stuck to the edge like it did. \n\nFinally, with the girls stab wound, bleeding stopped itself, she’s checked for a pulse, she has one, checked again less than 10sec later, it’s still there. Then suddenly with no blood loss she loses her pulse when she’s gets in the helicopter? \n\nI’m all for some unrealism in movies but this movie was a hard watch and left me cringing with the how poorly is was made, unfortunate, I think it had really good potential.",
    "date": "2024-12-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Both boring and gruesome. Needs to be fast-forwarded to pick up the pace. Skimpily shot and fractured directing.",
    "date": "2024-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Top 10 Films on Netflix in September.  If you're into horror and gore, keep looking. But if you want a gripping film about humanity’s dark side and the will to survive, you’re in for a ride! It’s tense, suspenseful, and hits close to home with its realistic take on what goes on in the world. The young cast is fantastic, and the direction is spot-on.",
    "date": "2024-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Perda de tempo. Filme realmente fraco e triste de assistir.",
    "date": "2024-09-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Really bad acting, some things simply does not make sense, it was a waste of time",
    "date": "2024-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "please just spend extra month or 2 to walk through the script , does it make any sense that people do this or that under situation a or b ?",
    "date": "2024-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Characters do too many dumb things and other events in movie are to typical.",
    "date": "2024-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A weekend movie for chilling at home, enjoyable.",
    "date": "2024-07-30"
  }
]