[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie deserves so much more love. The songs are so catchy, the actors are great.  It's so much fun, it's like high school musical,  night of the living dead and a sweet Christmas movie all rolled into one.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "If you thought Cop Rock was one of the worst television shows of all time, you're REALLY gonna hate this movie! A Christmas movie about self-absorbed high school kids, breaking into song and dancing their way through battling zombies? Well, I still thought it was WAY better and more realistic than Glee and on that TV show. they were actually supposed to sing! The catchy tunes, great harmonies, and elaborate dance moves elevated this movie to a guilty pleasure for me. Sorry, not sorry.",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Anna and the Apocalypse (2017)\nUnbearable Movie\n(11,641 - 24 Apr 2025 - by Claudio Carvalho)\nAlthough being a prolific viewer, horror is one of my favorite genres, especially zombies and vampires’ movies. Therefore, I had great expectations regarding “Anna and the Apocalypse” based on its rating. Unfortunately, director John McPhail made an unbearable movie with the combination of musical and horror. But nothing comparable to the cult “The Rocky Horror Picture Show” (1975). “Anna and the Apocalypse” (2017) is annoying since the very beginning, with a poor story and awful songs. Despite the good teen cast, this film is intolerable. My vote is two.\nTitle (Brazil): “Anna e o Apocalipse” (“Anna and the Apocalypse”)\nMy Blog: https://maniacosporfilme.wordpress.com/",
    "date": "2025-04-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Embarrassingly bad.",
    "date": "2025-04-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Strange mix of genres... A christmas-zombie-high school musical",
    "date": "2025-01-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is FANTASTIC!\nThe story, music, choreography and acting is perfection. More people need to see this gem.\nAnd I just got the soundtrack on vinyl...100%",
    "date": "2025-01-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Twenty minutes into this movie, I paused it and yelled to my husband \"why isn't this the most popular movie in the world!? This is amazing!\"\n\nFunny, smart, heartfelt, can't wait to sing along the next time I watch it.",
    "date": "2025-01-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "BEST CHRISTMAS MOVIE EVER!",
    "date": "2024-12-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Brilliant! Simply brilliant. Ella Hunt as Anna Shepherd was a fantastic role! She killed it. The songs were magnificent!",
    "date": "2024-06-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Anna and the Apocalypse It's an enjoyable ride, but sadly, it doesn't excel in anything it proposes. As a musical, the songs are fine, just fine; they are not memorable or very catchy for more than a second. What is worse is that the lyrics are not very connected to the story, and sometimes the songs last too much. It is pretty clear that it didn't need to be a musical. As a zombie movie, it doesn't innovate in any way, quite the opposite, it's formulistic, and some of the turns don't make that much sense. Finally, as a comedy, it doesn't have much merit either.\n\nIn conclusion, I say it again: It's fine, no more, no less. For me, a solid 6.",
    "date": "2024-04-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely FANTASTIC!!! A seasonal film that fits any time of year as well. A must see and repeat watch.",
    "date": "2024-03-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I liked movie. I don't usually enjoy musicals but it made for a fun campy comedy. It provided some good laughs. I would recommend it to the kind of person that enjoys movies with a dark side and doesn't take movies too seriously.",
    "date": "2023-12-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I just love the musical.  Need something refreshing this is it.  Laughed all the way through.",
    "date": "2023-12-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Christmas-meets-zombie-meets musical flick Like really how many movies have that combination? What does a girl do during the apocalypse? Anna is an English girl who has her father but her mother is dead She wants to travel before college but her father feels it's a waste of time It's the holiday season and unbeknownst to everyone a viral strain is spreading across the world turning everyone into zombies It takes 30 minutes for the actual zombies to start taking over and they probably could've dialed back on the songs A big underwhelming but delivers on the gore and the zombies running amok You never expect to see carnage like this on Christmas itself",
    "date": "2023-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Really good song/zombie movie and I especially love the Sarah character in the movie",
    "date": "2023-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "“BOOM! Saved your life!” 💓👩‍❤️‍💋‍👩🌈",
    "date": "2023-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I imagine the elevator pitch to get this movie made was \"What if Shaun of the Dead... was a Musical?\" And here we are. Take multiple movie genres and subgenres (horror, musical, high school, rom-com...) mix in a blender and see what you get. Often it's a muddied mess as movies can conflict within themselves and try to be too funny or too serious and the pendulum swings back and forth all movie long. I don't believe Anna had that issue as it kept me entertained from the get go. \nAs a musical, the numbers were well staged and worked with the story. The comedy wasn't forced. The blood and gore flowed in often comedic tones keeping most of the movie light. But it is a zombie movie, and you know you're going to lose certain characters along the way. Where Anna and the Apocalypse succeeded, is they put a lot of emphasis on character way before the apocalypse happens.\nSo unlike a lot of horror films where characters x, y, and z are doomed from the beginning and you are expecting it and move on to the next scene...\nWell there's a lot more emotional loss for the characters left behind and the viewing audience as well than you normally see. Bravo to the story and the actors for pulling that off. Well worth a watch if you get a chance.",
    "date": "2023-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "xmas zombie musical!? it's awesome and i don't like musicals.",
    "date": "2023-10-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love it!  I find myself humming the tunes at work, it's so good.  \n\"I need a human voice\" gets me every time.    Enjoy it and don't take it seriously.  It's fun.",
    "date": "2023-02-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I don't think a zombie musical is entertaining.",
    "date": "2023-01-26"
  }
]