[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Absolutely bad movie night",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Despite it's classic tropes and campiness. The movie is good for what it is. Not the worst but not the best.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I loved it! I am not sure why it doesn't get any love from the critics. It is fun and funny and I hope they make a sequel!",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This is the kind of switch off, lay back and let the fun happen type movie. It’s a simple enough story with some great acting as well as some pretty lame jokes. Not a blockbuster but definitely a lighthearted action comedy",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Perfect movie to watch with family. Good action, great character development, and even though is typical storyline still gets to a satisfactory ending. Hoping for a sequel!",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "So happy to see Cameron again! The movie however was very safe, somewhat funny, it's good for a family watch with kids.\nJamie & Cameron are playing as spies that retired and decided to build a family and completely change their lives by cutting off their connections with CIA, that thought that they died during the last mission. But one day they got uncovered and that's when the trouble just knocked on their door. They went back in action and forcibly told their kids about their past that they sacrificed for raising them.",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Forget the boring critics, this movie was great! Enjoyed every minute, they better make more!!!!!",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "My goodness this was dire. I wasn't expecting Fight Club, or The French Connection, but a silly piece of action fluff to pass an evening. What I got was painful to watch. Credit where it's due, I guess it takes a special level of craftsmanship to make this many bike, boat and car chases, and shoot outs boring but they did a great job of achieving that. The script was bad fan fiction of one of Arnie's lesser movies. Throw in a comic relief character who was as funny as a piece of broken glass in your shoe, and we couldn't finish it. Do your self a favour. Don't.",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Otra entrega de ex espías con familia que tienen que volver a la accion para el disfrute del publico en el streaming de turno, en este caso con Jamie Foxx y Cameron Diaz. Rendidora, tiene buen ritmo y aunque la historia ya se hizo varias veces cumple. Falla mucho en el humor, por momentos es muy bobo e inocente. La escenas de peleas y persecuciones es lo mejorcito que ofrece (y menos mal porque es lo que uno busca ver).",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Back in Action had me hooked from start to finish! It’s the perfect mix of action, crime, and laugh-out-loud comedy. The spy storyline kept things exciting, and the humor made it so much fun to watch. Nigel was one of my absolute favorite characters—he brought so much personality to every scene. This is definitely a movie my family and I will be watching on repeat!",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It was a great action movie",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "To me it was amazing! Comedy and action mix-up. Laughter and chemistry of the actors. Please watch for your self😊",
    "date": "2025-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is fantastic! See it for yourself, don't let critics keep you from it.",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This so wanted to be good but it just wasn’t. Bad action and really predictable.",
    "date": "2025-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best family oriented action slapstick humor I have seen in so long. Get Smart spy action and Andy Griffith wholesomeness. Must see with the family. Hope they make more like this.",
    "date": "2025-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Diaz and Fox have amazing chemistry! As a parent watching this moving I could not stop laughing 😂 definitely recommend for the action as well. Seriously, the the best flick I’ve seen in a while. None of the pointless drama. All fun and good acting. Cameron Diaz coming out of retirement was a delight.",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie!  Critics are so wrong!",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I have watched this movie twice since it has been released. It very much so gives ‘Spy’ (Melissa McCarthy) vibes as well as ‘The Family Plan’ (Mark Wahlberg). Getting the return of Diaz and Foxx separately was so thrilling, let alone the return of them together. Their chemistry in this picture was nothing short of comedic and genuine excitement. I’m not too sure why some audiences do not have a liking toward this genre of film anymore, as this style is the epitome of what the peak of Action Comedy was and is. \n\nIt is not meant to be a film where you are strictly given gruesome action scenes, rather it is to give a sense of thrill and wonder paired with a light hearted smile (which it did so very well). I enjoyed every moment of this picture, and would recommend to any group of people, including family audiences.",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I love action movies of all kinds but this has a lot moments where I felt embarrassed to be watching it. I turned it off near the end - no point in finishing it.",
    "date": "2025-08-12"
  }
]