[
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "It's really a great movie, but I just don't like it enough. If u r an action lover I don't recommend this movie to you.",
    "date": "2025-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It's a good movie to watch, but it's lacking and very one sided sorry telling.",
    "date": "2025-06-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Doesn't quite hit the spot. This true story deserved a better telling.",
    "date": "2024-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Well.. its a worth to watch. Definitely a big yes for it. U can experience many emotions while watching it. It also reveals one part of the world that is unknown to most of us.",
    "date": "2024-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It's a very good movie, and worthwhile to watch. I was skeptical for a while, but it grew on me. It's a great feel-good story. The acting and direction are good. It's believable because it's true. They didn't overdramatize or sensationalize the story. Two thumbs up!",
    "date": "2024-05-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Estou assistindo alternadamente dois filmes baseados em fatos reais sobre três nadadores excepcionais e especiais, \"As Nadadoras\" e \"Nayd\" e completamente encantada e apaixonada por ambos, impossível escolher melhor... Todas elas desafiaram a morte e seus próprios limites, e as irmãs Martini São heroínas porque fizeram isso em prol de outras vidas crianças homens e mulheres, puro altruísmo... Como não amá-las, respeitá-las e exaltá-las… Trilha sonora \"Firework\". Dolorido...\n\nYusra atualmente estuda cinema na University of Southern California, continuou nadando e foi para Toqui 2020, além de ser Embaixadora da boa vontade da ACNUR. Enquanto Sarah, abandonou a carreira esportiva logo que escapou da Síria, em 2018 foi presa por 100 dias na Grécia e segue ativa na defesa dos refugiados vivendo na Europa.",
    "date": "2024-04-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I really appreciated how the movie went from light hearted to heavy handed and vice versa. It kept me on my toes not getting overwhelmed with one style or aspect. The story inspires anyone showing not even war can stop one's dream, in this case a young girls dream to compete in the Olympics.",
    "date": "2024-02-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I really enjoyed this movie.  It hit all the right notes to keep me captivated this this story.  The director does a great job of showcasing this journey.  Felt inspired afterwards.",
    "date": "2023-12-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Fantastic, heartbreaking, and inspirational story.",
    "date": "2023-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Beautiful film, uplifting and so sympathetic to the millions of refugees in the world. The 2 main characters are well developed, including and especially their relationship with each other and to their family. Most of the really horrible stuff these people are fleeing from is only touched on, with more focus on the positive - but still, you get a clear sense of what people are up against when forced to abandon their homes and generally not welcomed in the rest of the world.",
    "date": "2023-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The Netflix teaser showed a scene that doesn't happen until two thirds of the way into the movie. That didn't make those two thirds any less harrowing. The characters half a world away both geographically and culturally are so human and relatable, I felt genuine dread, horror, and heartache for them. The titular Swimmers are real life Syrian sisters - 17 year old Yusra (Nathalie Issa), a driven and ambitious Olympic hopeful, and Sarah (Manal Issa), who is few years older and more interested in partying. They have a younger sister. And a pet bird. When the war starts, they try to carry on. There is a symbolic scene in which the sisters are dancing at a rooftop club. To Titanium. Rockets are falling in the distance. The loud music drowns out the sound of explosions, literally and figuratively. But the war catches up to them. The swimming complex gets hit. People they know are dying. Or going to Europe. The parents make an agonizing decision to let the girls go. With two conditions - they get their male cousin to go with them and they take a land route. The cousin comes, but the land route is quickly dismissed as impractical. \n\nThere are a lot of artsy shots in the film. But the most powerful ones are simple. Lifejackets sold everywhere at the place in Istanbul \"where the Syrians meet\". People quickly counting their borrowed money and handing it to the smugglers, who disappear with no guarantee that they will come back. The promised \"boat\" carried down to the shore - small and folded. The patches on it. And the sun sinking into the sea as the motor is dead, there's water in the boat and no land in sight. \n\nThe girls' journey could have easily looked like reenactment of various news stories from that time. But somehow the filmmakers managed to make it so much more. I felt like I was there, with those people, every step of the way. Unfortunately, that is lost in the last part of the film, after the scene that was in the teaser, and the movie becomes flat and kind of forced. \n\nI don't want to say that it's an important film, but it is. And I am glad it's most important part is as well made as it is.",
    "date": "2023-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Powerful, inspirational, and undoubtedly an eye-opener, The Swimmers deserves all the buzz it generated at last year's award season and more. Director Sally El Hosaini captures the strife of the immigrant experience through a poignant story about two sisters in this biopic that goes straight to the heart with its outstanding performances, beautiful cinematography, and well-written script. Every moment felt real, which made it effortless to resonate with the characters and feel their emotions. It's not easy to describe how watching this movie made me feel, but it definitely put things into perspective and left me speechless in awe and passion.",
    "date": "2023-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It's an afternoon sort of film. Interesting characters. Shows the struggles without being overly dramatic or sentimental.",
    "date": "2023-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A tremendous Road-Trip style movie that follows two daring sisters from Syria and their courage and bravery through thick and thin in being able to get to Geenany to pursue their joint dream of competing in the Olympics in Brazil. There are parts that lag a bit that could have been more tightly edited for the benefit of continuity speed, but generally speaking its a tip-notch film that us both inspiring and endearing. At the end of the day people are just people, we all want a better life, more options, choices and opportunities, so its a film everybody can relate to, on s very human level. Highly recommended, and its worth viewing twice or more with some time between each viewing. 🤓",
    "date": "2023-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The Swimmers is an amazing story - one of just millions of stories - that will make you feel sad about the refugee situation in the world right now. It humanises the millions that you just see as numbers on the news. Not a groundbreaking film but a worthwhile story.",
    "date": "2023-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Interested in the swimming part. That's the title and focus of the trailer. But it's geopolitical finger-wagging immigration melodrama with unpleasant, ungrateful characters.",
    "date": "2023-06-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Good flick. Very compelling.",
    "date": "2023-05-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Thought provoking movie putting the plight of \"illegal immigrants\" in a different context.",
    "date": "2023-04-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A story about the desire for a better future and capitalizing on a dream, based on persistence and the desire to survive. Inspired by real events, the only thing it doesn't provoke is indifference.",
    "date": "2023-03-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Engaging and emotionally powerful",
    "date": "2023-03-12"
  }
]