[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "2024, and this is what we have come to. A vacuous documentary about a vacuous subject.",
    "date": "2024-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I am not sure what I was supposed to take away from this. Disjointed.",
    "date": "2024-05-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This was terrible documentary they didn’t really seem to know what direction they wanted to go in they touched on so many different things that really didn’t have anything specific to do with brandy \n\nI’m still not sure why a doc about fast fashion focused so much on one specific brand when there are significantly worse brands out these \n\nThis was a very disjointed doc very boring and had way to much going on well not really saying anything",
    "date": "2024-05-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Convoluted and disorganized and lacking focus. If you're trying to post a provocative message about overconsumption then the last thing you should do is hone in on one brand which is definitely not at the top of the list of offensive fast fashion (former advisor to Global Green, environmentally sensitive as actor in my wardrobe choices).. but this couldn't decide what it was and therefore serves no other purpose other than a catty attack on a brand. Abercrombie & Fitch did it much better because they stayed focused on the status of the brand... I disagree with many of the points specifically that it was problematic to have an image of teenage girls without makeup looking Bohemian and tossing hair playfully (That's what I was like when I was 15 and I would argue that this is actually a good representation of one stylistic sensibility and Brandy never pretended to cater to other styles).. The claim that sizing was only for tiny people is also wrong.. My boyfriend wears extra large found a sweatshirt in there and I found things for three different sized friends the very first time I went in there to shop. I was drawn in because it was made in Italy or that's what they said and that's the part of the documentary that has any value. This is poorly executed and irresponsible because it doesn't serve a pure narrative about one brand and their CEO nor does it make a compelling argument for over consumption as a standard way of living. The title itself comes across as petty I think they should have titled this made in Italy with a question mark because then I could expect real investigative documentarianism instead of whatever this bizarre scatterbrained mess is.",
    "date": "2024-04-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thought this was really interesting! People need to be talking about the harm of fast fashion, this documentary heights it.",
    "date": "2024-04-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It just wasn't good. Very incomplete with not many interviews besides teenage girls. It was actually very boring and really nothing people couldn't have guessed from a company who markets their clothes \"as one size fits most\" . They hired skinny pretty girls, didn't want bigger girls wearing their brand. That's the gist!",
    "date": "2024-04-14"
  }
]