[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A+ ✨❤️‍🔥🫶🏽🏆🫶🏽❤️‍🔥✨",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It's a fairly good watch on it's own, but it loses some of the original's touch due to topsy-turvy Hollywood treatment.",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "low key wanna slip it inside lorax fr fr",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved this film not just because of the great story line and the amusing characters but because of how enjoyable this movie is i could rewatch it 100x without getting bored . This movie shows the importance of the environment so well",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Some of the most important movies in life.\n\nI would often have concerns about movies depicting environment issues because soon, it may become too late for what they are talking about. But this, it goes down in history & is a timeless one, teaching you & encouraging you to take your first steps of doing a thing.\n\nThis is also an allegory of the economy vs the environment because the Onceler cut down all the Truffula trees which was a habitat for the animals there for his buggering business. The Onceler is no longer the antagonist due to his regrets later - which is what governments & companies who cannot get round to doing things for the environment should be feeling.\n\nYou know who I think the real hero is? Audrey (portrayed by Taylor Swift). She was the one who wanted to see a real tree & masking on her face how upset she is about what happened to the environment.\n\nBut, there a few nonsensical parts: how can those humans survive while they go outside despite the O'Hare products? What has the chemicalized water got to do with the not-so fresh air? Maybe it is the invisible pollution.\n\nThis should go down in history for its songs, loveable characters & memes more than the \"Despicable Me\" franchise.\n\nThe word UNLESS is a powerful one.\n\nIllumination actually did matter. Its mt favourite movie of theirs & my favourite environmental movie.",
    "date": "2025-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Ok story with peak songs.",
    "date": "2025-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Good and nostalgic movie, and it teaches a good lesson to younger children",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love this! I have for years. I think the animation is great, the songs are catchy, and the story is really fun. I am honestly so surprised by the bad reviews this got. I thought they really brought the characters to life in a fun way. I think a lot of bad reviews came from people having a preconceived notion based upon the actors who voiced the characters, which is a shame.",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "You don't know me but my name’s Sai\nI'm just the O'Hare delivery guy\nBut it seems like trees might be worth a try\nSo I say let it grow\nMy name is Dan\nand my name's Rose\nOur son Wesley kinda glows\nAnd that's not good so we suppose\nWe should let it grow\nLet it grow, let it grow\nYou can't reap what you don't sow\nPlant a seed inside the earth\nJust one way to know it's worth\nLet's celebrate the world's rebirth\nWe say let it grow\nMy name's Maria and I am three\nI would really like to see a tree\nLalalalala lalalee\nI say let it grow\nI'm granny Norma, I'm old and I got grey hair\nBut I remember when trees were everywhere\nAnd no one had to pay for air\nSo I say let it grow\nLet it grow, let it grow\nLike it did so long ago\nMaybe it's just one tiny seed\nBut it's all we really need\nIt's time to change the life we lead\nTime to let it grow\nMy name's O'Hare, I'm one of you\nI live here in Thneedville too\nThe things you say just might be true\nIt could be time to start anew\nAnd maybe change my point of view\nNah! I say let it die\nLet it die, let it die\nLet it shrivel up and ...\nCome one who's with me huh?\nNobody.\nYou greedy dirtbag!\nLet it grow, let it grow\nLet the love inside you show\nPlant a seed inside the earth\nJust one way to know it's worth\nLet's celebrate the world's rebirth\nWe say let it grow\nLet it grow, let it grow\nYou can't reap what you don't sow\nIt's just one tiny seed\nBut it's all we really need\nIt's time to banish all your greed\nImagine Thneedville flowered and treed\nLet this be our solemn creed\nWe say let it grow (in Thneedville)\nWe say let it grow (It’s a brand new dawn)\nWe say let it grow (in Thneedville)\nWe say let it grow (It’s a brand new dawn)",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Molto carino e originale",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "How baaaaad can I be? It’s not bad at all, it’s an enjoyable time",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "peak movie to watch",
    "date": "2025-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie was amazing. I loved how it included real-world elements hidden throughout the story—they didn’t hold back with their creativity, and it was thrown right in your face in the best way.",
    "date": "2025-06-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Es disfrutable %62🍅",
    "date": "2025-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1 hour and 26 minutes!!!!!!!!!!!!!!!! Rated PG for Brief Mild Language!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $213,900,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I think this is an amazing movie with its original take on what's happening in Theendvile because there is no trees, and it really shows that the once-ler isn't that bad he's just been push by captialism. But he does stink as a human being and should be rotting in jail.\n\n-The Lorax",
    "date": "2025-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I mean its worse than the grinch! I thought this movie was meh. It had a weak story and I hate that How baaaaaaaad  an I be has been stuck in my head ever since I watched this movie it was not that bad!",
    "date": "2025-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "3.5 stars that’s okay lorax",
    "date": "2025-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Gleefully swimming in Hollywood bombast while providing an exploration of Dr. Seuss's timely themes that is content to go skin-deep, The Lorax amounts to little more than a messy agglomeration of silly musical numbers, ironically consumerist messaging, and highly derivative characterization.",
    "date": "2025-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Ok movie. Good songs, goofy villain, a little boring though.",
    "date": "2025-05-09"
  }
]