[
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I love the cover. But when I watched it, the cover scene was only one small part. Literally rather than the cover, I hated this movie. Both during and after, I still don't know what triple 9 means, and I'm too lazy to even look it up. Had this movie been something completely different, it could have been awesome.",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Cryptocurrency Romance Scam Recovery Expert - Fast Swift Cyber Services Today\n\nIf you've been a victim of a romance cryptocurrency scam, you understand the pain and frustration of losing your money to fraudsters who prey on trust. Fast Swift Cyber Services are specialist who has earned a reputation for helping individuals recover funds lost in these scams. I had the unfortunate experience of being scammed by a fraudulent cryptocurrency investment scheme, and after months of feeling helpless, I reached out to Fast Swift Cyber Services for assistance.\n\nFast Swift Cyber Services kept me updated regularly, answering any questions I had and offering advice on how to avoid similar scams in the future. What impressed me most was their commitment and their ethical approach. They never made unrealistic promises or guarantees, but they worked tirelessly on my case, and after some time, I saw significant progress in recovering part of my lost funds.\n\nIf you find yourself in a similar situation, I highly recommend Fast Swift Cyber Services.\nFAST SWIFT CYBER SERVICES:\n\nWhatsApp : +1 812,,380..0994\nfastswift @ cyberservices . com\nWebsite : https://fastswiftcyberservices.com",
    "date": "2025-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Was für ein dämlicher Film. Reine Zeitverschwendung.",
    "date": "2025-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "What did ı just watch? So boring .",
    "date": "2025-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Bad. Acting, plot, entertainment. Just bad",
    "date": "2025-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Imagine you have one of the most amazing casts ever ensembled. And your writers are fantastic at writing scenes. But wouldnt know a plot if it hit them in the face. That's this movie. It has amazing scene after scene but it seems to have been plotted and put together by a 12 year old. Nearly everyone in this movie is .. flat out evil. How this director managed to get people to hand him the money to hire a cast like this is hard to fathom. It tries to steal the scenes/feeling from movies like Heat and Training day but the director/producers/writers arent remotely in that league. Not worth watching other than for the actors performances",
    "date": "2025-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Would’ve loved to see Norman Reedus’ character get more time but overall I can’t complain. It was a good movie. Heist movie mixed with dirty cops with a stellar cast. I can’t think of one weak actor/actress.",
    "date": "2025-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Good action but the plot drags out waaaay too long! And the actress doing the Russian accent was absolutely horrible!",
    "date": "2024-12-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Such an average film that wastes a stellar cast.  It seems as if the screenwriter gave up halfway through and just tacked on an anticlimactic ending.  It had potential and actually starts out well, but goes down the hill pretty fast after the first \"shocking\" kill.\n\nRating:  5.5/10",
    "date": "2024-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Great cast  carry this decent plot. \nThe characters are formula, though there are some good scenes.",
    "date": "2024-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This film tries hard to have a sense of urgency and tension, but honestly the plot is just wafer thin and theres not enough for the runtime. There are some good moments, but the film does waste a lot of the ensemble cast. Aaron Paul in particular doesn't get much to work with. Beyond that, Casey Affleck feels horribly miscast in his role. His performance nearly single handedly ruined this movie for me. Everyone else was pretty good, even if they didn't get much to work with.",
    "date": "2024-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A great cast, a good beginning, a semi-interesting plot.... But it doesn't quite take off. It gets stagnant for the most part, and with no real peak",
    "date": "2024-05-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I think it is too underrated. People these days are looking for something new, but most of the movies that they love and like are the same as some other movie. This movie honestly impressed me. Moderate performances, violence, incredible casting and a more or less original but entertaining plot. Highly recommended",
    "date": "2024-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A complete rubbish of a film.",
    "date": "2024-03-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Shades of The Departed, if set in Atlanta. Much better than most of the reviews here suggest. Like others I didn't quite believe Kate Winslet. But the other characters were solid, and the plot and pacing kept me on the edge of my seat.",
    "date": "2024-02-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "lots of action but i came here because it's hard for me to watch any character who chews like a pig, the actor who plays Chris, non-stop chewing in this movie so 1 star off for that",
    "date": "2023-12-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "\"Triple 9\" boasts a star-studded ensemble that should have made it an action classic, but alas, it falls short on several fronts. The cast is filled with A-listers, and the acting is undeniably top-notch. However, the movie's biggest problem is that it tries to juggle too many characters, leaving the audience struggling to connect the dots.\n\nThe plot is as thin as a supermodel's diet plan, making it hard to follow at times. You find yourself yearning for more action scenes and heists, but they are disappointingly sparse. The lack of emotional connection with the characters makes it difficult to invest in their fates. It's like watching a well-choreographed dance without caring about the dancers.\n\nIn the end, \"Triple 9\" feels like a missed opportunity. With its fantastic cast and potential for thrilling action, it could have been a knockout. Unfortunately, it delivers a few punches but fails to land the knockout blow.",
    "date": "2023-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I actually enjoyed the movie. It's one of my absolute favorites. The suspense sucked me right in.",
    "date": "2023-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "One of those movies where all the characters deserve to die.",
    "date": "2021-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A big cast and a well-made film squandered on a nonsensical story. What happen? No one bothered to read or rewrite that god awful script? Surprised it got green lighted.",
    "date": "2021-09-06"
  }
]