[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I saw this listed in the filmography of Natassia Malthe, and I wondered what it was about. So, I took a look at the synopsis and had to admit it looked interesting.\n\n18000 BC. A tribe of humans participates in a hunt that sees its chief’s son to prove the mettle of his worth. The son is a sweet young man, but in this savage world, a man must prove himself with his hands as much as his heart. It would appear that the son, in an act of foolishness, gets separated from the pack, but it is reliance on a canine that he refers to as Alpha that leads him home.\n\nThis was profoundly amazing. So much great acting over modest to most distinguished performers. I don’t know how else to describe this other than genius filmmaking. A well spent time.",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-09-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best movie I've seen in a long time. Loved it so much I watched a 2nd time before it goes off Netflix. Felt every emotion & got the meaning without understanding a single word. Highly, highly recommend. Action, Love, trust, honor, loyalty this movie has it all.",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie, big on discipline and patience. 10/10",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Good movie and I love the ending. And if I find the director, I going to dab him up",
    "date": "2025-06-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing movie and I liked the ending",
    "date": "2025-05-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Inicio prometedor, pero después es fallo de lógica tras fallo de lógica. :/\n\nQueda atrapado en un risco muy alto, lo abandona su tribu y después llueve tan duro que se hace un río debajo de el (hazme el dog favor jajajaja) su tribu decide abandonarlo alv y se hace amigo de un lobo que después se convierte en perro JAJAJAJA",
    "date": "2025-04-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Awesome movie my spouse and I enjoyed it immensely...",
    "date": "2025-04-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wow! The powerful dynamic of Man and Wolf! They didn't give up on each other. I absolutely love this movie 🍿. I was crying from Beginning to end. Mind-blowing, powerful, courageous, survival, loyalty, actions Speak louder than words, Trust, compassionate, Friendship, family, Spiritual, etc. Loved It!",
    "date": "2025-04-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Movie with no dialogue needs no dialogue to draw you in to a brave old world.  A very daring and bold cinematic offering.  It leaves no emotion untouched as the actors brought their A game camera performance.  Kodi Smit-McPhee makes you believe.  He is one to watch.  The wolf performace was also very above average.  I enjoyed watching and taking their journey.",
    "date": "2025-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Kodi Smit-McPhee stars in the movie \"Alpha,\" which presents a unique culture with its own distinct language. At first, the dialogue can be quite perplexing, as it often feels like the characters are communicating in a dog-like manner, using a dialect they've crafted themselves.\n\nHowever, the film is impressively directed, and once you start to grasp the underlying concepts, it becomes quite engaging. You can really see the emotions on the faces of both the parents and the children, which adds depth to their drama and action-packed journey, allowing viewers to connect with their powerful interactions.\n\nThe cinematography is exceptional, effectively immersing the audience in this vibrant world. The filmmakers did a remarkable job of bringing it to life, making you feel like you were part of the experience, whether you intended to be or not. You find yourself drawn in from the very beginning, captivated by the meticulous craftsmanship of the film.",
    "date": "2025-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "AT first frustrated with language ,not knowing what they are saying ,but emotions shown by father and mother were know by the heart of the situation. Love of the wolf and young was delightful to watch and the end of the movie.",
    "date": "2025-04-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "THIS IS A MOVIE ABOUT ME!!! IM THE ALPHA.",
    "date": "2025-04-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I enjoyed every scene of this movie. Gripping. Serious yet light. No overkill to impress. Loved the animals. Excellent acting by Kodi. Have a lot of respect for ancestors who had to go through all this to survive. A new appreciation for food and how easily we are able to access it today.",
    "date": "2025-04-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I don’t think you could find a bigger waste of time.",
    "date": "2025-04-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Almost shut it off several times. I'd be willing to bet that anyone rating this show 3 stars or better was raised in a city. Completely detached from reality; if you like caveman fantasy, well, I guess you're in for a treat. I am aghast with how well it is rated here. The acting was fine, but the writing... my goodness.",
    "date": "2025-03-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great, fun and sweet adventure movie. Great representation of a forming bond between an animal and human",
    "date": "2025-02-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Really enjoyed this adventure that depicted man's first interaction with wolves. If your a dog lover it's a must see",
    "date": "2024-12-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A pleasurable movie with familiar themes expressed in an original setting.  Such a nice, refreshing flick. Grabs your attention just seconds in and never let's go.",
    "date": "2024-12-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Truly awful. So many inaccuracies, and far too much of a modern interpretation.",
    "date": "2024-12-09"
  }
]