[
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "5 out of 10.",
    "date": "2025-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It was aight nah actually it was good, I like the plot how the minions leave and then how we get some gru lore and gru has a twin brother. This was definitely more interesting then just another random villain because there’s plot and lore.",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This film is not really that good. That's all I have to say.",
    "date": "2025-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This film was mediocre. Not that bad, but not good. It had some good plot parts - the 'romance' between Margo and Niko was very funny, as was the Lucy learning to be a parent part, or even Dru stealing lollipops. And Bratt was a pretty good 80s-themed villain. The music was great, too. However, all in all, the plot is bloated, and full of some not-so-good parts. I would recommend this film to people who don't mind there being multiple subplots, which I am not a fan of when it isn't done right.",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Despicable Me 3 is a curious entry in what is undeniably one of the most dynamic animated franchises of recent decades. Gru and the minions have become cultural icons, capturing audiences worldwide with their humor, quirks, and heartwarming arcs. The first two films established a formula that worked brilliantly — Gru’s transformation from villain to father, the girls’ charm, and, of course, the chaotic brilliance of the minions.\n\nUnfortunately, the third installment feels like a misstep in several ways. The story introduces Gru’s long-lost twin brother, a premise with obvious comedic potential, yet the execution falls flat. The narrative leans heavily into exposition and convoluted plot points, leaving many of the more genuinely funny or chaotic moments feeling diluted. While the concept of exploring family dynamics is commendable, it doesn’t carry the same magical rhythm established in the earlier films or even the minion spinoffs, which thrive on over-the-top antics.\n\nThe screenplay seems overly focused on Gru himself, which is understandable given his central role, but it does so at the expense of the minions — the true engine of the franchise’s popularity. The minions’ mischief, their slapstick humor, and their unpredictable energy are what consistently draw audiences, yet here, they feel secondary. The balance is off; the film attempts to juggle too many characters and subplots, ultimately leaving the minions’ chaos underutilized.\n\nPierre Coffin, co-director and voice of the minions, clearly worked to craft a story that he enjoyed, but it feels like the attention to franchise dynamics and audience expectations wasn’t fully prioritized. Steve Carell, Kristen Wiig, and the rest of the cast continue to deliver strong vocal performances, imbuing their characters with life, charm, and comedic timing. However, the script and focus simply don’t let the cast shine as fully as they could.\n\nAt its heart, Despicable Me 3 is a well-intentioned film with flashes of brilliance, but it lacks the punch, cohesion, and minion-driven energy that made the franchise a worldwide phenomenon. Even with strong performances and DreamWorks’ signature animation quality, it doesn’t quite reach the heights of its predecessors. For fans of Gru, it’s worth a watch, but for those hoping for minion-centric chaos and the pure joy that made the first films unforgettable, it’s a noticeable letdown.",
    "date": "2025-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "You don’t remember anything from this",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not very well done. Strange plots and the first two movies  are the best.",
    "date": "2025-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie was not the best. I don't remember much after watching it again compared to the others. Trey Parker didn't help their case and having two Grus didn't help either.",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best movie ever❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Purtroppo sbaglia in tutto quello che punta apparte risate e il personaggio antagonista.",
    "date": "2025-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It is good but I don't like the story of the movie.",
    "date": "2025-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Esse filme é divertido e interessante, mas menos divertido de se ver, comparado á outros",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It’s ok ummm that’s it",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This movie becomes a mess with multiple side stories and is a downgrade from the first two movies but this movie is still a watchable one",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Al principio la odiaba por ciertos aspectos pero me di cuenta que la juzgue mal primero que nada las canciones quedan bien, aunque el villano es medio medio porque aveces era chido y otras insoportable pero lo mas odioso diria las subtract que en esta empezaron a meter subtramas para rellenar la película a comparación de las primeras 2 películas las subtramas si aportaban algo en cambio en esta no tanto y aunque el hermano gemelo de gru era insoportable la trama estaba interesante y entretenida, siento que esta peli esta aguantable y tiene algo de escencia de las primeras 2",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Pretty major step down from the first two. The concept that was developed in the first 20 minutes was fine, but nothing special. But then like the next 40 minutes were just the characters hanging out, not doing much. Then the last 30 minutes ended up being the resolution from the plot at the beginning. The lack of minions to the main plot also didn't help much. Even the comedy wasn't as top notch as the last two. Sure I laughed a few times, but not as much as before. Even the antagonist wasn't as interesting. Any kid will still enjoy this, and I'd recommend to any young Despicable Me fan, but now that I can properly judge movies and point out issues, this one was full of them.",
    "date": "2025-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Me gusto mucho y le di un 79%🍅🫐,hay que mezclar los colores",
    "date": "2025-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "La historia me gustó, cumple con entretener aunque el villano no fue de mi agrado.",
    "date": "2025-06-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie was sort of a letdown for me. I don't know why but it just didn't hit as hard as any of the other despicable me movies! Plot was weak, villain meh, not good at all!",
    "date": "2025-06-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This was a great movie but after watching it I watched the new one and it was better then the third one because the third felt like gru being in the dark after firing him in the face and then the 4 came back to the screen to make it a better come back to give him the chance to be the evil man again some what a villain he is.\n\nRotten Tomatoes: 2/5",
    "date": "2025-06-10"
  }
]