[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I had to turn it off when she dry humps her kids toy in the kid's bedroom while they are sleeping. I used to think she was funny, but this was just gross.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I Smile Back is meant to make you irk at the pain of addiction, especially as a parent in a family. Silverman makes the viewer so uncomfortable, just like it was meant to be.",
    "date": "2023-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "No matter what the critics say this was all too real - for anyone who has been through exactly this.  The only difference is what some of us choose to do after walking out that door after all seems utterly hopeless.",
    "date": "2022-01-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Sarah Silverman's performance is raw and utterly convincing.  A dark, unflinching look at self destruction that will not be to everyone's taste.",
    "date": "2018-01-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A tough subject for a movie, but the cast was strong. Real life isn't always pretty and this makes it tough to enjoy this movie.",
    "date": "2017-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The inevitability of Laney's actions is compelling. And she would have circled back to drugs/ alcohol irrespective of lifestyle.  She suffers from bipolar disorder and with or without the lithium, her triggers make her reach out for more obliterating chemical support. She is destructive and she sickenly knows what she is doing. Pure desperation which she carries out again and again, quite callously, then the remorse, then the repeat.",
    "date": "2017-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Great performances pieced together poorly.",
    "date": "2017-05-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Curiosity got the better of me because of all the praise Sarah Silverman got for her role in this movie. It is deserved, maybe a little too much hype as it didn't really blow me away but she is definitely the reason to watch this movie.",
    "date": "2017-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Hoping for a rib-tickling hijinx escapade with razor sharp witticisms from Sarah Silverman? Not happening.\n\nInstead, \"I Smile Back\" slaps audience faces awake with a desperate housemom coke binge scene. Its realism is disconcerting, and quite shocking. Laney is living the dream: suburban home, steady income hubbie, a couple of cute replicants; what could go wrong? Laney goes wrong. Addictively wrong. Drugs and extramarital sex seem appropriate escape mechanisms from dullsville, but in Laney's case, there is something deeper and darker within, that fuels her self-destructive behaviour. She's smart enough to sneak her vices, for a while, but depression wins out in the end.\n\nStruggling with demons is especially hard when searching for reason where reason may not exist. People wanna help. Laney wants help. But they don't know how, and besides, life keeps interrupting. \"I Smile Back\" is an exercise in frustration, much like life itself. Silverman delivers an astounding performance, which covers various personalities (druggie, charming gal, selfless mom, slut, victim, drunk, bitch) with equal aplomb.\n\nIt's a tough transition from comedic icon to dramatic actor. Robin Williams almost made it. Steve Carell is there. And now, Sarah Silverman.\n\n- hipCRANK",
    "date": "2016-12-31"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "To start, I didn't much like this movie for reasons that would be ill-timed to mention and would most certainly send me into an uncontrollable rant. Let's just say that although the vision was clear, the foundation was rather set in quicksand instead of concrete, leaving me drowning under a wave of questions about the birthplace of Laney's demons. \n\nAnd then came the scene. \n\nTHE scene. \n\nYou know, the one where the heroine is on the floor, completely wasted, humping her child's stuffed animal while said child is sleeping at an arm's length away. \n\nNow, I'm not one for frivolous shocking, I don't like having my arm twisted into an open jaw just for the sake of it - but this... This was more than that. It went deeper than that. This wasn't a bored housewife lost in her own mental, suburban insignificance, trying to find self-worth in sex, drugs and the rolling rocks of her promiscuity. \n\nThis was a woman trying to fuck away a fucked up childhood, trying to reconnect with the girl within, fix her, plead with her for a clean slate, a do-over. \n\nThis was a woman with a name, a face, a past and a present, a story and a history. \n\nThis was Laney Brooks, flailing to keep afloat in the dark waters of a fading future, thrashing in the deep end with arms flapping frantically; while the world simply smiled at her and jovially waved back.",
    "date": "2016-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "One of the most depressing films I've seen in a long time. Otherwise, it had an overall mediocre plot, with lackluster dialogue and acting apart from Sarah Silverman. While I didn't like the movie and cannot recommend it, I thought Silverman performed extremely well. I'd love to see her in more dramas, preferably ones that occassionally let the audience breathe instead of being drowned by the unbearable sadness.",
    "date": "2016-12-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "the script lacks depth but Silverman's fantastic performance fills in the gaps",
    "date": "2016-12-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I enjoyed it, relatable to a point",
    "date": "2016-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Ehhhh....could have used about 30 more minutes.",
    "date": "2016-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "How should an ideal mother behave when she's haunted by her bad past.\n\nThe film is about a small family of two little kids and their parents, but all the focus was on the mother who is a drug addict and struggling with mental illness, yet care a lot for her children. But how long this happy family stays that way is the film going to reveal in its entire narration.\n\nBased on the book of the same name, half a million budget film, has a decent cast who have given their best for it. This is not a film you watch to enjoy, but a film about the families around us. This is a depiction of the real world story, like not all the families are happier as we see them from the outside. There are some secrets in them, which sets a bad example for their own children once they come to know the true nature of their parents. But some would decide to fight hard to make everything come back to the normal and some won't. That is where film derives, how it all ends makes this film unique from the other similar ones.\n\nI think this film was decent with an important topic. Not everyone would end up happy with their watch, because the story won't end up as they thought. The novel was written by a woman, so this is a woman's perspective tale and quite neatly told story. Not a bad direction or the screenplay, surprising the production quality was too good. Seems it is a quite family type film for involving kids, certainly the theme was very strong, so definitely for adults only. It is neither worth nor a waste of time, only if you come across to it and has no other choice, you can give it try.\n\n6.5/10",
    "date": "2016-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "bravo sarah. perhaps i live on another planet than the critics and audience, they seem to disagree with me when i think this was a good one. takes one to know one maybe.",
    "date": "2016-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Sarah Silverman is captivating as a depressed suburban housewife battling addiction and self hatred issues. Her best work yet.",
    "date": "2016-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I really liked this movie. Ok so I have the biggest crush on Sarah Silverman already, but she did a tremendous job. Very sad to see a person struggle with happiness.",
    "date": "2016-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Addiction drama throws curveball with comedian as its lead.  Unfortunately Silverman's strong performance is detracted by a MOW growing pains script.  Bit of a downer.  See instead: Clean and Sober",
    "date": "2016-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "'Nobody tells you that it's terrifying to love something so much.'",
    "date": "2016-05-19"
  }
]