[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A brilliant sequel, probably better than the first movie. The film has an incredibly good villain. Just like the first part, it has a lot of jokes that will make everyone laugh.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Trazendo os personagens carismáticos que tanto amamos e com vilões incríveis e bem feitos (A Fada Madrinha é uma das melhores vilãs de animações que eu já vi), Shrek 2 supera o primeiro em todos os aspectos e é um aventura incrível e maravilhosa. Recomendo para todos os públicos.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "10/10 every time story, soundtrack, characters what a movie",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Shrek 2 (2004) has a very thorough and simple story development. The only downside is that the villains are really weak and feel forced, but aside from that, the movie is quite entertaining.",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of my favorite sequels in animation. Playing Donkey in a theater production soon. Five stars.",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best sequels ever made. The new characters are perfect additions. The story is deeper, the comedy is better, the animation is better. Basically, it reaches the full potential of the Shrek Cinematic Universe. LOVED.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is perfect; the rating should be much higher than it was.",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Shrek 2 is funny but not as good as the first.",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It’s quite literally the best Shrek movie of all time, and yes I do believe it’s 100% better than the original. The movie is undoubtedly a wonderfully written and well executed masterpiece. The story is similar to the first one but with a twist and in my honest opinion, that twist makes the movie stand out above the original. The characters are charming and entertaining to watch as always. The classic raunchy humor never gets old and the jokes are extremely clever and witty. What can I say? 10/10. 5 stars easy.",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Shrek 2 builds on the charm of the original with even bigger laughs, colourful characters, and clever pop-culture houmor. It’s a delightful sequel that’s both fun and heart-warming, keeping the magic alive for fans of all ages.",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I thought shrek 2 was okay in my opinion",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "5.7/10 — \"Mediocre\"/\"Passable\"",
    "date": "2025-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Shrek 2 is the only Shrek sequel worth having made and worth watching. Adding new and hilarious characters, recontextualizing the message of the first film in a poignant, if not always well executed manner and, of course, having much more of Shrek and friends’ edgy 2000’s humor. \n\nWhile the first film is, of course, meant to be a comedy, it does have a worth-while message: you are beautiful and worth being loved as you are. This film retreads that same message and while it doesn’t hit with the same resonance as the first, it still provides much needed heart. This story fleshes out our characters a bit more, mainly Fiona and her family dynamic leading to the introduction of some great characters like Puss in Boots and, my personal favorite: The Fairy God Mother. Her dynamic character is oddly believable in this weird film, fluctuating between menacing fairy and corporately charming with ease as she functions as the Amazon.com of wishes and magic. \nThe humor here consistently strong with corny jokes, sight gags and Mike Myers’ Scottish accent —depending on how much you enjoy it at this point. That said, the story doesn’t go as far with its themes as it could. Splitting up Shrek and Fiona for much of the film weakens the emotional impact, and Prince Charming, despite some funny lines, doesn’t bring much beyond being a bland obstacle.\n\nShrek and this sequel will always have a special place in my heart. While Shrek 2 doesn’t hit the same highs as the first or have the same emotional resonance it is still sharply written with great new characters and some fantastic performances.",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Slightly less good than the first, but only slightly.",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I like the first better, but this one is pretty fun. It's well written and has a good payoff.",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I’ve always loved this movie but I’ve never seen the first one before yesterday.. it makes so much sense now. \n\nIt’s like the movie didn’t stop, I love movies that go together so well you can remember every detail of the first one because it goes together so well.",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I don’t understand where the rest of the 11% has gone to. Shrek 2 is the GREATEST ANIMATED MOVIE OF ALL TIME and it will keep that title for eternity. It was perfect, down to the last minute detail. Storyline 10. Soundtrack 10. Animation 10. The GOAT",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Shrek 2 is masterpice and my favorite shrek films I really loved it",
    "date": "2025-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Shrek é uma franquia incrível, igualmente com esse filme.",
    "date": "2025-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Not that good at all",
    "date": "2025-08-04"
  }
]