[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I would say that this movie is as close to a 5 star movie you can get, without it actually being a 5 star movie. It really keeps you focused on what is happening and the cast does a great job. People want to knock it for not having enough action or character development, but it is based on a true story. You can add a lot things that didn’t happen and keep it close to what happened. I guess people wanted there to be more action like car chances or explosions, you know, the things that really bad movies need to entertain people. The ending when Cage’s character antagonizes Cusack’s charter into admitting he is the killer is great, some of the best work by both actors. Add in the amazing scenes from the Alaska wilderness and how the movie was shot with a cold, overcast feeling and you simply have a great movie. I honestly think that most people like to hate on this movie since both Cage and Cusack have had some real stinkers in their careers, almost to the point that they have become a cliche (especially when it comes to Cage’s movies). Since this movie, Cage has done probably his best work ever. I think this movie is what actually turned his career around.",
    "date": "2025-06-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Its a terrible movie, bad script and filled with flaws.",
    "date": "2025-05-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Intense movie. The photos of the real life victims at the end are very powerful.",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Lots of action, violence. Good plot & acting",
    "date": "2025-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This is my favorite Nicolas Cage movie.  Probably my favorite John Cusack movie too.  Really interesting story and characters.",
    "date": "2025-03-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "No character development. An amazing story, poorly executed. \nIf you want to hear the story in-depth, I recommend Psychopedia podcast.",
    "date": "2024-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This movie had a ton of potential. It’s a gripping and devastatingly horrible true story, and the Alaskan setting makes it that much more chilling (no pun intended). Sadly, this movie falls flat. Poor storytelling, poor pacing, and above all, poor acting. \n\nNicholas Cage was okay, not his worst performance ever but nothing special. Cusack was semi-engaging yet cliche and predictable as the killer. I think he could have shined had he been given better counterparts and a better script. Vanessa Hudgens was a complete disaster… she ruined the movie for me. She had a terrible fake “ghetto accent” that she would turn on and off randomly throughout the film. She didn’t sell the part at all; everything about her acting was terrible. Breaking Bad’s Dean Norris was the only one who delivered a believable performance, and his role was small. \n\nFor a thriller, the movie dragged in places. It lacked suspense, which is surprising given the source material. The “gotcha” moment where Cage/Hudgens catch the killer offered very little emotional payoff. The whole film leaves a lot to be desired. Such a shame because, as I said, there was a lot of potential and it was wasted on a subpar film.",
    "date": "2024-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I've seen this movie a couple times. While the performances of Cage and Cusack are both good, the movie mostly spins it's wheels and not much happens. \n\nWatchable but not great.",
    "date": "2024-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "John Cusack's serial killer, Nicolas Cage's cop, and Vanessa Hudgens' prostitute have to carry this average psychological thriller.",
    "date": "2024-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Care for a fast-paced thriller that works for what it tries to deliver? The Frozen Ground is a good choice.\n\nIn this story, Alaska State Trooper Sgt. Jack Halcombe is about to retire from his duty within 2 weeks, but the discovery of a body in the wilderness might reveal a serial killer on the loose. Now Jack wants to find the killer before he gets another victm, but also he has to deal with his marriage that seems to be breaking apart.\n\nEntertaining as this movie is, we can't ignore a few facts. First, the cinematography is frantic, to say the least. I even joked during the movie that I could not count one shot that lasted over 15 secods. Cuts everywhere, this movie is on 'roids, speeding through event after event until we get to the climax.\n\nThis is not a detective story, though it might feel like it. We know who is the serial killer from the start, and what we watch is Nick Cage racing to frame John Cusack for his deeds, all while relying on one traumatized victim that Vanessa Hudgens plays.\n\nThe Frozen Ground is based on the real acts of serial killer Robert Hansen, and the story tries to be as fateful as possible with the addition of some spicy drama.\n\nFrenetic plot points aside, Jack Halcombe's marriage problems are just dismissible backdrop that seems unrelated to everything we see. We could cut that subplot and the story would be the same; felt formulaic.\n\nOverall, The Frozen Ground entertains for what it is, and the tribute it tries to pay works. If you want to see solid John Cusack acting, this is one good entry. If you want to see a good movie, this is also a good try. Lacks outstandingness, but entertains enough.",
    "date": "2024-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A great movie. I didn’t know what to expect when I watched it the first time, but I was quickly hooked. This is an excellent film based on the real life story of serial killer Robert Hansen. Great acting performances by the entire cast (especially the main characters played by Nicholas Cage; John Cusack and Vanessa Hudgens). It’s a thrilling ride that keeps you engrossed in the story throughout the entire film!",
    "date": "2024-05-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thought it was great. I lived in Alaska, actually ended up meeting the murderers son and renting a place from him, poor guy had issues. I lived in Palmer and drove the road to work everyday where he dumped the bodies and went to the river alot where he did as well. I feel so mad for those girls, but I didn't even know as much as I do now when I lived there. So erie to think I was on the beach of the same river alot with my family where he brought these girls to murder them.",
    "date": "2024-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I enjoyed this movie, the plot was kind of obvious but it was well directed and acted it's definitely worth a watch. 7/10",
    "date": "2024-03-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Nicholas Cage, John Cusack, Radha Mitchell, and Vanessa Hudgens Anchorage, Alaska 1983 A young prostitute has just been rescued after being held in a hotel room in handcuffs A state trooper stumbles onto the case involving a serial killer preying on women for 13 years This is actually based on the real life murders of Robert Hansen Cage plays the trooper Jack Halcomb Cusack plays Hansen, the man is viewed as an upstanding citizen with a wife and two kids so the authorities dismiss this young woman's claims But Halcomb is determined to save this young woman from ending up like the others since he couldn't save his own sister The plot comes off as standard more like something for a tv procedural The shaky cam can get excruciating for some and it is a very dark subject matter But Nicholas Cage comes back in good fashion after having a very lackluster track record The film is suspenseful, nail biting, and never slows down Covers one of the most infamous serial killers in U.S. history with the main victim Cindy Paulson finally having the courage to tell her story getting justice for all the others involved alive and dead The tone of the movie is very dark and mature but important Director Scott Walker has his cast give strong performances and allows the cold, cruel Alaskan setting to sink in",
    "date": "2023-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Horrifying true movie.   Very brave woman.  Terrific cast,  very convincing.   Must see",
    "date": "2023-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Confusing. The director could have done a better job of portraying the storyline. Interesting that it’s a true story. What a weirdo! Glad he’s locked up for good",
    "date": "2023-04-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I thought it was well done.  Keeps you thinking.",
    "date": "2023-03-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A true story with boring drama, known & unknown",
    "date": "2023-02-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A good movie based on the true story of the capture of a serial killer.",
    "date": "2022-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "this movie has really cringe acting by anyone who isn't Nicolas Cage.  this movie is gritty which is good but it doesn't tell this true story well. it has some side characters who seem important but then they disappear, and then we never see them again, and I don't maybe this is just me but just some of the scene of the movies just made want to puke.",
    "date": "2022-04-19"
  }
]