[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Wow What a disappointment with the extensive cast like that you would have thought you got something a lot more. The script was awful. The acting was great built up expectations, but nothing really happened. That I could say was substantial, big fart movie. Don't recommend it. Don't waste your time.",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I loved this movie. Have now watched it three times. The cast is stellar - the only somewhat miss is the rabbi and the oldest son’s wife, Annie. Bateman and Fey are wonderful and Drover lights up the screen (even though it’s a little unbelievable that he’s the ‘baby’ brother). The story is sad, funny, touching but not overly dramatic. true yo familial messy relationships.",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I could listen to Jason Bateman and Tina Fey read a shopping list, but while the premise was interesting, it failed to follow through with it.  The actors did what they could, but the characters were simple and unconflicted.\n\nWhen characters too easily apologize for their own mistakes, I can only conclude that the character development in the book was left on the cutting room floor.  It's like telling just the punch line of a joke without the setup.\n\nOnce again, I'm reminded that I should look at reviews before spending my money on a Prime rental.",
    "date": "2025-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I don't know why so many people and critics didn't like this movie, I found it quite enjoyable.  It's different, it's got some very funny moments and some touching bits.  Sure, some of the characters are not particularly likeable, but doesn't that accurately reflect life?",
    "date": "2025-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I liked this film. Not too lighthearted, not overly dramatic, just a good story told by talented actors with a bit of humor thrown in.",
    "date": "2025-05-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The Roy siblings if they had good parents",
    "date": "2025-03-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Enjoyable movie about a Jewish Family. I am not particularly a fan of Jason Bateman but I like him very much in this movie. Acting was good though in some parts overdone. But fun movie all around for an evening with popcorn.",
    "date": "2025-02-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The raunchy humor is very hit-or-miss, half the characters are very unlikeable, and the dialogue can get awkward with exposition and borderline pretentious at times. However, the star-studded cast are doing the best they can with the so-so script and carry a lot of charm and chemistry with their scenes together. Despite my prior complaints, the movie can still be funny from time to time, usually whenever the main leads quit the raunchy one-liners and focus on more casual family moments like in the classroom scene. The story is kind of a mess, particularly with how the mother is framed more as a misguided quirky matriarch rather than the toxic emotional manipulator that she is. However, the rest of the story with the main siblings trying to find closure and meaning in their lives can be quite touching at times whenever it’s not trying to be too melodramatic. Overall, it’s a mixed bag, but I still had an okay time with it, and I’m glad I finally got to watch it with my girlfriend after all these years of her hyping it up for me. I particularly like the ending symbolism with Jason Bateman’s character venturing off to Maine on the highway to let loose and explore beyond on the horizon. Very relatable moment to conclude a messy but relatable movie.",
    "date": "2025-01-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "i ended up crying at the end, this was real good. it really captured the family thing",
    "date": "2025-01-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Extraordinarily good ensemble film well-anchored by Jason Bateman as the thoughtful, world-weary straight man to his eccentric siblings and mother, played by a surprisingly sympathetic Jane Fonda.  The dialog ranges from good to crackling and I believed in all the characters and their life challenges.  Tina Fey, Adam Driver and Timothy Olyphant are at the tops of their respective games.  Highly recommended.",
    "date": "2024-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Enjoyable family drama with witty writing, the cast is excellent and the movie has its good emotional moments, such a fun movie, and a joy to watch.",
    "date": "2024-12-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I'm surprised the ratings here don't reflect the excellence of this film. Hilarious and poignant. I loved it.",
    "date": "2024-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Sadly despite Jason Bateman with a beard 🫶🏻 this is less than the sum of its parts. It has a great cast, promising premise, and some entertaining moments, but there’s so little chemistry with the lines and how they’re delivered. Just not super well written :(",
    "date": "2024-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Every character in this movie is an awful human being (maybe the ice skating girl is ok).  No one to relate to or root for and no reason to waste your time",
    "date": "2024-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "With this many characters going through so many unimaginably trying situations, it makes it impossible to go in depth on any of them enough for the viewer to care at all.  It is difficult for me to NOT like something Bateman and Fey are in, but these screenwriter's were \"up\" to the task.  The ending is worthy of a teenage girl watching her dad try to dance at a wedding eye-roll.  Absolutely awful.",
    "date": "2024-06-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Typical family dramedy with the same situations and same character structure, and kind of the same developments that we've seen in many movies... But nice still, thanks to its charming cast of players",
    "date": "2024-05-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved this movie and have watched it several times with different people and everyone loved it. Great cast, funny and bittersweet moments, and I am shocked it didn't have higher ratings. Totally underrated movie.",
    "date": "2024-03-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Based on critic reviews, apparently, I'm a know-nothing sucker who is easily entertained and am too stupid to realize this movie is a sanitized retread of other, seemingly more effective movies.\n\nBut fuck it I loved this movie. It makes me want to have more kids and psychologically manipulate them so that they are guaranteed to turn into charming, yet self-destructive adults like the Altmans. I'll defend this movie to the death (but maybe I should really just read the book). Everyone's allowed to have a guilty pleasure.",
    "date": "2024-03-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Smart and funny with a great cast.  Under-rated imho.",
    "date": "2024-02-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Some funny moments, and a good cast, but too many characters and unlikely storylines to really care about any of them.",
    "date": "2024-02-10"
  }
]