[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "“Pig” surprised me in the best way. I went in not knowing what to expect and ended up really enjoying it. The story is slower and more emotional than I anticipated, but it pays off with great atmosphere and a genuinely memorable lead performance. It’s unique, a little weird in a good way, and definitely sticks with you after it’s over. Not perfect, but absolutely worth watching.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "So many things wrong with this movie except the pig. The story didn't build on anything and made you suffer to the end to get the back story. Besides all the ridiculous characters in this mess, the one thing that grated me throughout the entire film was the dirt and fresh blood smeared face with not so much as a swipe to clear it up. It was obserd and not believable—zero redeeming qualities except the pig who actually looked clean for a pig, better than Nicholas. Gawd, I spent a part of my life on this burntout moment.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Slow and boring , turned it off halfway through. Don’t bother",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "so surprised to see how great the ratings are. I remember being so disappointed & thinking \"dang not all nick cage ones are winners huh?\"",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Sorry to disagree with such an overwhelming majority, but I found this movie unbearable. The best thing about it is the cinematography, especially in the opening scenes. The worst thing about it is the utterly implausible actions of the characters. These render its slow pace and long speeches pretentious rather than authentic. I don't want to engage in spoilers, so I'll just say this. If you watch it, ask yourself, \"Is it credible that the son would stick around with this guy? Is it credible that a child, approached by what appears to be a zombie, would offer him his musical instrument rather than run, screaming, into the house? Is it credible that this unwashed, bloodied vagrant would not only get a seating in a five-star restaurant but that the chef would come out for a friendly chat? Is it credible that a back-woodsman in search of his pig would pause to deliver lengthy philosophical disquisitions?\" If you answer yes to these questions, I expect you'll enjoy the film.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I have always been a fan of Cage.\nAgain though, its just his acting that makes the movie better .\nOn this occasion though, not even Cage could save this movie .\nYes, it does have a underlying meaning.\nBut, I was waiting and hoping for some twists and turns in the story that has you glued to the screen,not wanting to look away! Unfortunately, this didnt have anything memorable throughout and just as you think it is bound to give you something , it ends!!, \nNot sure how this has a very high rating 🤔. Cant see how it has great reviews \nLike alot of movie reviews on rotten tomatoes, its the movies that only have average ratings that I have found much more enjoyable then one's like Pig , that have high ratings and makes you wonder how or why . Disappointing 😞",
    "date": "2025-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Nice movie, slow moving, really about loss and how we all deal with it.  Confused ending though…",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was weird and pretentious and just frankly stupid. I don’t get why people are glazing this movie it’s actually just ridiculous and definitely not worth watching. I’m rating it 5 stars because me mom watched it with me and really liked it for some reason and asked me not to give it a bad review. Also why didn’t he shower?? And don’t tell me it’s a metaphor for something it’s not it’s just weird.",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The best nic cage movie i have ever seen, and imo a near perfect film. Spoilers ahead, but if you havent seen this then just do yourself a favor and watch it. This was like john wick meets ratatouille. The only thing i didnt love about the film was the early scene of seeing the pig in distress, as this is the most beautiful pig i have ever laid my eyes upon. Theres too much to love that its hard to orient myself about where to start- but i think the greatest achievement of this film for me is the mislead. Theres a tonal anticipation throughout the film that things might take a more badass vengeful and violent turn, but they never do. The mislead that this might be some action thriller but in reality is just a deep exploration of grief is handled beautifully. I love how the moment Nic cage’s truffle distributor steps onto screen with his  giant gucci belt that contrasts the reclusive in the woods no phone life Cage’s character lives, you hate him instantly- and by the end of the film you feel the complete opposite. i loved the monologue to the portland chef- i think this whole movie is more essential media for chefs than kitchen confidential is, honestly- but is also just widely relatable to anyone. I love how there is so much shown and not told in this film- in the moment of the reveal of what happens to the pig there is an obvious grieving for both the pig and his late wife, Cage’s performance is so excellent,  and you have to piece together that this guy really re-oriented his life in the wake of his wife’s death, and how much he put into his work and regrets it in that light, and goes into the woods to focus on what actually is real and matters- relationships.. like his relationship to a pig. I do think realistically, even if he’s a recluse and also not in his right mind and is ultra focused on finding his pig, nic cage couldve taken a shower at some point in this movie…if only so his cuts dont get infected- that was the only thing that actually felt a little ridiculous. Its hard to even articulate to myself why i dont give this 5 stars, but something just didnt fully take me there, despite truly loving this film. But either way, it is incredible and absolutely deserves to be regarded as a cult classic",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "If you can get through this without crying then you gotta be made of steel. Fascinating, deeply meaningful, very original.",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is one of my all-time favorite films. It hit me just how & when I needed it. Sure, people who want to see Nic Cage act extreme will be disappointed. Fine. The guy has range. I saw him in a YouTube Most Searched Questions where he said his favorite Nic Cage movie is Pig, because he felt like \"I had become seasoned and I had entered the room.\" I could not agree more. \n\nIf you're threatened by emotional rawness and you need to have your feelings covered by punches and shouts, look elsewhere. This movie is about grief, which is deeply threatening to an awful lot of people. But man is it sure handled with love here. \n\nI've seen this movie at least five times, in the theater, on streaming, and on the DVD I bought.",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I usually like Nicholas Cage movies but this was without a doubt the worst, most boring film I’ve ever seen.\nHe acts like an inanimate object, the story is a hodgepodge of stupidity, he never cleans the blood of his face, for days, they waste Adam Arkin, and the pig had a better acting day than Cage.\nWhat a waste of time.",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A bit of a strange little movie in a surprising and affecting way.  Some narrative slight misfires aside it really sticks.",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "If you enjoy subverted expectations and well-written character development, this movie is for you. It is NOT a thriller or action film, but a gritty and suspenseful journey following a man that would endure anything to save the ones he loves. He overcomes his various obstacles in unexpected ways that relates and resonates deeply with the audience.",
    "date": "2025-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wow!  This movie delivered so much more than I expected. I’m a better person for having watched it.",
    "date": "2025-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Started watching it, then I quit. Went back later and read some of the good reviews. Gave it another try. Watched it to the end. A terrible waste of time. Cannot recommend it.",
    "date": "2025-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "No, actually. I'm all for a quiet movie with interesting characters and storyline, but this is just absurd, makes as little sense plot-wise as the John Wick revenge plots it's supposed to oppose. The Portland, Oregon culinary mafia fight club? Really?? Maybe it's just a John Wick spoof, in which case it's not even very amusing.",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This is not a complicated movie. It is about love, missing someone, and values in life.",
    "date": "2025-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I was shocked that this movie was as good as it was, and thought that may have effected my perception. After watching a year or two later, it still holds up. Fantastic film",
    "date": "2025-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's less about  a pig, if that makes you feel any better and more about life and connections. Nicolas Cage gives an academy award level performance, just  stunning. It IS about food and the carefully crafted life as well as the right to remain alone for years in the wilderness. Loved the  ending!",
    "date": "2025-07-03"
  }
]