[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie has Assed at every ass like someone I know",
    "date": "2025-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Unless you're one of the uptight sorts that are offended by every living thing, this movie is the perfect sequel. It's rated R for a reason, so if you are easily offended, go watch something else.",
    "date": "2025-04-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Mila Kunis is wonderful trying to please Christine Baranski as her difficult mother.\n\nDirectors Scott Moore and Jon Lucas’ sex comedy A Bad Moms Christmas (2017) is really wild. It’s somehow more raunchy and outrageous than the first movie. Moore and Lucas direct crazy montage scenes of trampolining, mall havoc, and partying. I loved the cameo from Kenny G, who gets the funniest line in the movie. I love the running gag that Christine Baranski will forget Mila’s boyfriend right after meeting him. I liked Bad Moms about as much as Bad Moms. It’s a total riot. I also recommend Bridesmaids, Bachelorette, Bad Moms, Rough Night, Girls Night, and Joy Ride.\n\nWriters Scott Moore and Jon Lucas manage to develop the friendship between the three main moms, as well as them learning to speak up for themselves because their mothers need to respect boundaries. It’s great for uplifting moms. It has a heartfelt message about understanding everything your mom has done for you and is going through. All of the mommy trauma is increasingly hilarious, but also tender. It was a nice idea for all of these controlling mothers to appear during Christmas time at the homes of the main cast. Seeing all the mothers arguing is just pure hilarity.\n\nMila Kunis is funny, gorgeous, and lovable as the sympathetic mom heroine Amy Redmond-Mitchell. Kunis is great at getting you to feel sorry for her mother tormenting during the holidays. Jay Hernandez is kind and considerate again as Mila’s love interest Jessie. Ariana Greenblatt is great as the little girl Lori Harkness. Kristen Bell is cute and astonished at everything as the pathetically shy mom Kiki Wilson-Moore. Kathryn Hahn is insane as the incessant partier Carla Dunkler. She’s so funny, but also gets a nice romance plot with Justin Hartley’s stripper Ty Swindle. He’s a good sport for all of these scenes. Cade Cooksey is still very funny as the simple-minded son Jaxon Dunkler.\n\nChristine Baranski is a scream as the overprotective and commanding Ruth Redmond, Amy's mother and Hank's wife. Baranski is really outrageous with her endless insults and meddling. Peter Gallagher is just there to have fun as Ruth’s husband Hank Redmond. His heartfelt speech to Mila is adorable and very kind hearted. Oona Laurence’s Jane and Emjay Anthony’s Dylan are great as the spoiled kids.\n\nCheryl Hines is fun as Kiki’s constantly too close mother Sandy Wilson. Her mimicking Kristen Bell’s style and voice is a riot. Susan Sarandon is excellent as the weed smoking mother to Carla named Isis Dunkler. Lyle Brocato is amusing opposite Bell as Kent Moore, especially when he’s shocked by Cheryl’s clingy behavior. Wanda Sykes gets an even funnier cameo than the first movie as she is stunned by Hines’ overbearing mother and she tells off Bell. Christina Applegate’s cameo as Gwendolyn James had me rolling.\n\nA Bad Moms Christmas is super cute and hysterical.",
    "date": "2025-01-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Just watched this. It's quite entertaining, and sometimes intentionally. Other times it's just funny to watch all the 70 year-old Hollywood types with their plastic faces trying to be wacky. Susan Sarandon is too good for this material, as is Larry David's on-screen wife Cheryl. But it's undemanding fun in the run-up to Christmas.",
    "date": "2024-12-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "There are some good moments in Bad Moms’ Christmas, most of them supplied by an acerbic Christine Baranski, but they can’t overcome a flat and obvious script that frequently descends into vulgarity.",
    "date": "2024-12-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "That was bad. Made me uncomfortable.",
    "date": "2024-12-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Not quite as terrible as I expected, not quite the lump of coal I’ve read it was. Raunchy, foul mouthed and predictable. Cast was game and it’s brightly lit with a certain cheery flair. A few laughs, and it ends in schmaltz, as expected. Never realized how much Christine Baranski looks like Taylor Swift! Almost her older twin.",
    "date": "2024-12-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "OK, it's never going to be a Christmas classic. It was over the top but oh so much fun. Great cast and a little bit of the warm fuzzies at the end. Not for small kids though. However,  great entertainment for a group of women, after a couple glasses of wine, during the Christmas season.",
    "date": "2024-12-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This is the kind of movie that takes actual toxic behaviour and attempts to justify it through Hollywood sentimentality.  This is why so many people actually struggle with abusive, manipulative, overbearing mothers... because even when they can see clearly that boundaries need to be set or no contact needs to happen, society guilts, shames, and degrades adult children who attempt to find healthy and boundary guided new lives away from a toxic mother.  This movie might be intended to be light hearted, but any movie shaming victims of toxic abuse for just not being compassionate enough is pretty messed up.",
    "date": "2024-12-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Some funny moments in it and definitely just an easy Christmas movie to watch. Kathryn Hahn makes it for me.",
    "date": "2024-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Truly awful with almost no redeeming characteristics.  Blasphemies abound and the language is atrocious.  This, from an inveterate cursor.  The plot stinks.  It's boring.  And it goes on forever.  And the music sucks.  This film blows ass.  AVOID.",
    "date": "2024-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The dialog between the characters is well written and relatable. I laughed some but I cried more. If you have a dysfunctional relationship with your mom, you might appreciate this film.",
    "date": "2024-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie aged awfully",
    "date": "2024-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Pure Garbage....What is going on with the actors these days.  None of these movies make any sense anymore.  The end of Hollywood will soon become a reality....",
    "date": "2024-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Uh I don't know,to be a comedy movie is not really that bad.\nIt crscks some small laughs and Mila Kunis and her Co stars work so well together.\nIt's not bad but I'd take the first one instead of this,that one was really good",
    "date": "2024-05-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Honestly I was majorly disappointed. This movie had an amazing cast. Every one of the actresses that played the moms are A1 actors having proved themselves in other titles over the years. The problem was 100% in the writing. The jokes were terrible. Storyline was bad and obvious. It's just cringe and unwatchable even with the great casting.",
    "date": "2024-02-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I had a VERY visceral and negative reaction to this movie - so much so that I came very close to turning it off a couple times. While I certainly don't consider myself a \"prude\" when it comes to movies, this type of humor does nothing for me and often comes close to being offensive. Watching a young girl, possibly around 6-7 years old, saying the f-word not once, not twice, but THREE times is not humorous to me. I have not seen the original BAD MOMS movie, but I'm going to assume its probably the same raunch humor mixed with attempted pathos. Hahn is an actress I have admired in the past, but her character here is absolutely repugnant. I cringed every time she came onscreen. Christine Baranski as Kunis' mom is unbearable and made me want to pull my hair out. Susan Sarandon as Hahn's mom looks embarrassed to be part of these proceedings. And the rest of the cast isn't much better, save Kunis. She is the one relatively bright spot here and seems to understand how to handle the tone of this movie. Had everyone else been on her level, this may have succeeded. And a really good and funny movie could be made about the stress of mothers during Christmas. This just ain't it - not by a long shot.",
    "date": "2024-02-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The best part was the cast, the stories could have used a little more development and flashed between them all a little too fast.  Mila, and cast were good, the lines were solid, and the entertainment factor was there.  But 20 more minutes in setup of the story would have been nice.  It did feel more like an episode, not sequel, and had most of the right parts.  But lots left unexplained, a bit confusing on why.... Overall the cast and story were pretty good, and yes I would say give it a shot and see what your take is overall.\n\nIt was worth the first time investment, but it will NOT be a movie I watch a second time.\n\n-  Matthew",
    "date": "2024-01-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Great cast, but I wasn't impressed by the writing: the story isn't particularly good, the jokes kind of lame.. Wouldn't watch it again, but it made me laugh a few times.",
    "date": "2024-01-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Cheesy and a waste of time.",
    "date": "2024-01-06"
  }
]