[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fun filled movie - music and dance you can’t go wrong.",
    "date": "2024-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "a great story with alot of great music and dance",
    "date": "2024-10-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I enjoyed this one with the family as it was surprisingly good Celtic Riverdance music with a fun adventure story involving the animals in the forest.",
    "date": "2022-04-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "bona fide\ndance\nlighthearted humor\nFeel the nature and light\nreally comfortable i like it",
    "date": "2022-03-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is such a great heart warming and entertaining film for the whole family, based on the Riverdance musical stage show, it follows a new story layered on the dancing and music of the original show.  The characters are fun and the story is sweet and flows really nicely.  The animation and musical numbers are fantastic and super fun.  There are the added sequence's with the cute sheep and frogs that will keep very young kids entertained too.  So there is something for everyone.  I love this magical and special movie.",
    "date": "2022-02-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "What a surprising sweet family friendly movie. I watched it with my 5 y/o niece and she loved it. It has a sweet message and great dancing scenes with enough laughs to carry you through. A must watch for a Riverdance fan and any kids who love dance.",
    "date": "2022-01-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Lovely movie with a lot of Irish culture and a wonderful tribute to Riverdance the Show",
    "date": "2022-01-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fantastic movie for all ages!  The writers did a beautiful job of weaving in the traditional Riverdance music and dances into a modern, heartfelt story.  The movie itself was beautiful with the graphics, message and actors. My husband and I were tapping our toes to the music the entire movie and we cannot wait to watch it again!",
    "date": "2022-01-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Heart-warming. That's the best way I can describe it. It'll take you through happy and sad tears, but in the end, it'll have you smiling. Also loved the music!",
    "date": "2022-01-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A wonderful story beautifully told - fun for the whole family!",
    "date": "2022-01-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved Riverdance! It's so fun and poignant and has a great story. The characters are unique and thoughtful, and it deals with issues and emotions that affect us all. And the visuals are so cool… the scene with all the moose dancing is just terrific! After seeing it, I recommended it to my large cadre of relatives and they're telling me how much they, too, loved it and that their young children were happily dancing around while watching it….and they all want to see it again! A great film for both kids and adults:)",
    "date": "2022-01-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Such a great movie!  The problem with most critics is they're mostly angry men.  You'd have to drag them to the stage show and they'd grumble at that the whole time.  Been there, done that. They were never going to love an \"animated, dance, musical\" -- that's their holy trilogy of hell!  Ladies, kind men, and kids of all ages -- this is a must see!",
    "date": "2022-01-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "My daughter and I watched this movie and she loved it. She is taking dance class and  \nwas happily hopping around during the big dance numbers! I appreciated how the filmmakers handled the themes of loss and finding your way. I have not seen the stage show but am vaguely familiar with it - I was expecting a \"stock\" animated musical with songs every ten minutes but was pleasantly surprised at how the music and dance moments were handled. It was fun, funny and kept my daughter entertained throughout. I think this a great movie for young kids and Grandparents.",
    "date": "2022-01-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "First original film since Soul.  Isn't everyone getting tired of the repeated formulas used by Disney, Illumination, Dreamworks, etc?  Critics keep saying the same stuff is great -- they're the ones who lack imagination.  Riverdance gets 5 stars for trying something different.  Not to mention there's a wicked Hurling scene and cool stampede!  More like this Netflix, please!",
    "date": "2022-01-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Riverdance is a fresh and new take on typical animated movies. With compelling and grounded characters, we explore the world of Riverdance in a new light that people will enjoy, whether they have seen the stage show or not. We follow Keegan and Moya in a fantastical and beautiful adventure, full of folklore, traditions, and friendship, as a way to talk about grief and community. Of course, the whole thing is intercut with incredible music and wonderful choreographies. The way this movie talks about loss in such a natural and sincere way, with a good touch of comedic relief, makes it accessible to young kids, and enjoyable for the whole family. I highly recommend it!",
    "date": "2022-01-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Perfect family film because it was so full of good lessons, colorful scenery, funny jokes and, of course, great dancing.  Kids can't wait to see it again and it really touched my husband and I, too, and we both remarked that it's better than some adult films with its themes and careful treatment of childrens' emotions.  Timely film about losing a grandparent, as it's been a tough two years for so many.  The film knew exactly when to hit you then give you a release with a joke. So many animated films don't take kids seriously.  They assume kids want pop music and cliche stories like all those studio sequels telling the same story again and again.  We watched Hotel T 4, Pets 2 and Sing 2 recently, and they just felt like big studios stealing money from our kids. It's nice that Netflix is fighting against that with something understated but more powerful.  We loved the fairy tale aspect, the interesting designs everywhere and the epic music. We haven't seen the live show, but now we must!",
    "date": "2022-01-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Riverdance is the perfect balance between heartfelt and lighthearted. The whole family will enjoy this movie, with its great soundtrack, wonderful choreography, and compelling story. It's the perfect introduction to Irish folklore and dance for younger generations who might not have heard of the stage show.",
    "date": "2022-01-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "My family absolutely loves this movie!  We watched it 3 times this weekend.  I have 4 kids, 2 boys and 2 girls between 6yrs and 12yrs.  I lost my husband, their father, last year.  Talk about a cathartic experience for all of us to watch this gorgeously made, poignantly observed tale about grief and love and allowing your community to help you heal.  Most of all, it's not a heavy \"message\" film.  Netflix delicately wrapped the soul around great humor to make it more relatable to my younger ones while also captivating my older ones.  There's a story line for girls, a story line for boys, and an adorable story line about little tadpoles for the little ones all cleverly woven together. The bad guy is just bad enough and the humanity of each character is well expressed. We're half Irish, too, so to see the landscapes I grew up around and hearing the various Irish accents (yes we have many) was wonderful.  I have to laugh at some online who say the narrator has a fake Irish accent -- it's John Kavanagh one of our most famous Irish actors!  And yes, Pierce Brosnan is Irish, too! Clearly the filmmakers did their homework. I also like some of the other accents , that they weren't all Irish, because it's very true to the stage show (which I've also seen multiple times) in incorporating different cultures like Russian, Spanish and North American. One of the best scenes in the stage show is when the dancers visit NYC and have a hilarious tap-off and deer named Penny and Benny capture that spirit and are the 2 middle kids' favorite characters. Both the show and film express how we're all, many countries and cultures, connected through dance.  This film will offer so much to so many who let it.   And I must say my oldest boy is a tough critic, but when I saw him tear up then burst out laughing, I knew they hooked him. Everyone in the house has been emulating the Riverdance (it's great exercise!) and quoting their favorite lines.   Seriously I hope this is a St Patrick's Day classic that everyone watches every year -- we'd be a kinder planet if that happened!   Bravo Netflix! \np.s. When can we buy those sheep? Omg we all want those sheep!",
    "date": "2022-01-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Netflix's Riverdance: The Animated Adventure sets the bar high for other animated movies as it is everything they should be and more. Be it the music, story, visuals, themes or characters, the film shines in almost every aspect and makes it a memorable watch with poignant lessons.\n\nThe movie beautifully yet sensitively explores deep emotional themes, all through its animation and plot. Keegan's story of struggling with the loss of his grandfather is something one would resonate with if they experienced the grief of losing a loved one.",
    "date": "2022-01-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Low budget animated movie with little story.  Just a confusing storyline with bland jokes.  Don't go in expecting an UP, Cars or Despicable Me level of animated movie.  I don't see what deers and Irish dancing have to do with each other.  It's very forgettable.  I watched with my kid and he kept asking questions I didn't have the answers to.",
    "date": "2022-01-14"
  }
]