[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Stupid but entertaining.",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "With plot holes big enough for a battleship and a Navy recruiting show of force, it remains a fun couple of hours.",
    "date": "2025-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Not much narrative or story substance, but, it's still just a plain old fun movie.\nSuspend your disbelief for a bit and watch stuff get blown up for a while, you'll have fun, and you'll probably come out wanting to go visit the USS Missouri",
    "date": "2025-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love this movie I watched it 4 times in a week. I don't pick apart a movie I just like to watch something to get away. Cast was good.",
    "date": "2025-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great acting Great action",
    "date": "2025-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Did it make a lot of sense? No but great action a lot of pur fun.",
    "date": "2025-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The reviews are right...this is a terrible movie wrapped in an action cornucopia. Don't worry, the plot holes provide ample ventilation to prevent being asphyxiated by the the Three Stooges silliness.\n   Your eyes will get a workout...might even cause dizziness from rolling them for 2 hours. \n   You really have to \"be in a mood\" to finish this one. Good luck!",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Awesome action movie. Dumb acting. Definitely worth a watch",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Boringly simple and uninteresting.",
    "date": "2025-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Starts actually ok if you can overlook the cringe inducing football match….why do yanks always try to chuck games into their films when they have no idea. Ok side issue. Once we get into the crux of the fighting it all goes horribly downhill. By the close you’re just desperate for it to all end. The ending is woeful too. It really is a bad film with some surprising cast members having cameos.",
    "date": "2025-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie gets way too much hate, I think it is phenomenal for what it is, a game based off of a board game. This movie has some of the best one liners of any movie I have ever seen too.",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I don't think I ever got past Rihanna! playing a fairly major role in this flick. She was perfectly serviceable too",
    "date": "2025-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great movie for fun, where the idea is a brilliant alien combat scenario,  with even bettet alien concept; not unnecesary violence, great strategy",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A guilty pleasure. Big dumb fun. Great cast. Great action. Love the soundtrack. Liked the storyline. Nice nod to veterans too. International cast, good to see the Aussies got a showing at the end",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I don't know why this movie gets so much hate. It is a movie based on a game and I enjoy my movies that I see in theaters big loudI and sometimes over the top. It is entertainment and this is good ol American fun in my book. I can do drama at home but this movie is why we have Surround sound",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's a movie based on a board game, what exactly are you looking for?\nFun movie with a great historical Battleship USS Missouri.  If you like the game and Navy movies, this is a great time!  Be entertained and enjoy.",
    "date": "2025-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 2 hours and 11 minutes!!!!!!!!!!!!!!!!!! Rated PG-13 for Intense Sequences of Action, Intense Sequences of Destruction, Intense Sequences of Violence and Language!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $65,200,000.00!!!!!!!!!!!!!!!!!!!! Happy 13th anniversary!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Reading some of the reviews from top critics, instead of trying to find faults with films, why not watch and enjoy the moment, put yourself in the film,feel the energy and enjoy yourself. Ohh and watch the end credits.",
    "date": "2025-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I literally rewatched it this morning and it’s awesome. \n\nSit back, enjoy the cheesy action, macho style hero movie. We all wish we had a character arc like the main actor. \n\nDon’t let the negative reviews fool you, this movie is so fun.",
    "date": "2025-06-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Those critical of this movie expect too much of this film. One negative review described it as \"Transformers at Sea\" and I think that perfectly captures the movie's tone. Yes, the plot is quite two dimensional, but the point of it is to enjoy the amazing special effects and action - with a tiny homage to the original boardgame in the bouy scene! Besides, it does a wonderful job incorporating real veterans into the story and cast, showing that when it matters most they are always willing and ready to serve.",
    "date": "2025-05-29"
  }
]