[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Trust me this is the worse movie ever produced... Bad story, poor editing 😞",
    "date": "2024-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Sure we all wasted our time watching this piece of garbage but the amount of time and money that must have been wasted making it blows my mind.",
    "date": "2023-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "They kidnapped the wrong wife.  So this is about a Marine Captain (Gary Dourdan).  His archeologist wife (Serinda Swan) travels to Africa to excavate a site on the Moroccan-Algerian border only to promptly get snatched up by Algerian insurgents.  It's not standard hostage negotiation policy, but who can stop a Marine from trying to save his wife?  Now, this was yet another movie that I went into pretty cold.  I knew that it had Andy Garcia in the cast list, but after Passengers, that doesn't exactly mean much.  I couldn't get a gauge on if this was a war movie or a Taken situation going off of the plot description.  Well, the answer falls somewhere in between the two, but unfortunately, it is highly generic.  Now I don't have a lot in the way of positive things to say about Redemption Day.  If I had to say something nice about it, I would say Gary Dourdan is trying.  You can tell that he thought this was going to be a decent-sized break for him, and for what it's worth, it's cool to see a person of color in the role that would traditionally go to a bulky handsome white man.  While he may be getting an A for effort, the rest of the cast, not so much.  The acting is a bit shaky, and the story had already mostly lost me before I was out of the first half.  There's just not that much happening that is engaging.  The script is lackluster, the direction is not terribly competent, and there are no new ideas brought to the table.  There's sloppy exposition as this is getting set up, like making Ernie Hudson say, \"Look, I'm your father.\"  Not to be insensitive, but the insurgents are just the standard brown villains that you get in every one of these movies of this type, only this time they are from northern Africa instead of the Middle East.  They don't have any personality other than to be intimidating, and they don't have an end goal other than to extort money from the U.S. government because a citizen accidentally put a toe on Algerian soil.  Redemption Day is not a prime-time film, and it is just barely a B war movie.  It is simple enough to follow, but you're not going to care because you have seen it all before.  The setup is weak, and when this eventually and inevitably turns into Call of Duty, I was more than ready to cut this off.  I do give minor points for Dourdan, but he does not have a lot to work with here.",
    "date": "2021-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Very very basic movie. Full of plot holes, and ridiculous things that make no sense. For example, dragging a body from behind a vehicle into the line of fire. He was very obvious they did not have a single military liaison to help with this movie. \n\nDon't waste your time watching this movie.",
    "date": "2021-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Terrible writing, acting, directing. Funny to watch because of how bad it is.",
    "date": "2021-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Unfortunately a dumb story.  cliched.  Dedicated to Islamophobia.  Bad representation.  How long will these films be shown and money spent on them?  Its time is over.",
    "date": "2021-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Simply rotten. Too many known actors that are no substitute for good story telling, consistency of the story, useless moralizing, and a mezcla of disconnected story lines. Think of Gigli the flop except this one has shootings left and right. Just Awful.",
    "date": "2021-05-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It worths watching it",
    "date": "2021-04-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Does Andy Garcia need money? Because, if he needs money, I can lend him money.",
    "date": "2021-03-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Aweful, total waste of time.",
    "date": "2021-03-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Wow. That was a waste of time.",
    "date": "2021-03-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie. Nice landscapes. We really enjoyed watching with room mates. Love from Norway",
    "date": "2021-03-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Probably the most boring \"suspenseful \" movie I have ever seen. Extremely slow movie I kept waiting for the exciting part. The acting was terrible which is so unexpected  especially involving anything military the acting is usually really good. I would pass on this movie .",
    "date": "2021-02-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Good film .bigr actor ...thanks hajji",
    "date": "2021-02-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Worst movie i saw in the last 20 years. I cant figure out how they convinced actors like Andy Garcia and Samy Naseri to play in that atrocity. They must have been really desperate...",
    "date": "2021-02-04"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie was terrible. I've seen a couple really bad movies so far this year, and this one ranks right up there with any of them. Bad acting, bad screenplay, well, just about everything is bad. Why do people spend money making this trash?",
    "date": "2021-01-31"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "It looks like a cool movie, but actually it is far far from it. Good scenes and shots thouw",
    "date": "2021-01-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing movie. I think the bad note are wrote by Algerian people.",
    "date": "2021-01-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Wow, this has to be a world record. On IMDb, Out of the current 1,004 reviews, 882 are all 10/10's - that's over 80% of the reviews, which is the biggest joke and deceit any filmmaker has made. This film should've been called Desperation Day. Rotten Tomatoes' *real* Top Critics' honest 16% Rotten score is much accurate lol.\n\nNewb director Hicham Hajji, also wrote, along with two other writers, the worst screenplay I've seen in a long time. It was riddled with plot and technical issues, convoluted, ridiculous, and filled with long dragged out and unnecessary scenes, and the slow pacing made the 99 min runtime feel like 3+ hours. What was even the point of the flashbacks? They were a waste of film. Was this even edited? And it's not like we haven't seen this type of film before. We have, and they've all been much better. This action thriller had slow awkward action, it was stale and utterly generic and low-rent, with no surprises or any real thrills. Hajji's camera work was also horrible - a 5th grade drama class could've come up with a better production. Instead of wasting time with these bogus reviews, he maybe should've had his screenplay reviewed and edited properly by a seasoned writer. Film school should be his next project. You can always tell the quality of what's ahead in a film by the sound and score. Right from the start, you hear this loud, overbearing, unfitting and annoyingly non-stop score, that it made the dialogue barely legible.\n\nThe only redeeming qualities was the beautiful set landscapes, and the casting that performed fairly decent, considering they probably had zero cast direction from Hajji. My very generous 4/10 all goes towards those few qualities. It's a big \"no\" from me.",
    "date": "2021-01-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Yes I agree this movie is very low budget , I would not recommend this movie.. why would this movie even make it to theaters? I was very unhappy that I paid for this movie and on my husbands birthday!!",
    "date": "2021-01-21"
  }
]