[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Diane Lane carries this crime thriller with her realistic portrayal of a cheating wife. She looked the part and acted the part, making it impossible not to get lost in her world. The film offers a new take on the unfaithful spouse storyline by showing that infidelity isn’t always a result of neglect or unhappiness. Such thought-provoking themes, coupled with great acting, make Unfaithful worth watching albeit forgettable.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Works precisely because it is so upsetting, unusually so for a studio film, and so empathetic for Connie at the hands of her attractive manipulator.",
    "date": "2025-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Filme mais ou menos, o roteiro é fraco, as cenas são mais ou menos, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Good movie that gets a bit silly. Still, worth a watch. The sliding doors moment is always a good scene.",
    "date": "2025-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Unfaithful is not so much about the conventions of a typical bored housewife falls for exotic foreigner with disastrous results story, but in fact plumbs the depths of what really constitutes intimacy, and how complacency, rather than the melodramatic ups",
    "date": "2025-06-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Diane Lane anchors the movie: she plays real and she looks real, with just enough lines and hints of wrinkles; a beautiful woman who's been distracted by too many school runs and charity committees.",
    "date": "2025-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie with an equally great twist",
    "date": "2025-04-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I almost didn't watch this movie because of the poor reviewer reviews and the not so hot public reviews. But I'm glad I did.",
    "date": "2025-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A master class in seduction, an expert has written this script. The plot is give or take with you. If your here to enjoy a movie for its romantic or spicy scenes this movie will delivery above and beyond. If your here for the delima you will be served. If your here for the morality of an affair that's up to audience member to decide. The ending didn't work for me, and i took it at face value. Did i enjoy this movie yes, was the plot great not really. What it does well it does leaps and bounds above its weight class.",
    "date": "2024-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "“This moment is your life.”\n\nDirector Adrian Lyne’s erotic thriller Unfaithful (2002) is a shockingly beautiful and haunting film. Lyne’s direction plays around with the lust and passion in sex, the doubt and fear in suspecting your spouse is cheating, and the guilt of being found out. Lyne’s direction just shows us the desire of making love with someone instead of judging his characters. It’s very interesting to me how ambiguous the ending feels and lets the viewer decide are these lovers doomed? Unfaithful feels like a rare gem of impeccable craftsmanship and artful eroticism. It is a sexy film and dramatically moving.\n\nScreenwriters Alvin Sargent and William Broyles Jr. capture all the doubt and desire of infidelity with an alluring sensuality and consideration for the feelings of all involved in an affair. We get moments with an unsatisfied lonely housewife, disappointed husband, innocent child, and insatiable other man. Author Claude Chabrol’s is fascinating with twists and turns. I’m fascinated at how Lyne’s direction makes romantic moments suddenly feel eerie as you witness a loving relationship fall apart. I love the sheer passion, lustful sex, dark twists, and ambiguous ending. Casting directors Kerry Barden, Billy Hopkins, Suzanne Smith Crowley, and Mark Bennett cast everyone in this from Dewey in Malcolm in the Middle to Junior from The Sopranos.\n\nDiane Lane is wonderful as Unfaithful’s lonely and horny heroine Constance Sumner. Lane is portrayed as heartlessly unfaithful, shamelessly sexual, brazenly lusting for more, and devastated by guilt. Her performance goes from charming to shocking to sorrowful until her final dejection. Richard Gere is interesting and chilling as the forlorn husband Edward Sumner, initially upset and disappointed that his wife is cheating. Gere twisting into rage, then succumbing to acceptance is enthralling to watch. His heartbroken to outraged faces pack a hard punch.\n\nOlivier Martinez is excellent as the openly flirty cheater Paul Martel. He is captivating and heinously horny as the brazen book seller, who steals Constance’s heart. Erik Per Sullivan is funny and quite sad as the son Charlie Sumner, who doesn’t understand why his parents are acting estranged suddenly. Chad Lowe is great as the indignant employee Bill Stone, who happens to see the affair. Dominic Chianese is amusing to see as the private investigator Frank Wilson, who takes no pleasure in reporting the scandal with professional grade photos\n\nMichelle Monaghan gets a quick cameo as the attentive secretary Lindsay, early in her acting career. Kate Burton is entertaining as the gossiping friend Tracy, who is very nosy. Margaret Colin is also amusing as the other wife Sally, who happens to run into Constance. Željko Ivanek does a great job of looking like he knows everything already as Detective Dean. Gary Basaraba is likewise cunning and subtle as Detective Mirojnick.\n\nEditor Anne V. Coates delivers some of the finest editing for any film I have ever seen. From montages of wild sex juxtaposed to pleasant memories of playing with her son, Unfaithful constantly visually reminds the audience of the affair. Her cuts are dreamy and perceptive. Each touch of the skin or gaze into eyes feels meaningful. Cinematographer Peter Biziou shooting each sensual moment in tender close-up shots feels more intimate. I found the wide shots of New York and Biziou’s careful framing of Lane as isolated or boxed in to be fascinating. Lighting from Russ Engels creates killer silhouettes of Gere enshrouded in darkness as the affair consumes his mind.\n\nComposer Jan A. P. Kaczmarek’s beautiful film score is astonishingly romantic. I think all of the melodies are gentle and emotional. Sound designers Paul Massey, Doug Hemphill, Andy Nelson, Anna Behlmer, James Bolt, Alan Rankin, Randy Kelley, Harry Cohen, Wade Wilson, Craig S. Jaeger, Jeffrey Wilhoit, James Moriana, Nerses Gezalyan, Greg Zimmerman, Robert Renga, Craig Heath, Tim Gomillion, Dennis Rogers, Tod A. Maitland, Wylie Stateman, and Gregg Baxter create an overbearing atmosphere of guilt. The rushes of gusts of wind to loud moans or quiet whispers all sound great. Costume designer Ellen Mirojnick crafts sultry gowns, dresses, sweaters, and blouses to ensure Diane Lane looks truly sexy. Makeup artists Joseph A. Campayno and LuAnn Claps go for beautiful aesthetics. Hairstylists Candy L. Walken and Lyndell Quiyou give Lane the waves in her hair.\n\nOverall, I believe Unfaithful is outstanding in its creative filmmaking and strong performances. Adrian Lyne’s fantastic direction is only matched by Anne V. Coates’ all time grand editing choices that show female sexual liberation. Diane Lane delivers her finest dramatic acting in a complex performance as Unfaithful’s femme fatale. Unfaithful is 124 minutes of sexual tension and guilt release.",
    "date": "2024-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This was my second time watching this and my feelings are still the same. I'm not a fan of this movie. Someone tell me, was that a tornado that struck New York that brought the 2 players together? This is when you know that the story is going to be ridiculous and it was. The acting was fine and so was Olivier Martinez but the plot didn't add up. The reason for cheating is implied but not fully explained. The ending is worse than the tornado that only effects 2 people. I thought Freddie Kruger was going to show up at one point. Has potential but it was wasted.",
    "date": "2024-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Richard Gere is one of my favorite actors and he was the wrong choice for this role.  I think he is too good looking and too likeable, I can't imagine being married to someone like that and having an affair.  There is no basis for the wife's discontent and then an affair.  All the actors did a good job and the movie made me sad",
    "date": "2024-03-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Far from perfect (Gere's performance is a bit of a drag) but a decidedly better erotic thriller than we typically get. Here Lyne keeps a mundane and less sensational ending that feels more honest than the genre typically allows. Also Diane Lane gives a hell of a performance.",
    "date": "2024-01-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Despite the movie's description as a thriller, it looks more like an erotic-romantic drama about infidelity. The first part is too slow for being a thriller, and only in the second half suspense appears. But contrary to what the critic's consensus says, I consider the ending quite satisfactory.",
    "date": "2023-12-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I think I've watched this film 3 or 4 times over the years and still I haven't watched it enough. The chemistry between all the actors is just incredible. There are so many layers to this film and so very thought provoking! The soundtrack really is the cherry on the cake! Beautiful, beautiful, memorising film!",
    "date": "2023-12-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Director Adrian Lyne really wraps you up in this slow burning tale of a picturesque marriage heavily fractured by a seemingly shallow affair",
    "date": "2023-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Sometimes being simple with a story pays off at the end of the day.",
    "date": "2023-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "They both annoy me. French accent sucks. Hate this movie.",
    "date": "2023-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I remember seeing this in a movie theater- and it was very exciting, and sexy- the crowd was super into it and we were loving Diane Lane- and then, the movie jumped the shark.   You'll know where.    If they would have kept it realistic, and about relationships- without fear that the audience was going to get bored-it could have been great.  But- they under estimated the audiences intelligence and ruined the whole thing.   I rewatch the first half of this movie sometimes, because Adrienne Lynn films are beautiful- but I never watch the 2nd half.",
    "date": "2023-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "\"Unfaithful\" seems like it is going to play out one way for a lot of it, and then suddenly it changes gears pretty close to wrapping up. The movie is a pretty decent drama with some interesting ideas and solid lead performances. The movie doesn't really have much to root for or get invested in and really is just a presentation of a sad and frustrating situation. I do think the movie could have gotten a lot more complex with its subject and delivered a more impactful ending. While these gripes do take me out of it, I do think this is a fair movie that has qualities worth mentioning, most notably Diane Lane and Richard Gere's performances. Overall, the movie finds itself stuck in a limbo between being trashy and actually something profound, which makes the experience of watching it just okay despite how bleak it is.",
    "date": "2023-08-18"
  }
]