[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The film is bad in every possible way. EVERY! They took a global bestseller and ruined it completely—why? The many screenwriters are incompetent. The many producers even more so. And the only explanation for why the actors agreed to be in such a terrible script is money. Embarrassing. I can only warn you not to watch this poorly acted, poorly directed, and poorly produced film. (sooo many producers, unreal) Swiss cheese has fewer plot holes, and paint drying on the wall is more exciting to watch.",
    "date": "2025-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Well-acted and worth a watch. Very heart-wrenching, though.",
    "date": "2025-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I liked it more that I thought, was fast, different countries, different killings, I definitely knew they were the killers, so bad that they never knew the truth",
    "date": "2025-03-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Plot line is garbage  acting is terrible and it's an absolute waste of time.",
    "date": "2025-01-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The handwriting on the postcards was never brought up ?!?",
    "date": "2024-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "As far as mystery suspense goes, it’s watchable despite an unbalanced, quick paced plot that isn’t as clear as it could be early on, only to become plodding and too convenient in the second half while the twisted nature of the twist is more twisted than the twistedness of the twist itself in relation to the rest of the plot.",
    "date": "2024-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Filme: Postais Mortiferos\t\tAssistido: 19-8-24\nElenco: @jeffreydeanmorgan @famkefatale @cushjumbohere \nModelo: #policial #suspense\nDuração: 1h 44m\tAno: 2020\nMinha opinião: Um filme policial com um serial Killer como em colecionador de Ossos, Seven, Ressurreição,..... Neste filme temos Jacob (Jeffrey Dean) e Valerie (Famke Janssen) são um casal, quando a policia na França encotra sua filha morta com seu marido. E Jacob que é detetive nos EUA, viajar para reconhecer o corpo. Neste drama, suspense. Após reconhecer e perceber que a policia não tem nada e que não farão mais nada ele começa a investigar por si próprio. E para isso ele vai seguindo pistas eque o leva a outro país. Até descobrir que na verdade existem outros casais que também foram mortos e que a forma como os cadáveres são postos, elas representam uma obra este estilo lembra o filme Ressurreição que também recriava obras, porem de forma de arte ou Seven que era dos Sete Pecados Capitais. Lembrando que o casal foi abordado por um outro casal, onde fazem amizade. E o filme vai fazendo um paralelo com oque ocorreu com o casal jovem e o presente onde Jacob procura o assassino. Até que o serial envia postais e que na verdade a cada assassinato parte dos corpos são usados e membros sendo colocado na cenado crime de forma aleatória a cada novo assassinato. Até que Jacob descobre e consegue descobrir que na verdade o casal que imaginavam eram na verdade irmãos e que seu pai esta na prisão. E que ele oprimia seus filhos com estórias e levando a conhecer tudo sobre arte. E essa pressão causa neles distúrbios que os transformam nesses assassinos e sem medo de morrer. Até que se descobre tudo e que são rsponsaveis. Agora Jacob tem que salvar mais um casal da morte. E o casal pego. Assim Jacob consegue se vingar. Um filme que não deu a mesma liga que os outros aqui comentado. Um filme mediano, que não trouxe a mesma imersão.\nRoteiro e enredo mediano. \nVale apena assistir? Se não tiver outra opção.\nNota: 5",
    "date": "2024-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I wish I had THAT two hours back......\nThe twist comes in the middle, when you discover that who you thought would be the \"KILLEES\" are actually the KILLERS.\n\nI'd normally be concerned that that's too big of a spoiler--but in the case of this boring thing that put me to sleep, I'll let it stand.\n\nIt devolves and turns into a one-dimension melodrama--and a fairly dull one, at that, once the mystery is removed.\n\nBesides, I just can't forgive Nagen for murdering Glenn. He'll always have some real retribution coming, in my book.",
    "date": "2024-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Incredibly frustrating mystery that only gets solved by convenient clues out of nowhere.\n\nDirector Danis Tanović’s crime mystery thriller The Postcard Killings (2020) is so stupid. It seems normal, but writers Liz Marklund and James Patterson just have random side characters talk to the detective with crucial information right at the end, so that he can figure out that the two killers are using pseudonyms. It even goes so far as to almost make a case for why incest should be normalized as a legitimate type of love. That is the villains’ perspectives, so take that with a grain of salt, but The Postcard Killings is incredibly dumb.\n\nPatterson always leans into formulaic murder mystery fare, but this one gets increasingly ridiculous and nonsensical, that it ruins all the suspense from the first two thirds of the movie. It skips around too much and I could hardly follow what was happening or who anyone was talking about with the scattershot editing. The Postcard Killings is a textbook example of how not to do storytelling because it will confuse the audience.\n\nAmerican actor Jeffrey Dean Morgan is trying hard to be seriously invested and concerned as Jacob Kanon. Morgan is a great actor and has his compelling emotional moments here and adds some gravitas. However, he cannot entirely save a dull movie. He does nothing other than talk to a few investigators around Europe. Morgan must have gotten an easy vacation and paycheck for this because he’s given surprisingly little to do to solve this case. Dutch actress Famke Janssen is unrecognizable as Valerie Kanon and randomly solves the murderers’ backstories just on the side out of nowhere.\n\nBritish actress Cush Jumbo, yes that is her name, is so boring as journalist Dessie Lombard. She adds almost nothing here. German actor Joachim Król is interesting and engaging opposite Morgan as German Inspector Klaus Bublitz. English actor Steven Mackintosh is equally engaging as English Inspector Rupert Pearce until he mostly disappears. English actress Naomi Battrick seems charming, then just does a Mia Goth impression as Sylvia Randolph to be more strange. Irish actor Ruairi O'Connor is pretty passive and forgettable as Mac Randolph. American actor Denis O'Hare is very creepy and irritable as Simon Haysmith.\n\nSwedish actress Eva Röse is gorgeous as the strict Swedish police Detective Agneta Hoglund. I loved her here like Morgan, but she hardly helps the investigation. Dutch actor Dylan Devonald Smith does what he can to appear creepy as the odd traveler man Pieter, who meets the main couple alongside Dutch actress Sallie Harmsen as Nienke.\n\nEditor Sean Barton cuts all over the place between countries, time, and people, so I was thoroughly confused when and where we were watching. Cinematographer Salvatore Totino shoots The Postcard Killings like an NCIS episode. Rocky Evans’ lighting is standard with a bit of moody lighting and shadows here and there, but not enough for a dark crime mystery story like this one. Composer Simon Lacey’s music is not eerie, nor exciting enough for this narrative. Nigel Egerton’s costumes are very chic and modern at least.\n\nOverall, The Postcard Killings is not worth your time, not even as a fan of the cast or James Patterson’s writing.",
    "date": "2024-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Dreadful acting, dreadful movie.",
    "date": "2024-03-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Rate MA for \"gore\" is not an understatement. There is an interesting twist in the middle that I did not see coming. I enjoyed that! \nHowever, I loathe movies that end with a blatant invitation for a sequel.",
    "date": "2024-03-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was so titillating and Erie to watch unfold. I enjoy seeing The lead play a more heroic character and it was believable ! Even more so , you never whom was the bad culprit/s. I enjoyed this and I totally recommend!",
    "date": "2024-02-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Jeffrey Dean Morgan is a fantastic actor, but his acting could not save this movie.  The plot started off very interesting but the story got lost.  It become very slow and very boring, I almost could not finish this movie.",
    "date": "2024-02-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This movie held my attention to the very end. Jeffrey Dean Morgan was awesome.  Since a great deal of the action was in foreign countries I was initially afraid that much of the dialog would be interpreted, which can be distracting, but it was minimal and didn't detract from my attention. Overall I enjoyed the movie very much.",
    "date": "2024-02-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I liked this movie.  Interesting plot turns and characters.  Well acted.  Not a typical procedural crime drama.",
    "date": "2024-02-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It was an okay murder mystery",
    "date": "2024-02-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I so wanted to like this movie but it was terribly written. Police magically identify the killers and zero development of the characters other than the detective.",
    "date": "2024-02-04"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Acting and dialogue was horrible - really disappointing",
    "date": "2024-02-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Morgan gives a valiant effort to save this movie but the poor surface level directing and lazy dialogue prevents the audience from connecting with the flow of the scenes. This film lacks depth which prevents it from engaging the viewer.",
    "date": "2024-02-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Terrible. Weak story, poorly paced, and lots of plots holes.",
    "date": "2024-01-31"
  }
]