[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "First time greeting to know Marilyn. She was and is still a beautiful star",
    "date": "2025-04-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "i made it around 17mins in and am bored out of my mind.",
    "date": "2023-10-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Interesting overall to listen to the story that was presented, but still leaves it open and doesn't prove anything conclusively other than that the Kennedy's were involved.",
    "date": "2022-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I saw it with family who were interested.  It was tedious and didn't arrive to any real conclusions, other than there were some issues unresolved!  It was on Netflix.",
    "date": "2022-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It doesn't add anything to the facts and/or established conspiracy theories surrounding Monroe's life and death.  Stock footage of cassette players and grainy recreations of actors lip-syncing recorded conversations make for a boring documentary.",
    "date": "2022-05-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "some interesting clips but overall did not solve the mystery or really add much to what was already known",
    "date": "2022-05-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I found this to be a quite competent documentary on Monroe's life and her passing, especially of her time searching for true love and wanting to comforting embrace of such love and her own family. That she only had brief stretches of such a life in her time, and was used by so many is simply the sad, earnest truth of the matter. And for all those critics and others who have given this such poor reviews, I just have to say: You can't handle the truth! \nThe title of this doc includes the words 'the unheard tapes'. So if the very real probability of hearing dark, tawdry, harsh recordings and recollections of an iniquitous nature is something that you know would put you off, yet you watch it anyway (not considering critics whose job it was to watch), then that's on you and your voyeurism, so stop with the hypocrisy. 3 stars",
    "date": "2022-05-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Bit disappointed. Definitely not what I expected from a Netflix documentary.",
    "date": "2022-05-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A new Netflix documentary goes back to the extenuating circumstances surrounding Marilyn Monroe's death. The documentary follows journalist Anthony Summers findings, with previously unreleased recordings from former directors, costars, and cast all commentating about their experiences with Marilyn. Much of the documentary is fluff with her history of growing up as an orphan, her failed marriages, and depression/mental instability before finally revealing her relationship with both John and Bobby Kennedy. This documentary hinges itself on the fact that many of these conversations have never been heard before and while that in itself is rather revealing to hear what her peers thought about her, the conclusion around her mysterious death does nothing to shine a new light on it. An ample film that brings Marilyn back into the forefront with titillating, recorded conversations, but again, does nothing in the end to close the book on her demise.",
    "date": "2022-05-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I thought the movie got another name, The Unheard Boring As Fuck Tapes",
    "date": "2022-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "We love Netflix shows and documentaries.  Not this one.  Learned some heartbreaking things about the effervescent and beautiful Monroe and her complicated relationships, yet many holes in this rendition of the \"truth\".  Our takeaway was, just as before, unless you were there in the room that night and willing or able to talk, we can only continue to conjecture and guess about what happened.  The fact that both Kennedys were assassinated themselves shortly after are also clouded in mystery.  Here's what we want to know:  An American ambulance picks up a comatose person, not to mention a mega celebrity, then turns around and brings her back home instead of to a local hospital.  C'mon now.  If that actually happened, even more than ever, things aren't looking so \"accidental\".",
    "date": "2022-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Just watched and it just shows what we already know. \nWhere are those tapes that were bugged?Those tapes will tell the truth and my god, we need it but especially Marilyn needs to be put at rest once and for all. \nAnd for us all to stop speculating what happened and what the truth is. The facts are still not shown on what really happened that night only he said and she said. The documentary also says she wanted to make \"love\" to her Father is grotesque to say the least and isn't something I cannot imagine her saying. The tapes are not unheard, all true Marilyn fans have heard these. Again unfortunately another money-making machine that has failed and quite boring really to say the least.",
    "date": "2022-04-27"
  }
]