[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not fir me.\nMuch was inaudible, more like fantasy of middle earth.\nLong spells of grunting and darkness. Entertainment it's not nor is it education.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Terrible. The main character burns women and children alive. Cheesy predictable plot. The most worthless $4 I've ever spent.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A Vengeful Epic That Drags.\n\nThe Northman is a punishing Viking epic that overwhelms with brutal realism, but its relentless grimness and repetitive cycles of violence blunt the mythic power, leaving a saga more exhausting than exhilarating. Alexander Skarsgård’s Amleth broods with intensity, but the narrative’s unyielding march—raids, visions, betrayals—stifles emotional breathing room, making the 2022 historical trend feel more slog than spectacle. Nicole Kidman’s fractured matriarch and Anya Taylor-Joy’s cunning ally tease complexity, but their roles are sidelined in the blood-drenched haze. Eggers’ visceral craft, from volcanic rituals to shadowy cinematography, enchants, but the pacing falters, failing to elevate fate’s tragedy beyond a cycle of fury. What could have been a profound Norse meditation devolves into a mud-soaked endurance test, a near-triumph marred by its own unyielding ferocity.",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It actually was pretty good. It's not the genre of movies I'm very familiar with, I mean I don't usually watch smth of these sorts, but I could not help myself but watch it because of the cast. The entire movie is based on the novel and it tells a story of the man who lived in the medieval ages who seeks revenge and what he is ready to do for it. I really enjoyed it.",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Despite liking most of the cast, and the impressive scenery, this was a dumb movie. The plot was optional and the story was forgettable. I was so excited about this I bought it without seeing it on streaming... normally I love these kinds of movies... this was an \"ok\" idea with horrible execution. It now sits in a pile of movies I'll watch once and never again.\n\nThe performances were fine. The writing just... sucked.",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This movie is a classic case of, watch the trailer… and you seen the best parts of the movie.",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "daark and brutal love it!",
    "date": "2025-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The Northman is a visually striking and brutally ambitious film, helmed by director Robert Eggers, who once again proves his mastery of atmosphere and tone. Alexander Skarsgård delivers a powerful and deeply committed performance, fully embodying the rage and raw physicality of his vengeful Viking character. From the opening frames, it’s clear this is a movie made with precision and passion — every shot feels meticulously crafted, every detail steeped in authenticity.\n\nFrom a cinematic standpoint, the film is nothing short of spectacular. Eggers captures the brutality and mysticism of the Viking world with an almost operatic intensity. The production design, costumes, and breathtaking landscapes all come together to create a fully immersive experience. It’s a visual triumph that balances primal violence with haunting beauty. On a technical level, The Northman succeeds in every sense, elevating itself beyond the typical revenge epic.\n\nThat said, while I can appreciate its craftsmanship, the movie didn’t completely work for me on an emotional level. It’s heavy on dialogue and introspection, often prioritizing mood and mythology over momentum. The pacing can feel slow, and the story occasionally gets bogged down in philosophical exchanges that, while thematically rich, sap the film of the visceral energy that audiences might expect from a Viking revenge saga.\n\nThe screenplay, though thoughtful, could have benefited from tighter storytelling and a stronger balance between action and character development. There are moments where the dialogue feels overly stylized, creating a disconnect between the viewer and the raw human emotion at the film’s core. Instead of feeling fully immersed in the journey, I often found myself waiting for something to happen.\n\nStill, it’s impossible to deny the artistry behind The Northman. Skarsgård’s performance, combined with Eggers’ direction, gives the film a mythic power that will resonate deeply with certain audiences. For those who appreciate slow-burn storytelling, historical realism, and symbolic depth, this film is an unforgettable experience.\n\nUltimately, while I respect The Northman as a cinematic achievement and understand why it’s beloved by fans of the genre, it didn’t quite connect with me personally. It’s beautifully made, but its deliberate pacing and dialogue-heavy structure kept me at a distance. A stunning film on a technical level — just not one that left me emotionally moved or eager to revisit.",
    "date": "2025-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I was so excited for this before it came out.  I was 100% disappointed.  Acting and action was not good.  Only one good action scene.  I think there are other way better Vikings movies than this.",
    "date": "2025-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of my all time favorite movies",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Alles gut etwas düster ist halt so...",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A fantastic movie, no notes",
    "date": "2025-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I am not a fan of Eggers'. I don't like those long close-ups, witchcraft, and those imagery scenes",
    "date": "2025-10-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Beautifully shot and amazing set design and really great cast but story is really terrific that it reminds Conan the Barbarian in the good way but also is absolutely the bloodiest revenge viking film ever.",
    "date": "2025-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is special. It manages to tell a tale that sees it's own inevitable myth being built before our eyes. The depth of setting and the effort on conjuring believable and interesting details, sets and settings pays off in spades. A true tale of violence and revenge, myths and the actions that build them. The skin of your life has already been written! You cannot escape your fate.",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This film stayed true to the roots of old culture. Every variety of emotion was displayed throughout. Amazing CGI, storywriting, and finished off with a stoic ending. This most definitely could of been made into an instant classic TV series, out of spite i'm taking half a star off for such elite filmmaking.",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Very long movie; but it never felt dull. \nThere were lots of moving parts but it also felt like everything was included for a reason. \n\nLots of very big names in this movie but almost none of them aside from Willem Dafoe were recognizable (this is a plus). \n\nI was immersed in the world, storytelling. As someone who struggles to watch movies; I was pleasantly surprised by this one.",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Beautifully shot. Intense battles. Magic and mayhem",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I liked the film. I enjoyed the 13th Warrior and similar films so if that is your cup of tea you will like this. I can see it not appealing to everyone, but if you like that “Viking” edge you will like this.",
    "date": "2025-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "this movie made me make a big stinky in my pants",
    "date": "2025-09-08"
  }
]