[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Absolutely crazy how you can have such an interesting and relevant topic and real people to talk to, and they made it into the weirdest overly used AI images and strange random robotic voice over. I was so interested but this was unbearable to watch. Was this produced by high school kids? Honestly it was so bizarre.",
    "date": "2025-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The documentary is primarily characterized by annoying animation, peculiar voiceovers, and unconventional/weird editing, seemingly aimed at being \"cool.\" This approach detracts from its potential to educate viewers on overconsumption and its impact on daily life. Unfortunately, it fails to provide any new or meaningful insights. I learned absolutely nothing watching this documentry. Don't waste your time!",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I absolutely LOVE how they portrayed Sasha, the AI that accompanies you throughout the documentary. Especially the ending; that blew me away. She built up all the way to this \"surprise\", only to reveal there was none in the end. That she lied and regrets nothing. I think it really hammered in the theme that \"Hey, these corporations are scumbags!\", and wow, was I impressed. It's... It's incredible. And even more so that it's a freaking robot. Because we tend to forget that... at the end of it all, corporations are not people.",
    "date": "2025-05-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "2 minute news spots padded with animations and cut shots",
    "date": "2025-05-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I was hooked from the get go. I now feel the need to wait before buying! My eyes have been opened to giving things away or throwing them away.. AWAY is here damaging our future. It's a must watch for everyone.",
    "date": "2025-04-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Enjoyed the film, there were some interesting stories from people up to CEO level in FMCG companies, and people in waste management, but it could have been so more. Some shocking figures, eg 190,000 garments manufactured every minute, but it didn't delve any deeper. Mentioned microplastics, for about 30 seconds; the recycling farce but didn't elaborate much; \"donated\" waste sent to Africa but just showed a polluted beach. There was little shock value, very underpowered, no real warning of where this will lead us, and the film was packed with AI graphics, seemingly like it was intended for instagram - which may have been deliberate as that may be the target.  In the end it was interesting but with no clear threatened outcome, it was overall too watered down to be alarming - or to make a difference.",
    "date": "2025-02-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Major disappointment. There is important information in this film that is well worth hearing.  But the majority of the film is all these weird AI visuals and audio that bridge the gaps between tidbits of actually interesting and useful soundbites from the interviewees.",
    "date": "2025-01-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The editing was very gimmicky and annoying and I believe they’re using lots of AI for the imaging and that is frustrating. The people they interviewed are great but don’t get enough time to speak",
    "date": "2025-01-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "\"Buy Now\" is ipnotizing\n\nOne of the most thoughtful video I've seen in a while. You should watch it.\nThe story is told in a way it can be seen with the right eyes. It clearly\nshows how the people behind the movie are neat in their fight against the\n\"system\" (I know, bloated word but yeah, let's call it that way).\nIt makes sure to grab your attention, in the way you're used to,\nwhen you scroll and you see a \"Buy Now\" button and bunch of bright\ncolors. Not by keep you looking at just a sad, insanely rich footage of\ndumpsters accumulating waste every second. No, they make it so nice and tidy,\nyet somewhat twisted, even picturing and visualizing the data about how many\nsmartphones are produced every day, by making it pop out of the streets in\ncomputer graphic. So yeah, it's cool, you're watching. And then they\nsay something insane like \"yes, I worked ad Amazon for years, I know what\nI'm saying and they fired me. this is where we are\". And there you're not\njust watching. You're listening. And you see the truth. Naked. You see\nall the things you've been ignoring without even knowing, and you're\nnot just called to action, you're really called to think deeply about\nwhat you care about and why. Because that's what you're doing, no\nmatter how anesthetized you are. And if by any chance you feel like\nyou're now, while watching the documentary, out there opening the\nTruman Show's door, keep that door open, you're waking up, don't fall back asleep.\nAnd don't be scared. You can stay by the door if you don't feel like\ndiving through it. It's ok. Just keep it open because\nit's there, and you should watch it for what it is, realize the world\nyou're into and fix things up while you're awake.",
    "date": "2025-01-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I can’t believe they were able to get such great people to interview, and then came out with THIS. There is nothing new here. Not only that, but the format is verybfrustrating. They needed to take all of the time spent on weird graphics/music/knock-off Alexa narrating, and put it into coming up with some intelegent questions to ask a panel of people who had the potential to be very very intresting.",
    "date": "2025-01-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Maps together the production and post consumption connections in an effort to show  the reality of marketing and manipulation , and exponential increases in over production and waste. It takes a while to get to the impact of waste piles, microplastics, and other toxins on our environment. Maybe starting with this might have helped with engagement.",
    "date": "2025-01-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "There isn't much in it that surprises, and some of the testimonies may be viewed as retaliation from disgruntled former bigco employees, but the material is attention-grabbing, from those testimonies to the CGI.",
    "date": "2025-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The special effects and weird narrator voice is so distracting. I almost turned it off. Unfortunately, there was so much overuse of fake digitally-created trash overlaid on cities around the world that by the time we got to the real piles in Thailand and Ghana, it didn't mean anything. The most frustrating part is that there is just no need for it. The rest of the documentary is good.",
    "date": "2025-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The information from the interviews is good. I hated the voice over and the air editing. This was listed as a documentary, but far from that. All the nonsense voice over editing of imaging and colors was awful made me really want to stop watching. If I could watch just the interviews and get the information with out all the non related nonsense it would be great",
    "date": "2025-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The interviews & information in this doc are important and have a great message.  Some of the visuals and methods of presenting it felt gimmicky and 'dumbed-down'.  That was annoying for a few minutes, but if you get past that....this documentary is fascinating and kept me engaged throughout",
    "date": "2024-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Everybody shoulg listen to this documentary",
    "date": "2024-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The overall message is good, but the presentation is just so weird.  So many filler graphics and a weird AI voice throughout and a very janky overall structure and pacing.  To be honest it kind of feels made by AI?\n\nThe so called experts they had on have no real solutions and honestly just come across as disgruntled former workers.  Of course they are so righteous and did nothing wrong.. yeah hard to believe.\n\nAgain the message is good but it needs more substance and someone to actually put it together coherently.\n\nAlso fear mongering imagery of cities buried in mountains of garbage.. obvious that they are trying the same manipulation tactics they are supposedly against.",
    "date": "2024-12-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Some parts such as music and AI was annoying but really and eye opener or rather a reminder of how bad things are and totally out of hand.\nLeft me with one question however. What is the alternative business model for Amazon, Apple etc and into what the fast fashion companies can transition which is not this… horror really- lets call it for what it is.",
    "date": "2024-12-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "If you are a \"First-World-Person\" that believes in all the nice labels about sustainabilty on the products you are buying, which certainly soothe your conscience, this documentary is not only a wake-up-call, it's a hit right to your face. \nIf after watching this flick you don't radically change your consumption habits you either don't have children, or you just don't care at all.",
    "date": "2024-12-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The style of this “documentary” is bad. It’s difficult to get through. It’s a 40 minute show with a marginally interesting message stretched by so much fluff that I wanted to tear my own arm off and beat myself with it.",
    "date": "2024-12-23"
  }
]