[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Uma sequência impecável, tudo nesse filme é bom. A trilha sonora é maravilhosa, uma das melhores do estúdio dreanworks. O filme é um dos meus favoritos dentro e fora do estudio. O vilão é muito bom.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "AND ITS NOT THE SLIGTEST BIT OF FRIGHTNING(music in backround)",
    "date": "2025-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Kung Fu Panda 3 is funny, action-packed fun and my favorite entry in the series.",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "My first question is: Why does this movie gets so much negative in certain things? Let me correct that for you all. The positives: First of all this movie was an amazing conclusion to the franchise until the 4th one. The animation and visuals are even better than the previous 2. The opening scene where Oogway fights Kai the main villain is so badass and amazing. I really liked the return of Oogway in a meaningful way. Also Kai is still a great villain, his design is so cool and badass. The soundtrack and Kai's main theme song is perfect. Po's actual dad is a great new character with a great voice acting. I also enjoyed how Mr.ping became a way more important character in this movie than the previous 2.  The humour was still great and the montages of the training of the pandas is so well done. Amazing animation and visuals during the main battles of this movie. I also enjoyed the quotes of master Shifu. The negatives: Despite this movie was a great conclusion to the franchise until the 4th one theres still some flaws but that didn't annoy me much. Kai's backstory and motivations for being evil was kind of weak and not reaching the levels of the previous 2 villains he feels like a rage monster more. The pacing of the movie is a bit weird but not too bad. They abused a bit the humour stuff but still enjoyable. Finally, this was a great conclusion of the franchise before the 4th one. I would really recommend it to watch it and it's quite entertaining and fun.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Pretty fun to watch and a lot of humor",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Filme meio fraco,mais tá muito longe de ser ruim 4,5/10",
    "date": "2025-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Honestly the series should have ended here. It’s a perfect conclusion to both it and the characters, and has a lot for both old and new fans of the series",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not a bad movie, but has some flaws when compared to the first two. The villain has very good design but kind of comes out of no where. I think he didn't have as much build up and didn't have the same fire the other two villains did. This movie is a 6/10 for me.",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Kung Fu Panda 3 (2016) is a film that starts off quite nice with incredible visuals, but its villain is pretty bad. It may even be a very solid trilogy, but this one is still missing something.",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This third kung fu panda movie was also lame and this movie also sucks just like the second and first kung fu panda movies and just like shrek and this movie's budget was a waste of a million dollars and money and a waste of time just like shrek.",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Like its predecessors, Kung Fu Panda 3 is filled with humor and action to entertain the whole family.",
    "date": "2025-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Bello, il cattivo regge la scena, il protagonista però non è più quello del primo film... Non diverte così tanto e la trama e il contenuto non reggono il confronto con il primo capitolo, forse con il secondo.",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's a fun movie, the other 2 are better though",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie made me even more hungry",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "While for me it may be the least biggest entry of the franchise, I think this movie was still entertaining, enjoyable and fun to watch, I wish the story could have been a little more expanded on the characters and be more serious because I see here that it goes down a little, I felt the movie’s ending really was a satisfying closure to the franchise but… well (Kung Fu Panda 4 came out)",
    "date": "2025-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The story of Apo ended well, but it was not complete.",
    "date": "2025-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Po (Jack Black), the mighty Dragon Warrior, must learn a new technique in order to challenge a resurrected foe (JK Simmons) of his master.\n\nAlthough this is the weakest narratively of the first three, the animation has improved.  Visually stunning for certain.  It's fun and light as we'd expect.  And we have Simmons impressively chewing the virtual scenery.",
    "date": "2025-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 01 hour, 34 minutes, and 54 seconds!!!!!!!!!!!!! Rated PG for Some Mild Rude Humor and Martial Arts Action!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $143,500,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Now as attractions worldwide!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Did not like the villain in this movie. He was just not really related to the culture . Felt American bull.\n \nRotten tomatoes: 3/5",
    "date": "2025-06-13"
  }
]