[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I will never understand why this movie isn't a cult classic. Everything about it was perfect, the casting, the directing, the script, etc. Great action, funny AF, hot Zoe Saldana scenes, just about all you'd want from an action thriller. One of the most underrated movies of all time (tied with Cop Out).",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "fUnNY MoVie 🤪",
    "date": "2025-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1 hour and 37 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated PG-13 for Language, A Scene of Sensuality, Sequences of Intense Action and Violence!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $23,600,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It is a watchable action film. Good action scenes, some good performances from a great cast. Certainly worth a look.",
    "date": "2025-05-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Losers has an ensemble cast with great action and performances, weak script though. I’m amazed this movie came out 15 years ago.",
    "date": "2025-05-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I struggle to find positives other than the casting in this chaotic, mindless action flick which struggles to really take a stand on where it wants to be. Is it a comedy? Is it a drama? Is it an action flick? Even the film can't decide most of the time. \n\nThe first act blasts us into believing this is a great film. A mysterious untraceable villian and a gang of special forces who all have their own unique skill set. Excellent. A mysterious woman wanting to aid the group to extract revenge. Excellent. Then it nose dives off a cliff when the villian is revealed and who is supposed to be an unhinged psychopath but the reality is you cannot take him seriously at all. The acting is terrible. It's like a kid got a hold of his dad's suit and played pretend dress up saying mean things to sound cool. The villian just tries so hard to portray a sinister unhinged madman that it goes too far in the opposite direction to be laughable and cringe worthy. \n\nBy the time the finale takes place you are left with a lot more questions than answers. Like how did the woman find them? Where did the villian go? Why was there a need for that plot twist and how did it ever happen? What happened to the villians hand? Why do I care? What have I just watched? Clearly filmed with the intention of a franchise, the film ends offering you more but it delivered nothing in the first place for you to want more. Flopping at the box office this was always destined for a bargain bucket and any hope of a sequel is long long gone, much like your interest when you get to the end of this film.",
    "date": "2025-04-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Ever watched a movie that has a lot of elements of a good movie, but somehow isn't a good movie?  And you can't quite put your finger on why?  This is one of those.\n\n\nHas some pretty good actors, some good action scenes, and even some good funny bits, but it just doesn't come together in a cohesive movie.\n\n\nIt's possible the plot, which is pretty simple, even for an action movie.  The antagonist is pretty unconvincing as well.  I'm also beginning to think that Jeffery Dean Morgan just isn't a good movie protagonist.  His acting here just felt like his character in the Watchmen.  Arsehole American, that is somehow a good guy.  It just doesn't work.\n\n\nSkinny, American accent, Idris was also a bit off putting.  And Oscar Jeanada's character was cliché to the point of being almost tokenism and insulting.  The director and writers need a slap up side of head for that.\n\n\nChris Evans, however, was a stand out in this.\n\n\nAt the end of the day it felt like a setup for a DC franchise that just didn't clear enough hurdles to get another movie.",
    "date": "2025-03-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "(CASTELLANO) Los perdedores es una de esas películas de acción que no se complican la vida. Sabe lo que es y lo aprovecha al máximo: un entretenimiento ligero con explosiones, tiroteos y un grupo de personajes carismáticos que parecen sacados directamente de las viñetas. Y es que, al fin y al cabo, su origen está en un cómic de DC. Se nota en su estilo visual y en el tono exagerado de muchas escenas, que juegan con la espectacularidad sin tomarse demasiado en serio.\n\nEl reparto, visto hoy, es un auténtico lujo. En 2010, Chris Evans, Zoe Saldaña e Idris Elba aún no eran estrellas de primer nivel, pero ya tenían una presencia magnética en pantalla. Su química es innegable y le da mucha vida a la película, logrando que incluso los momentos más exagerados funcionen. La historia en sí no inventa nada nuevo: el típico equipo traicionado que busca venganza, pero el ritmo dinámico y el humor hacen que todo fluya sin volverse pesada.\n\nNo todo funciona igual de bien. El abuso de la cámara lenta y ciertas decisiones de montaje acaban volviéndose repetitivas, y el villano, en lugar de imponer, se siente más como una caricatura exagerada que nunca representa una amenaza real. Aun así, Los perdedores no pretende ser más de lo que es, y en ese sentido cumple. Si buscas una película de acción sin complicaciones, con escenas espectaculares y un grupo de protagonistas que se lo pasan bien, esta es una opción más que válida.\n\n(ENGLISH) The Losers is one of those action movies that doesn’t overthink things. It knows exactly what it is and makes the most of it: a lighthearted, explosive ride filled with shootouts and a group of charismatic characters that seem straight out of the comic book pages. And that makes sense—after all, it's based on a DC comic. You can see it in the visual style and the over-the-top tone of many scenes, which embrace spectacle without taking themselves too seriously.\n\nLooking back, the cast is now a powerhouse. In 2010, Chris Evans, Zoe Saldaña, and Idris Elba weren’t yet the huge stars they are today, but they already had undeniable screen presence. Their chemistry is one of the movie’s strongest assets, making even the most absurd moments work. The story doesn’t break any new ground—it’s the classic setup of a betrayed team seeking revenge—but the fast pace and humor keep it from dragging.\n\nNot everything works perfectly. The excessive use of slow-motion and some editing choices become repetitive, and the villain, instead of being truly menacing, feels more like an over-the-top caricature that never poses a real threat. Still, The Losers doesn’t try to be more than it is, and in that regard, it delivers. If you’re looking for an uncomplicated action flick with spectacular set pieces and a cast that’s clearly having fun, this one is a solid choice.",
    "date": "2025-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Predictable \nFun \nMan eye candy\nWay better than the stuff being made today. \nIf you like to see things get blown up, this works. If you're looking for acadamy awards performances .....nope. You won't see it here. If you're looking for anything better than 90% of the movies in the past 2 years....BINGO!",
    "date": "2025-01-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "While it isn't the worst film I've ever seen, it's a wonder why I believe it's possibly one of the most boring films I've ever seen. With a stacked cast of actors I absolutely adore with the likes of Chris Evans, Jeffrey Dean Morgan, Idris Elba, and Zoë Saldana, and very good acting all across the board, it is honestly shocking how indifferent I feel to this movie. It feels tacky and a little too campy, and forced scenes all around with characters doing off-the-wall actions that I found myself asking “Why?” to. The only thing I truly liked was the fight against Jason Patric’s men and the traitor *SPOILER ALERT* who turned out to be Idris Elba. Which made for a beautiful fight between Jeffrey Dean Morgan and Idris Elba as they give their all to try and kill each other once and for all, but make the fatal mistake of cowardice which seals one of their fates. With great humor and admittedly amazing beginning and ending sequences, it is still enjoyable, but with a middle that seems so empty and void of real substance, it just gets pegged down a notch.",
    "date": "2025-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Não é perfeito, aliás, passa longe da perfeição, mas é um filme de ação divertido, com um puta elenco, e a parte da comédia é divertida também!",
    "date": "2024-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The Losers isn't even sort of great, but a charming cast and stylish action makes the movie above average.",
    "date": "2024-10-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Entertaining. Funny. Great soundtrack. Sad that there isn't a sequel.",
    "date": "2024-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thought it was amusing. Great action scenes.",
    "date": "2024-05-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Extremely underrated, really enjoyed it.",
    "date": "2024-04-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "50/100 - passed the time. off wit humor, mid everything",
    "date": "2023-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Don't go by the negative reviews on this one !   It's a sneaky good movie that not many have seen!  Its action is only out done by its comedy! I loved this movie when I had no idea what to expect.  This is a must on a night when you're looking for a movie you haven't seen…",
    "date": "2023-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "no es una mala cinta o producción ya que se nota el buen presupuesto ,la calidad actoral distinguida ademas de ser una cinta entretenida ,con buenos momentos de acción y personajes carismáticos, el filme queda a deber un poco en su genero de acción ademas de eso tal vez la cinta es una monótona idea ya vista en otros muchos filmes ,en resumen entrega lo que ofrece entretenimiento divertido y explosivo.",
    "date": "2023-06-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Year: 2010\nPrompt: An action flick starring an ensemble cast, in a team, based on an existing property.\nTurn-ins: 4.\nNames: Sylvian White's \"The Losers\", Joe Carnahan's \"The A-Team\", Sylvester Stallone's \"The Expendables\", Robert Schwentke's \"Red\"\nNone of the projects above were graded bad or great as they've defined their own average standards in between with comparable explosive, quippy merits. \"The Expendables\", though doesn't qualify under the given prompt, is considerably the best with the genre's veterans' prolific calibers, followed by \"Red\" with similar assembly across age and capability, then \"The A-Team\" carries the most charisma underlining faithful replication. Then we have \"The Losers\", ironically being the least at the shared average's standardized minimum, is down as your ordinary action flick multiplied by the number of teammates dealing with the narratively problematic treatment with portions tackled better in other pictures. An excellent cast wittedly equipped provides the fun definition behind their own unique action pieces that were cleverly built, just not enough boost to prove itself above average but worth the view when only asking for simple fun rather than be like the others' performative assets. (B)",
    "date": "2023-02-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Classic Super-Hero movie without capes\n\nIf you like plot-work reminiscent of the classic superhero comics, and want to see an action movie that packs the punch and keeps the pace at a high level while never letting down with dialogue, then this is the movie I recommend. It is about a fringe group of soldiers for the United States who end up AWOL, and in some ways may remind you of GI Joe. However, there is no Predator in these jungles, and instead, the action-adventure that ensues is priceless. This is one of my favorite action movies of all time. There are no capes, there aren't a bunch of guys running around in tights, there's no Secret Service budget or 007 dramatics, there's just normal guys with machine guns. The main character is also from Watchmen, the Comedian, and is a solid action actor, and good choice for lead, with supporting actors including Idris Elba and Chris Evans, the selection of actors is fun. It's a gang of guys and one lady outfitted with different specs, who work together like a Charles Bronson Death Wish Voltron. It works.",
    "date": "2022-12-31"
  }
]