[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Weak, tried way to hard to convince us that this was an epic discovery made by an \"Egyptian Expert\". Nope.",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very very intresting, wish we got to see more!",
    "date": "2025-02-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This guy wants to be remembered.  We will remember him! Remembered for wanting to be right. Remembered for being a horrible scientist. Remembered for all the wrong facts he's put out since the 60s. Remembered for never telling the real story. I'm watching this hack and remembering",
    "date": "2024-03-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Anything with that corrupt lying thief Zahi Hawass I will not watch!!!",
    "date": "2023-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Really great camera work. You're right down in the tombs with the archaeologists. Subtitles is a must though if you're an English speaker.",
    "date": "2023-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very good documentary where we follow legendary modern egyptologist Zahi Hawass in the excavation of ancient Egyptian sites.\nGood job Netflix (for once you positively surprised us).",
    "date": "2023-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Uncovering lost antiquities is one of those topics that fascinates most of us, especially when they're documented as the discoveries are made. This is one of the goals behind the Netflix \"Unknown\" documentary film series in its chronicles of such events around the world. In the series' latest installment, filmmaker Max Salomon follows the efforts of Egyptologist Zahi Hawass and his colleagues as they seek to find the lost pyramid of Pharoah Huni, a little-known monarch of Egypt's Old Kingdom, in the necropolis of Saqqara. The structure, believed to be located in an area of the ancient city that hasn't been excavated (and thus suspected of not having been looted by grave robbers), fills the archaeological team with tremendous enthusiasm as to what they'll find. It's also an undertaking largely being conducted by native Egyptian investigators, a departure from previous excavations, which have been almost exclusively conducted by Westerners, a venture that's hoped will put these researchers on the map in their own right. And, with a scant nine-month digging window open to them, they need to work quickly before desert weather conditions make their efforts impossible until the following year. The film reveals some truly remarkable discoveries, too, some of the most significant finds in the history of Egyptology. However, despite the significance of these revelations, the picture also lays it on a little thick when it comes to what Hawass and company have found. The degree of self-aggrandizing self-congratulation truly becomes tiresome and repetitive, so much so that the unbridled boasting overshadows the most valuable aspects of the film. What's more, even though some genuinely remarkable artifact discoveries emerge from the excavators' work, digging on what's believed to be Huni's pyramid itself is left at a preliminary stage when the nine months come to an end, suggesting that continued efforts are needed during a subsequent digging season. This means that the chronicling of this venture, though laudable, could nevertheless be premature. In light of this, perhaps it might have been better to wait until the excavation is complete before releasing this offering, as waiting for later may have provided viewers with a fuller, more impressive, more definitive finished product. In short, this documentary feels more like a work in progress than a conclusive record, one that I would have rather watched when complete than in the preliminary stage in which it has been left.",
    "date": "2023-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Professor and former student race through a season in Ancient Egyptian Archeology to find the next big discovery. \n\nOn the brink of a potential major discovery, amongst other quite spectacular discoveries, its quite easy to share the thrill and excitement of those truly doing the digging while watching this one.  \n\nGreat for anyone who enjoys casual documentaries in general and a potential must see for history buffs.",
    "date": "2023-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Fascinating documentary about Ancient Egypt by actual Egyptians. The love and reverence for their history and heritage, coupled with excitement at new discoveries, make this well worth the watch.",
    "date": "2023-07-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Done tastefully well and worth the watch to broaden the regional knowledge of Egypt. \n Like most docu-type films, the facts supporting the storyline are key.  Dissenting views on Egyptology and/or World pyramids should be put forward.  Seems very agenda driven to support historical storyline and not present day knowledge.  Ancient Apocalypse was far more informative.",
    "date": "2023-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fantastic documentary!",
    "date": "2023-07-03"
  }
]