[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I was surprised this didn't get more attention when it first came out. I went to see it in the theater, because I had heard the story about how George Foreman had a vision of God and turned his life around, from Mr. Angry Man to committed comeback king, and he got happy in the process. I wasn't disappointed. Not every movie is going to be the greatest thing ever made, and it doesn't need to be.",
    "date": "2025-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "WOW POWERFUL MOVIE (SPOILER WARNING)\n\nI Love Boxing… Simple Any Saturday Or Friday And I Hear There’s Live Boxing On Or There’s A Fight I’m Looking Forward To I’ll Watch It And When I Heard They Were Doing A George Foreman Movie I Was Excited Since George Foreman Is One Of My Favourite Boxers And Sadly When This Came Out I Was Expecting Much And Actually Thought It Be Bad But When The Movie Ended I Wanted To Watch Over And Over Again. The Film Shows Us The Life George Foreman From His Hard Early Life To His Fight With Joe Frazier In Jamaica Then To When He Lost To Muhammad Ali In Zaire To When He Became A Priest To Knocking Out Michael Moorer At Age 45. The Acting Is Actually Really Spot On And Khris Davis Who Plays George Foreman From Young To Old Is Actually Amazing And Did a Very Good Job The Only Minor Detail I Didn’t Like Was The Boxing Fights I don’t know I’m No Specialist On Fight Scenes But The Punches Didn’t Look Real Like The Actually Hit The Boxer But Really Thats The Only Thing… Obviously As Of August 2025 George Foreman Passed Away At Age 76 And Just Yesterday I Looked Back On The Movie For The 12 Time And Never Gets Old His Story Is So Inspiring And If You Love A Good Story With a Real Life Man’s Ups And Down And Love Boxing This Is For You. Overall 9.5/10 NOW GO AND GET A GEORGE FOREMAN GRILL !!!",
    "date": "2025-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie, absolutely love this movie and have rewatched, highly recommend",
    "date": "2025-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What an inspirational movie. George Foreman proves that you can accomplish anything you set your mind to. He proves that a bad person can change. Life is all about choices. George Foreman is a boxer, preacher, and great human being. This movie gives you a glimpse of various stages in his life. It is a must see for boxing fans and fans of inspirational true stories.",
    "date": "2025-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "the biggest boxing comeback of all time",
    "date": "2025-06-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What an amazing film!! Got nothing negative to say.",
    "date": "2025-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Very disappointing.   Wooden and cliched acting.  Even the fight scenes were bad.   It could have been bearable if they had spliced some real footage in instead of the Rocky ring scenes. Should be counted out.",
    "date": "2025-04-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This biographical sports drama tells the inspiring true story of George Foreman, who went from impoverished childhood, to Olympic gold medalist and World Heavyweight boxing champion.\n\nAfter a near death experience, George retires from the ring, finds faith, and becomes a preacher. Financial hardships force him back into the ring, where at age 45, he becomes the oldest heavyweight champion in boxing history.\n\nIn honor of the recent passing of George Forman on March 21, I definitely recommend giving this film a watch. I found it to be a very entertaining, heartfelt, and inspiring film. The cast was great, there’s a fantastic message about what you can achieve with focus, determination, and perseverance. \n\nI also appreciated how it wasn’t just a movie about boxing, but a story about the power of faith.",
    "date": "2025-04-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The one thing Netflix does really well is bio pics and origin stories. This movie was entertaining, heartwarming and insightful. I had no idea that George Foreman had such a complicated life. A well written and well told story.",
    "date": "2025-04-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing film loved it",
    "date": "2025-02-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "5/10..meh thought it would be better honestly. Ali Boombayay",
    "date": "2025-02-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It skipped through the decades too quickly to get a hold on Foreman and his fight, both in the ring and outside. But it paid off as I now admire the man.",
    "date": "2025-02-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Remembered Foreman from my youth. Never was a fan of boxing but was inspired by his win at 45. Who wouldn’t be? This was an inspirational movie. If only all kids growing up in such dire circumstances could achieve even a fraction of what George was able to achieve. I thought the acting was very good. God is able to change anyone in any circumstance if they are willing to yield to Him.",
    "date": "2025-02-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A rags to riches, triumph over adversity film in it's most simplistic, reduced form. But that doesn't do justice to the real life story and the actors bringing George Foreman's story to life. There are many lessons to be learned from his life, not least of which is to always be kind but also to persevere no matter what the odds. I loved it.",
    "date": "2025-01-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Poor acting.\nJust ticking off what George did in his life.\nNo character depth. \nNo stories.\n\nGeorge foreman’s life was so filled with stories but this just tried to mash it all in with no direction.\n\nThe fight scenes were absolutely woeful too. Pita patta nonsense",
    "date": "2025-01-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I thought it was great.  Loved the pacing.  An amazing story that actually happened.  He is over looked because Ali.  I wish his Olympic win and how quickly he qualified was talked about more.  The music is good.  Great character development.  Good casting also.",
    "date": "2024-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "An unknown true story of a miraculous story of George Foreman’s career and life outside of sports. Very inspirational!",
    "date": "2024-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The events were pretty close to the actual life of George. He was a true blessing to have in the sport and gentlemen.",
    "date": "2024-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Awesome, inspiring movie for any athlete.",
    "date": "2024-05-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It was a little sloppy; but a very uplifting story.   If you don't like anything Christian in a movie then you should pass.   But it's based on the true story.",
    "date": "2024-02-28"
  }
]