[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great comedy film. The cast chemistry is dynamic. It's a must watch light hearted South African Rom-com.",
    "date": "2025-04-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was a good light hearted comedy.",
    "date": "2025-04-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it!! So entertaining... bit of a predictable storyline but the actors were great!! Very authentic, funny and came across as being genuine! Really enjoyed it... more than the other 'meet the...' were I found the acting a bit stilted... Great job showcasing South Africa and Durban, especially 👏 👌",
    "date": "2025-04-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Introducing \"Meet the Khumalos,\" a comedy film that hit Netflix in 2025. This delightful movie appears to be an international gem that has made its way to the United States.\n\nThe plot revolves around two childhood friends who have turned into fierce rivals over the years. Unbeknownst to them, their children have developed feelings for each other, and the parents are determined to keep them apart. However, as they realize the depth of their kids' love, they embark on a mission to reunite the young couple after their attempts to keep them apart backfire.\n\nOverall, it’s an entertaining film with plenty of humorous moments. Though some parts might be a bit tricky to follow due to the characters' unique dialects, the presence of subtitles helps bridge the gap. It's a lighthearted film that deserves its place on a streaming platform. While I might have felt let down if it had been released in theaters, the fact that it's available for streaming makes it a worthwhile and enjoyable watch. I definitely recommend giving it a try!",
    "date": "2025-04-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I had high hopes going into Meeting the Khumalos, especially as a fan of Keeping Up with the Kandasamys. Unfortunately, this film fell flat in almost every way. It felt like a cheap knockoff trying too hard to ride the coattails of its predecessor’s success, without capturing any of the heart, humour, or authenticity.\n\nThe storyline was weak and predictable, with little to no depth. Characters lacked chemistry, the jokes felt forced, and the overall execution was sloppy. Instead of delivering cultural richness or meaningful family dynamics, it relied on tired clichés and superficial drama.\n\nI expected something fresh and entertaining, but sadly, Meeting the Khumalos turned out to be a waste of time. Not recommended unless you’re curious to see how not to do a family comedy.",
    "date": "2025-04-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Acting/script is mid asf. Everything seems so overly hyper and the dialogue just doesn’t seem natural or realistic (not immersive whatsoever and it’s all a bit annoying). Just one of those mindless “whatever” movies.",
    "date": "2025-04-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Very poor copy of Meet the Kandasamys... no flow...story very weak. \nJokes repeated.\n\nBoring",
    "date": "2025-04-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Worth a watch. A really good comedy.",
    "date": "2025-04-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This movie is epic my people must watch",
    "date": "2025-04-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Differently funny. Worth a watch",
    "date": "2025-04-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is top notch👍 you are going to laugh from start to finish...#NETFLIX  SA  never disappoint when it's comes to local entertainment",
    "date": "2025-04-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Its a okay comedy but I had sub titles on because the older actors there parts I could not understand a word they were saying",
    "date": "2025-04-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Engaging from start to finish. Drama, comedy, loved it. Well developed characters even with the short duration of the film. Absolutely recommend.",
    "date": "2025-04-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "That was a beautiful watch. Loved all the tradition in the movie. Will definitely be watching more SA henceforth 🔥🔥",
    "date": "2025-04-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is literally a rescript of \"Keeping Up with the Kandasamys\".",
    "date": "2025-04-11"
  }
]