[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A very interesting, yet at the same time stupid movie. The court cases are a extremely interesting plotline, but the romance between the bee and the woman is a dumb idea. It's a pity for the guy the most because he thinks he is worse than the insect.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Movie was a good hit, just not the same as the other films.",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "ya like jazz?",
    "date": "2025-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "… you like jazz? Got me dying. This thing makes no sense. Literally can’t get enough of it. Justice for Ken, y’all.",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This film is what can only be described as a \"beautiful trainwreck\". It makes absolutely no sense, but I think that's the point. It's just a ridiculous film about a Seinfeld-bee who sues the entirety of humanity. It's not supposed to make sense, and that's what makes it beautiful. Out of all the films I have seen that have absolutely no sense of logic, the is one of the only movies I actually return to.",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I CRIED WHEN KEN STARTED DOING CRACK.",
    "date": "2025-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "la trama es bastante genérica, los diálogos dejan mucho que desear algunos son ciertamente un acertados y están de más en especial como el de “cómo ignorar el corazón que anhela” no la recomiendo no debería de estar en ninguna plataforma de streaming",
    "date": "2025-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Filme mais ou menos, o roteiro é fraco, as cenas são mais ou menos, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-09-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This would be zero but the website does not let me. Also why does the bee\nlook like pinocchio stuck his head in a meat processor",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's not Dreamworks best, but is still fun.",
    "date": "2025-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This is one of DreamWorks most stupid movies ever!!! The premise makes no sense, and worst of all, it preaches to you about something that's not even a real-world problem!! I left feeling grouchy and with no substance to take with me.",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A Haiku Review:\nSeems like Jerry’s life\nBut instead of a woman\nShe was seventeen",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "this the best movie on earth. so much love and care was shown in this movie. i cry every time i watching this master piece",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Overated is an apt term to describe this film. I enjoyed it as a kid, but upon rewatch it's unfunny to the point of frustration. I do not find Seinfeld's performance here entertaining whatsoever, his voice would rest an insomniac.",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "one thing I really enjoyed is the part where A banana is an elongated, edible fruit—botanically a berry[1]—produced by several kinds of large treelike herbaceous flowering plants in the genus Musa. In some countries, cooking bananas are called plantains, distinguishing them from dessert bananas. The fruit is variable in size, color and firmness, but is usually elongated and curved, with soft flesh rich in starch covered with a peel, which may have a variety of colors when ripe. It grows upward in clusters near the top of the plant. Almost all modern edible seedless (parthenocarp) cultivated bananas come from two wild species – Musa acuminata and Musa balbisiana, or hybrids of them.\n\nMusa species are native to tropical Indomalaya and Australia; they were probably domesticated in New Guinea. They are grown in 135 countries, primarily for their fruit, and to a lesser extent to make banana paper and textiles, while some are grown as ornamental plants. The world's largest producers of bananas in 2022 were India and China, which together accounted for approximately 26% of total production. Bananas are eaten raw or cooked in recipes varying from curries to banana chips, fritters, fruit preserves, or simply baked or steamed.\n\nWorldwide, there is no sharp distinction between dessert \"bananas\" and cooking \"plantains\": this distinction works well enough in the Americas and Europe, but it breaks down in Southeast Asia where many more kinds of bananas are grown and eaten. The term \"banana\" is applied also to other members of the genus Musa, such as the scarlet banana (Musa coccinea), the pink banana (Musa velutina), and the Fe'i bananas. Members of the genus Ensete, such as the snow banana (Ensete glaucum) and the economically important false banana (Ensete ventricosum) of Africa are sometimes included. Both genera are in the banana family, Musaceae.\n\nBanana plantations are subject to damage by parasitic nematodes and insect pests, and to fungal and bacterial diseases, one of the most serious being Panama disease which is caused by a Fusarium fungus. This and black sigatoka threaten the production of Cavendish bananas, the main kind eaten in the Western world, which is a triploid Musa acuminata. Plant breeders are seeking new varieties, but these are difficult to breed given that commercial varieties are seedless. To enable future breeding, banana germplasm is conserved in multiple gene banks around the world.",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Epic movie, ya like jazzzz",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Bee Movie has a hive of colourful animation, but the plot is a bit of a buzzkill in that it's not all that appealing for a family film. There's some decent humour, but mostly adults will be the ones buzzing about it.\n\nGrading: C",
    "date": "2025-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "OVERHATED! (CLAP CLAP,CLAP CLAP CLAP) OVERHATED!  (CLAP CLAP,CLAP CLAP CLAP)",
    "date": "2025-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the funniest most stupid enjoyable films ever",
    "date": "2025-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wow!!! The bee movie is funny",
    "date": "2025-06-28"
  }
]