[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Halle Berry is a brilliant and talented Black woman with incredible abilities to showcase, but why not showcase the strength and focus of a black woman dating manager instead of zombie like who jumps when he calls? I understand the struggle to be shown but shes too fierce to not have a little of her flare. Overall, alot going on in film and not all connections were given throughout film.",
    "date": "2025-06-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Filme: \tFERIDA\t\t\tAssistido: 13/6/25\nElenco: @halleberry @sheilaatim @adancanto @shamieranderson @a.lenoxzach \nModelo: #esporte #drama\nDuração: 2h 18m\tAno: 2020\nMinha opinião: Berry com 58 anos, esta mandando muito bem. Um filme que retrata o drama daqueles que vem do subúrbio, de famílias desestruturadas, que tem relacionamentos doentios e tem filhos neste mesmo universo, e que o trauma vai passado de geração para geração. Seja nos relacionamentos, vícios, traumas e conflitos de relacionamento. Este é o filme que mostra a vida da lutadora de MMA Jackie (BErry) vive. E com seu parceiro Desi (canto) e tudo muda quando aparece um filho de Jackie que vivia com o pai. Depois de assassinado vem morar com ela. Porem com o convívio já era difícil com Desi, depois da vida da criança, tudo piorou. E antes que ele maltratasse a criança ela sai, vai morar com mãe, que não dura muitos dias e muda novamente para o apartamento da treinadora budda (Atim), com quem acaba tendo um relacionamento. Até quando chega o dia da luta pelo cinturão. Cenas muito bem construídas que pareceu real. Isto mostra quanto Berry treinou muito. Cenas bem filmadas, e sem pretenção, ela perde mas com a decisão dividia. O filme termina com ela reiniciando sua vida com seu filho. Com boa atuação dos atores e méritos de Berry. Um filme revelando o drama de várias famílias.\nVale apena assistir? Sim. Boa atuação de Berry e como esta bem de forma, poderiam fazer um filme como Bailariana no universo John Wick para ela, contando sua estória.\nNota: 8",
    "date": "2025-06-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Forget what any critic says, watch this movie, its  fantastic on so many levels, and I’m not a UFC octagon fighting fan what so ever!",
    "date": "2024-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I’m always rooting for a Halle Berry movie. Bruised as a drama sport film is probably more drama than sport however as a drama film, it also delivers I was expecting more action with fight scenes, but the whole movie was a buildup to the one scene at the end, which delivered in my opinion, Halle Berry does deliver well in that motherhood type role I think the movie would’ve benefitted from more fight scenes and more action in the octagon but I could see movie lovers liking this film. MMA fans may not like it as much as they might be expecting more action with the film delivers.",
    "date": "2024-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It wasn't great, but it wasn't bad either. I think that if it had been someone a bit younger in the lead role it would have scored higher from me. I couldn't suspend my disbelief for long enough to believe that someone Halle's age was playing that part. Sheila Atim did well and so did Danny Boyd Jr. as her son.",
    "date": "2024-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it! Found myself rooting for Jackie in her personal life as well as professional. She had to fight (literally) for both. A come back/redemption movie worth watching!",
    "date": "2024-05-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great movie. Cried the entire time. I wanted more of a ending tho. It got me all excited and then boom it ended. 4/10. I cried almost all the way through great job overall.",
    "date": "2024-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was the MOST moving movies I have ever seen! I have NEVER left a review on a movie and I know it's late but god damn.. I will watch this over and over!!",
    "date": "2023-05-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Two stars for Little.",
    "date": "2022-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Powerful women, good storyline. Halle Berry trained hard for this role. Sheila Atim as her trainer is amazing in her portrayal of a no nonsense coach, and a broken heart. I loved it.",
    "date": "2022-06-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Despite a few flaws and cliche'd plot, Halle Berry is incredible.  She's 55 folks, and she looks the part with an admirable performance.  Supporting cast is also very good and worthy.  Bottomline, I liked it a lot.",
    "date": "2022-04-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Despite having a few clichés in regards to its genre and being somewhat repetitive, this is still a fairly engaging and emotional directorial from Berry and will no doubt have some kind of impact for most who consume its contents.\n\nP.S. This one is also a bit on lengthy side for those that can't handle a bit of slow pacing or are on the verge of falling asleep",
    "date": "2022-04-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "As a big UFC fan, I am perhaps more critical of the training and fight sequences than the average movie-goer, but I didn't find the action very realistic. I realize you can't teach Halle Berry how to fight in a few short months of movie-making, but even making allowances for that, it was hard to watch sloppy technique. \n\nThe story itself was fine and the performances all around were good; they just weren't as good as I would have liked. Pretty good outing for Berry in her directorial debut.\n\nIf you're a fight fan, this might be worth a look for you. There are several appearances by people you'll recognize from the fight game.",
    "date": "2022-03-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Wooden fight choreography and unconvincing performances aside: it's a totally unnecessary retelling of Warrior.",
    "date": "2022-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Halle is the reason to watch this and she is very impressive in the ring also. Subtract a star for the kid. For some reason he never speaks and is not particularly likeable either.",
    "date": "2022-02-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "(Note: This review is posted before 2022 Oscar nominations are released; I watched and reviewed over 30 movies predicted to be in the mix for Best Pic, Best Director, and the four acting awards.)\n\nBerry seems to be trying to get an Oscar nomination; ok, I'll play along, I'd give her a nom for Best Actress, if it was up to me.  Arguably a top 5 performance in 2021, although that category has a LOT of competition (Chastain, Gaga, Stewart, Coleman, Hudson, Jones, Haim, Zegler, Bullock...)\n\nOtherwise, boring and, uh... been done?  Who's with me here -- when she lost the decision, did you expert her to start yelling, \"Adrienne...?\"",
    "date": "2022-01-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It started out really good. I like Halle Berry as an actress, and also Sheila Atim. but the last 45 minutes were very predictable.",
    "date": "2022-01-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "If you enjoy a film that's a mixture of being heartfelt, dangerous, humorous, action(ous)😁, uplifting, and prosperous, then this is a \"Must Watch\". Ya see....... in life.... we go through tons of rough times when we continue to fall and have to continue getting back up. No highs or lows, just a constant never ending gritty road. This was one of the most uncut films I've seen in some time, lead by one of the most phenomenal female actresses of the 2nd/3rd millennium. If you enjoy drama films, this is a top choice I'd recommend!",
    "date": "2022-01-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Awful. So tired of the broke fighter looking for a break. Make a movie about GSP or Rich Franklin. This movie was just like Rocky 4 with worse acting and a \"woke\" underline. Awful, I wish Netflix could give me back the time I wasted watching this. It actually took me 4 separate sitting to stomach the writing and acting. Would rather stand inline at the DMV then watch this movie",
    "date": "2022-01-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "While the movie is unfocused and inconsistent in it's town, Halle pulls a strong double duty as a director, lead actress, and gives a more than admirable go as a MMA fighter.",
    "date": "2022-01-19"
  }
]