[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "One word: meh. \nThe story lacked depth. I didn't connect with Whitney... it felt like a two-hour music video.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The main problem with Whitney Houston: I Wanna Dance with Somebody is that it’s too long. This is partly due to all the full-length musical numbers. Yes, Houston was a great singer, but we don’t need to see each song in its entirety. And I would praise Naomi Ackie for her vocals, but she was just lip-syncing most of the time. Also, this biopic made me like Houston a little less, and everyone around her is a stock character with no real progression. If you were alive when these events were occurring then you already know what happened, so you could skip Whitney Houston: I Wanna Dance with Somebody.",
    "date": "2025-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I thought this was a really solid biopic. I went into this with pretty expectations, and I'd say they were very slightly exceeded. I'm glad I got to learn more about Whitney Houston's music career, but I was kinda shocked they did not seem to emphasize her personal life more. Like they gave us plenty, but I did not see the commitment in that side of her life compared to her music career. Overall, still well done.",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "If you’re not a massive fan but interested in the seminal parts of Whitney’s life and career this is a great watch. A bit too much is made of the performances - as we’re not actually watching Whitney herself and it’s definitely a celebration rather than an exposé but I’m good with that. A brilliant performance by Naomi Acke.",
    "date": "2025-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The songs and music is he reason why I gave it 2.5 stars (I got goose bumps and tears every time I heard a song) but the movie lacks substance and misses many of her life's special moments, like the huge hit of her mivie and her special performance for Michael Jackson. It also didn't have the right timeline.  I Have Nothing was made for the movie The Bodyguard, not after! The ending was abrupt  short and a bit confusing, for me. \nIf you love Whitney H, you'll love this movie for the fact that they play a lot of her hits.",
    "date": "2025-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I Wanna Dance With Somebody is a biopic that simplifies the hard live of Whitney Houston, while they delete any content  that a 9 year old couldnt watch. Yes, they mention she had an addiction to drugs, or an abusive husband, but you will never see nothing but the top of the iceberg. If you want to know the most important moments of her live, you will see them, but with anything remarkable rather than Stanley Tucci and the songs, and you will do this for 2 hours and a half.",
    "date": "2025-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very good performance by Naomi....Nice movie...!!!!",
    "date": "2025-02-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Awful. How can an huge artist like that get such a bad movie? Empty. With no soul at all. Really terrible.",
    "date": "2025-01-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "An embarrassing mess. Can't recommend at all. She deserved better than this.",
    "date": "2024-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Great movie, I enjoyed it, The actress portrayed her did a great job, But doesn't look that much like Whitney Houston, Whitney Houston is a great singer, She have great music, I felt like they could've added more to this biopic of Whitney Houston, But it's way better than the life time biography, 4/5 R.I.P. Whitney Houston♥️🕯️",
    "date": "2024-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Why does this site keep taking down my review? \nIs honesty such a touchy subject for people?\n\nIf I could give this movie less than half-a-star, I would.  \n\nI love biopics and there have been so many incredible ones.  So, for someone as renowned and great as Whitney Houston, this film quite frankly was not an accurate reflection of what she achieved and the legacy she has left behind or even who she was as a person.  \n\nNaomi Ackie as Whitney was miscast, as she looks absolutely NOTHING like her.  I think it was important to get the casting right as Whitney was renowned for her beauty (as she was a model first and foremost) before she signed with Arista.  Let's be real, do you think Titanic would have done so well at the box office if they didn't cast a very young and gorgeous Leonardo Dicaprio to look at for the next three hours?\n\nThe story for IWDWS was bad and just jumped from place to place with inaccuracies all over the story.  If you want a better and more truthful look at Whitney, read her friend Robyn Crawford's book or watch the Whitney documentary by Kevin MacDonald.  Both did far more to uphold Whitney's legacy.",
    "date": "2024-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I enjoyed it. If you're alone on a weekend and you feel like having a glass of wine and learning 90% more than you did about an abused pop star, give it a go. It won't give you nightmares, it won't make you swoon, but it will give you an appreciation for the beautiful, flawed, human being behind the pop star who was devoured by the media and her own family. This film inspires a new generation of strong and powerful women.",
    "date": "2024-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I've given up after 15 minutes. The actress playing Whitney looks nothing like her, if this was the only issue I would continue watching but it's also very cringey. Such a shame, I usually love biopics.",
    "date": "2024-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I liked the fact they played whole songs so you could enjoy the music but I didn't feel Naomi looked like her. The best bit was the end credits. Another catastrophic popstar life, greedy and pushy parents, very sad. RIP to her mother who I discovered as I watched it had died today.",
    "date": "2024-10-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This film details the life of Whitney Houston and her journey to become one of the greatest female singers of all time. Overall with the accurate performances and iconic songs I enjoyed this exploration of the performer and learning about the ups and downs of her life. I would recommend this movie to her super fans but also newcomers as well so that they can experience this movie and understand her legacy as an artist.",
    "date": "2024-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Great actors and another view of an artist's life.  However, it seemed to be a more protective of the artist than the art.",
    "date": "2024-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Whitney is the best. This movie is everything to her legacy",
    "date": "2024-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was touching and beautiful. Learned a lot about Whitney and her struggles. It was lovely singing along to her timeless hits with my family",
    "date": "2024-03-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Whitney was so talented and beautiful, such a tragic loss.",
    "date": "2024-03-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The critic plagiarismcheck  plagiarismsearch.com consensus on \"I Want to Dance with Someone\" is that while it offers a wacky and entertaining biopic experience, it ultimately falls short of fully capturing the essence of Whitney Houston's life and legacy. The film leaves viewers feeling tantalizingly close to the energy and spirit of Houston's performances but ultimately yearning for a deeper connection and understanding of her personal journey. Despite its shortcomings, the film offers a relatively decent watch, particularly for fans eager to relive Houston's iconic moments on stage and explore the complexities of her life and career.",
    "date": "2024-02-15"
  }
]