[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Real footage in 1 hour and 58 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Las palabras del final fueron conmovedoras, ver que lo que dicen en este documental fue muy diferente a lo que se retrato en la serie hace que veas a los hermanos desde otro tipo de lente.",
    "date": "2025-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I wasn't all that familiar with the Menendez Brothers besides the headline, and for the most part, I left it at that. \nBut, I was interested. \nAnd, so I indulged in this doc - and, I was utterly shocked. The sensitive themes discussed now with an unbiased, open-minded perspective of these current times compared to the 80s - were much needed. Many missteps and this tragic story... I'm really glad one of the most well-known crime stories has been given a chance to tell all sides with the defendants themselves, credible witnesses and mounts of footage in full with an empathetic lens, that was not present when the original events took place. Re-writing the narrative, focusing on what truly matters - this film seamlessly walked us through almost 100+ worth of history surrounding a supposed nuclear family and the lengthly subsequent trials with grace and insight. \nMust watch for those who are interested~!",
    "date": "2025-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Very dark and depressing true story crime drama about the two brothers who were relentlessly sexually abused by their cruel and merciless father throughout their childhood and entire teenhood. They were neglected by their mother who did absolutely nothing to protect them from him which led to them killing their parents. The movie is very intense and heartbreaking. I absolutely feel for the brothers and am absolutely appalled by all the negative reviews dehumanizing the Menendez brothers. Gender bias has definitely got to play a big role in all of the negativity. This movie is extremely well acted and well made. One of the best lifetime movies. I can’t believe the jury was stupid enough to find them guilty. I’m sure all the negative reviewers siding with the prosecutors would’ve done the same thing too if they were in the Menendez brothers’ shoes.",
    "date": "2025-03-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie didn't do the menedez brothers any justice in what happened to them and what they lived through.  not only did the writer some what sexulized the relation of the brothers in a weird way they managed to make the worst people look like victims in some sick story. Yall are forgetting that this isn't just some movie these brothers actually lived through this. \n\nNext time you think about making a movie based off of other people's life traumas don't",
    "date": "2025-01-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I don’t think I’ve learned anything further in this documentary that I had already known when the brothers were repeatedly tried for murder  throughout the 90’s. The brothers claimed they were sexually abused from almost the beginning of this story. There were experts & family to claim the duo were abused but as far from what I watched nothing new in the form of forensics or evidence. I honestly believe that if folks in the US were given the opportunity in deciding the fate of the brothers then the two would earn their freedom as I believe many would decide from their hearts. I believe in the US judicial system in most cases but in others I think it’s a complete banana republic. For these two brothers to even be given a chance at parole even though they were sentenced to life with none is surprising to say the least for the manner in which they committed the crime & to whom & without question it was 100% premeditated. I truly believe the brothers are receiving this recognition because of the men they’ve become in prison being role modeled prisoners. The prosecutor that recommended the brothers receive the parole hearings is a complete an incompetent fool. In my honest opinion I do not think these brothers deserve the light of day for freedom. I gave the documentary 3 stars. It was ok but nothing throughout the film gave me the aw factor",
    "date": "2024-12-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A decent documentary that doesn't stray from its subject matter, The Menendez Brothers offers enough insight to true crime fanatics looking to learn about the tabloid murders.",
    "date": "2024-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A good true crime documentary about the notorious brothers who murdered their parents.",
    "date": "2024-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wow. Some of these reviews are so grossly ignorant it’s infuriating. Family of the murdered parents corroborated the abuse, and people still want to say they’re lying?????? The gender bias is glaring. The way these brothers were treated about their testimony is why male victims of abuse rarely disclose. We need to do better. If they had been young women, they would’ve had resounding support. Their actions would’ve been considered against the weight of the horrors they’d endured. The naysayers might as well go sit in a corner with a dunce hat on and delete their social accounts. Tom Cruise wouldn’t have been able to portray the emotion of their testimony surrounding the abuse, so to claim they are faking is laughable.",
    "date": "2024-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A true crime documentary in which brothers Lyle and Erik Menendez, who were convicted of the 1989 murders of their parents, are interviewed about the case for the first time in about thirty years, the brothers themselves talk about what exactly happened and why they did it through audio interviews from prison. Others involved in the case also speak, including family, lawyers, jurors, reporting journalists, and the lead prosecutor Pamela Bozanich.",
    "date": "2024-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Going back and rehashing this is a last ditch effort for these two who viciously killed both their parents in cold blood only as a attempt to free themselves. TRUTH they both were old enough to leave out on their own.\nThey had the opportunities to succeed and move on they didn't have to live at home. Lest you forget the spending spree post murder,and the lack of remorse on their part. They want to play the total victims here & act like their actions were warranted..Maybe I'm the only one who sees their manipulated game. They did what they did because of greed. I see self defense BUT they didn't kill in self defense and literally blew their parents to pieces. They're despicable and this documentary is a waste..Silenced the parents who now can't defend the accusations..pathetic",
    "date": "2024-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This documentary is very well done. At the time of the trial, I thought the brothers had created a completely false defense. But 30 years after the fact, I think there is truth to the allegations of molestation. The cousin's testimony, which I didn't see during the trial, is very convincing. The newly found letter, if it's age can be authenticated, is also compelling. And an allegation of abuse by a young man visiting their home is corroborating, as well, if credible. Watching their testimony today, the emotions they exhibit appear genuine. As one juror commented, either they're the best actors in the world, or they were telling the truth. 30 plus years ago, sexual abuse of boys was not something that was often discussed or acknowledged. At the time, I couldn't imagine a father abusing his sons. And yet, we believe girls who say their father abused them, and we know for a fact that it happens with some frequency. Our (or my) understanding of this abuse is clearer today. Sadly, Leslie Abramson would not participate in the documentary. Extremely selfish of her. She didn't win the case so apparently felt there was no more to say. If she truly believed in her client, she owed it to him and to us to speak her truth regarding guilt or innocence, as well as detailing the judge's bias in the second trial. Highly disturbing were the rulings by the judge that did not allow testimony on the alleged abuse. What? The 2nd jury had every right to hear this testimony. I was also shocked to hear that the father found a therapist who agree that anything the boys discussed with him would be reported to the father. This is simply outrageous. I think the brothers did have to be held accountable for the murders, especially for the murder of their mother. I don't believe they feared her. As suggested in the film, she was \"collateral damage.\" But putting all the pieces together today, I think a sentence of manslaughter would have been more appropriate. The evidence that they were abused as well as their testimony, for me, today rings true. And their mother did not protect them. Battered syndromes are not just a defense for women. Good documentary. Hard to fit everything related to their lives and the case into two short hours, but it shed light on this case and I see it much more clearly and differently than I was able to 30 years ago.",
    "date": "2024-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "'The Menendez Brothers' is the documentary film of the events which happened in the 1990's, and sort of a follow up to the 'Monsters' series which aired earlier on Netflix.\n\nSYNOPSIS: 'In 1996, the Menendez brothers faced trial for killing their parents, a case that captivated America. Years later, they share their side through interviews with those involved, offering a fresh take on the events.'\n\nAs excellent as this is I'm always unsure why Sky creates a dramatised version of a story to then, a week later, release a documentary version of the same story. \n\nBoth are incredibly strong in their own right but did we need both? I'm unsure we do.\n\nMore here than with the dramatic interpretation, you're allowed a better opportunity to make an educated decision on the case through all of the evidence.\n\nA proper compendium piece.\n\n7/10",
    "date": "2024-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This show came out at the right time to convey the real story behind the brothers. I do wish it went more in-depth about details of the case. I felt like it was rushed and short when there’s so many details involved. I also wish the cut Pamela’s part shorter. She was annoying and clearly still very bitter about this situation. It doesn’t matter why the brothers case has revived more popularity, the important part as that it did. “Tik Tok” raised awareness for their case and hopefully inspired them to continue to fight for their freedom.",
    "date": "2024-10-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I felt this was a well done documentary.  It is really shocking that they had two trials, and the same judge in both.  I felt that this had a huge effect on their sentence.  It was difficult to listen to the young men's testimonies about their abuse from their father.  Lyle had reached out to his mother several times, and she did nothing.  I have not watched the Ryan Murphy show, as I felt the story from the perspective of the actual brothers would be more factual.  This is a tough show to watch, but it is well worth it.",
    "date": "2024-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It is more about the two brothers waffling on about how harsh it is that they were sentenced, and what they have achieved since then, than it is about examining and exploring some of the contentious and more emotive elements to their crimes and court cases. The nine episode drama seems to give more about the family, the brothers, and the crimes, than this documentary manages",
    "date": "2024-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Otra mas romantizando personalidades narcisistas, psicopáticas y peligrosas, ahora todo mundo está enamorado ( de nuevo ) de enfermos mentales. La producción esta muy bien, la musica también pero nos recuerda lo peligrosa de nuestra sociedad",
    "date": "2024-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great watch if you're into murder documentaries. Tries to tell both sides as best as they can. Shows how the justice system isnt always just and that people who aren't perfect victims are silenced. Take whatever opinion you want about the case from this documentary. Wouldn't watch at night or if sa is a sensitive topic.",
    "date": "2024-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I find It silly those who argue this doc is biased. For the First time we get The chance to have The brother's point off view, but Also The prosecutior POV, which honestly I couldn't disagree more, I found It so dumb, the woman seems not to want Justice, Just to win. This is someone's trauma, life and Destiny what we are talking about.\n30 Years Ago media coverage picture this guys like Monsters. In this time and age I think psicology has evolved a lot, and we have a different picture about trauma response and those extremely complicated issues. According to today's standards we would treat them better and not make Fun off them like 90' comedy did.\nAfter watching both the doc and murphy's drama, my only conclusion is Second trial was not completely Fair, I really Hope their case can be revised in the near Future.",
    "date": "2024-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Archival footage and phone interviews but compelling to hear the brothers reflect on the trial, their relationship and experience. A new lens on this for sure with their voices and a lot of very interesting interviews with family. I wish we'd all paid more attention to this case. These guys didn't deserve how they were treated in the media. It was hard to watch SNL, Leno and Bernhardt being so crass about something so awful.",
    "date": "2024-10-12"
  }
]