[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's a fun movie. Seth Rogen could just sit there and say nothing and I would still laugh.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Formulaic but kinda charming. The political jokes landed and at least the main characters, though comically flawed, stood for things I agree with!",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The Long Shot is in familiar rom-com territory with characters and plot devices updated for the times.",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Absolutely hilarious!",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Starts as a very simple rom com , meet cute and developing relationship, but descends into a drug fuelled farce , not sure exactly what message it’s trying to get out there but it’s not a message I endorse . An intelligent female Secretary of State descends into the state of an adolescent idiocy when she hooks up with an old friend and starts living the misspent youth she never had , thereby jeopardising her chances of becoming the next president , not sure exactly what the audience is meant to extrapolate from that , but this audience member didn’t like it at all , is the message women will do anything for a relationship, they are so desperate for affection ? Because that’s the only “ meaning “ I could find , oh and by the way it gets pretty gross at times too . No wonder this bombed , despite an excellent cast .",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Really funny movie that makes you care about the romance",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme ruim, o roteiro fraco, o filme coloca um romance impossível de acontece com cenas ruins, seth rogen junto charize theron não tem química para fazer o filme ser bom, é nem o elenco ajuda, o filme tenta ser engraçado com cenas um pouco forçadas, e nem tem cenas relevantes no filme, com tudo isso, eu não recomendo esse filme.",
    "date": "2025-02-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Extreme, but romantic movie.",
    "date": "2025-01-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "\"Long Shot\" is the perfect mix of humour and heart making it an ideal way to wind down your Thursday. Theron is effortlessly classy and gorgeous as the Secretary of State, while Rogen, in his usual hilariously unfiltered style, delivers a performance that's both relatable and genuinely funny. His humor feels natural, making every scene he's in a thrill to watch.\n\nWhile the story doesn't reinvent the genre, its charm lies in depicting two wildly different characters, one polished - the other chaotic, finding common ground.\n\nThe film has beautiful visuals that take you around the world and brisk pacing that keeps it engaging. An unexpected action sequence midway adds an energetic twist, while the nostalgic tone brings heart to the comedy, grounding the film in genuine emotions. \"Long Shot\" is sweet, witty, and effortlessly entertaining.",
    "date": "2025-01-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "\"This room is too bright\" went downhill from there. I get it drugs are good but white men are bad YAWN.. \n\nGross out stuff also not needed YUCK",
    "date": "2024-12-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This is truly one of Seth Rogen's better movies, he shows another side of himself, but it's missing some x factor if he really wanna match his other movie \"Knocked up\", that lies in the same ball park.",
    "date": "2024-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Romantic comedy can still be smart and refreshing...",
    "date": "2024-05-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I cry and sob at the end. not a perfect movie ,but really really great romcom. Plot is new, chemistry is there. Love it",
    "date": "2024-04-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is my comfort movie. Chalk full of grown up 90s humor and subtle jokes that never warrant an outloud laugh but still make you feel like you are a fly on the wall of a blossoming relationship and in that sense, are perfect.  There are some parts that are absolutely hilarious and well delivered and other parts that are ridiculously unrealistic that it lets us know that this film doesn't take itself too seriously and the writers and actors aren't afraid to have fun.",
    "date": "2024-03-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "rrally formulaic garbage. c-",
    "date": "2024-02-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Already a ridiculous plot design, but proved to be over the top without complexity or intrigue. A few laughs but overall a movie that disappointed, and proved that movies are still made without reason and we walk like lambs towards them. This lamb is very disappointed. Go watch Dave.  A great movie with a similar ridiculous plot set up that aims high.",
    "date": "2024-01-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I can't remember the last time I laughed so much watching a movie.",
    "date": "2024-01-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Realistic staircase walk on drugs.",
    "date": "2024-01-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Typical Hollywood cliche.",
    "date": "2024-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Such a funny movie, really impressed with the cast. Highly recommend",
    "date": "2023-12-26"
  }
]