[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Greetings from Lithuania.\n\n\"Trap\" (2024), a latest movie written, directed and partially acted by the once shortly famous M. Night Shyamalan. There was no hope that this movie could be good for me, as i have lost hope for this director to make anything close to those 2-3 great movies he once made decades ago. \"Trap\" is a poor movie - no surprises here. The plot is ridiculous even for M. Night Shyamalan's movie. The idea is a pure nonsense, and a concept was basically made to showcase as much as possible his daughter - she plays one of the lead roles here as this famous pop teen singer during which concert this so called trap happens. The ways that M. Night Shyamalan puts this main character in a situation and then things of impossible ways for him to escape cops,  FBI and etc. are just plain bad. Like they are the most incompetent cops in a history of cinema. Like i was laughing at how things were happening here - the screenplay, story and the entire films is just plain bad. How come did i voted generous 5 / 10 ? Because it was so ridiculous that at running time 1 h 40 min i did laughed a lot in disbelieve so time went fast.\n\nOverall, \"Trap\" is just a poor M. Night Shyamalan's family business project. Like there is nothing to see here.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Can't explain how bad this film is, I waited for a twist that never came as I couldn't believe it would be so bad on purpose. Storyline didn't make sense and the film is just a long line of plot holes and unbelievable choices. Absolutely terrible.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I didn’t expect anything different from Shyamalan.\n\nDespite the little hope given to me by the trailer and the comments about the film, it doesn’t quite become a failed attempt at something absolute. Its biggest mistake doesn’t lie in the technical aspects, but in the very conception of what is being told. The story is interesting, I suppose, but the development is unnecessarily convoluted. In thirty minutes, everything Shyamalan stretches over almost two hours could have been resolved. Instead of seeking conciseness, he goes down the path of intrigue, wherever his \"creativity\" takes him.\n\nHowever, on the other hand, this decision doesn’t really result in a tiring pace but rather the opposite. It doesn’t bore you because the script doesn’t allow it. In every scene you wonder what will come next. The problem arises when certain sequences and actions defy internal logic. Coherence at times only exists if you pause frame by frame looking for an explanation as to why. Of course, this feels forced to the limit. It doesn’t break the experience by some miracle, but it certainly lacks credibility to a large extent.\n\nThe good thing is that it’s entertaining thanks to the tension maintained by the characters. Josh Hartnett knows exactly what role he plays in the story and how to approach it. He gives the character a solid presence, sustained by self-control and cunning. Ariel Joy Donoghue and Saleka Night Shyamalan also contribute to giving some essence to the narrative mechanism, expanding the emotional dimension.\n\nIt’s not surprising, after all, that 'Trap' didn’t receive very positive scores. It’s a film that accumulates more missteps than successes, but even so, it doesn’t deserve to be dismissed. Observing it as a whole, as a final result, one can conclude that the main issue lies in the initial conception or primordial idea of the director. It’s not a bad proposal, of course, but it feels like the choice of \"the first thing that came to mind,\" only to then put effort into turning it into something that doesn’t quite fit.\n\nIt’s a light experience, especially if the viewer is tolerant of irregularities and not too demanding. 'Trap' is the very definition of Shyamalan’s cinema: a blend of strange ideas executed in an irregular manner which, paradoxically, keeps the interest alive. This already happened previously with 'Old', a brilliant idea with a dreadful execution.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Had to make an account here just to say how bad it was",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Josh Hartnett is one of my favorite actors. Great performance on his part. The movie has a cool concept & great aura. The 1st part sets things up nicely. The 2nd part becomes far too implausible. The 3rd part has moments of utter genius, which is frustrating. So much potential, gets lost in a convoluted script. A little more focus/thought could've made this a real master piece. Its incredibly hard to rate this movie.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Too many people fall into the trap of slamming Shyamalan when there’s a lot of enjoyable storytelling happening. Hartnett’s playful performance is the real joy of this movie. Unfortunately, things fall apart when we leave the concert venue, and what could have been a tight story unravels. I would have happily jettisoned the twists and multiple turns for a shorter, more determinate ending.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 01 hour, 45 minutes, and 06 seconds!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated PG-13 for Some Violent Content and Brief Strong Language!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $42,700,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Filmed in color for the August 02nd, 2024, release date of this movie!!!!!!!!!!!!!!!!! Copyright 2024-2025 Warner Brothers Discovery!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Good premise, but not well executed!",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Very disappointed. The acting was really bad, the story line was bad too, and by the twist of the movie I had already checked out.  This movie felt like it never was going to have an ending or at least a good one.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie was ok, till they brought the singer lady into it. Then it went downhill really really fast. Really dumb ending.",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I know i am giving this a high rating for something done so bad, But I still like it, Why? Well this movie has a really Good concept, would be something that people would wanna watch, but since the main focus was on Saleka as Lady Raven to show off how good she is at singing, trying to make her famous and all that, made the movie seem like its a musical, it made it not interesting compared to what you expected..\nLike I want someone else to take control of the story, and make a trap 2, that would be great.",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I have no idea how this movie got a 57% rating. It was such a ridiculous idea and so full of idiotic plot holes. I would give it a 27%. It’s usually a hit or miss with M.Night Shyamalan’s films and this one was definitely a miss. I only watched the entire thing because I was hoping for a brilliant, mind-boggling twist at the end and there was anything but that. The word Predictable comes to mind. Maybe the movie got its name because viewers feel trapped for the entire film with their fingers crossed that this whole insanely ridiculous movie would turn around and offer something new and exciting . I certainly felt trapped. Don’t waste your time on it",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great suspense movie! Well acted. I don't know if there will be a sequel as there was an open-ended ending.",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie reminded me of B rated movies from the 80s.  Everything from the writing to the visuals. Normally, his movies are great. Keeping you on your seat through the whole movie.",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Shocked me to say the least.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The premise is overtly absurd. Far fetched and utterly unbelievable from the get go. And the music is terrible and takes up far to much of the film.",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Normally a movie with a ho hum story, telegraphed twists, and unrealistic moments to push plot along would be considered a  wasted evening.  In this case, two things make this watchable; \n1. Josh Hartnet's very goodacting.\n2. Most of movie is from bad guys point of view. \n\nWhile not a strong endorse to watch, I enjoyed it enough to not regret watching it.",
    "date": "2025-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Really bad! Horrible story. Worse acting.  Not scary or suspenseful.  Don’t waste ur time watching",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A so so thriller with a great cast that just gets wasted in a tedious scripts and slow direction. It does have some moments but they're few and far between. Bring a pillow with you when you watch it cuz you'll fall asleep in the middle somewhere. I had to watch it twice to make sure I didn't miss anything unfortunately I didn't miss a thing.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "You wonder how he would get out of these predicaments.  It is a suspenseful movie .",
    "date": "2025-11-03"
  }
]