[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Hilarious , worth a watch slap stick comedy",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Would recommend this because of the fact that I enjoyed this game and can say that this Is amazing as always. They knocked it out of the park with this movie and game. You need to understand this was the first one to do this because after this then Sonic and Mario. Enjoyable for whole family since it is funny. 100% will recommend.",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I can't imagine how some people hates this film, but I love it.\n- Humor is perfect for me\n- Little bit of nostalgia, 'cause I have seen it in theaters when I was 6 years old\n- Songs and score is so good",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "La vi cuando era pequeño y me encanto, no entiendo porque tan mala critica es muy divertida",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It’s one of those video game movies that’s for the fans and no one else. And as someone who had AB as one of their first games, I loved this movie.",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I liked this movie when I was a kid!",
    "date": "2025-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The Angry Birds Movie (2016) – Animated Comedy\n\nLet’s be honest here—this movie is very rough. It’s not a polished, groundbreaking animated film by any means. But with that being said, it’s still enjoyable enough for young children. They get the thrill of seeing their favorite Angry Birds video game characters brought to life in a theatrical feature, and in that regard, it delivers what they want.\n\nThe voice acting cast is perfectly fine. Everyone does a solid job with their delivery, and the director deserves credit for piecing the film together as best as possible. The issue comes down to the writing. The comedy is present, but it doesn’t land the way it needs to. A lot of the dialogue feels lapse and slightly off, and overall the script gives off the vibe of being rushed rather than carefully developed. It feels undercooked when it easily could’ve been more clever and appealing across all ages.\n\nThat’s really where the problem lies—this movie does not appeal to adults or even teenagers in any significant way. And that matters, because parents are the ones rewatching films like this alongside their kids over and over again. The best animated films succeed because they balance humor and storytelling for both children and adults, but The Angry Birds Movie leans entirely toward little kids, leaving adults bored and disengaged.\n\nNow, it’s not unwatchable. It has enough energy and silliness to keep kids entertained, and it’s definitely rewatchable if you have young children who want to see it again. But outside of that, it lacks substance, wit, and charm.\n\nI’m not going to score this one high. However, I will give it a very slight thumbs up—not because it’s a great film, but because it serves its purpose for the younger generation. It’s not completely rotten, but it’s also far from soaring.",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The Angry Birds Movie is the best movie ever it's my #1 Animated movie of all time but the critics should have it a 80% and popcorn meter 90%",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I feel like this movie is underrated. It’s a really good adaption from the video games! I did catch a lot of references. I played the Angry Birds games when I was little, and I still play it to this day! But I do feel like the other birds were rude to Red, and the movie was kind gross, and it was a bit annoying the way Stella (the pink bird) was moving her arm. But it’s still a good adaptation!",
    "date": "2025-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It took a while to get to the plot of the angry birds game and sometimes the dialogue seemed to be a bit too fast paced. But overall a very entertaining film and it kind of makes me want to play the game again",
    "date": "2025-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Um filme agradável e divertido, além de visualmente colorido e deslumbrante",
    "date": "2025-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The Angry birds movie was worth it great animation, complicated story, and pigs everywhere as they cause destruction everywhere at their island inviting them to a party so they can steal the eggs before the hero comes around to save them which is red I absolutely love king mudbeard as the antagonist of the story the pigs may be clowns but their very enjoyable to watch",
    "date": "2025-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The Angry Birds Movie is fairly funny, and it will keep you invested throughout the whole movie.",
    "date": "2025-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This had so much to do with the games birds vs pigs, the pigs stealing the eggs, and the giant slingshot for the birds.",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Watching this movie warmed my heart it was a great film and the casting, colors and the animation was just amazingly good",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "this is a underated gem",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The movie is okay. I didn’t like how the characters were a bit boring. Most of the movie was funny but weird. The animation was good. I don’t understand this has to do with the game. It’s okay like I said the birds they have in it are exactly how they were in the video game.",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "crude and unfunny humor. disappointed 👎",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The first bit felt a bit off, but I loved the jokes and enjoyed the film.",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is my favourite movie sorry but it just so funny the songs nonstgla the characters and even side characters are fun the pigs are also funny like expected and boy red is relatable you can’t tell me you dislike mightly eagle pissing or any jokes in the movie also chuck is the funniest of all the characters yea just saying wish critics don’t hate this movie or this movie being popped up more in YouTube or Sony ranking videos not only it only got the angry birds movie 2 in theses videos but it kinda weird how this film who got what made angry birds angry birds unlike the second one is worse than the second I like the second one and all but it didn’t even capture the original angry birds movie at least it have silver anyways ye also f##k nonstgla critic for trashing on this real hard",
    "date": "2025-07-15"
  }
]