[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved this movie.  It was refreshing to watch a movie without any alterior motives.  Just a lovely story and so good to watch with my children.  I highly recommend it and hope they make more like it!!",
    "date": "2025-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was too cute! The end made it even better.",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Underrated animated movie. It's extremely funny and has a ton of good lessons and heart at the center of it.\n\nOne thing that disappointed me, and could ruin the movie for some people, is a scene where they destroy a nest in order to cross a river or something. I mean, this is a movie about lost family and family in general; these characters are all like orphans or once lost children. You would think they would be more compassionate and careful when it comes to those eggs and nest. It kind of goes against all the good messages the movie is showcasing.\n\nI still recommend it tho, if you ignore that quick moment i mentioned.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "¡ES HERMOSA! esta película nos deja una gran enseñanza, ademas esta película animo muy bien a Maddie, la aventura aveces es un poquito aburrida pero de resto genial, le podría dar un 4.5 por eso del aburrimiento pero no, es muy hermosa tanto en la enseñanza como en la trama de la película, y la protagonista Maddie es hermosa también.",
    "date": "2025-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is NOT a movie for young kids. There is a lot of adult references and it’s rather inappropriate and I don’t recommend it.",
    "date": "2025-05-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Bright, well-paced, and entertaining. We really enjoyed this movie. The plot is simple and the characters are easy to root for. Visually the movie is vibrant and well put together. The ONLY reason I wouldn’t give 5/5 is because of the few (I mean few) adult sexual innuendos that are sprinkled in. It’s  not egregious, but it just doesn’t have a place in a children’s film and doesn’t add anything to the movie. But overall, it’s an excellent kids film that I think is a hit.",
    "date": "2025-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Back to the Outback is the cinematic equivalent of soggy toast—bland, uninspired, and utterly forgettable. It desperately wants to be a heartfelt adventure about misfits finding their place in the world, but instead, it delivers a painfully predictable storyline with jokes that land about as well as a faceplant onto concrete.\n\nThe animation is generic, the characters are walking stereotypes, and the emotional beats feel so forced you can practically hear the script begging you to care. Even the \"message\" about not judging a book by its cover is drowned in uninspired execution and a lack of originality.\n\nThe villain is laughably one-dimensional, the dialogue is filled with tired pop-culture references that will age like milk, and the pacing drags so much that even kids might lose interest. It’s a movie that exists, and that’s about the best thing I can say about it.\n\nIf you’re looking for a charming, animated adventure, watch Zootopia, Madagascar, or literally any other movie that does this concept justice. Back to the Outback belongs in the cinematic wasteland, never to be revisited.",
    "date": "2025-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A pretty decent movie, although it promotes the idea that dangerous Australian animals are safe to touch and pet. The movie itself is pretty sweet, but the concept of \"Don’t worry, they may be deadly, but they’re nice! I swear!\" just seems a bit dangerous to me. Any dumb tourist could see a potentially venomous snake or spider and try to pick it up because a movie said it was ok. That aside though, I like the designs, and Nigel was really cute.",
    "date": "2025-02-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Much worse than I remember it being. It's a good movie to put on the background to distract your kids, but for adults it's a lame mess. (5.0/10 - Mid, But Almost Alright)",
    "date": "2024-12-31"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "A boring movie with a boring plot and an annoying Koala that made me fall asleep.",
    "date": "2024-12-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I love the movie, I mean, I'm fourteen years old and I keep watching it, I really like its characters, I like the animation, I like the villain, but yes, I feel that the movie has errors in character development, a few slight flaws in its script and I feel that it gives a little cringe,\nI just hope that in the sequel they correct the errors that this movie has.\nIf you like the movie, congratulations, you have your own opinion, and if you don't like it, you have all the reasons why you don't like it, and you only have your opinion, and pretend it's not Canon.",
    "date": "2024-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I agree with nathan z cringe from start to end\n\nFOR THOSE WHO KNOW 💀💀💀💀💀😡😡\n\nall th esngle ladies 🥵🥵🥵🥵🥵",
    "date": "2024-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Pretty Bad Movie, Kids Will Enjoy It Though",
    "date": "2024-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love the movies where us humans are portrayed bad, cause we are and honestly, that's sad. In conclusion, this ATE.",
    "date": "2024-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "back to the outback was a great movie",
    "date": "2024-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Cringe from start to finish",
    "date": "2023-06-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Back to the Outback was an amazing movie. I watched it about a year ago, so it is not that fresh in my mind, but I remember it was great. It was a super funny comedy, and I LOVE comedy. Back to the Outback has a great moral too. Being different is not bad. That's a good moral for a movie. What a good movie.",
    "date": "2023-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I’m not going to say it was great but yeah it was ok",
    "date": "2023-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing, I didn't think I would laugh this hard but I freaking loved it!! There hasn't been many movies I said were good and this one definitely one of my top favorites this year!",
    "date": "2023-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I like it.. it's different, funny sad and good story. I really liked it",
    "date": "2023-04-08"
  }
]