[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved this movie! It's the American Dream... No matter where you come from, you can,through hard work and perseverance, become SUCCESSFUL!  God Bless you JD Vance! Our PRESIDENT 48!! 🇺🇲🙏",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Such a great true story of how to make your way to the top, from very poor roots. JDVance’s story of his life is the epitome of what you can do in this country if you have the grit to do it.\nIt reminds me of Abraham Lincoln’s story.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It was a good movie, not great. The acting was pretty great, but the story is well a story. It was great to see Freida Pinto again, she always seems to brighten the screen when she is on. But, this movie is nothing that we have not read or watched before. Ron Howard has definitely done better Biopics. \nBut, it is a solid campaign add, that is for sure.",
    "date": "2025-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A compelling biography of a young JD",
    "date": "2025-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I grew up in Ohio. Very realistic",
    "date": "2025-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A well made movie about the disintegration of family and economy in post-industrial Rust Belt America. Vance does a service in reporting about a deeper history and culture of Appalachia that is alien even to others in rural Midwest, South and other regions. Adams and Close are great and the lead does a good job. Yet a hopeful message showing that multigenerational families weather storms",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The actors carried this movie",
    "date": "2025-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Anyone who gave this movie a bad rating let their political views get in the way. It’s a great flick and all the “Top Critics” who hate Trump let that interfere with an honest rating of the movie",
    "date": "2025-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Not as bad as it's made out to be. When taken as the story of someone dealing with the drama of family issues, and ignoring this someone is the current VP, it does stand on its own. I couldn't finish in one sitting, which might be my own patience or the fact that it's not so gripping, but in the end, I felt it was a worthwhile watch.",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I don't know what to say this was just very very awful. It's about that really annoying fat politician too... I can't believe it has so many good actors in it.",
    "date": "2025-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best movie I've seen in a long time. Compelling.",
    "date": "2025-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "To me, this movie really hits home. I grew up in a country family and was raised by my grandmother, who cared for me and kept me on the right track. Many people don’t understand how difficult it is to remove yourself from the life you were brought up in.\n\nI had a family that told me “college isn’t worth it,” and I grew up thinking the only option was working on farms for minimal cash flow. If you’ve never experienced this situation, it can be hard to truly understand that lifestyle. That’s why this movie means so much to me, and it has my full support.",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I’m truly surprised to see some of these negative reviews. This movie is not only an excellent film the acting by everyone especially Glen Close \n(Who should have at least been nominated for an academy award) the actors were superb. \nYou really don’t see this much honesty in a film nowadays. Vance was a product of a messy home life and became a mess of a person, but he listened to his meemaw and pulled himself up out of that life. Look at him today. I have a feeling if he hadn’t become a GOP VP many of those bad reviews would be glowing",
    "date": "2025-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent movie and amazing performances by Close and Adams.",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It was not worth the time I had to sit through it...very disappointed that Amy Adams and Glen Close chose to do this ridiculous movie!",
    "date": "2025-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The sad and obvious reality is that if JD Vance was a democrat, the critics reviews would be much higher",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Amazing jobs by all the actors!",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This was a very moving biopic, especially if you know where the main character ends up in real-life.",
    "date": "2025-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I know what it's like to grow up in difficulty and how much strength it takes to keep from drowning in it. I admire this man very much.",
    "date": "2025-06-25"
  }
]