[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love this movie, one of the best I've ever watched! It delivers \"terror\", drama, romance, friendship and much more, for Tim Burton lovers I highly recommend it! I haven't stopped watching since the first day I saw it, too good.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Was interesting for a while, but as it dragged on it became less and less sensical.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The themes and style are unoriginal, but it's an enjoyable watch. Discovering this world alongside the lead is captivating; you too want to find out what happened and how this universe works. Sadly, the film's mechanics are too obvious as it relies on the whimsy of the visuals and premise but neglects to focus on the characters and emotional stakes: the romance feels obligatory, the climactic action scene is a clunky mess, the parents just disappear, and even the closure with Grandpa is hasty.",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Good to great special effects, much scarier than what you might expect for a PG movie.",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Miss Peregrine's Home for Peculiar Children (2016)\nDelightful Original Adventure\n(11,962 – 15 Nov 2016 / 03 Oct 2025 – by Claudio Carvalho)\nJake (Asa Butterfield) is an outcast teenager that adores his grandfather Abraham “Abe” Portman (Terence Stamp) that used to tell stories of the orphanage in Wales where he was raised to him. When Abe is murdered in his house in Florida and has his eyes removed, Jake sees a monster and his parents take him to a psychologist. Jake asks to go to Wales to visit the orphanage and his psychologist agrees. His father Franklin Portman (Chris O'Dowd) travels with him to Wales and Jake discovers that the orphanage was bombed in 1943 by the Germans. When he decides to visit the ruins of the orphanage again, Abe finds a girl and soon he learns that the orphanage, the headmaster Miss Peregrine (Eva Green) and the children still exist trapped in a time loop. But they are in danger since monsters are hunting them down. And Jake has the gift of seeing monsters. What will Jake do?\n\"Miss Peregrine's Home for Peculiar Children\" is a delightful original adventure directed by Tim Burton. The fantasy is a sort of X-Men and is highly entertaining with lovely characters and evil villains. Tim Burton’s creativity once again is amazing. Despite the confused idea of time loops, the film entertains adults and children. My vote is eight.  \nTitle (Brazil): \"O Orfanato da Srta. Peregrine Para Crianças Peculiares\" (\"The Orphanage of Miss Peregrine for Peculiar Children\")\nMy Blog: https://maniacosporfilme.wordpress.com/",
    "date": "2025-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Miss Peregrine's Home for Peculiar Children offers a fascinating time-travel fantasy with strong visuals and decent performances, though it suffers from slow pacing and underwhelming conflict. Logical inconsistencies and overlooked details—especially regarding time-travel consequences—detract from the story’s believability. Despite its flaws, the film remains an enjoyable watch for fantasy lovers, though it leaves room for improvement in storytelling depth.\n\nRead the full review here: (Indonesian version : alunauwie.com) and  (English version : uwiepuspita.com)",
    "date": "2025-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of my favorites. Maybe it’s just me getting older, but I really enjoy throwbacks to simpler stories—family, overcoming adversity, good vs. evil. Too often, movies feel like they’re trying too hard to be “relevant” or, at worst, end up pandering. Real life is already real enough; movies should take us away from that and simply entertain. And Tim Burton’s visuals? Absolutely stunning.",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A visually captivating yet narratively uneven fantasy that shows Burton’s flair for the peculiar but falls short of his best work.",
    "date": "2025-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love this movie! The story is charming and the characters are all exciting. Imagination has no limits here!",
    "date": "2025-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "With the exception of “Sweeney Todd”, this is Tim Burtons best film this century. It’s a return to form for the man who captures childhood fear and horror and whimsy like no one else.",
    "date": "2025-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "amazing scary movie for children, good story line as well as interesting throughout, definitely one of the best movies",
    "date": "2025-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is unlike any other! It’s like magic meets horror! 100000% recommend",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie it has all the stuff you would want in a scary but not to scary movie",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Trust me, you’ve ever seen a movie quite like this! A must see that holds up every time",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "UGH such a good movie!!!! \n\nI haven’t seen this movie since it first came out and just re watched it. I think it got better than I remembered. \n\nBut why didn’t the grandpa go with him at the end 😫",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Edge of my seat the entire story! Lots of twists and turns that made me leaving the movie feeling a little peculiar myself",
    "date": "2025-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I liked this movie as a kid, but rewatching now, especially after reading the original book, I'm disappointed. Not only is the movie generally not intriguing, but so much is changed from the fun book. Jacob and his grandfather's jewish ancestry is a huge and important part of the story, but it was completely erased from the movie. Not at all surprising considering it was directed by Tim Burton. Characters were switched around, Jacob is boring, Emma is boring, Miss Peregrine feels like a different character. So much is different from the book, which is a great read, which makes this film utterly disappointing.",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This movie is very good both for the theme of the time loops, the chemistry of Jake and Emma and the powers of the children. I would give it 5 stars if it weren't for the villains who are a little disappointing and without much depth behind them, but I would give it 5 stars, but for the villains I give it 5 and a half stars.",
    "date": "2025-05-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "You can definitely tell that this is a Tim Burton film. The vibe of this movie was amazing and I love the characters.",
    "date": "2025-03-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Very good film with a fun vibe. The peculiars are fun and interesting, they should definitely do more with the source material.",
    "date": "2025-02-13"
  }
]