[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thought the best aspect of this film was the dialogue. I do not know if the style is accurate but it seems like it might be the way they actually spoke in that part of the U.S. in the early 1900s.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "While the story is a bit slow, it tells a good story based on theory that Henry McArty isn't dead (who is that you ask? Read your history) the cinematography is well done, and storyline does flow well.  Tim Blade Nelson plays a perfect part as Henry.",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This really grabbed my attention. Hadn't seen it before, but have to say, it was a brilliant film. Great acting and story. Authentic in its depiction and doesn't out stay it's welcome. I would consider this a high bar for western storytelling these days.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "An instant classic. Great cast and Tim Blake Nelson always wins me over.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I think it was an awesome western movie. Kept me on suspense the whole time and the gun fight omg! It turned out to be Billy the kid... kind of makes me think if this was really his ending!",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Simple, awesome and satisfying. If you like westerns, you'll like this.",
    "date": "2025-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I saw Butch Cassidy and the Sundance Kid in theaters when it came out. I can't think of any western I enjoyed that much until Old Henry. Just watch. You won't regret.",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The word that comes to mind regarding this movie is \"authentic.\" The lead actor was compelling as a hard-boiled prairie outlaw-turned-farmer. The sets, cinematography, and acting were all understated in a refreshing, non-Hollywood way. The clothes and house were dirty, and the people were not great-looking, just like real life. Loved it!",
    "date": "2025-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What a great Western movie with a twist!!! I was absolutely blown away with this movie. The performances and kills were awesome. Tim Treakle",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Solid, good pace and TBN makes me want to give it 5 stars but nothing jaw-dropping here. Very enjoyable but not breaking any molds",
    "date": "2025-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Spent the weekend watching movies . This one popped up with a good rating . Was a good western flick. The final scene was a bit of a stretch how he out gunned everyone . Was worth the watch though .",
    "date": "2025-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "First off, I enjoyed watching this film. It has a lot of classic elements that work. It has a sincerity and straightforwardness that is refreshing. However, I am kind of torn on it and somewhat surprised by the very high ratings it has. I guess people are just really thirsty for a very simple, unironic, western. This film was surprisingly modest in all respects, which is has a certain charm, but I also kind of agree with one critic who said this film lacks ambition. I was hoping for something more in the vein of 2003's \"Open Range\" in terms of a modern western. This movie feels more like a small stage-play than a grand sweeping western. It's interesting to note that this film has zero women in it, at all, for its entirety. I don't mean to point that out as a criticism or a negative thing. I just point it out because it highlights how narrow the scope of this film is. We also don't really see any other sets/properties other than Henry's farm. Also, the runtime of the film is relatively short. This film almost feels like more of a short film than a full movie. Again none of these things are necessarily bad things on their own. This movie basically succeeds in what it sets out to do. But in the larger picture I think there is legitimacy to the criticism that this movie lacks ambition. P.S. some of the action sequences are weirdly dull. This may have been intentional - they may have been going for a very mundane, realistic interpretation of what a shootout would have really looked like in the old west, but it's also, well, kind of dull and doesn't really satisfy the previous buildup of tension. All that said, this is definitely worth watching if you are a fan of the western genre and are interested in modern interpretations of the genre. Tim Blake Nelson is really great as this character.",
    "date": "2025-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "No Country for Old Men in a western format. Masterpiece. One of the best movies I watched in years. I watched the first half 3 times before watching the second half which was even better. Highly recommended. Would have been rated 100 if we didn't let women vote.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A riveting modern western that combines suspense and violence with the underdog narrative of an apparent farmer facing off against a stronger force. \n\nThe visual shots are nothing short of spectacular and help to keep your eyes glued to the screen. The twists and turns of the plot caught me off guard at times as well. \n\nA great movie overall, one of the best modern westerns with no frills, and Tim Blake Nelson shines as bright as he ever did.",
    "date": "2025-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Le film démarre bien, c'est prometteur, mais très vite on remarque des comportements absurdes, ou tout au moins inexpliqués. Pire encore, j'ai rapidement réalisé que ce film était un remake déguisé d'Unforgiven, mais sans le génie de son auteur, sans souffle ni idées. Le scénario, très simpliste, pourrait tenir sur un timbre-poste, ce qui ne serait pas un problème si le réalisateur avait réussi à le rendre captivant ou à lui donner du sens. Mais non, c'est terriblement vide, sans âme. Quant au twist final, il est risible, tout comme la scène de mort du méchant dans la forêt, mal pensée, mal réalisée, complètement ratée. Une énorme déception.",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Just a good old fashioned simple movie.  Small cast does justice to a cool story.",
    "date": "2025-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I've been seeing youtube clips of Tim Blake Nelson - and I don't know why I just like that guy. He does a great job, cinemetography is wonderful. The story is a little run-of-the-mill, to be honest, which brings it down to the rating I gave it.",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best cowboy movies I've seen in years! It really has a twist also which makes it even better. Highly recommend!",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is one of those movies which starts slow and ends with a bang! Once the climax hits, this movie goes full speed until the end! If you like great story telling, with a classic story-arch, then this movie is for you!",
    "date": "2025-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Buena película y un desenlace sorprendente, al mejor estilo de los viejos wéstern",
    "date": "2025-06-21"
  }
]