[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie! I’m a Star Wars fan and still loved this movie. Not sure where all this hate is coming from.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie made me lose intelligence. It was so stupid, so boring.",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "It's watchable... as long as you have something to do alongside it, because the movie itself is incredibly unoriginal and forgettable. Everything about the movie is one huge cliché after another - from the plot, characters and fight scenes to the very end. This feels like a movie from IKEA, they got the parts and used a well-known blueprint to put it together and yeah, now it exists but it looks like every other movie you've seen.",
    "date": "2025-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Didn't hold my attention. The VFX are pretty poor in places. It's a hotch potch of stuff you've seen before, only worse.",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Far from his finest work but highly watchable. Why are so many people downing this as some \"Star Wars derivative\" when it's clearly a \"seven samurai\" homage.",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's true the story borrows heavily from other sci-fi stories but this is a little unfair as really what themes are genuinely original in this or any genre. The visual style is great but for some reason the storytelling didnt hold my attention. Perhaps a rewatch is in order.",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "An adult version of Star Wars — I hope they make Part 3 as well.",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Rebel moon won an admirable Skidmark award for the most clichés ever compressed into a single movie, and the 3.5 hour Director's Cut wowed audiences with an award-winning 342,048 clichés and totally implausible scenes. Charlie Hunnam's frankly rectal impersonation of an Irish accent won him a Barfta award for Most Implausible Accent, and the scriptwriters were sent straight to hell where they are suffering eternal torture and damnation at the hands of all that is holy and good. If anyone suggests watching Rebel Moon for a fun night in, run immediately out to the desert, remove your eyeballs with a rusty spoon and fornicate your eye sockets with a cactus. It will be considerably more fun than watching literally every Hollywood cliché of all time jammed into this total mess of a movie.",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I really had high hopes, it was kind of borrowing from country westerns and all the sci fi and it almost had me but there wasn’t anything really original in there. Just borrowed trope after borrowed trope. Charlie Hunnam and Sofia Boutella’s exchange after he captures them felt like a high school kid wrote it. V painful.",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Love Sofia and an action star. Yes we don't know a lot about the world so it might have put people off, but enjoyable and worth the watch wish they would make 4 more.",
    "date": "2025-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I enjoyed the movie! The visuals are stunning 👏🏽👏🏽",
    "date": "2025-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I don’t get why people are hating it, yes it was more visual effects than character development however this has the potential of becoming a great universe, if they actually do create the 6 movies or more it will be awesome, people need to understand that now a days you first need to capture the eyes of the audience if you’re doing something from scratch and then slowly develop it into a full universe, most movie universe that we have are based on books or comics but this is something new with inspiration of things that we have seen but still has its own uniqueness so I’m excited to see what they bring next!",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Failure to launch. Seems to have potential for the first few minutes but then fizzles out relying on FX too heavily.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Everyone loves to hate on this film.  I watched the first Directors Cut and since I was streaming it in my theater room I didn't care that it was so long.  I can see that a heavily edited version might not work.  Perhaps this may be one of those films that becomes more favored with time but as long as it was, I did not feel like I wasted my time watching it.  Indeed, I'm glad I gave it a try before reading all the negative reviews.",
    "date": "2025-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Not a great film. I was really looking forward to this. And love some of the actors but it was a pretty big let down. It didn’t build any character arcs and the dialogue felt very amateurish. I only gave it the 2 stars because of the VFX. Otherwise it’s a 1 starts film.",
    "date": "2025-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I don’t know why most people say it’s a bad movie. I thought it was a good movie.",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "An astonishingly bad film that I want so badly to be good. \n\nOn paper, this should have been awesome. The art design is incredible, visually, it is fantastic. The background worldbuilding is genuinely interesting... and also totally unexplored. In all other respects, it is an incoherent, hollow, poorly paced and poorly edited mess.\n\nThe dialogue and character writing is atrocious and there is zero chemistry between ay of the characters. They are all one-note, shallow, derivative caricatures. And the film *drags* with so many excruciatingly, unnecessarily long scenes where absolutely nothing happens. Things frequently happen for no reason other than to drive the plot, even where they make no sense. \n\nRedeeming factors are Atticus Noble as the bad guy, & Anthony Hopkins as the robot. The spaceships looks amazing, the sci-fi elements are genuinely interesting - unfortunately, the entire film takes place in the countryside, so we don't really get to explore any of that. \n\nGenuinely one of the worst films I have ever seen, and part 2 is even worse.",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Incredibility bad, I've liked a lot of what Synder has done in the past, not sure what he was doing on this.  A complete waste of time, if you need help sleeping maybe check it out, other than that avoid at all costs.",
    "date": "2025-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "HORRIBLE. JUST HORRIBLE. Besides a few cool fight scenes it was almost unbearable to watch.",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "If this is 22% I don't care I wish this movie was at a 90% on this website 😁",
    "date": "2025-07-19"
  }
]