[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "An emotional deep dive into this amazing artist that carved his name into a shining star in the sky.",
    "date": "2025-03-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The sad, but all too familiar story about the trappings of success.",
    "date": "2025-02-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Siento que es algo mágico cuando ves el documental de tu ídolo musical, cada experiencia es única y no será compartida por todos, pero es algo seguro decir que todos sentirán lo mismo cuando vean la historia de ese artista que de alguna forma te cambió la vida; y a mí me acaba de pasar con “I’m Tim”, este documental está lejos de ser perfecto, el principal defecto que le encontré es que muchas veces se siente inconexo, en algunos videos te muestran la creación de una canción desde el estudio, y en otros ya directo cuando es un hit; pocas veces vemos lo que sería narrativamente correcto, la creación de la canción para después mostrar su impacto mediático. Y se entiende que este documental depende completamente de los pocos videos que Tim tenía en los estudios, cómo de sus últimas entrevistas; pero no sé, siento que podrían haber indagado más en los artistas que estuvieron a su alrededor, cómo Aloe o Chris; me pareció criminal que este documental no llegara ni a las 2 horas de duración, o que no mostraran casi nada de “The Nights”, “Waiting For Love”, en general se ignoró mucho a “Stories” o peor aún que no se mencionara a Tereza Kacerova. \n\nPero hay que enfocarnos en todo lo demás de este documental, no es exageración que habré llorado más de tres veces viendo esto, las entrevistas con las celebridades invitadas son increíbles, cómo de la forma en la que se expresan de Avicii, a pesar de ya saber el trágico destino que tendría este documental, no deja de ser impactante, en especial Henrik Burman recalca mucho en toda la duración, lo importante de ser escuchado tanto por otras personas cómo por nosotros mismos, esta película reitera una y otra vez cómo sin importar que en nuestra superficie parezca que no tendríamos de que quejarnos, lo que realmente importa es siempre tener un propósito que nos haga felices, aunque sea difícil, siempre encontrar el momento para disfrutar lo que en verdad nos llena, ya sea algo mundano u ostentoso, lo importante es darnos aunque sea un minuto para sentirnos en nuestra mal nombrada \"Zona de Confort”. \n\nYo creo que, aunque las personas que apenas supieran quien es Avicii van a amar este documental, tiene momentos realmente mágicos, la música es hermosa y la dota de un contexto que en una nueva revisitada será aún mejor. Esta película más allá de hablar del mejor DJ de todos los tiempos habla de quién realmente era Tim, tanto de sus demonios cómo de su personalidad que conquistó a toda persona que se le cruzó.",
    "date": "2025-01-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I was nervous about watching this film, given Tim’s suicide. However, his story, personality, and music were so engaging  and I am very glad I watched it. My heart aches for these young people and their families. Tim was an amazing talent and an even more amazing young man.",
    "date": "2025-01-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely breathtaking documentary - a beautiful tribute to one of the greatest musicians of recent years. A real insight into Tim’s creative mind, it makes listening to his music all the more impressive. Lovely to hear him speaking throughout but also heart wrenching hearing his struggles. Definitely worth a watch.",
    "date": "2025-01-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Tim still whispers his message, I was born in 2000 and until today I found out about his story. It's incredible how a spirit can connect with others almost indefinitely. Rest in peace, Tim.",
    "date": "2025-01-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I'm glad this footage and this documentary exists",
    "date": "2025-01-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A raw and honest insight of the highs and lows of the short life of one of the greatest artists of a generation. A large amount of the documentary was in Tim’s own words adding to the feeling of inevitability.",
    "date": "2025-01-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "As an EDM lover I really enjoyed this movie. It is a well produced documentary that also offers an intimate glimpse into the life of a musical genius. The film blends behind-the-scenes footage and genuine Avicii interviews, revealing his creative brilliance and also his mental struggles. It captures the highs of his groundbreaking career and the challenges of navigating the fame that came along with his success. A must-watch for fans and anyone inspired by resilience and creativity.",
    "date": "2025-01-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "If you are a fan of Avicii or not, most of his productions was the soundtrack of our last decades. \nYou must see the movie. This is a gift for everyone, not only for the music, but above the many road we can take unconsciously.\n It’s not a film about EDM music, it’s a film about life.",
    "date": "2025-01-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent. Fan of Avicii or not, you’ll marvel on how the doc explores the creative process of some of his biggest hits and take you on his journey through making it in the music industry, as well as the mental health battles Tim was fighting up until the moment he ended his life. RIP Tim, you’ll always be missed.",
    "date": "2025-01-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What an outstanding, breathtaking documentary.  The producers did a fantastic job of keeping it moving while slowing down at key points to show the viewer what was happening mentally with Tim at the time.  I especially like how they lingered on the creative process while he was composing some of his most memorable worldwide hits. It is such an amazing view into the mind of a genius, and is supported by interviews with so many gifted artists he collaborated with. I got chills several times during the concert scenes, just watching the energy and happiness he brought to so many people. I can't recommend this movie highly enough.",
    "date": "2025-01-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great Doc. Thank you Tim for all of your great music.",
    "date": "2025-01-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very Breathtaking, Emotional, Inspirational, and Uplifting Documentary. after watching it I had no words I speechless all I can say is TRUE CINEMA haha get it cause the Avicii Album called True... You can laugh now, anyways give it all the awards right now, because that was the best piece of media I've seen in the last 5 years. And it shows his life which is what Tim always wanted as he said in this quote \"I want to be remembered for the life I lived not the money I made\" - Tim Bergling, Avicii he also uses it in lyrics for example The Nights \"One day you'll leave this world behind so live a life you will remember\" he expressed that he wanted to be remembered for who he was and for the life he lived and this documentry does a great job of showing that. RIP TIM WE MISS YOU, YOU WERE ONE OF A KIND!  Avicii forever ◢◤",
    "date": "2025-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This film does a wonderful job to showcase how Tim used his incredible ear for music and melodies to create what the world came to know as Avicii-- so much more than a \"DJ\" or a \"producer,\" a true virtuoso.",
    "date": "2025-01-03"
  }
]