[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "There were some plot holes and the story is hard to understand at first but the rest makes up for it, Ryan Reynolds and Walker Scobell play their role amasingly good and the jokes are so funny and well balanced.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Shame that Ryan Reynolds is always Ryan Reynolds, he never play any other character. Overall I liked the concept but maybe a different actor would be a better fit.",
    "date": "2025-10-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The kid made it worth watching.",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A well balanced movie, exceeded my expectations. Was a roller coaster of emotions, a perfect blend of humour, sci fi, romance, emotion. Really appreciate the actors performance. A must watch",
    "date": "2025-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Super fun and great pacing. This film has so much heart which most of today's action films lack.",
    "date": "2025-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Simple plot explanation - maybe some spoilers, nothing too major. \n\nJust a very generic time travel movie. Adam’s dad invented time travel, but didn’t know it. He later died in a car crash, and a past investor in his company took over the company, this person knew that he discovered time travel, and used it for bad. They went in the past and told themselves to invest in specific stocks and companies to emass a fortune. Adam’s wife digs into the situation with the company, and discovers about the investor. She then time travels, and is tragically lost. Fast forward to what we actually see in the movie - adam steals a jet from the company, and time travels back, to try and find his wife. He accidently stops in the wrong period of time, and meets a younger version of himself, who he befriends and takes with him to the correct year, where they are to meet their father, and tell him to destroy the formula for time travel. \n                 Just a well rounded OKAY movie. Wasn’t amazing. Did get kinda boring, and there wasn’t a super engaging ending. Some good life lessons in this movie though.",
    "date": "2025-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "nice script, nice story nice performance very exciting time travel movie. After movie Back to the Future 1985, The Adam Project has given scientific time traveling excitement. The most unique thing about this film was that a 12-year-old child is meeting his own youth, who has come from the year 2050. The film does not show the world of 2050, but despite this, it did not get boring. The best lesson was that tampering with nature causes a lot of damage.",
    "date": "2025-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Fun movie with tons of laughs",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Lame story, annoying charcters. \nDidnt even finish watching it to the end/",
    "date": "2025-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A Time-Travel Loop with Heart\nWhat a delightful piece of cinematic engineering. While it may remind you of Back to the Future, The Adam Project is a far more clever and heartfelt journey.\nThis is a story built like a Mobius strip—a single, continuous journey that twists back on itself. The humor, a sharp blend of wit and charisma, comes from this very paradox, as the older, cynical version of Adam learns from the raw emotions of his younger self.\nThe film is a perfect blend of high-octane action and a tender look at family. It's an exhilarating ride that ultimately proves that no matter the paradoxes of time, some bonds are truly unbreakable.",
    "date": "2025-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I really, really enjoyed this movie, but wasn't certain I would after reading reviews that stated it was simplistic or the same as other sci fi films, however, I beg to differ. This movie explored much more than what people have given it credit for. Familial relationships, grief, acceptance, growing up and the complexities of losing yourself to something dangerous because you have spent your life, and your money working towards it. Maya's character served as both an antagonist throughout but also a sense of self reflection. Adam was a very well crafted, flawed character that added comedy, excellently displayed by both Ryan Reynolds and Walker Scobell, but also realism. The scene of Adam (the pilot and the bullied, asthmatic sixth grader) playing catch with their father was both beautiful and daunting, acting as the key moment where you understand the sacrifices everyone had made. This was a lovely film to watch with my dad, and I simply loved the story line.",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Genuinely amazing and hilarious movie with just about everything you'd want to see in a film",
    "date": "2025-06-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Its kind of a funny movie, and a really well done and catching history, I watched it a lot of times, and I still will watch more. It's simply entertaining.",
    "date": "2025-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Don't expect the most complex story, but you can expect some fun banter between the two Adams and good action. Entertaining, not perfect.",
    "date": "2025-05-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The type of movie that you´ll forget 5min after you watch it. Full of cliches and the \"science\" part is beyond laughable.",
    "date": "2025-05-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's basically what you'd expect from a time travel movie. Really enjoy sci-fi stuff, and this was another solid addition. Nothing crazy, but nothing really against it. Thought it was a really good cast as well. Ryan Reynolds continues to shine in whatever role he is in. Had a good amount of laughs. Also thought it was visually well done. Overall, not bad!",
    "date": "2025-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This movie was wonderful! It had a compelling story, amazing visuals, and was heartwarming in all of the right places. I definitely recommend it!",
    "date": "2025-04-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "(CASTELLANO) El proyecto Adam es una de esas películas que no pretenden reinventar nada, pero lo que hacen, lo hacen bien. Tiene ese sabor a cine de aventuras ochentero que recuerda a Spielberg, con viajes en el tiempo, acción, momentos familiares que te aprietan el pecho y un toque de humor que ayuda a suavizarlo todo. La típica película que podría haber sido un clásico del videoclub si hubiera salido hace 30 años.\n\nRyan Reynolds hace de sí mismo, como casi siempre, pero aquí funciona. Y la sorpresa es Walker Scobell, que no solo aguanta el tipo frente a Reynolds, sino que consigue robarle planos. La dinámica entre ambos es el motor emocional de la historia. El reparto lo completa gente como Mark Ruffalo, Jennifer Garner o Zoe Saldaña, que aportan solidez, aunque sus personajes no tengan tanto espacio para brillar.\n\nLa historia no es especialmente original: un piloto del futuro regresa al pasado para evitar una catástrofe, y acaba reencontrándose con su yo infantil y con su familia. Pero no necesita más. El ritmo es ágil, la acción está bien medida y hay algunas escenas que consiguen emocionar de verdad. La clave está en cómo combina todos esos elementos para hacerte sentir como cuando eras crío y soñabas con salvar el mundo.\n\n¿Tiene fallos? Claro. A veces se pasa de sentimental, los giros científicos no siempre tienen sentido y hay momentos en los que parece más una sucesión de clichés que una historia nueva. Pero también es honesta, entrañable y, sobre todo, muy entretenida. De esas pelis que, sin darte cuenta, acabas viendo con una sonrisa en la cara.\n\nSin duda, una propuesta familiar que, sin ser perfecta, consigue algo mucho más difícil: hacerte olvidar el mundo durante un rato.\n\n(ENGLISH) The Adam Project is one of those films that doesn’t try to reinvent anything, but what it does, it does well. It carries the spirit of '80s adventure films, reminiscent of Spielberg — time travel, action, heartfelt family moments, and just enough humor to keep things light. It’s the kind of movie that could’ve been a video store classic if it had come out 30 years ago.\n\nRyan Reynolds plays his usual self, as always, but it works here. And the surprise is Walker Scobell, who not only holds his own next to Reynolds but actually steals a few scenes. Their dynamic is the emotional core of the story. The cast also includes Mark Ruffalo, Jennifer Garner, and Zoe Saldaña, who all do a solid job, even if their characters don’t get much development.\n\nThe plot isn’t particularly original: a pilot from the future comes back to the past to stop a catastrophe, and ends up reuniting with his younger self and his family. But it doesn’t need more than that. The pacing is tight, the action is well-balanced, and there are a few genuinely moving moments. The magic lies in how it blends all these elements to make you feel like a kid again, dreaming about saving the world.\n\nAre there flaws? Of course. It leans a bit too hard into sentimentality at times, the science doesn’t always hold up, and there are moments that feel more like a collection of clichés than a fresh story. But it’s also honest, endearing, and — above all — really entertaining. The kind of movie that leaves you smiling without even realizing it.\n\nDefinitely a family-friendly film that, while not perfect, pulls off something much harder: making you forget the real world for a while.",
    "date": "2025-04-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Admittedly - I'm a sucker for time travel movies.  This one hit all the right notes, and didn't fall into the familiar traps.  The right amount of humor, action, touching moments, and love.  A Great Film.  Just watch it.",
    "date": "2025-04-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Maybe I'm old school but I absolutely loved this movie. The banter between the characters was incredibly funny and an intriguing plot without being soooooo over the top like most movies. Love loved loved!",
    "date": "2025-03-31"
  }
]