[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Shark Tale isn’t one of DreamWorks best movies, but with a great cast, and plenty of colorful visuals it is good for kids.",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I laugh out loud at this film, a lot of easygoing jokes and just fun to watch!",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "5.7/10 — \"Mediocre\"/\"Passable\"",
    "date": "2025-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Shark Tale (2004) is a pretty bad animation, there's nothing special or beautiful here. The comedy is very frank and the characters are terrible.",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is so awesome! You people have no idea what you are taking about. This is peak cinema. I love that fish so much and these reviews are making me so sad. He does not deserve this. He is just a fish.",
    "date": "2025-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I am seriously mixed about this. There are some moments that work, others not so much. There are some funny bits, but also some groaners. The voice cast is pretty good, but the animation did not age well by 2025.",
    "date": "2025-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Will Smith in his prime era. Martin Scorsese has never been apart of a better film.",
    "date": "2025-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1.5 hours!!!!!!!!!!!!!!!!!!!!!! Rated PG for Some Mild Language and Crude Humor!!!!!!!!!!!!!!!!!!!! The USA grossed over $160,800,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Shark Tales has been able to stand the test of time, many movie references are still popular to this day!",
    "date": "2025-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Worst DreamWorks movie...\nUntil Megamind 2 came out",
    "date": "2025-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie sucks!!!!!!",
    "date": "2025-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Uma animação muito divertida, é um filme que mistura humor, crítica social e mensagens sobre identidade de forma leve e divertida, uma paródia viva das grandes metrópoles humanas. Esse universo é construído com cores vibrantes, personagens carismáticos e animações que, mesmo com os traços caricatos, transmitem emoção, personalidade e movimento com competência.",
    "date": "2025-06-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie feels like something I would dream about after I just had a stomach ache",
    "date": "2025-05-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Uhhhhhhh, what did I just watched??",
    "date": "2025-05-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Why haven't I reviewed this yet? Best movie of all time for sure. Like, I deadass have no idea what score I would legitimately give this movie because I derive so much ironic enjoyment from it.\n\nIt's ok, a lot of white fish can't review movies.",
    "date": "2025-05-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie has charm and comedy. I would say it’s a great go to movie for movie night. Not as good as shrek or nemo but definitely a great movie with phenomenal casting",
    "date": "2025-04-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A truly brilliant film that is one of the greatest comedies of the 21st century. This film brought more laughter to my friends and I than any film we’ve watched together. We love this film with our entire hearts, and we will always love it forever. I would recommend this to anyone looking for a really fun time.",
    "date": "2025-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "this was a very boring film. got to watch shrek the same day which was amazing",
    "date": "2025-03-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "A literal fever dream. What the hell even IS Shark Tale?",
    "date": "2025-03-04"
  }
]