[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great movie! She's so good! But there's no reason this movie had to be 2 hours and 5 minutes. This easily could have been 90 minutes. AND the ending made absolutely no sense. So he wanted to kill her but then as he's dying it's revealed that he actually wanted to go with her when he was a kid like to be his new mom or something, and she says later when he's older? So if that's all he wanted, why want to kill her, threaten the vet's family, kidnap the girl, and then beat her up and almost kill her? Whaaaaat? Then she realizes it and goes over to him and holds him in her lap as he's dying and basically says why didn't you tell me and he said because he was scared? So because he was scared to tell her he instead tries to kill her? Again, whaaaaat? Storyline would have been better If he was a little angry and midway through they had a fight or something, then that realization happened, then they joined forces or something. It's almost like, did anyone really read the script and realize the ending made no sense? It's like, \"I'm an adult now and I'm angry because you left me when I was a kid, I'm going to try to kill you, intimidated a family, kidnap a girl, hire 25 men to kill you with guns, fight you myself, punch and stab you and almost kill you, all because I was scared to tell you I was the kid from 25 years ago whose father beat me and you protected me by killing him and I wanted to go with you but you said find me later and I did but was afraid you wouldn't remember me.\" ???",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The Old Woman with the Knife is a captivating thriller filled with intrigue, revenge, and some great fighting sequences! Lee Hye-young is incredible in this! The cinematography in some scenes is just beautiful. This is a terrific action movie with a few twists that might catch the audience off guard. The Old Woman with the Knife is destined to become a martial arts classic.",
    "date": "2025-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Finally an action movie that doesn’t insult one’s intelligence!",
    "date": "2025-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Riveting and very suspenseful",
    "date": "2025-05-17"
  }
]