[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It was ok not my favorite one",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I know I'm late but this movie was definitely mess making the main character kid have a type of disability was ehh, it was a good movie which made me emotional for only two scenes with some bad acting but the new Predator against the original was a good fight....even though it was short.",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "So bad that is actually kinda fun to watch",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The movie was pretty cool and the armor design was totally sick like awesome sick with cool technology and weapons even that super predator assassin with his dogs",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "By far the worst movie in this franchise. The only movie in my life that I quit watching twice. Got through 1 hr on first attempt and 1hr 15 minutes on second attempt. Deplorable",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Jesus the guy who gave us lethal weapon 1 and 2 is responsible for this? What the hell shane sid you hit your head really hard repeatedly?",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Worst movie in the franchise.  Tries to be funny and nonsensical.  Cheesy characters and video game feel.  CGI is terrible.  Hate this movie.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It was messy but entertaining",
    "date": "2025-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The movie should have stuck to the original script",
    "date": "2025-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I saw this on opening night with a group of friends, all about 4 beers deep and I absolutely hated it. People give AI a bad wrap but I'm sure a basic AI bot could write a better screenplay 3 minutes. If you stop to think about anything for more than a second it completely falls apart, like the fugitive is on earth to save everyone, yet he crash lands and immediately starts taking trophy's. The upgrade predator is seemingly impervious to damage yet in the end he gets shot and dies. The ending is one of most embarrassing things I've ever seen, felt like I was watching an asylum movie or something directed by Roland Emmerich, truly awful",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I expected to dislike this film a lot more. Yes, the story isn't the most compelling, the characters can be shallow and/or very unlikable, the score is pretty weak in my perspective, and it doesn't really give us anything too new or interesting to set it apart from the rest of the franchise. It's pretty forgettable, not very impactful, and bland. Easily my least favorite film in this series. But, it still has some good moments. Particularly, some of the action scenes, which benefit quite decently from the mostly solid effects.",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not bad.  I like how the Predator coms communicate with others in spaceships so you get to see more of their world.  However, most of movie takes place in military base or camp so a bit low budget.  Character development quite good so when some of good guys die, it kinda sucks.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "\" Do you think Shane Black LOST a Bet (?) or said to his Co-writer: ' The Dumbest Flicks make a Billion $'s these days, what if we made the Dumbest Predator Movie possible.....and it's successful (??) ' \"\n\nI plus many & more wonder: The PREDATOR could just be the Dumbest Predator Film ever made.",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "They wanted to recapture the hype of the first one so badly. They rehired one of the contributing writers who also had an acting role in the first Predator film. Shane Black. \n\nThe movie starts off strong; giving nods, and references to the first two movies. Then slowly wanes as it goes on. The comedy elements could have been better or not done at all. Aliens want autism ? Predator dogs? Personally I think this movie would have faired better in a war setting than in a suburban town and forest.",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It was funny sometimes. Positives end there, it’s really dumb. Worst of the franchise.",
    "date": "2025-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "First one hour and 30 minutes were REALLY good,\nBut when that dog predator thing came on the screen the movie got ridiculous",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "There’s a flicker of fun in some gory action sequences, and the Predator designs hold up. But those moments can’t save the sloppy pacing, cringe-inducing humor, and messy editing. It’s a frustrating low point for the series, lacking the focus or thrill of its predecessors. The Predator is a forgettable mess that even diehard fans will struggle to defend.",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Shane Black should be absolutely embarrassed.\n\nThe 2nd scene immediately ruins The Predator, nothing redeems it going forward, just gets worse.\n\nThe Predator immediately exposed himself and drops a body from a vine for no reason, what's the point of his light camo and being a hunter, literally opposite of the other predator movie's on earth (1+2).  \n\nThe acting is really not that good.\nCharacters are just not believable at all, nothing like the other Predators excluding AvsP.\n\nThe 3 Predator movies all have good acting, characters don't over act and are believable despite it being a fictional movie.\n\nThen to pull a complete franchise killer, they change why the predator is hunting the galaxy.\nNo longer about trophies it's about collecting DNA. So frickin lame and once again they should be embarrassed.",
    "date": "2025-09-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This movie should've destroyed everyone's careers from ever doing Sci-Fi ever again, total embarrassment to the Predator franchise",
    "date": "2025-09-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Highly entertaining. Added this one into my go-to movie collection. Absolutely loved this movie! I loved the way the predator (the fugitive) has so much cheekiness about him and how quickly he learns power play from humans.  He has a wider range of emotional responses, I was even almost ready to see some personality development on this predator. I also found the overall body and armor design terrific . Felt thoroughly sad about him being killed so easily by the overgrown one. That was a silly waste of material and potential. Should have joined the humans in the final battle and then the defeat of the overgrown predator would not look so implausible. The human characters, surprisingly, did not come across as annoying. Thiss tory is fresh but stays true to the lore. Anyway, I loved the movie.",
    "date": "2025-09-05"
  }
]