[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Muy al contrario de lo que su título sostiene, está es una película sobre navidad nada usual, en dónde la confrontación cultural planteada al centro de la historia resulta algo entretenida, sin embargo el ritmo y algo que no sé nombrar hace que no funcione del todo. \nAcabó siendo rara.",
    "date": "2025-02-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is a terrible film. Shallow writing and Jashan’s character (Indian) is annoyingly uncultured. The fact that he’s joining his fiancés family (Norwegian) for christmas holidays, it is expected for him to adjust. However, I don’t understand the audacity of his character shoving his culture down their throats. I can’t stand characters with no courtesy to his surroundings. \n\nWaste of my time tbh. This is a good movie to play for background noise while you’re cleaning your house.",
    "date": "2024-12-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The plot—an Indian fish out of water in Norway for Christmas—-is tired. Poorly respected by his fiancé’s family meeting him for the first time, Joshan tries pretty hard to fit in to no avail.  Usual happy ending.  What made it most interesting was watching Norwegian Christmas rituals, of which I knew very little. Also Norwegian winter scenery. In the Netflix version I watched there was little varying between when characters were speaking Norwegian or English as it was entirely in English.  But a more interesting movie then many of the Hallmark Christmas movies with  cookie-cutter plots.",
    "date": "2024-12-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "One of those well-intentioned movies demonstrating the challenges but also the possible rewards of multicultural relationships. Everyone kind of dealt negatively with the situation - neither was the Norwegian family welcoming, nor was the Indian character really so willing to play by their rules. Ultimately though the problem was that it was actually quite boring, though colorful and well-made.",
    "date": "2024-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Not a comedy, not even remotely. Train wreck that you don’t want to watch. Complete lack of communication between all characters creates incredibly awkward, unwelcoming family situation. Got halfway through and shut it off. Don’t waste your time.",
    "date": "2024-12-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I am surprised that Kanan Gill who is an amazing comic btw, decided to just play this obnoxious character of Jashan. Ranting to his mom loudly outside church, ruining Ronya's gig and not being genuinely sorry for it was just too much for me to bear.\n\nAnd Christmas in India is celebrated with carols, church sermons and amazing food not \"5,4,3,2,1 and Merry Christmas\", that is like major downplaying and trivalising of cultural heterogenity of India. Jashan is so ignorant of this and is wary of blending into Thea's cultural traditions calling them cult. Rather than bringing people together, the food scenes are where the cultures clash and in just the worst ways, because of the blatant stereotyping of the story that brings in the spicy vs bland debate. The end with maang tikas and fulkaari dupatta just felt so forced and completely unecessary. \n\nThe movie played into typical stereotypes portraying Indians as loud and overbearing. I watch a lot of christmas movies, predictable, feel good and was actually excited to see Kanan Gill's stint as an actor. This was so outrageous that I had to leave a review so that others do not waste their time.",
    "date": "2024-12-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I had misfortune of watching this movie with my wife and I am not even a fan of Cheesy Christmas movies. I am an Indian and I hated Jashan. Like he was entitled, pushy, didn't understand personal boundaries, inconsiderate, thinks he is funny but is not, always wants to be center of attention, mannerless. The movie should have ended with Thea not marrying this asshole seriously. Although the potrayal of a typical North Indian Man is accurate. The writer i am sure has had a first hand experience with North Indian men. Seriously a true toxic Indian man and the movie should have ended up with her dumping this loser. Also, as Indians being cultural diverse we are also very accommodating and considerate about various cultures and customs unlike Jashan. Jashan ruined this movie completely",
    "date": "2024-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Terrible. No likeable characters and it's a movie with lots of angst. \nCan't recommend",
    "date": "2024-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Jashan is awful. He is loud and selfish, destroying Christmas for everyone. He doesn’t deserve his happy ending. In fact, just the dog and the little girl deserve a happy end. Most of the movie makes me angry…",
    "date": "2024-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I’ve never felt so uncomfortable watching a Christmas film, but not in a thought provoking way, simply in a torturous and unnecessarily stupid way.  \n\nAt first I felt very bad for Jashan and you knew right away things would be awkward and not entirely welcoming for him in Norway. The mother of his fiancé is very insular & it’s hard to watch her reaction when meeting him, and clear she wanted her daughter to be with her ex. \n\n But even harder to watch is Jashan’s obliviously disrespectful and annoying behaviour towards the whole family and Norwegian culture. He starts immediately calling his fiancée’s mother “mama” after she politely asks him not to. There is nothing endearing about taking over the kitchen of someone  you’ve just met and forcing  everyone  to eat your food and expect them to all love it. Then when it’s his turn to eat their food  he makes a massive scene about how bad it is, on xmas day no less. \n\nThe background film clips were beautiful and the film could have been interesting &  the story could have shared a message, as the actor has so much potential not to be so stupid. But the film decided to make Jashan into the most annoying, unaware character it’s actually simply not believable (making the loudest phone call he possibly can in earshot of the entire church durIng the singing recital) \n\nEvery scene but the final one is so cringey it’s  almost sickening. You don’t get a rest from the horribly awkward mess.",
    "date": "2024-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It's really not worth a watch. A cringy awkward sequence of facts that are over exaggerated.",
    "date": "2024-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I’m Norwegian, and I really loved the aesthetic of the movie, it felt really homie. I watched it twice, and especially the second time I noticed how bad the script, message etc of the movie was. Slight spoiler from now on. We know from early on that this is the first Christmas Thea and her family is celebrating without their dad. The dad loved Christmas a lot and had many traditions he had started within the family. Yet immediately upon arriving Jashan starts to disrespect these traditions by saying it’s crazy and “cult” like, even the smallest things seems to bother him, food, activities, he even commented on the tree decorations... And continues to do so throughout the entire movie. And instead of celebrating their traditions with them, and learning about his fiancé’s culture, he pushes his own Indian traditions onto them, and expects the family to disregard their own traditions. Now Thea’s family wasn’t perfect either, they seemed oddly sceptical of Jashan, and her mom was not exactly helping by continuing to bring her ex into all this drama. \n\nIn the end Thea had to apologize to Jashan and to me that just seems…weird. I’m still confused why he was mad. I get Thea was in the wrong for not telling her mom about the engagement. But for him to act the way he had for days, disrespecting her traditions, and agreeing with her to tell them mom about it during the Christmas dinner…then preceding to get very drunk, ruining their dinner, attacking the Santa for Ronja (Thea’ niece) then HE is the one to get mad and literally run off to the airport and she has to run after him?? Makes no sense. (Also doesn’t make sense how he was incredibly drunk, then maybe 2 hours later he is completely sober). \n\nThen 1 years later everything is amazing and their all enjoying their Norwegian/indian Christmas",
    "date": "2024-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Una película inusual de navidad. Fresca y divertida",
    "date": "2023-12-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Tough to watch. It look like everything ends well, but we know thats not the truth, right europeans? I'm just glad it was showed some reality, cause most of the time scandinavians pass as non racists compared to other european countries (or are draw that way) or hide their real selves.",
    "date": "2023-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The same christmas story and family film of always. We've seen this over and over again. Nothing new, not even being an european film",
    "date": "2023-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie was horrible. As a Norwegian Indian person this movie feels designed to be offensive for every culture in this movie. The writing is bad, the acting is bad, and every single character is an asshole. On top of that this movie is filled to the brim with stereotypes. I'd even say that I feel bad for the people portrayed in this movie. The fact that all characters are based off of real people makes it even worse. And for any non Norwegian person reading this, this isnt how we are, the people in this movie are ignorant and selfish, don't take it as an example.",
    "date": "2023-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The plot of resistant matriarch and ex-boyfriend lurking in the shadows aside, I loved the movie! I was rooting for Jashan all the time. He's so genuine and refreshing. It's also a good deviation from the typical Christmassy boy-meets-girl-and-both-try-to-revive-community/family-tradition-while falling-in-love gig.",
    "date": "2023-12-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Probably one of the worst christmas movies i've ever watched. all of them are assholes, no chemistry for the characters for hundreds of miles, bad acting all around, a stupid script, and all just forcefully jammed into a christmas story. barf",
    "date": "2023-12-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thoroughly enjoyed this film, immersed in the enchanting Norwegian traditions that paint a picturesque Christmas atmosphere. The perpetual struggle between a daughter's desire to be good and not disappoint her mom adds a delightful layer of relatability. The movie, with its light and humorous tone, offers a cozy experience, complemented by a well-thought-out film setup.\n\nI noticed and liked the use of beautiful Kähler dishes during the dinner scenes, adding a touch of elegance to the visual narrative. The attention to detail throughout the film is commendable, making it a delightful watch for the entire family. I wholeheartedly recommend it for a heartwarming holiday experience.\nI am from Estonia and I think this movie is especially tailored for audiences in Scandinavia and the Baltic countries.",
    "date": "2023-12-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I don't mind cheesy Christmasy movies but this movie was a complete disaster. If this was a true story and the Indian person behaved like this, I would be appalled, as a fellow Indian, who has been  in a similar situation.\n\nThe arguments portrayed in this film about cultural traditions and norms is almost offensive to a degree. The Indian character in this film makes no attempt to try to understand the culture and norms of his fiancée's family, but instead tries to impose his own cultural norms. In addition, he disrespects the other members of the family and are the cause for conflicts and drama in the movie. The crappiest thing is the movie portrays the Indian character in the right even when they get drunk, pick a fight in front of the family, and openly disrespect all the cooking, traditions, and activities the family does, and storms out after blaming his fiancée with a completely bogus reasoning.\n\nIf the movie is trying to bring light to different cultures and coming together during the Christmas time, it completely fails. I do not recommend this movie to anyone and I would go as far as to say it sends a completely wrong message to folks in bi-racial relationship.\n\nP.S. the actor for the Indian character is Kanan Gill and he is actually a pretty funny comedian so no shade towards him. It's just his character is written worse than if you asked a cat to write a term paper. I'd rather watch paint dry.",
    "date": "2023-12-23"
  }
]