[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I have never made a movie review in my life,I was so utterly disappointed with the level of acting or lack for would be a better statement.the wife was totally out of her comfort zone in this role.she truly cried about 20+times and I swear I almost gave the movie another watch just to she if she ever dropped a single tear.**Spoiler Alert** she never she a single solitary tear.smfh \nOne more thing stood out to me was the fact that she got nfl field goal kicked in the stomach 2+ times, punched and to top it off she was shot in back/stomach and the baby freaking lived….give me a break. I liked her in other roles but as I stated earlier I don’t feel this role was in her theatric repertoire and her agent should be fired for allowing her to delve so far out of her comfort zone  to put out such a performance that many would find it hard to argue that this was even a  screen Worthy performance.terrible casting and the director should take this and truly read the comments and learn from this visual disappointment in every aspect.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie was hard to watch. The acting more so from the wife was by far some of the worse I’ve seen. Loved her in orange is the new black, but this kind of role is outside of her lane.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I’ve never written a movie review. In fact, I made an RT account just to review this movie. This is the worst thing I’ve ever seen. Everybody’s acting was horrible. My 4 year old cousin could’ve done a better job. Seriously it was painful to watch. The tone of voice of all the assailants was so off—they would like say things that were meant to sound aggressive and scary, and instead would sound calm/almost timid. Their faces would not match their words. My God, I’ve never seen worse acting. 0/10 I’m mad that’s not a rating option on here.",
    "date": "2025-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I’ve never hated a movie so much. I’ve read that high schoolers wrote and directed this movie. Netflix should have a category for movies like that alone so they can be judged differently. This was no bueno. “Please” is the main thing I can remember hearing throughout the whole film. Boo.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The only terror that came knocking was the pain in my head while watching this travesty. This movie should be referenced as an example of what not to do. I hate when directors and actors are so over the top and try to throw a hundred things at the audience that all add up to nothing. So many details missed and illogical occuences, and this starts with the child opening the door in the first place. It just continues to spiral downward throughout the movie. 200k ransom, really? GTFOH, and this was to be split between 4-5 criminals. The bank scene between customer, bank-teller, and manager (Laughable) I worked as a teller decades ago, and the stacks the manager presented was well more than 57k (each would have been 10k) Details people, details....smdh. Why would she walk in house and throw the money on table, and say SHE DID IT? Also, they would have known she didn't have the amount before going to bank as they made her transfer all funds to one account ( just nonsensical). God, there are just too many lame things about this movie to continue 🙄😒😴",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I have seen alot of movies in my day and I created this account specifically to say how bad this movie was. Please do not watch unless you enjoy bad movies or want a reference of a bad movie with bad acting. The only good thing I have to say is the movie was written and directed by High schoolers so kudos to them. Other than that its a bad movie.",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "0 stars bro 😭😭😭😭 so tired of this mf saying “PLEASE! PLEASE PLEASE”. Acting was terrible. So many times Marcela could have got away, but instead - she decided to be stoopid! 🤣 I don’t know. This was horrible 😵‍💫",
    "date": "2025-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Worst hour and a half of my life. The best actor was the little dog. He barked so well I believed it. zero tomatoes.\nI wanna know why the neighbor who was almost 9 shows up at the end of the movie with a baby that should have been much older than the baby that Marcella had. Nobody in production could have given her an older baby? Nobody caught that?",
    "date": "2025-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "So terribly bad. Acting is awful",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Netflix’s Terror Comes Knocking: The Marcela Borges Story is a film that lures you in with the quiet, wholesome familiarity of a Hallmark drama — but make no mistake, it quickly reveals itself as something far darker and more unsettling. Based on the real-life events of Marcela Borges and her family, this drama-thriller explores the terrifying ordeal of an ordinary household thrust into extraordinary danger.\n\nThe story follows Borges and her family after they are violently hijacked by a group of criminals who believe they are sitting on $200,000. What begins as intimidation escalates into kidnapping, torment, and relentless psychological pressure as the captors force the family to find ways to produce money they don’t have. It’s a scenario that feels chillingly plausible, and the weight of knowing this is rooted in real events makes it all the more disturbing.\n\nThe direction is commendable in how it sustains tension, drawing the viewer into the claustrophobic fear that grips the family. At the same time, the screenplay struggles with consistency. There are stretches of heavy dialogue that bog down the pacing, leaving scenes that feel stagnant when they should heighten suspense. At times, the narrative is either too vague in where it’s headed or far too obvious, eliminating any sense of surprise.\n\nWhile the performances keep the emotional core alive, the execution often feels uneven. The fight sequences and moments of rescue, which should deliver explosive catharsis, lack the necessary intensity to reflect the full horror of Borges’ lived experience. One can’t help but feel that the film waters down her ordeal, perhaps due to budget constraints or a desire to avoid going too dark, but the result is a loss of dramatic weight.\n\nDespite these shortcomings, the movie still manages to hold attention. It’s engaging enough to watch once, but unlikely to warrant a rewatch. The dialogue-heavy stretches make it more of a slow-burn drama than a gripping thriller, which might leave audiences divided. Those looking for a riveting, edge-of-your-seat experience may walk away underwhelmed, while those simply seeking a grounded drama based on real events may find enough here to appreciate.\n\nIn the end, Terror Comes Knocking: The Marcela Borges Story lands somewhere in between. It’s a sobering look at a true story of survival, but one that ultimately feels restrained when it should have been unflinching.\n\nFinal Verdict:\nA decent, time-passing watch with moments of genuine tension, but not the definitive retelling Marcela Borges’ story deserves.",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "If I could give it zero stars I would, seriously. I only give props because it was written and directed by highschoolers so good job on that accomplishment but otherwise absolutely horrible movie. Such a waste of my time. Absolutely dumb and frustrating and unrealistic and the actors all sucked at acting. Someone else remake it please. Do the “based on a true story” justice.",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Ai slop from start to finish. I think everything besides actual actors themselves is AI. WASTE of time unless wanting to laugh at an insanely terribly movie taking myself extremely serious.",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "this might quite literally be the worst movie I have ever seen. The only good actor was the man and the child. The plot was so unrealistic. I understand this is based on a true story and I get full respect to the family that actually went through it, but the directors and the writers did not care about this movie. It has nothing to do with the budget or anything. Spoiler but why didn’t the wife recognize the girl when she first saw her face after she did her taxes for two years and how was she already in surgery before the husband got in the ambulance. And how could the cop have possibly known those details that she was okay. These are just some things I have seen but throughout the whole movie.  I literally have never written a movie review and I created an account just to talk about how bad this movie was.",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This was the absolute worst movie ever and so unrealistic I want my time refunded . Youre telling me a pregnant woman jumped from two stories and got shot in the stomach and not only did she survive but the baby did aswell?? Yea im all for a good ending but with no storyline and then immediately being action packed this movie is ass.. simply beyond ass.",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "We have all seen a good movie lately, well this will not be your next. Bad… Just bad. It was so bad I actually looked up to see is a group high schoolers in A/V class actually wrote and directed this movie.",
    "date": "2025-09-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "There are some movies that are so bad that they are good.  This one is so bad that it’s worse than those, and not good.  The plot sucked.  The writing sucked.  The acting sucked.  You get the picture. \nI can’t believe I’m saying this but Lifetime I know you can do better.  Come on.",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Terrible from Start to End. I recommend fast fwd the majority. Bad acting , bad dialogue so unrealistic. Could have been a good movie with a good director actors and writer.",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The acting was really bad. The actress is not a leading lady. All she did was squint and pout trying to convey fear. I mean the movie was just painful to watch. After 30 minutes of watching the movie, I just skipped to the last 5 minutes. Maybe if the actors knew how to act, it could've worked.",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "So bad, can't tell what is worse the acting or the plot line.  Its just so bad",
    "date": "2025-09-16"
  }
]