[
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Simple, predictable, boring. Watched because of holiday/winter scenery, in my pajamas drinking pumpkin spiced latte. Otherwise, no way. It must have been written by a man because no woman would find that lead character appealing. Ick.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Feel good movie, fairly predictable & cheesy. But some parts still amusing enough to fill a boring Sunday afternoon.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "What horrendous accents!!!",
    "date": "2025-03-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great Christmas movie! Definitely watch!",
    "date": "2024-12-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "A horrible Christmas movie to watch. A toxic stuck up man trying to ruin a good woman's life and the woman giving in all the time, being cheerful and accommodating, and what's worse is she eventually falls for him. TRAGIC is the word for this movie.",
    "date": "2024-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Utterly woeful, dreadful accents, ridiculous idea of Scottish geography.\nMore ham than at Christmas dinner",
    "date": "2024-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved this movie and have told quite a few friends and relatives about it who love it as well. It's fun and warm and dreamy. The actors and actresses all did a great job!! I even watch it when it's not the Christmas season!!",
    "date": "2024-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fun . Romantic. A joy to watch. Highly recommend.",
    "date": "2023-12-31"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Hallmark Movies would be proud of this. Storyline is terrible.",
    "date": "2023-12-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A fun and easy to watch Christmas movie! It was wholesome and romantic, nothing special but nothing wrong with it either. If you're a fan of hallmark movies then you will absolutely love this movie!",
    "date": "2023-12-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "sweeet and little cheesy xmas movie",
    "date": "2023-12-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "After that cliché with the Scottish taxi driver that she couldn't understand, her being pushed by the dog, \nfalling into Cary Elwes arms and his horrendous attempt at a Scottish accent  I simply couldn't take it anymore.",
    "date": "2023-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Better than A California Christmas",
    "date": "2023-01-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Feel good movie in beautiful setting.  Loved it.",
    "date": "2022-12-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Fun holiday romp.  Homely scenery and easy pace to much down on mince pies with.",
    "date": "2022-12-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved everything about this movie it's simple and very watchable the cast is great it has become a new favorite for watching at Christmas!",
    "date": "2022-04-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love the scenerary and everything about this movie. Music, wit, chemisry between Brooke Shields and her love interest. Funny, sweet, romantic. Love the Castle and Scotland location makes it worth watching a second time!",
    "date": "2022-03-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was funny and different, not the same kind of Christmas movie that comes on every year.",
    "date": "2022-02-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The acting was not terrible but the plot sure was, laughably predictable and full of holes.",
    "date": "2022-01-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not much to say, not sure why this movie was made",
    "date": "2022-01-04"
  }
]