[
  {
    "user": "Lindsey Romain",
    "rating": 3.5,
    "text": "The young cast is excellent. The lore points and witchy nursery rhyme hint at more twisted fun to come. And Janiak’s eye for crisp horror keeps things refreshingly propulsive and infinitely surprising.",
    "date": "2024-02-13"
  },
  {
    "user": "Jennifer Bisset",
    "rating": null,
    "text": "If you're looking to get more into horror, or even introduce your older teens to the genre (and I mean 15/16 plus  – there are some over-the-pants action and sex scenes, which are just not fun to watch as a family), I really recommend these movies...",
    "date": "2023-03-30"
  },
  {
    "user": "Aaron Phillips",
    "rating": 9.0,
    "text": "Fear Street Part 1 encapsulates what made 90s thriller movies so popular.",
    "date": "2023-01-16"
  },
  {
    "user": "Keith Garlington",
    "rating": 2.5,
    "text": "Neither the story nor the characters have enough weight to make “1994” feel like anything other than a retro slasher knockoff.",
    "date": "2022-08-17"
  },
  {
    "user": "Cris Kennedy",
    "rating": 3.0,
    "text": "Leigh Janiak, along with her screenwriting collaborator Phil Graziadei, moves her plot along at a pace and while not foregoing them entirely, doesn't weigh her characters down with too much motivation...",
    "date": "2022-08-04"
  },
  {
    "user": "Erick Estrada",
    "rating": null,
    "text": "If I had adolescent nieces or nephews, I would be plopping them in front of the tv with popcorn so we could talk about it afterward. [Full review in Spanish]",
    "date": "2022-07-25"
  },
  {
    "user": "Jessie Gender",
    "rating": null,
    "text": "While Fear Street certainly has that cookie-cutter Netflix gloss to it, it still manages to provide enough thrills and unique surprises to make it a worthwhile entry into the horror genre.",
    "date": "2022-05-30"
  },
  {
    "user": "Linda Maleh",
    "rating": null,
    "text": "Fear Street is not unaware of the shoulders of past slasher flicks on which it stands.",
    "date": "2022-05-23"
  },
  {
    "user": "David Reddish",
    "rating": 3.0,
    "text": "For now, suffice it to say Janiak and Graziadei have reimagined Stines pulp chiller as a macabre Lord of the Rings-type saga. Fear Street never reaches that level of epic, though that doesnt make it any less fun.",
    "date": "2022-03-13"
  },
  {
    "user": "Q.V. Hough",
    "rating": null,
    "text": "\"Janiak and Graziadei blend the old school with the new; there's the aesthetic allure of Argento's movie Suspiria, the conceptual familiarity of Scream, and also an up-and-coming actress who would typically be the heroine of a modern horror film.\"",
    "date": "2022-02-20"
  },
  {
    "user": "Therese Lacson",
    "rating": null,
    "text": "FEAR STREET PART ONE: 1994 plays on horror tropes and high school angst, all while kicking off an exciting new trilogy.",
    "date": "2021-10-08"
  },
  {
    "user": "Witney Seibold",
    "rating": null,
    "text": "A clever-enough twist on old slasher tropes, full of wonderful characters, and with a sweet queer romance at its heart, this looks like the start of a thrilling new film cycle.",
    "date": "2021-09-17"
  },
  {
    "user": "Jason Shawhan",
    "rating": null,
    "text": "Truthfully, it's kind of sad that a film that exults in its R-ratedness to this extent is instead a Netflix exclusive, but if it gets more audiences to take a chance on bread-and-butter horror like this, I can't complain.",
    "date": "2021-09-08"
  },
  {
    "user": "Ben Turner",
    "rating": 3.0,
    "text": "It looks like director Janiak sat the art director down for a Scream marathon and said \"I want it to look like that\". And it does. It really does.",
    "date": "2021-08-31"
  },
  {
    "user": "David Nusair",
    "rating": 2.5,
    "text": "...the absence of wholeheartedly compelling protagonists goes a long way towards perpetuating the sporadically tedious vibe.",
    "date": "2021-08-16"
  },
  {
    "user": "Andrew Wyatt",
    "rating": null,
    "text": "A flawed but entertaining supernatural slasher epic, one that is more intriguing for its thematic and structural ambitions than its execution of horror fundamentals.",
    "date": "2021-08-05"
  },
  {
    "user": "Steve Murray",
    "rating": null,
    "text": "If you have a stomach for violence and some meta-textual playfulness, rewards await you.",
    "date": "2021-08-02"
  },
  {
    "user": "Inkoo Kang",
    "rating": null,
    "text": "Deena and Sam's romance is a push-pull between two paper-thin characters whose relationship never gains the contours that make you care about its survival.",
    "date": "2021-07-30"
  },
  {
    "user": "John Serba",
    "rating": null,
    "text": "The movie's laden with drawn-out scenes, blah one-and-a-half-note characters, moth-eaten jump scares and enough white-hot referential pop-culture bric-a-brac to melt a million millennials.",
    "date": "2021-07-28"
  },
  {
    "user": "Matt Hudson",
    "rating": 7.0,
    "text": "1994 sets up the trilogy with a fun first installment that is as bloody and vibrant as it was frustrating.",
    "date": "2021-07-28"
  }
]