[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It’s the kind of solidly constructed genre effort that has \"cult favourite\" written all over it.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Ready or Not has a sharp, fun premise and enough personality to stand out from most mainstream horror-comedies, but it never quite reaches the potential of its own setup. The film starts strong, balancing dark humor with genuine tension, and Samara Weaving carries the entire story with a performance that’s far better than the script deserves.\n\nThe problem is consistency. The tone shifts so often that the suspense never fully lands, and the comedy isn’t always as smart as the movie thinks it is. Some moments hit perfectly, but others feel repetitive or forced, especially in the second half when the film leans harder into slapstick than into the psychological tension it builds early on.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Ready or Not accomplishes exactly what it set out to do. It delivers a fun, entertaining 90-minute hide-and-seek game as we’ve never seen before.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "As a kind of grown-up Clue in reverse, complete with the tribute appearance of a pepper-box revolver, Ready or Not also lays out a motley assortment of Colonel Mustard and Mrs. Peacock-worthy opponents hell-bent on dispatching Grace prior to sun-up.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A Classic Horror Thriller. What seems like a quirky and kind of dumb concept ends up providing lots of commentary and satire on the burden of living up to family expectations, acceptance, and norms. It's smarter than you give it credit for at first glance. On top of that it's a really well paced and edited survival thriller in a very memorable setting with some really good acting. It's a small miracle that pretty much every single family member despite not all getting the same level of depth manages to be pretty memorable for the most part. On top of that this also manages to balance the quirky dark black comedy with the thrills and scares very well. It knows how to make the laughs and thrills work together in like a tense sort of laughter type of way. Like in Die Hard at the end sort of laughter or Evil Dead II with the Deer. It's got good direction, a memorable setting, likeable characters, and it's pretty easy to follow again despite so many members of the family. Everything else is pretty soid here. The lighting in this is great and gives a welcoming cozy feel despite being such a tense unsettling chase of hide and seek. The kills are memorable as well. If there is a major knock is it can jump around a bit with so many different characters, subarcs, and sometimes (not very often but sometimes) it can get a little jumpy when focus is off of Weaving as it doesn't really keep them all together at times but it knows just how to anchor for the most part to keep it flowing and tied in. All very minor things really. Anyone who is fan of any actors here, the director, thrillers, or horror films should check this out. I kind of prefer this over Saltburn in terms of the satire on rich families.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "\"Fxcking rich people.\"\n\nOh my god, what did I just watch? That was certainly intense from start to finish. I was genuinely on the edge of my seat and didn't know what was coming next. Pretty satisfying in the end.\n\nI'm not so into the occult angle and kind of wish she had gotten more personalized revenge on everyone, but still, wow. It was thrilling and really well done. Good visuals.\n\nSamara Weaving was perfect. She nailed it, especially her screams and noises when she was in pain or angry. She really sold it. Really, everyone nailed their parts. Good cast.\n\nBut damn, it was so messed up. So messed up, like I felt actually kind of angry about it, even though it's just a movie. I almost couldn't have as much fun with it as I wanted to, and I think the director intended for there to be a little bit of a comedy element, but because I was just so pissed off at the scenario, I basically couldn't laugh.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "É divertido e te prende ao ponto de nem perceber o tempo passar, porém o final é broxante e o plot do personagem do noivo é não fez nenhum sentido para mim.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Truly witty banter mixed with horrendous scenes of shocking brutality punctuates, the “just another day” feel of this black comedy.",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "As a kind of grown-up Clue in reverse, complete with the tribute appearance of a pepper-box revolver, Ready or Not also lays out a motley assortment of Colonel Mustard and Mrs. Peacock-worthy opponents hell-bent on dispatching Grace prior to sun-up.",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "By the end of Ready or Not, each character feels fleshed out, the rituals feel both insane and logical, and the whole experience feels like a blood-soaked roller coaster ride you can’t wait to get back in line for.",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I really loved this film. It is a bit dragged out in the middle, where they could have omitted 15 minutes in editing, but it does come through towards the last 40 minutes . Great acting. Samara Weaving is really excellent in this. Always love Andi McDowell.\nIt was a fun, entertaining show.",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Ready Or Not blends horror and comedy effortlessly to give the audience a great viewing experience.",
    "date": "2025-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Ready or Not (2019) is a very peculiar film, it is lovely to watch but could have more adrenaline and action. The main character is quite weak at the beginning of the film, but later she becomes more sympathetic.",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Creepshow’s Father’s Day, meets Squid Game, meets Die Hard, meets The Most Dangerous Game, meets…\n\nlove the ending.",
    "date": "2025-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This is one of these movies which is an okay film. But after a while when you think about it again, it gets better because it has some creative ideas and iconic moments that stick with you.",
    "date": "2025-10-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A sharp blend of blood, laughs, and tension, this is carried by a perfect lead performance and a setting that feels like its own character. Even with some clunky exposition, an over-eager score, and one memorably silly death, the finale still delivers and cements it as one of the stronger horror-comedies of the past decade.",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Ready or Not features a newly-wed bride who has to take part in a sick initation ceremony, where her rich in-laws start hunting her, literally.\n\nThe movie does a great job of creating a visual potrait of Samara Weaving. The character can be cosplayed for generations to come. The tattered wedding dress, the blood oozing from her face, create a marvelous visual. performance of Samara Weaving just adds to it, as she is extremely likeable and you will yourself rooting for her.\n\nThe movie also has its own morbid sense of humour. I found it hilarious when the character sucker punched a child as I didn't expect it to happen. There are also gags at the behaviour of the rich, as sometimes they are so inept at hunting her down.\n\nI loved the selection of songs in the film, but the soundtrack is still is a few scratch away from being zany like Kill Bill or even Babysitter.\n\nEven the set pieces were great, as the crew members did a good job of crafting up the manor of the family.\n\nThe climax of the movie was kinda unsatisfying to my opinion, because it felt as if the character doesn't have a role to play in the happening of the third act. It kinda robs us of a much more satisying ending.",
    "date": "2025-09-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Good movie and I love the concept, ending is a little goofy but I like it",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The best movie of RadioSilence.",
    "date": "2025-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "While I did enjoy it, it was humorous and great acting especially from the recognisable leads. I didn't say it wowed me.  Still a fun watch.",
    "date": "2025-08-14"
  }
]