[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Whoa. This one was so much crazier then the first content wise. I realized she was Jazmine from the remake of Aladdin which was funny. Man that ending... Absolutely no hope. There's obviously gonna be a third one, so it's cool it's turning into a franchise.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "it's the same movie, but better in almost every way",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "While the cinematography is quite impressive, nothing else in this movie is. I guessed the \"plot twist\" only 15 minutes into the movie. It started off so promising, it only went downhill from there. It tries so hard to be deep and something you’d have to rewatch multiple times to understand, when in reality, it’s not. One of my least favourite movies of all time. I don’t know how it gets all these positive reviews.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Same as the original, but way worse.\nThe film is nothing more but a rehash of the original and once again is unsatisfying to look at.\nI've heard the director didn't want to make a sequel, he originally wanted a prequel. When your director of the original says they didn't want a sequel but was convinced to do so anyway, that's never a good sign.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Rating: 7.7/10\n\nA relentless, visually inventive horror sequel with a powerhouse performance from Naomi Scott.\n\nHighlights\n- Strong Performance: Naomi Scott delivers a career-best performance as Skye Riley.\n- Inventive Horror: Creative use of the \"Smile\" gimmick and disorienting transitions.\n- Effective Atmosphere: Oppressive sound design and score maintain high tension.\n\nCriticisms\n- Plot Twist: Reliance on \"it was all a hallucination\" trope may feel like a narrative cheat.\n- Supporting Cast: Underutilized and mostly serve as fodder for the Entity.\n- Bleak Tone: Constant trauma and lack of hope can be exhausting.\n\nVerdict\nA superior horror sequel expanding its scope and deepening psychological themes. Recommended for fans of the first film and psychological horror.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "It is not often that I say that the 2nd one was better than the 1st one, but this is it. \nThis movie is exactly what should happen when a horror franchise gets millions more in production budget. \nPretty excited to see where this franchise goes.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Definitely in line with the series. Keeps the style of smile and all. Good movie. Scary truly.",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It was garbage. I quit watching it at the end. Not worth the rest of my time.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "OMG this movie is amazing i love the singer plot!!!",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The ending was unnecessary.",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "While the premise of a horror sequel with a damsel in distress, minimal supporting characters, and virtually no expansion to the evil entities lore from first film sounds like a recipe for disaster, they pulled it off well. The story is interesting. The pacing is patient without dragging. They mix gore/creepiness/jump scares, and the lead actress does a good job of bringing to life the troubled pop star.  It won't win awards.  Its not extremely disturbing or super memorable, but you will come out of it satisfied with the 2 hours you put into this horror flick.",
    "date": "2025-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Did a really good job at holding tension, every jump scare landed perfectly. Also couldn't really tell what state the character was in at some point which was excellent.\n\nHad me at the edge of my seat.",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This might be my favourite horror movie of all time. The story is brilliant and Naomi Scott absolutely killed it in her role. I love the glitzy glam pop star aesthetic being mixed into a horror movie, it doesn’t sound like it would work but it did. The soundtrack is also an absolute banger and I loved all the practical effects especially on the entity. Overall this movie was scary and somehow beautiful at the same time. Love it!!",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I love the story idea about smile entity and how it messed up your mind and can’t differentiate between reality and imagination but sadly the torment of the mind isn’t related to main character issues with guilt that she have, only few random flashback and jumpscare about the accident, the rest just random creepy moment that not related with main character phyche. Like the jump scare is totally random. And not related to what going on with her mind and what she’s dealing with.",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "THIS is the perfect example of what a TRULY MAGNIFICENT SEQUEL CAN BE! I was on the edge of my seat THE ENTIRE TIME! Plus it reminded me of one of my favorite anime’s of all time: Perfect Blue. A must see if you haven’t already.",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie and had a great soundtrack",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This film is absolutely bonkers, it’s everything and more that the first one was, it’s frightening and horrifying. The story is completely insane. Naomi Scott is fantastic in this film. Just when you think everything is going to be OK the rug gets pulled out from under you. There’s many twists and turns and on top of that there is some great other scenes of choreography with music and dance on top of the absolute creepiness and unnerving tension that keeps ramping up with every scene.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Damn, they're have to be so many recent horror movies that came out every recent years and later that had to be so graphic it'll make them feel to their stomachs but man enough to do so like myself which is why Smile 2 has got to be the most bonkers out of all of them even though a lot had to be bonkers too. Since I already reviewed the first one which I found to be a decent horror film with satisfying blood and scares but found the ending disappointing but makes up for this one which takes place after the first film so here's that. After the long shot gory opening, Pop star, Skye Riley played by Naomi Scott, is preparing her comeback at touring following her substance abuse including her horrific car accident killing her boyfriend. Despite constant supervision from her mother/manager and their assistant, Skye sneaks out to buy Vicodin from her high school friend, after injuring her back in rehearsals. At his apartment, She witnesses him screaming and panicking before collapsing in an apparent seizure. He gets up, smiling, and smashes his face in with a barbell plate. Afraid of being found in a room full of drugs thinking everyone thinks she has something to do with it, She leaves without alerting anyone. Now cursed herself, Skye begins to experience deranged hallucinations of people smiling at her, causing her mental health to rapidly deteriorate. The way I require this before seeing it, I notice that it's going to be the same thing but much gorier than the film one and this is how intense this experience actually is whenever people are at the edge of their seats to see how the hallucinations are going to get to them as well whenever they'll be having nightmares about it after they've seen it at the cinema. When Naomi is on stage rehearsing, I didn't want anything to go wrong until broke her back or seen hallucinations which it did went wrong because of it and I didn't expect a Drew Barrymore show in the film which is actually part of the story after a gory opening. The one thing I actually notice is that somebody walking towards Skye while smiling while she's given a speech about her comeback and the flashback with him and her and the one that she is with is actually the son of Jack Nicolson, Ray Nicolson. Yeah, how ironic is that? Of course you heard me mentioning that Sosie Bacon is the daughter of Kevin Bacon from the first movie she's been in. And now the same thing that happened in the sequel and I heard that they're making a third one after this one so I hope they'll do the same thing by starring someone's son or daughter and not through the same trope that they in the first and second. I'm thinking that Bryce Dallas Howard would star in the third. I just had my theories with it. So as it is, Smile 2 is one bloody and gory sequel to Smile that is messed up and bonkers like any horror film is and better than the first Smile but hey, don't worry, I still find the first one good for what it is and horror aspects are really enjoyable as well. What makes Smile 1&2 to be scary is what you see on the screen itself even towards the very end and you don't know what is going to happen. It is that scary! And Naomi Scott whom you may recognise her from Disney's live action version of Aladdin and Charlie's Angels reboot is one final girl like Sosie Bacon because who doesn't want actresses to appear in main horror roles? Of course they do because who doesn't like before? If the horror franchise itself continues to be scary, graphic and horrifying then, Hoohoo boy, people are gonna have one hell of their later years of nightmarish experience when the third film is going to be anticipated and memorable and that will get their attention like before. If I was like this smiling and planning what I will do to my victims. OOOOOHHH! Of course you know I have a calm facial expression and when that moment comes, don't worry, you'll know when that time comes so stay tuned for that and smile for the camera. (Laughing)",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Even more tense than the original, but not enough new ideas added to the Smile universe.",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Darn near as good as the first one, outstanding horror, and edge of your seat suspense.",
    "date": "2025-10-29"
  }
]