[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I tried watching the movie without any prior information and had a positively unnerving time. The cinematography alone gives subtile surreal qualities to every place it captures, exactly sizing up the available room and adding additonal dimension to it, before twist after twist works its way through. The story and sequencing are weird in the right way, building up carefully to finally make sense.\nThe acting is committed, horror fans having some of their favorites playing against their images. \nIt's clear, why people were so hyped up about Weapons as a follow-up movie.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "this film was really good, The mother was absolutely terrifying, and I think it’s going to be a cult classic in years to come.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "We get it all men bad. Jesus such a stupid movie",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "First half of this movie was gripping, interesting and had a lot of good tension. Then Justin Long shows up and the movies momentum literally skids to a halting stop. The ending was so bad I thought it was going to be a dream sequence. Lots of great potential which unfortunately didn’t maintain a good course throughout the film. I still recommend only if you can stream for free.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Zach Cregger’s Sam Raimi-esque film is best watched knowing nothing about it, but rest assured it will deliver on frights, laughs, and utterly brazen entertainment.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Barbarian is scary. There is no doubt about that! Cregger has mastered the chiller-feeling one gets when being locked in a basement. But what began as a hair-raising horror film soon fell flat on the jumps once the antagonist was revealed.",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "There was so much buzz about this movie and after watching Weapons everyone told me I had to see Barbarian and it was brilliant. Well, everyone lied. It feels like no one actually bothered to write the movie in it's entirety. The plot holes are gapping and the entire premise of how they got in the house is also completely ridiculous. This is the first horror movie that, 90 seconds in, I was hoping every character died just so I could be rid of them. I only kept watching because e everyone said there was a crazy twist. Where? Where was the mind blowing plot twist? Worst horror movie I've ever seen. And, in fact, first horror movie I have ever been upset I watched.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Title: Utterly Frustrating\n\nSo, I finally decided to check out *Barbarian* after hearing some buzz around it, but wow, what a letdown! Directed by Zach Cregger, who I guess was trying for some edgy horror, the film really falls flat. The plot had potential, but the characters? Absolutely brain-dead. Seriously, who in their right mind would decide to explore a creepy basement alone in a house they've just discovered is already inhabited by a stranger?\n\nJustin Long and Bill Skarsgård may have some acting chops, but they couldn’t save these ridiculous character choices. It’s like they were all struck with a severe case of poor judgment. No one behaves this stupidly in real life—at least not that I know of!\n\nTo be fair, Cregger’s next flick, *Weapons*, is way better.  Maybe he just needed to warm up? But honestly, if *Barbarian* is anything to go by, he’s got a long way to go. Save your time and skip this one unless you enjoy yelling at characters making dumb decisions—it’s exhausting!",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Weird but captivating, wouldn’t say it’s a classic but it did have some good side plots",
    "date": "2025-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The first 20 or so was good. A lot of tension and suspense being built up as the two characters dealt with being booked together in a BnB. Then Justin Long’s character shows up and the rest of the film is all downhill from there. The film did have beautiful and unique cinematography and Georgina gave a phenomenal performance but both were wasted terrible film.",
    "date": "2025-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Barbarian was a good movie with solid suspense and believable acting",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "5 stars... not because I would ever rewatch, but it certainly is unforgettable and made me feel all kinds of intense ways.",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I've still got to be convinced by the Rotty critics analysis of many films. Often they seem to almost border on the scam spectrum. \n\nBarbarian .. which I suffered til the very end was quite simply one of the worst films I've ever had the displeasure to view. Yes there's a bit of decent acting, editing and camerawork.. But call me old fashioned I like a script that suspends my disbelief. Cool film making this is not . Hmm let's think of a comparison.. Psycho, The Shining, It, To name just three wonderful pieces of cinema. Maybe the idiot director and production company should watch these before wasting their efforts again. \n\nHype. No style. \n\nNot to sound too intellectual but this film is total bollocks. \n\nHow he was funded to make his new pile of cack \"weapons\" is beyond me. Possibly the worst film ending of all time. I often wonder if the director was actually in the cutting room for the final 5 minutes. Or was he sleeping with the editors girlfriend at the time..",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I think barbarian is a good movie",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The suspense is great! Watch it….",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Rewiring horror movies. Great funny and terrifying twisted movie. Must follow this guy.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Great until we see the ‘monster’ and its slightly unwehleming from there on out. Think it would have been better to carry on teasing and leave the monster to our imagination for a while rather than full on exposure of it so early on in the film as it then made the remainder when AJ was down there less scary as we knew what was coming and what to expect.",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it. Scary and the cast is amazing, well performed. Horror fan.",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Zach Cregger's unique storytelling in the horror film will leave any viewer baffled, transforming a generic premise into a truly captivating, suspenseful, thematically rich story where the definition of a \"good person\" is brilliantly explored.",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The story’s unpredictability is one of Barbarian’s greatest strengths.",
    "date": "2025-10-29"
  }
]