[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The way how they figure out there plan is slow at first. But once they finally make there move, that’s when things get intense.",
    "date": "2025-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Started out entertaining enough and then went fake beyond belief = stupid. Was there some Marvel aircraft idea rejects or what?",
    "date": "2025-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Like the NFTs that Kevin Hart is pushing, F. Gary Gray’s latest project, Lift, is a complete scam of a movie and just continues Netflix’s trajectory of over-budgeted action thrillers with no personality and zero rewatchability. Red Notice and The Gray Man have set the standard, and Lift has come in and lowered the ante.\n\n\nFull review on my Substack: https://benpatten.substack.com/",
    "date": "2025-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Most people hate this movie because of the fact that only the first part/ some 20minutes in the middle/ and end are \"good\" but i think it deserves a better score, top 3 heist movies i ever watched(not even a big heist movie fan)",
    "date": "2025-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Mediocre flick. Glossy at a first glance, but tries too hard to sound smart while delivering a really subpar, formulaic plot. No thrills to be had here. The heist in itself is embarrassingly dumb. Despite a couple of cute characters in the crew, the movie is a forgettable affair, that lacks the wit, the charisma and the inventiveness necessary to the genre. Charmless.",
    "date": "2025-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Of its type, top flight. Think Oceans 11 or The Italian Job with a hint of Mission Impossible. It's not art & it isn't Mission Impossible, but it's very well done. Lots of drama, a little romance, a touch of humor. A somewhat implausible plot but that IS the type.\nActing is competent, the script & dialogue are fine. Great scenery, locations, feel-good vibes. Pure entertainment. No hint there'll be a sequel, but it's plenty reprise-capable, so good odds there'll be a Lift2. Netflix is producing some very good content.",
    "date": "2025-04-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I really liked it. With most action movies you can predict the ending but i did find it entertaining from start to end.\nI actually think it got better as it went on.. but still a standard action film.\nId recommend it to anyone.\nIt's a perfect light watch.\n\nOh I just realized people are mentioning it's a comedy. \n\nIt is not. It's a standard action film.",
    "date": "2025-03-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Super boring and certainly not a comedy. I literally didn't laugh once.",
    "date": "2025-02-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "If you like Kevin Hart, you'll hate this. If you don't like Kevin Hart.... you'll also hate this. \n\nBad acting, terrible plot.",
    "date": "2025-02-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Total waste of time. Too cliche",
    "date": "2025-02-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Much better than most of the reviews. Great cast. Kevin Hart playing it straight was surprisingly good. Good action.",
    "date": "2025-01-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Everything a heist movie should be: Action packed, suspenseful, threat of violence but not tons of killing, beautiful places, twists in the plot, hightech gadgets, fast vehicles, opulence... this movie has it all!",
    "date": "2025-01-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Look past the awful aviation blunders aspect of the movie and it's just ok.",
    "date": "2025-01-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "So cliched that the director could have used footage from the Italian Job, because he already shot the opening 20 years ago.  Amazing how all these Netflix writers have absolutely no credits but get these big budget jobs.",
    "date": "2025-01-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "First I determine what I enjoy, half of movies made in Hollywood that receive Oscar's are boring and I would never watch them.  When I watch tv or a film  I want to be entertaining, full of mystery, intrigue, comedy, drama.  Critics have no idea what people enjoy watching.  Their opinions mean absolutely zero, nothing, everyone has to decide for theirselves.  Do not go by what others say when it comes to music, tv or a movie. You decide.  How would you feel if someone said I do not like your team.  If you didn't like this film you must have a very boring existence.  Break away from the real world and enjoy being entertained.",
    "date": "2025-01-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Genial, no puedo expresar más de esta película.",
    "date": "2025-01-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Terrible movie. Do not recommend. Lost a part of my life I can never get back!\n\nScript is a shocker. Acting poor. And the \"special effects\" could have been done better by a toddler using a free app on his tablet.",
    "date": "2025-01-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I am a behavioral analyst.  Most of Kevin Hart's fans love him enough to hate that his acting skills were being hidden behind the desire of everyone else to have the \"funny guy,\" the guy that people want to laugh with or at but never seeing his serious side.  His fans have been waiting for a combination of whit and seriousness that shows another angle.  If you are a true sleuth/action/humor fan, your senses were activated from beginning to end.    To Kevin Hart, this is one of the best choices for switching it up.  Perfect! Five Stars.  Many of the fans favorite actors or mine: Batalon, Reno, Mbatha-Raw, D'Onofrio Gorman.  Added favorites are Magnussen, Proud, Corbero, and Kim.  I am going to call it.  Lift II, III, IV.  Waiting for the next Trailer.",
    "date": "2024-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "terrible movie! The writers had no idea about aviation,\nThe plot is complete garbage - even for Netflix’s low standard. What a waste of time.\nadding famous actors to a garbage plot, doesn’t make a good movie",
    "date": "2024-12-30"
  }
]