[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Wow… what a disservice to the original.  Poorly acted and written. As a former SWAT Team negotiator, very very poorly done. Obviously there was zero consulting involved.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "All I kept thinking is that AMIL AMEEN  delivery was Will Smith the entire movie and AMIL AMEEN looking like a doppelgänger of Will Smith with darker skin tone, —- crazy😂",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Inside Man is one of my favorite Spike Lee films, it had a standout performance by Denzel Washington, a cast that included Jodie Foster, Clive Owen, Christopher Plummer, William Dafoe and Chiwetel Ejiofor who were all very good, great directing, great writing, great screenplay, great cinematography, and one hell of a great musical score, if you want to make a great bank heist movie, get Spike Lee to direct it for you, i’m just going to pretend that Inside Man doesn’t exist, terrible directing, terrible acting, terrible screenplay, actor AML Ameen seemed  to be channeling Will Smith trying to do a Denzel Washington imitation, it just didn’t work, Ameen seems like a good actor, but not in this movie, I soldiered through this movie, trying to find something to like about it but honestly, I couldn’t find a thing",
    "date": "2025-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Do you wanna watch a movie that disrespects the original one and Titanic and La Casa de Papel and Clive Owen? This is exactly it!",
    "date": "2025-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Poor script and conventional direction. No continuity at all with the original Inside Man, so there's no need to call it a 2.",
    "date": "2025-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I watched only 10 minutes before switching it off. I expected an A-level film but quickly realized this was more of a B-movie at best. From the start, the acting and directing were poor.\n\nThe plot involves armed robbers taking over a bank, but the lead female gunman looked completely unconvincing—dragging her weapon like a paperweight and delivering a weakly executed Eastern European accent. It was hard to take the threat seriously.\n\nThe opening scene with Remy Darbonne, a police negotiator, was equally unconvincing. He’s trying to de-escalate a hostage situation in a hospital where a man, frustrated by steep medical bills, holds a nurse at knifepoint. Oddly, the director places another nurse hiding behind a medical box across the room—as if she were also in imminent danger. But the attacker only has a knife and is far away. That detail felt forced and unnecessary.\n\nI couldn’t get past the poor execution and quickly lost interest.",
    "date": "2025-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Ameen looks like the son of Will Smith. So, this is basically like the remake of the Inside Man (2006)...",
    "date": "2025-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Mediocre film with bad performances, with Aml Ameen playing a disastrous mix of Eddie Murphy and Will Smith. \nThe plot offends Spike Lee's work, as well as the excellent work of the actors in the original film. And, please, where did they get Roxanne McKee from? What a horrible actress! \nWhat a regrettable experience.",
    "date": "2025-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I mean u could write it better, right? It honestly as if they they dare us. It would not be hard to write this 10 times better. I am really confused....why the screenplay was so bad.",
    "date": "2025-05-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "By the numbers, cliches at every turn. Remind me of 1970s TV movies.",
    "date": "2025-05-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The writers and director could have done better. Good plot, poorly executed. A lot of unnecessary flirting 🤮",
    "date": "2025-05-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It was a phenomenal movie the original one in 2006 --- i dont understand why the nowadays need to destroy everything that was good. actors/actresses performance was like a level awful ... just terrible terrible i dont recommend to watch it at all !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-05-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "If your idea for a good sequel is a poor copy of the original premise, transparent foreshadowing, and some bad acting that destroys the films momentum, then this is your jam.",
    "date": "2025-01-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "We have a great film with a strong female character, it’s called Inside Man. But, that’s not enough! We need a sequel/remake with all female leads!!! And, in the end, we’ll screw it up, make a terrible film, and set women back! Nice work. There was absolutely no reason to make this. But… women power (!!!), I guess? Next up… Saving Private Rhonda? Goodfloozies? No Country for Old Broads?",
    "date": "2024-12-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is an absolute insult to the original spike Lee film. Extremely unimaginative and very predictable.",
    "date": "2024-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Unimaginative and poor writing (poor title as well. most wanted, nickname of the characters) with what they think is clever but in the end is just a bunch of cliches and some political idiologies. No intrigue like the original.  Cast is mediocre, some ok performances from Aml Amen and Rhea Seehorn. But it’s a pale shadow of the movie from 2006. That cast and crew from Spike Lee’s 2006 production: Denzel Washington, Jodie Foster and the rest of the cast was really good. I’d recommend you check that one out and skip this poor sequel.",
    "date": "2024-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "While I like the NYPD hostage negotiators charm, there's way too much cliche bs in this story for taking the namesake of the Denzel movie from a while ago. I'm amazed how they can't use actual buildings/city as things looked so built on a stage I felt as if I am watching a stage drama. Just your average streaming service movie",
    "date": "2024-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "One cliché after the other. This movie fails to deliver anything it promises and runs only on the fame of the original Inside Man.",
    "date": "2024-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "A very unnecessary sequel that tries to add to the original movie, but at the same time it disrespects it.",
    "date": "2024-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Weak and annoying compared to the original. Bad script, bad acting, lame characters, and a complete ripoff with no deviation from the original. Everything sucks. Literally ass",
    "date": "2024-05-26"
  }
]