[
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The movie felt very rushed and the chemistry between the leads was not well developed. The cute moments they did have were quickly brushed over. The events seemed to come out of no where and then be resolved within a minute. I wish there was more story development and showing of emotions rather than trying to cram a lot into a few minutes.",
    "date": "2025-03-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "É um bom filme, lento mas da pra se divertir, especialmente na 2 metade.",
    "date": "2025-03-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love how they pushed each other through the trauma the cutest couple",
    "date": "2025-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Venus Venture Capital (VVC) is your partner in building a robust financial future through diversified investments in the shipping industry. Our focus on tangible assets like shipping containers ensures stability and consistent returns, even in fluctuating markets.\n\nThrough strategic global partnerships and collaborations with Venus Ship Management, we offer investment opportunities tailored to both novice and experienced investors. Our approach prioritizes diversification, minimizing risks while maximizing potential gains. \n\nhttps://venusventurecapital.com/",
    "date": "2025-01-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a very sweet, sad, and happy movie. To appreciate it, you need to put yourself in the role of a young girl who has lived her life not knowing her mom and going from foster home to foster home. I don’t want to give you the details of the movie, but it will make you feel good",
    "date": "2024-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was really very special to me it was both very fun and upsetting at the same time because like \n  It was part of my life because I am also flawed \n  I have a congenital heart so no matter how hard I tried to hold back my tears I couldn't even in the final scene which was unexpected for the audience unlike most other romantic movies that were heartwarming for the audience but I kept crying",
    "date": "2024-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Para começo de conversa, eles estão fazendo o itinerário de uma forma que eu sonho em fazer, um tuor pela França (Europa num todo seria minha preferência), num mini motorhome, uma Kombi, deliciosamente perfeito... Um filme adolescente todo lindinho, recheada de adolescente traumatizados, mas de um alto astral e alegria que deixa o nosso coração quentinho... Fotografia belíssima, roteiro basiquinho, casalzinho convincente...",
    "date": "2024-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This is Rom-Drama and definitely not a Rom-Com, though there are amusing scenes. While the acting is not Oscar-worthy both characters are believable, and the story is different. If you seek action films or steamy sex this file is not the choice. See You on Venus is more like curling up with a satisfying if not exactly memorable book. No regrets investing the time to watch.",
    "date": "2024-05-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Predictable. The storyline is like 15 days long and they don’t even know each other and then they love each other? Otherwise if not thought that way, it was cute",
    "date": "2024-05-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Such a touching story, profound and full of important messages. It leaves you with many questions about the way we live our lifes and what's the meaning of being here. It's visible to me that  its writer is someone with a sensitivity and talent that has yet to be discovered and honored in cinema. Since her novel in which this film is inspired is working so well and has a depth and dimension I rarely find in others... I'm really looking forward to seeing her next works. I enjoyed watching See you on Venus and loved the charisma and tenderness Virginia Gardner brings to her character, cause is close to Mía from the book. Thanks for creating such a lovely story.",
    "date": "2024-02-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a movie with a deep message that I also enjoyed after reading the original novel written by Victoria Vinuesa. I loved to watch how the characters open up about their true worries in a different, loving and totally truthful way that I have never seem till now in a movie. Some of my beliefs, regarding life after death and how much loved we truly are, completely changed. Mia is a character that helped me to question myself, as after seeing her deep love for humanity and her true worries about our indifferent behaviour, I couldn't resist to question myself in that way too. With no doubt I recommend watching the film and also reading the book.",
    "date": "2024-02-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Love the sense of humour and the great  message about life and relationships in this movie. \nBeautiful road movie. \nI can't wait for next movies from this writter.",
    "date": "2024-01-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I read the book last summer and I'm still moved by the depths of the message, the preciously detailed story, bursting with pure, luminous love and with a great sense of humor too. Victoria Vinuesa is a 10/10 writer! Hope to see more of her work on the screen really soon. An unmissable voice with personality, a profound knowledge, and the talent to make you immerse in the story, to make you laugh and cry, to make you feel alive and to make you realize that someone beautiful out there is listening, that you are not alone: and it feels absolutely peaceful and lovely. It'd been years since I last read a book in 3 days. Although the production didn't seem to totally capture the deepness of the script/novel, I totally recommend watching this film, cause, truly, I believe Vinuesa's voice is an outstanding voice.",
    "date": "2024-01-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Lovely and sweet movie. A teen love story about finding their way in life around beautiful places in Spain.\nMy husband and I really enjoyed it and I highly recommend it.\nI read the book a while ago which I loved and I also recommend it.",
    "date": "2024-01-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This feel-good adventure, a movie adaptation of a beloved book, has stunning scenery, humor, and personal growth. It delivers a lot of positive messages about life, forgiveness, and self-love, delivered with heartwarming sincerity.\nKey highlights:\n\n• Uplifting themes: Renewal, redemption, self-help, and finding love for oneself and others.\n• Inspiring quotes: Lines like \"There will always be someone somewhere who's happy that you were born\" resonate deeply.\n• Catchy tunes: Upbeat music that complements the positive vibes.\n\n\nPerfect for all ages seeking a story full of adventure, hope, and heartwarming messages. 200% recommended!",
    "date": "2024-01-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Una gran película para ver en familia. Lo que viven sus protagonistas, lo que sienten y cómo lo transmiten no os dejará indiferentes. Recomiendo también leer el libro, su autora narra con exquisita sensibilidad y un gran sentido del humor la historia protagonizada por dos adolescente.",
    "date": "2024-01-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Emotionaly uplifting, fun and sweet. I would recommend this movie to anyone who appreciates a good message. I must say I've read the book as well and I enjoyed it even more. Definitely search it up!",
    "date": "2024-01-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "See you on Venus is a fresh and powerful movie about true love. The writer knows how to transport the audience to a beautiful and sweet journey through the characters... I really recommended as well as the book in which the author describes every scene in detail in a way I have never read before... I look forward to seeing more films from the screenwriter Victoria Vinuesa.",
    "date": "2024-01-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Beautiful movie, I loved seeing Spain represented! The message is great, and so is the acting. Would recommend!",
    "date": "2024-01-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie! Loved every single part of it!",
    "date": "2024-01-19"
  }
]