[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I have watched many movies from Liam and this by far fell short of what I expected.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I had no idea Netflix could make a movie that is so intense, and so relatable to America back in 2021.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The cast of this movie is good, but they killed the dog so for that matter I stood up and left, I hate this movie.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I have nothing against actors but the directing is just crazy. I couldn’t feel it and way opposite from how things happen in real life. Again I love actors but definitely not the directing and writing, or the story of the movie.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I hate films that depict the murder of dogs. That turned me off. The movie could've ended better.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I feel like no one cared what this movie looked like. Like they couldn't be bothered to do more than just plop down in any convenient place and just kind of point a camera in the general direction of Liam Neeson.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The Marksman was good. I would definitely recommend this movie for an enjoyable watch. Liam Neeson does a great job continuing to lead action films even at his older age. The movie touches on real topics and discussions that matter in America. Overall, I would recommend this movie.\"",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Predictable, but without much payoff in terms of character rapport, twists, or action. Fairly pedestrian, but nothing worse than that.",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The marksman starring Liam Neeson is a great movie about a guy who lost his wife to cancer and just mind his own business on his property near the border of Mexico and ends up helping out a woman and her child trying to escape the cartel. Things turned badly and the mother was shot and the story is Liam neeson’s character trying to get this young man to relatives before the cartel gets to both of them and kills them. I thought this show was really good Liam Neeson does a terrific job in his role as as does the young man who plays the little boy. I don’t recommend this film for children under 14 and there is a lot of violence in this one and the killing of an animal which I hate to see that in a movie.",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "He has a bag full of money that he could buy a new car and not use a credit card. Ridiculous",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not bad, not great... but decent. Liam definitely getting old. 3 stars.",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The critic reviews are just post-modernist douchebaggery. It's a good movie. Watch it with your kids, watch it with your grandfather, watch it with your dad. Not everything has to be some deep artistic expression. Look at the juxtaposition between the people that watched the movie and the people that \"critiqued\" the movie. Can you get more out of touch?",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The Marksman is one of those films that delivers exactly what you’d expect from a Liam Neeson project, offering familiar beats and the same rugged persona he’s become known for. While this movie does attempt to add a bit more storytelling than some of his other recent work, it still falls into that predictable pattern that makes many of his films feel copy-and-paste. It wavers between being slightly more thoughtful and fully embracing the formula he’s repeated for years.\n\nLiam Neeson is undeniably a talented actor, and his presence alone can elevate a storyline. But the issue here is saturation—how many times can we watch him play nearly the same character in a slightly different setting? One film takes place on a train, another on a plane, another in a truck or on foot, and this time he’s escorting a young Hispanic boy on the run. The repetition becomes impossible to ignore, and instead of variety, it feels like another rearranged version of the same story.\n\nThe direction in The Marksman doesn’t do much to break away from the usual Neeson mold. The filmmaker sticks so closely to the established formula that the movie begins to feel like a checklist of Liam Neeson tropes. Somber man with a dark past? Check. Reluctant guardian role? Check. Intense chase sequences sprinkled throughout? Check. Nothing about the approach feels fresh or bold, which ultimately leaves the movie lacking impact.\n\nThe screenplay appears almost tailor-made for Neeson, relying heavily on his persona rather than crafting a character with depth beyond the actor playing him. Instead of building an emotional or complex narrative, the writing centers everything around his presence and his usual style. That leaves the supporting characters underdeveloped, the dialogue predictable, and the emotional beats less effective than they could have been with a more robust script.\n\nThat said, The Marksman isn’t entirely without merit. There are moments of tension, a few engaging scenes, and enough heart to keep some viewers invested. For those who enjoy Neeson’s particular brand of action-drama, this film will likely feel familiar in a comforting way. It’s not poorly made—it just doesn’t offer anything new or exciting to distinguish itself from his other entries in the genre.\n\nUltimately, The Marksman is watchable but not memorable. It sits comfortably in the middle of Liam Neeson’s long list of similar movies, offering a serviceable but unremarkable experience. While it’s far from the worst film in his filmography, it’s certainly not one I’d revisit. It’s a decent one-time watch, but it’s definitely not my cup of tea.",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Watching Liam kick ass, never gets old. Great story, and loved Katheryn Winnick in this. Ignore the critic ratings.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Can’t say no to an action-packed thriller with the Great Liam! I enjoyed this movie. It was a good length where it didn’t drag on and it kept you on your toes watching what the next move will be. Liam stumbles upon a little boy running from the Mexican cartel and takes him under his wing. Liam takes out the bad guys in a satisfying way and he does it with precision. I would give this movie a 8.8/10.\n\nSPOILER ALERT:\n\nIt does not get a 10 because the mother’s death could have been prevented, unrealism, and a bit of a cliffhanger. Why didn’t she tell Liam the cartel was on the way? How did the SUV flip from a sniper shot? Why did Liam take a huge risk by giving the main bad guy a loaded gun at the end? What happened to Liam after he got on the bus?",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "You shoot a dog, you get a bad review",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Predictable story. But, I still thought it was a good movie with an emotional ending.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Very dull and predictable; probably the worst of Liam Neeson starring as an action figure.",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Poorly written. Main guy sees the bad guys waiting to come thru the port of entry and doesn’t tell anyone. Why?",
    "date": "2025-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Its a good movie and eye opening to how the cartel really works.  Not as much fighting as a normal Liam Neeson movie but still a good movie.  Definitely keeps you reeled into it.",
    "date": "2025-08-18"
  }
]