[
  {
    "user": "David Nusair",
    "rating": 0.5,
    "text": "...absolutely disastrous...",
    "date": "2023-03-31"
  },
  {
    "user": "Keith Garlington",
    "rating": 4.0,
    "text": "I quickly found myself engaged in its hyper-fantasy landscape.",
    "date": "2022-08-21"
  },
  {
    "user": "Brian Eggert",
    "rating": null,
    "text": "Jones has made Warcraft into a film that kept my attention and left me hungry for more.",
    "date": null
  },
  {
    "user": "Don Shanahan",
    "rating": null,
    "text": "Little reason is presented to like, root, or care at any level.  Connection has to come from more than cool looks and cool powers.  It needs actions that transcend words and reinforce the destinies supposedly being forged.",
    "date": null
  },
  {
    "user": "Matt Brunson",
    "rating": null,
    "text": "After a trying and torturous opening, the story starts coming into view, and Warcraft soon emerges as - well, it's still a feeble flick, but it improves enough to avoid the year-end 10 Worst placement that initially appeared to be its birthright.",
    "date": null
  },
  {
    "user": "Therese Lacson",
    "rating": null,
    "text": "It is immensely fun to watch if you suspend your disbelief at the door and open yourself up to a completely new mythos and adventure.",
    "date": null
  },
  {
    "user": "Mike Massie",
    "rating": null,
    "text": "To do justice to all the lore and mythology generated by Blizzard's prized computer game would have required a good four hours or more.",
    "date": null
  },
  {
    "user": "Brent McKnight",
    "rating": null,
    "text": "This could have been spectacular, a crazy D&D fever dream come to life. It's weird and ambitious, but though there are stunning technical achievements, it crumbles under the unbearable weight of its flaws and sucks out any possible joy.",
    "date": null
  },
  {
    "user": "Ricardo Gallegos",
    "rating": null,
    "text": "One of the few movies that are worth a watch in 3D: it's visually breathtaking. [Full review in Spanish]",
    "date": null
  },
  {
    "user": "Ard Vijn",
    "rating": null,
    "text": "In the end, as a non-player of the game I was pleasantly surprised by how much I liked the film.",
    "date": null
  },
  {
    "user": "Juan Luis Caviaro",
    "rating": null,
    "text": "Sometimes it is vibrant and amazing, sometimes it falls into the conventional, but, I repeat, I put the blame on its blockbuster status and introduction to a saga. [Full Review in Spanish]",
    "date": null
  },
  {
    "user": "Udita Jhunjhunwala",
    "rating": null,
    "text": "It's hard to tell one growling, sabre-toothed orc apart from another.",
    "date": null
  },
  {
    "user": "Daniel Barnes",
    "rating": null,
    "text": "A film that only serves to set up the many sequels that will never get made, Warcraft is all ambition and no execution.",
    "date": null
  },
  {
    "user": "Ryan Syrek",
    "rating": null,
    "text": "I'm just not a fan, and there is nothing in it for non-fans. At all. So, oh dear God did I hate this movie. One day, there will be a video game adaptation than unites lovers of the original genre and movie lovers. This is not that day.",
    "date": null
  },
  {
    "user": "Germain Lussier",
    "rating": null,
    "text": "Warcraft has some good moments but mostly it's a huge disappointment.",
    "date": null
  },
  {
    "user": "Rachel Wagner",
    "rating": null,
    "text": "All the cool special effects and world building mean nothing if the story doesn't work for this kind of movie.",
    "date": null
  },
  {
    "user": "Phil W. Bayles",
    "rating": null,
    "text": "The fact that director Duncan Jones has hammered any kind of story out of one of the most popular videogames of all time is impressive, but Warcraft goes one better and manages to be pretty damn entertaining.",
    "date": null
  },
  {
    "user": "Allen Adams",
    "rating": null,
    "text": "Warcraft is just one more in a long line of less-than-stellar video game movies.",
    "date": null
  },
  {
    "user": "David Ocadiz",
    "rating": null,
    "text": "Somewhere in here is a great movie, but decisions made by who knows who, the story trips and falls. [Full Review in Spanish]",
    "date": null
  },
  {
    "user": "Micheal Compton",
    "rating": null,
    "text": "This may not be the worst movie of the year, but it is definitely the worst use of $160 million.",
    "date": null
  }
]