[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely unreal film!! Acting is absolutely next level!!",
    "date": "2025-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is an incredibly beautiful version of the film. There is such chemistry between the two actors. I loved the raw passion between them. A very hot and steamy film",
    "date": "2025-06-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I went to England to get the uncensored copy of this book in 1958 and found that it was still banned. I had to go to Paris for it, and have since studied it quite a bit. My favorite film version was the BBC serialization of the novel, starring Joelly Richardson and Sean Bean. I didn't care for the female actors in this new film, as I found them very unattractive. The endings always seem to veer from the book, but that is acceptable. I feel so sorry for D.H. Lawrence who never got any profit from this book and others because of censorship. He would be shocked to know that there are at least six film versions of his most notorious novel.  It took 30 years after his death to get the book published in both England and America. Now, everyone uses that notorious word that got the book banned.",
    "date": "2025-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Passionate is my overall taking from the film. Following your heart because it feels right not because it is right. Jack o Connell is a star!!!!!",
    "date": "2025-06-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Corrin and O'Connell have great chemistry, bringing to life an otherwise traditional tale of forbidden love.",
    "date": "2025-02-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The best film adaptation I’ve seen of this novel. The leads are excellent, with their passion illuminating every scene they’re together. The mature approach to the topic was appreciated as was the treatment of the impending issues of the era.",
    "date": "2024-12-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Before I'd only seen the version from the 70's, which was honestly quite silly and lacked any emotional depth. This one is superbly adapted and shows that all the status and money can never surpass the need for love and human connection. The acting is solid and shows maturity and depth, the costumes and scenery lovely, and the music compliments everything perfectly. It's interesting to see the similarity between that time period, just as the industrial revolution was starting and replacing manual labor, and now with the rise of AI and the erasure of knowing whether or not your job will be taken by a computer.",
    "date": "2024-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Some say its romantic, but to me its aristocratic smutty. The story of love found under great loneliness is cheapened by being 1 dimensional.",
    "date": "2024-06-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "For all its visual beauty, cast chemistry, and solidly-crafted illustration of a crumbling marriage, we must not forget that this is first and foremost a romance, and in that regard it falls short in one vital aspect: its communication thereof with the viewer. The film seems to focus on the Lady's experience by removing its focus from her affair, but then forgets to accurately portray the steps leading to the leads' infidelity. Instead, the script attempts to verbally justify her actions afterwards – a verbose tactic in visual narrative that leaves its characters appearing flat and unsympathetic. Unlike Lady Chatterley, we the audience do not become acquainted with her partner-in-affair, nor with the affair itself; therefore, the romance is reduced to a montage of sex scenes, albeit satisfyingly steamy ones, and little more. What at first bite appears to be a delicious candy made out of all the right ingredients has a tiny hollow centre, a nearly complete product lost in assembly, a romance lacking in romance.",
    "date": "2024-02-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "You can't help but to be drawn to the chemistry between the two leads.",
    "date": "2024-01-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it. Great plot and script. Chemistry between leads and their acting is on point. Beautiful filming locations.",
    "date": "2023-12-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The beautifully choreographed steamy scenes and a deep sense of romantic longing are alluring, but its rushed third act and underdeveloped characters set the film back.",
    "date": "2023-12-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Neither is hot enough for this",
    "date": "2023-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I  loved it, I thought it was very romantic. And beautifully made.",
    "date": "2023-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It's hard to present this story without lots of sex and nudity, but there's not enough of a story behind this to not make it feel like soft, soft-core porn. The acting is fine and the costumes are lovely, but I don't like how specifically drawn the characters are. It is too long and a slog at times. There is a lot of walking and then more walking and it seems like we're running in circles. Final Score: 4.3/10",
    "date": "2023-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I couldn't keep my eyes off Emma Corrin & Jack O'Connell I thought they were both excellent.",
    "date": "2023-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It was quite good\nbut since it was after all a theme of betrayal\nit didn't sit well with me...\nbut even  so it was good",
    "date": "2023-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It took me some time to commit to watching it and didn't really expect to love it as much as I did. I've always thought Emma Corrin was great, but now add Jack O'Connell to my list of great (and sexy) upcoming actors. The direction was spot on and the color palette, costumes and settings beautiful. Everything to like and enjoy with this movie.",
    "date": "2023-06-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The best version of Lady Chatterley's Lover that I've seen.  It not only captures the steamy passion of the illicit affair really well (credit to both leading actors for some very convincing sex scenes) but expertly puts it into the class ridden social context of the period.",
    "date": "2023-05-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A passable period piece and literary adaptation.",
    "date": "2023-04-29"
  }
]