[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Se me hizo un poco complicado poder prestar atención a la historia en un principio pero las escenas y ese silencio asfinxiante me atrapó.\nEl final fue algo que no espere pero tenía toda la razón de ser.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Although we don't learn anything new about these alien creatures from this prequel, it is worth the watch.\n\nLupita Nyong'o and Joseph Quinn give heart felt performances. Joseph Quinn is quickly becoming one of my favorite male actors and Lupita Nyong'o is just such a gem. She's a pleasure to watch. \n\nThe story is one of humanity. Two people, though reluctantly at first on Miss Nyong'o character's part, strengthening each other at their weakest moments. It is a story of loss, yet filled with hope, given through the strength of these two main characters and a very loyal cat.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Rating: 7.6/10\n\nA poignant, tense prequel succeeding due to Lupita Nyong'o's performance and unique emotional angle.\n\nHighlights\n- Emotional Story: Focuses on terminally ill Sam's quest for agency in her final moments.\n- Strong Performance: Lupita Nyong'o delivers a masterclass in acting without dialogue.\n- Intimate Direction: Michael Sarnoski brings a character-driven approach, emphasizing human connection.\n\nCriticisms\n- Predictable Plot: Familiar \"hide-and-seek\" formula and known invasion outcome lower stakes.\n- Underutilized Characters: Djimon Hounsou's character feels like a bridge to the next film.\n- Limited Scope: May disappoint viewers expecting a military-heavy war movie.\n\nVerdict\nA worthy addition to the franchise, trading action for a somber meditation on mortality and human connection. Recommended for fans of horror with emotional depth.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Straightforward storylines, enjoyable to watch.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Booooooring. Really dull. Doesn’t add anything to the franchise and as a whole, very predictable. Find something else to watch, this is a waste of time.",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "A Quet Place: Day One is a nice movie but it doesn't add anything to the genre, to the franchise, and to anything at all. It's well acted and directed but it lacks real tension and the fact that we see the creatures from the first moments of the movie doesn't help to build up suspense that's instead much needed.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "genuinely beautiful movie, i like the simple idea of focusing on connection during the invasion as the first 2 movies were more action and survival; which makes sense don't get me wrong, but the humanity side of this movie is genuine and beautiful. really nice to watch.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "There is no charm in this film.",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It wasn't bad. There was just a huge lack of characters. If you saw this poster then you are familiar with the entire cast already without seeing the movie. Also I was expecting more visual effects since they decided to bring \"Quiet Place\" to NY... They could've done a much better job at showing more of the city & just in general it felt like they were hiding from those monsters on the same street the entire movie. But overallit was okay. It got emotional at the end, which was a highlight.",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I really wanted to like this film.\n\nMonsters decided when they wanted to be scary, movie pretends to hold emotional weight without earning it, and characters make wildly dumb choices.",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A monster movie that combines apocalyptic horror and humanity in such a moving way",
    "date": "2025-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Nothing we didn’t already understand.",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Surprisingly great, aside from a couple small parts. Lupita and her cat were everything.",
    "date": "2025-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Despite what many have said, I found this to be an entertaining prequel to the original film.\n\nRevolving primarily around 3 main characters (one being a cat called Frodo), it certainly keeps you on the edge of your seat, and Lupita Nyong'o is fantastic in the lead role and keeps you watching.",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Good movie with lots of action. I just wish the story was a little stronger.",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Why the heck is movie based on a cancer patient chasing pizza, this was by far the worst movie I have ever seen beginning to and total waste of time it was a boring movie. The best part was the fricking cat, fat cat",
    "date": "2025-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A marvel of digital effects and performances, this excellent if albeit VERY unnecessary prequel makes for a great time overall.",
    "date": "2025-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "A great story told in the most drawn out & boring way.",
    "date": "2025-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "These days, it seems like lots of quality entertainment is being done in the horror genre. And while that is usually not my favorite, I must join those who have praises for this particular entry to the field.  Lupita Nyong'o and several other actors were excellent in conveying fear as well as the determination to survive. I wish we had seen more of Djimon Honsou - we always enjoy his work. But the star of the movie has to be Schnitzel the cat, playing the part of Frodo, the most amazing comfort/service animal ever portrayed in a movie!",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was a great way to know how it all started when all those aliens' monsters came from space crashing to earth.",
    "date": "2025-09-13"
  }
]