[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved everything about this movie , such a great story . I would watch again",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Wonderful movie, slightly cheesy with the scientific explanations but would watch again.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Beautiful storyline. \nI love that it takes place in San Francisco and you get some history as well.\nWell acted and very believable.\nThe part about the stock market algorithm developed from a weather algorithm  is spot on as a friend actually is a stock market algorithm architect. \nExcellent ending to a wonderful story.\nOne of our favorite movies of all-time!",
    "date": "2025-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Came across this movie on a whim and decided to watch it. I enjoyed it. They took an interesting premise and pulled it off.  Pretty decent story flow kept me interested. I thought the Harrison Ford scenes in the latter part of the movie really brought it home.",
    "date": "2025-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I liked the movie, it was good...",
    "date": "2025-05-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "One of my favourite films. Sometimes boring and predictable but really enjoyable.",
    "date": "2025-05-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Good movie idk why the score is low its a good light movie must watch for romance lovers",
    "date": "2025-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "After watching Ellis coercing Adeline to go on a date by threatening to withhold the donation I could not watch one more second.  Made in 2015- thankfully this kind of vile male conduct would not be allowed today.\nDon't watch this make fantasy film.",
    "date": "2025-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Blake Lively is not a good actress, and the industry should just stop the nonsense of giving chances to ruin movies to nepo babies without talent. There are plenty of talented actors whose parents are well-known in Hollywood, Lively is not one of them. Waste of screenplays every single time!",
    "date": "2025-05-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This would be a 5 star movie if it wasn’t for one annoying thing.\nThe narration!\nThe guy’s voice sounds like an AI instagram voiceover and he’s giving far too much scientific information to explain Adeline’s condition and experiences. \nIt’s really quite annoying because whenever he speaks he’s ruining a fantastic movie.\nThe narration is heavy at the start of the movie and comes back to annoy you at the end but other than that it’s still a great movie and definitely worth a watch.",
    "date": "2025-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Love this movie - something a little different and unexpected. Enjoyed everything about it.",
    "date": "2025-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "What if we stopped aging altogether, immune to the ravages of time, never worrying about the process of slowly withering away? But just because time doesn’t move with us doesn’t mean it can’t stop for love 10 years old and this serves as a familiar tale we all know Yet it acts as a fable touching upon things like mediation on immortality, impermanence, loneliness, loss of life, and the struggle to find love thanks to director Lee Toland Kriger Blake Lively plays Adaline Bowman; she’s an ordinary woman born in 1908 She was married and had a family of her own Then one night driving home she gets into a car accident and by some magical set of circumstances her body chemistry is drastically altered From that moment on Adaline has gained the gift of immortality being immune to the ravages of time not aging another day It seems unbelievable to her but there are obstacles to contend with; everyone else around her still dies either by natural causes etc., she has to keep moving from place to place to avoid suspicion given the many decades she lives through, it also pains her that she cannot be with someone having a real relationship In present day she meets a young man named Ellis, he becomes the apple of her eye yet she’s very reluctant to make it real believing she can spare him the pain of him staying young Harrison Ford also plays a supporting role tying to Adaline’s past which hits hard for her The film is utterly romantic with a love for things nostalgic of days long gone along with some good acting When you don’t age like everyone else it’s not the same when you don’t grow old, that love be everlasting and have meaning only heartbreak, is there something we can hold onto and never let go, some of us don’t know how to have a life after so long, it’s also a true testament nobody wants to live forever, time is precious, and love can be eternal, our bodies grow old but our passion can abide, it’s much stronger than longevity Blake Lively’s performance really carries the film even if it feels a bit saccharine and more along the lines of a Lifetime tv feature It also feels a bit long being nearly 2 hours But the movie goes over the ruminations of living an eternal lonely existence in a believable manner without leaning too heavily into the sci-fi aspect with undertones of melancholy and yearning for a connection Ellen Burstyn and Amanda Crew are wonderful supporting players as well with heartfelt performances The costumes for each decade are spot-on too next to warm cinematography For Adaline she’s an old soul having the wisdom and weariness never growing old being a big downside so the movie addresses several of the pitfalls living with something that feels like a burden Again Lively’s performance is the strength of this romance meets science-fiction tale making us appreciate our own mortality",
    "date": "2025-04-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Blake Lively is a one- note actor. Boring.",
    "date": "2025-04-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A must-watch for anyone who enjoys films that spark both reflection and emotion.",
    "date": "2025-03-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Fairytales make magic so that they can reveal something about reality. This movie suspended reality and stayed there, never telling a single truth about anything. Adeline doesn't age and everyone around her does. So, she pretends to be 29 and dates other men of this age group. These young men aren't intimidated by her at all. They are allured by her maturity, wit and knowledge and fall quickly in love with her. What reality is this, again? Because most 29 year old women are faced with guys who can't be anywhere around a woman who is superior in any way to them. In reality, men would be running away from Adeline, at best, or at worst, actively loathing her. There is no way a 101-year-old Adeline would want anything to do with a 29 year old man. I found it more likely (though still not very likely) that she'd be a better companion to Harrison Ford's character simply because he was older. Then, to find out that he was the love of her life but, oops, she's dating his son and has fallen for him, instead, for some unknown reason... It was just ICK. There was never a believable moment in this film. I thought the acting was wonderful. Blake Lively and Harrison Ford were fantastic. But... there was no truth anywhere here.",
    "date": "2025-03-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Although the storyline is based on silly cellular biology science, the acting by Blake Lively and most of the cast makes this a very fairly enjoyable movie.  The script for Ellis trying to win Adaline was a bit creepy, stalky and pushy and lacked the chemistry another actor could have delivered.  The other actors and their scripts were fine.",
    "date": "2025-03-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It had some weak points, but I enjoyed it overall. Good acting, great score, heartfelt story, and shot beautifully!",
    "date": "2025-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Great picture, good acting, but a very boring second half of the story.",
    "date": "2025-02-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I love this moved and the majority of the cast are great. It is well worth seeing and it will remain one of my favourite films of all time, but I feel Harrison Ford for me is a little miscast, and jt looses some of it's flow in his scenes",
    "date": "2025-02-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The science behind the film completely fails to impress, no matter how much the narrator tries to make it sound believable. If you can get past that, the acting and chemistry of the leads makes for an enjoyable and relatively original film.",
    "date": "2025-01-28"
  }
]