[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Another movie that is unrealstic, too simple and the same as always.\nAt my age it is annoying and boring to be presented with the same lame story telling over and over again.\nA pity, that money is wasted on a good idea with such a shitty outcome.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Absolutely ridiculous movie. Not worth it, except as a goof.",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Absolute garbage.\nCheap, corny, borderline comedy due to how hilariously bad it is.\nI enjoy a corny action film every now and then but this is diabolical.\nI expected more from Chris hemsworth",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "its no more than what its supposed to be... sorta like Die Hard on the real cheap.. plot makes little sense but the hero wins all the improbable fight scenes after getting stabbed, tossed, strangled... and I guess its fun watching a 5'3\" 100lb soaking wet woman beat up a 6'3\" 240lb trained killer... who wouldn't like that? except the guys mother... grab some popcorn and lay back and enjoy...",
    "date": "2025-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Can we give a negative star rating? This movie was embarrassing. Cliche script. ANOTHER super hero women beating up men twice her size, and in the end with 1 arm.\nThe atrocious acting is not the worst part. We were giggling everytime we guessed the next scene. So there it is; this is a comedy although not sure it was intended to be.\nWhat scares us is surely noone really enjoyed this as an action movie? \nSo, so bad!",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Before I watched this on Netflix I just finished The Gray Man about 2 weeks ago. And then Netflix hilariously recommended Interceptor as the next similar film that I should check out. Big mistake. I've seen better action choreography from comedy film, heck, I think I've seen better action from some cosplay ninja police whatever themed adult film.\n\nSo what's the big problem with Interceptor. Well, basically there is this film that came out in 1992 called \"Under Siege\" starring Steven Seagal. Just watch that and compare Interceptor to Under Siege and you'll see what the big problem is. or should I say the lack thereof, the action. In Under siege the protagonist roamed the whole ship taking the bad guys out one by one until the good guys defeated all the bad guys. In Interceptor, the protagonist stare angrily at the bad guy for like an hour. and then there is like maybe a bit of fighting here and there and near the end. No epic gun fight, no epic cqc, just a bit of smacking around near the end to fill the action quota, and that's it. Had they do a similar script like Under Siege and do a Guerrilla warfare that gradually wears down the terrorist that would have been a very good film. Case in point, Under Siege and The Rock, all very good action film that I'd watch again and again.\n\nAnd then the villain, what a boring character, doing all this for money!? seriously, I'd remember the general from The Rock because there is that human moment where he choose not to kill innocent civilian with missiles or how Tommy Lee Jones play this kind of crazy but charismatic mastermind because they got a thing that makes them a great villain instead of an angry guy with a gun.\n\nSo to sum it up. This movie is really bad. Whom ever wrote the script should maybe watch some action film or read some books because they have no idea how to write a good action film.",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Such a tiresome cliche. I just wasted an hour and half. Most of these types of movies feature a woman as the US president. I guess the writer thought Kamela would win.",
    "date": "2025-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A small woman with one arm incapacitated beats up a trained mercenary with torture skills! Saving the world with 1/3rd second to spare. Too many crazy things. I was busy elsewhere and had this on in the background, no way could I have sat and given it my full attention. Chris Hemsworth obviously thought being an Executive Producer gave him the right to a small part in the movie. A stupid, annoying part! Each time he popped up I thought why is he being such a clown?",
    "date": "2025-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very entertaining. The star was awesome!",
    "date": "2025-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "As close to a Matthew Reilly book as you'd expect.  Suspense and ridiculous feats of unbelievable heroism.  Love it for the movie it is intended to be.",
    "date": "2025-06-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The premise at the start was promising, then went downhill from there with too many holes. Especially at the end where she had only 3 minutes to save the USA, no way. Unrealistic.",
    "date": "2025-03-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This is a horrible movie! 💔😩😭\n\nMy only regret is the 90 minutes I will never get back! I feel dumber having watched this movie!",
    "date": "2025-03-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I don’t find the criticism that it would be bad. I loved it. Just a simple movie, chewing gum for the mind. Need more like it.\nYours truly. Bryan Cahill Beara peninsula, Ireland",
    "date": "2024-12-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Elsa did an amazing job with this one!! Was captivated for every second of it. The fight scenes were incredibly well choreographed, and her muscles are now the only gym motivation i’ll ever need. Loved it!!! Keep ‘em coming.\n\n\nFor future reference: never look at the male reviews of a female lead action film. If the lead star of this was Bruce Willis or another one of them bald dudes, the men would be losing it - but, I guess it’s hard to handle watching a woman win against all odds, and with just one arm :)",
    "date": "2024-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Ignore the critics - if you want a solid female B action film this is a good one.",
    "date": "2024-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "what a terrible movie. I really mean it. It is as bad as it gets. All the Americans in the movie are traitors and a girl from Spain saves the American army against Russians (I assumed that is the ending because I stopped watching an hour in the movie and had to rush to the bathroom to throw up).",
    "date": "2024-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The description sounded interesting, but in terms of execution this movie was awful. So many elements were unrealistic to the point where it wasn't entertaining. Very disappointed.\n\nI think my biggest issue is more with the story. As I said, a lot of it was unrealistic, and certain character reasoning for why X was happening didn't line up.\n\nThe backstory behind the main character was a typical cliche that obviously was used for the sole purpose of explaining why she was where she was. It was such an overused sub-plot I started getting annoyed whenever it came up.\n\nThe ending was even more confusing. Granted, I skipped ahead a little cause it was boring, but how it ends leaves you scratching your head as to who the bad guy was.",
    "date": "2024-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Elsa is spectacular in this movie and the action is fantastic.",
    "date": "2024-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Watched it many times and was still fantastic, one of my favorite movies of all time.",
    "date": "2024-06-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "You can't take it seriously but it is a lot of fun.",
    "date": "2024-02-10"
  }
]