[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Heart warming , sweet, endearing  movie with a love story for many different age groups. Although they did miss the chance to broaden the movie by having the mother inlaw have a more indepth story line. She could of meet someone at the community center or discuss her past more. To bad its on Tubi only and not available to more streaming services. Plus I was waiting for the Uncle to come out of the closet.",
    "date": "2025-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "\"Worth the Wait\" was a funny, warm rom-com that I enjoyed watching. Well-directed and excellent acting. As an Asian American, it was wonderful to watch a comedy featuring so many actors that looked like me. Highly recommended.",
    "date": "2025-06-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Lame movie lol sucked so bad",
    "date": "2025-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "\"Worth the Wait\" tells multiple heartfelt and relatable stories that moved me to tears in various scenes.  It was both humorous and touching, with raw human emotion intertwined. It's worth watching!",
    "date": "2025-06-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie showcases an amazing collection of actors, and the interwoven story lines combine to create an entertaining and heartfelt film. This is essentially the Avengers of Asian romance/comedy actors, featuring all-stars like Ross Butler, Lana Condor, and Andrew Koji, as well as up-and-coming stars like Ali Fumiko Whitney and Ricky He. I particularly loved Ali Fumiko Whitney’s portrayal, having seen her in several films this year (#AMFAD: All My Friends Are Dead / Find Me Falling), this girl has RANGE! Add this film to your must-watch list. Great to see a new platform like Tubi dive into original content.",
    "date": "2025-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie starts out a little differently than most movies. It quickly introduces the characters and it seemed intriguing. The dialogue was quirky and enjoyable. \nSpoiler: As the father of three, and a grandfather I was upset by the birthing scene, that with no foreshadowing turned into a stillborn.  I don’t like the latest trend of calling something a comedy, that has horrible tragedies in it. I am seeking entertainment not depression. \nI didn’t watch the rest of the movie, it might be great, but I am bailing.",
    "date": "2025-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was so worth the watch! Multiple story lines with real life story telling. Stories of love and grief and all the in between. It’s completely worth watching. We laughed and tears might have flowed. Well done!!",
    "date": "2025-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great to see so many great actors that look like me on the screen. Love how all the storylines tied together & all the characters popping up into each others' stories.",
    "date": "2025-05-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A fun movie that also makes you think about love and loss. I agree it would have been nice to develop some of the characters and story lines more. I definitely enjoyed the all Asian cast.",
    "date": "2025-05-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "“Worth the Wait” is a charming, feel-good romcom that delivers both heart and humor.\n\nThe writing is clever, and I loved how the film juggled multiple storylines while still giving each character emotional depth. The ensemble cast really brought it—every actor made the most of their role.\n\nKnowing the stories were inspired by the creators’ real-life experiences adds an extra layer of sincerity and makes the film’s message hit even harder.\n\nMy only critique is that the multiple narratives sometimes made the film feel a bit drawn out. That said, trimming it down might have compromised the emotional investment we feel for each character.\n\nAll in all, it’s a culturally specific yet universal take on love, loss, and connection—and definitely worth the watch.",
    "date": "2025-05-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "\"2025,\" featuring Ross Butler, initially seemed promising with its intriguing cast and the potential for a fresh, cultural perspective. It appeared to offer something unique and engaging.\n\nHowever, the film's storyline quickly revealed itself to be a rehash of well-worn tropes that audiences have seen countless times in recent years, lacking any hint of originality or creativity.\n\nDespite the impressive cast, the execution fell flat. I struggled to feel any genuine connection among the characters; it felt more like they were simply going through the motions rather than forming authentic bonds. This lack of chemistry, especially in the romantic scenes, made it difficult to invest in their relationships.\n\nOverall, the film felt disappointingly one-dimensional. At times, the dialogue was dull and uninspired, detracting from any potential for a compelling narrative. Ultimately, while it may appeal to some, I personally wouldn’t choose to watch it again.",
    "date": "2025-05-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A heartfelt, beautifully crafted romance that feels authentic and deeply moving. The lead actors share electric chemistry, making their love story believable and earned. The pacing is perfect, avoiding cliches while exploring love, timing, and sacrifice in a fresh way. Stunning cinematography and a touching soundtrack elevate every emotional beat. “Worth the Wait” balances drama and hope effortlessly, leaving you smiling long after the credits roll. A must-match for fans of meaningful love stories!",
    "date": "2025-05-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Worth The Wait is a fun, clean RomCom that left me feeling good and inspired to wait for a miracle. It was great seeing Asian actors, but in storylines that crossed cultures.",
    "date": "2025-05-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love a good rom-com, and with this movie's impressive cast, I had it on my radar to watch it the day it came out. It did not disappoint! The movie had a great script that had us laughing and crying throughout, and the actors brought a depth to their characters uncommonly seen in movies of this genre. It definitely touched on a few more serious themes, but that just made the movie feel more real and the characters more relatable. I thoroughly enjoyed it and will probably watch it again!",
    "date": "2025-05-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I LOVED finding a new ensemble rom com! The writing is witty, storyline is full of heart and tenderness, the cast brings a true emotional depth, and it's all around FUN. A must watch for a feel-good movie night with your friends and family!",
    "date": "2025-05-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What I love about this movie is how it blends classic RomCom charm with raw, emotional depth. The writing is especially impressive—it juggles multiple storylines effortlessly, giving each one space to breathe without losing momentum or heart. It’s funny, tender, and genuinely moving. The cast brought it all to life with performances that were both hilarious and deeply dramatic when it counted. The chemistry was spot-on, and every emotional beat felt earned. I left with all the warm fuzzies and a fresh appreciation for life’s quiet, meaningful moments. I’ll absolutely watch anything this screenwriter creates next.",
    "date": "2025-05-24"
  }
]