[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I'm sorry but I enjoyed it.  Alexandra Daddario (whom I discovered on The White Lotus) is adorable and her big blue eyes are worth the price of admission.  This is a bit of a Cinderella story if you're wondering; it's not hilarious but I don't think it was meant to be.",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It's like a Hallmark movie with Mature behavior.",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "“Can You Keep A Secret?”, es la película romántica a la que acudimos cuando queremos sentirnos mejor. Tiene tan marcados los conflictos en cada acto que no hay sorpresas, ya sabes que se van a enamorar, que va a haber un conflicto en el punto climático de la cinta, y que posteriormente van a terminar juntos, pero yo creo que el problema con esta es que no está adornada con nada característico, no se siente una intencionalidad en que aunque ya conozcamos justo lo que va a pasar en cada escena, sea bajo con contexto interesante, y no diría que argumentativamente le resta, pero si en cuanto a originalidad entre cientos de propuestas iguales.\n\nPero para mi lo que la hace especial, es la química entre Alexandra Daddario y Tyler Hoechlin, realmente te sientes bien en cada escena romántica que tienen. Y los personajes secundarios no me parecieron malos, si, son los estereotípicos amigos que cumplen una función dentro de la trama, pero logran ser empáticos, y en ellos hay chistes que si funcionan. Visualmente es agradable y aunque no arriesga nada, si se desarrolla en lugares visualmente atractivos. \n\nAl final ya todos sabemos a lo que vamos cuando vemos una película cómo estas que es más un encargo de una productora, que un producto con intenciones reales, por lo que se me haría muy pretencioso indagar en defectos técnicos o narrativos. Este es un género al que regularmente recurro cuando solo quiero ver algo para pasar el tiempo, y también me parece importante que este tipo de propuestas sigan existiendo. Son la excusa para ver con la familia, con amigos o, para ver solo comiendo palomitas. Es una entrega que repetiría, porque, aunque ya hayamos visto esta misma historia contada de mil maneras diferentes pero siempre con la misma conclusión, te hace sentir bien contigo mismo una vez terminada.",
    "date": "2025-02-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Even Alexandra Daddario's haunting blue eyes and voluptuous figure can't save this train wreck.",
    "date": "2025-01-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A charming romantic comedy that blends humor and heart effortlessly.",
    "date": "2024-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Was a cute rom com movie.",
    "date": "2024-06-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is one of my all time favourite Books and this films was 100% absolutely shocking. Absolutely devastated how bad it was!!",
    "date": "2024-04-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Despite other reviewers, I thought this was a tremendous movie. Alexandra Daddario and Tyler Hoechlin were terrific as the leads. The supporting cast was excellent, great production and direction make this a 5 Star movie. Do not miss it.",
    "date": "2023-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Good romcom movie, don't get the reviews, give it 5 minutes and decide for yourself.",
    "date": "2023-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The problem with this film is that it deletes more than half the source material. Structurally, a major plot point in the novel comes after about 80% of the book. Here, it comes before the halfway point, so there isn't enough build-up to give it weight. \nMost of Emma's characterization is removed, including her loveable loser life, her family, and her career struggles. As one example, her boss in the book is a man who overlooks her work and refuses to replace the department secretary. Here, it's a trans woman making sympathetic faces and having little function other than being the token LGBTQ+ character. \nEmma's family is a HUGE piece of the book, adding much to her self-doubt and low self-esteem. Again, gone. \nAdaptations can be tricky. This one didn't have to be. There is room for story, backstory, and characterization. It's just been taken out for no good reason at all.",
    "date": "2023-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Can You Keep A Secret was predictable but a good movie to watch for a brainless night. The script for each character was very surface level and doesn't capture the message that I think it was trying to portray. Firstly, when the Characters meet on the place she spills secrets that are mostly comical, others just plain stupid, but none very embarrassing. I know that there are women that get stuck in relationships out of loneliness but it didn't send those emotions because Alexandra's character just didn't come off as an awkward lonely girl. So when the time came that the boss \"spills\" her secrets, it felt more like a proclamation of his adoration for her. They really reached trying to make that a climax for her feeling betrayed but it was so forced by the coworkers joking about nothing serious. They needed better writes and someone who looked more like the lawyer roommate as the actress for the role.",
    "date": "2023-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Not as bad as the critics would have you believe, but still... not that good.\nAlexandra is a terrific actress (see White Lotus) - but here, she's miscast.\nI don't buy her goofy aloofness or self-deprecating actions and dialogue that comes with this character. Her face is not emotive enough for her to wear her heart on her sleeve. And she has zero chemistry with Tyler - who's pretty good in this.\nTo make matters worse, this movie was stuffed with every ethnicity, sexual orientation and gender that you feel like you're watching a diversity training seminar instead of a real story. The inclusiveness of side character casting stuck out like a sore thumb and made too much of this movie ring false. \nThe \"misunderstandings\" that cause the girl-lose-guy were dumb and the \"big secret\" that Tyler's been keeping is laughably stupid and implausible. \nThe set-up of a goofy girl spilling all her secrets and then later seeing her try to cover them up was the charming and fun of the story. But it doesn't last long enough to make this a \"must see.\" What's also missing is how these two characters really complete each other. By the end, we - as the audience - never felt the magic and the desire for the 2 main characters to get (and stay) together, because we never believed that they had any magic and needed each other.",
    "date": "2023-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Completely forgettable leads, absolutely boring storyline, nothing redeeming really.",
    "date": "2023-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This was a cute and enjoyable rom com if looking for something to watch. The plot/writing could have used some more work, but the acting and chemistry between Alexandra and Tyler made the movie.",
    "date": "2023-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Cute\nFunny\nDifferent",
    "date": "2023-04-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "No esperaba nada y me resulto bastante entretenida, me reí bastante. La historia es medio fantasiosa, los conflictos están medio tirados de los pelos para que funcionen pero así y todo se deja ver. Daddario y Tyler hacen una pareja que se ve hermosa pero no con mucha química que digamos.",
    "date": "2023-03-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "\"Can You Keep A Secret\", which is based on a Sophia Kinsella novel, tells the story of Emma, whose flight home from Chicago appears about to crash. Given this, she spills all her inner secrets to the tall, handsome stranger sitting next to her, only to discover the next day that he's her new boss. It's a classic romantic comedy type storyline, however, the lack of chemistry between its characters mean that it ultimately falls flat.",
    "date": "2023-01-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Please someone give Alexandra Daddario a competent rom-com. She is tailor made for it. This is not that film.",
    "date": "2022-12-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A good, old fashioned rom com with great chemistry between the actors that made me smile. Just what I needed tonight.",
    "date": "2022-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "\"Can You Keep A Secret\", which is based on a Sophia Kinsella novel, tells the story of Emma, whose flight home from Chicago appears about to crash. Given this, she spills all her inner secrets to the tall, handsome stranger sitting next to her, only to discover the next day that he's her new boss. It's a classic romantic comedy type storyline, however, the lack of chemistry between its characters mean that it ultimately falls flat.",
    "date": "2022-04-25"
  }
]