[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Definately doesn't qualify as a thriller. Mediocre at best",
    "date": "2025-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I really enjoy this movie and I don’t think that deserves so low ratings",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "End of the Road is largely typical Netflix action fare, filled with clichéd moments and little else to set it apart. The acting isn't bad, and there are occasionally funny moments, but overall, the performances feel familiar and straightforward. This isn't a groundbreaking action-thriller or a fresh take on the genre, and it's not particularly worth watching. That said, I don't blame the actors; they did their best with a script that left much to be desired.",
    "date": "2025-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie, didn’t know who kidnapped the son. It’s always rotten tomatoes😒",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "If the clichès don't ruin this the acting/writing will. Brenda annoys with her constant high horse attitude, her brother doesn't understand repercussions and her eldest daughter has zero situational awareness.",
    "date": "2025-05-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It was fine for a Netflix 90 minute movie. Not great, not horrible.  Queen Latifah is charming to watch in my opinion and makes it worth a watch.",
    "date": "2025-02-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Although I love the main actress… the movie was filled with illogical plot choices. Also bad medical advice. Never pull the knife out till you have a tourniquet on or are at an Emergency Room. Even then the wound needs to be treated for possible infection. \n\nLudacris would be possible slowly dying at the end due to either bleeding out or infection and given that Queen Latifah was supposed to be an ER nurse, she would have known that.",
    "date": "2025-01-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I thought the movie was super funny, because It was so bad my mom and I were laughing our heads off when he flys through the windshield and slams into the tree",
    "date": "2024-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Absolute rubbish.  Corny",
    "date": "2024-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The acting here isnt very great and the true end of the road here was the terrible twist.",
    "date": "2024-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "That was a bottom of the barrel script. Predictable and ridiculous. What a waste of talent.",
    "date": "2024-03-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "this was one of the worst movies ive ever seen. the acting was horrific, the dialogue was horrific, the cgi was horrific. i wish i could go back to an hour and a half ago before i decided to watch this horrific movie. literally 90 minutes of my life that i will never get back.",
    "date": "2023-12-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Ok I'm just going to address the elephant in the room … the video editing??? Why was the sky bright purple? That amongst the other inconsistencies, bad decisions and Latifah turning into Neo, this film was a big fat no from me.",
    "date": "2023-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "i enjoyed it. queen Latifah is always good to watch",
    "date": "2023-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This film is embarrassing for all characters. Unfortunately misplaced acting talent in a poorly written script.",
    "date": "2023-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Latifah is moving her family to start fresh when a hotel neighbor is murdered and his drug money gets taken by Luda. Latifah tries to return it, but runs into some neo-nazi racists. Well written? No. Kinda Fun, yeah.",
    "date": "2023-04-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great action movie, lots of fun. It takes pride in taking your power back. Queen Latifah goes from being an agreeable mom who will suffer for her kids to the momma bear who will do anything to protect them. She learns to stop accepting society as it is and takes justice into her owns hands. Lots of fun violent action and chase scenes. The twist is predictable but the action scenes are what make this movie so fun to watch.",
    "date": "2023-03-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Ah, I wanted to like this. It tries, but 'End of the Road' isn't something I'd wanna revisit in a great hurry.\n\nQueen Latifah and Chris Bridges (aka Ludacris) are the film's only real positive, though I will say the change in directon of the story did fool me... so kudos for that. I actually think the twist makes the story weaker, but still. I found the pacing and dialogue to be off, it does attempt heart with the main characters but sadly it just doesn't come across as natural.\n\nYou could do worse, but this one fell unfortunately flat for me.",
    "date": "2023-01-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "what a load of bullsh*t\nthought it was a comedy it was just plain unfunny\ndidn't give a sh*t about any of the characters in this movies\nwhoever thinks this is good is on crack",
    "date": "2022-12-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I tried really hard. I tried even twice, for queen latifah and because I was so happy to see  Ludacris back on the screen..sigh",
    "date": "2022-10-26"
  }
]