[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This film has an interesting and unique plot.",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best sci-fi movie have seen 2024. They say the acting are not good or clunky they are liars. Very original I like it a lot better than other Hollywood BSH are pushing out.",
    "date": "2024-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Visually well shot, good acting as far as watching the English dub. But the story falls flat, a lot of elements that made no sense for the sake of plot.",
    "date": "2024-03-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It was ok, not BAD for a Russian Produtction. The worst thing was the overly military stile of the movie..",
    "date": "2023-12-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Interesting concept.",
    "date": "2023-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fresh is the definition of this movie.  It's absolutely mind blowing.  Top tier!",
    "date": "2023-04-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I liked the movie just didn't like the edits he didn't do a good job on putting together the pieces also he over edited the colours and too much slow motion. But best actors",
    "date": "2022-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The idea is interesting, however it all comes crashing down the further we get into the movie; much like many other aspects, the main premise of this movie works more the less you think about it; a lot of things are left to the viewer's imagination and that does not really work when you're trying to tell a concise and well-developed story, which did not happen.\n\nDecent action scenes and not a lot of blood makes this for a passable view with friends to laugh a little, but it is likely the kind of movie you watch once and never again; and forget about in a few weeks to a month at most.",
    "date": "2022-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Great movie until you reach the end. And boy did they mess up the ending! That one dude which we actually saw once or twice in the movie, we get to see him once again in the end, only to step up and take credit from the main protagonist with whom the audience actually connected and cared about. I have seen bad endings, but this one was just phenomenally bad! (If you aren't afraid of bad endings, then this is really a great movie for you!.. They only screwed the ending)",
    "date": "2021-12-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thought it was engaging, well-shot, mysterious, and exciting until the last scene. I had some trouble understanding the motives of the defecting alien, but realism isn't what draws sci-fi fans, so I can let it slide. Great job!",
    "date": "2021-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This could have been a really good movie,  but there were parts that were just too cheezy.  Some of the lines were like they were written by a 15 yr old boy. \n\nThen next the ending,  it should have ended when the alien was killed.  But then they added the whole scene in the spaceship,  where they start killing the aliens.   That went on for way too long.  Wouldn't it have been much faster to just shoot the huge tube of goo,  instead of trying to smash all the smaller ones?\n\nThen it kind of ends with a cliffhanger,  and the alien kids.  A story that will never get told of how it turns out.  It was dumb that after smashing all these tubes,  the last one just happened to be the children alien tubes.",
    "date": "2021-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Really enjoyed this movie from Russia. It's alien invasion with a lot of cool unique story ideas and twists and origin of man and humans as virus. Only with budget of 2 million - it has Surprising High production value and special effects - of course not in same league as big budget Hollywood. Cool effects from boss fight. Lots of military style fighting action on end of world. If you like world war z or Tomorrow War then u will like this. It would be great if Hollywood adapted this story ideas into movie or series.",
    "date": "2021-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "BLACK OUT: INVASION EARTH is a pretty meaty apocalyptic scifi. This is a dark Russian apocalypse and it shows in the best ways. The characters, subplots and everything fits together solidly. It's worth a watch just to see how it's unafraid to tell a story how it wants.",
    "date": "2021-06-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Great production value, good special effects with a dumb story line, sprinkled with extra cheesy/bad dialogue.",
    "date": "2021-06-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "If you liked Attraction (2017) andor Coma (Koma) (2019) this is close to their quality.  The doctor from Coma plays an honorable general.  Because it's so military-equipment-heavy, it plays a lot like Fedor Bondarchuk's 2013 Stalingrad movie (also recommended if you like recent Russian movies and CGI).  \n This effort has the great advantage of a very literate script and multiple twists at the end all worked out in a writerly non-Hollywood manner.  \nThis effort has the disadvantage of a very slow first act.  If you stay with it, it will surprise you over and over.  The women win in the end.  \nThe CGI is again world-class and on a TV invisible.  \nThematically this plays like a Russian version of the 1951 The Day the Earth Stood Still.  It neither copies nor mimics the 1951 film.",
    "date": "2021-04-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is the best movie that you can watch on earth. It best explains the existence of human in the best controversial way ever made on earth. You this movie Russia rewrote the entire hierarchy of power and order on the world. And what a great flex Russia,",
    "date": "2021-04-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A nice fresh perspective on the action sci-fi genre",
    "date": "2021-04-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The Blackout: Alien Invasion (In Russian - available for rent) is an action film.  It is a real mix bag of impressive set pieces, wonky as hell plotting, blatant misogyny, bad subtitles, and places where the small budget leaked through.  The sequel is a 6 part TV show (not yet available in the USA).    2 stars out of 5.  Poster is cool.",
    "date": "2021-03-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Let me insert some really unique words no one ever uses so I can sound cool. Just kidding.\nThe cinematography is great, so was special FX makeup.\n\nThe story is one repeated over and over in many movies, shows, books--humans are destructive and the main reason we're in this predicament.  You'd think a pandemic would unite people, but no. It just brought out the worst in many and highlighted those lacking logic.\n\nI imagine any species with the intelligence to come here from another planet would think of us like the Kardashians and rather not be annoyed so they don't waste time stopping by.",
    "date": "2021-02-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Excellent sci-fi film that shames most similar Hollywood productions. Cinematics and CGI are on par if not better, action and gunfight scenes outperform american cinema. The dialogues are heavily influenced from past action movies, however the story is so nicely evolved that the genuine sci-fi viewer will rank this amongst the pantheon of the genre.",
    "date": "2021-02-13"
  }
]