[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The movie itself isn't anything that memorable, but I think it's important because of the topic, especially in that time (1988) when this kind of crimes were still punished too lightly.",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Great Film with Jodie Foster. Very interesting storyline but the beginning of the film is graphic.",
    "date": "2025-05-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Not a believable depiction of the crime. Did a disservice to an important issue. Nothing about the film or characters felt realistic. Even the courtroom drama made little sense at times and wasn’t dramatic. Watched on DVD.",
    "date": "2024-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "In the US alone a crime of sexual violence is reported every six minutes; one out of every 4 victims is attacked by two or more assailants The accused are sometimes the most difficult to prove that they are guilty Director Jonathan Kaplan presents a courtroom drama that struggles to change the entire justice system for the better Jodie Foster plays Sarah Tobias Kelly McGillis plays attorney Kathryn Murphy Sarah is a young woman that goes out to party at a bar one night But it ends in a horrible way as she is gang raped by several men, the opening shows her escaping the incident and getting checked out by the hospital and getting a rape kit Kathyrn is assigned to the case but the lack of evidence, witnesses, and proof that it ever happened stalls the prosecution Sarah is becoming more victimized believing that no one believes her and the accused are wrongly charged by everyone else willing to keep their mouths shut out of fear and coercion Can Kathyrn prove the crime actually occurred and shake up a corrupt justice system that refuses to go forward? This acts as a slow pot boiler; it tries to get the facts straight while others try to dismiss the alleged crime Foster gives a powerhouse performance next to McGillis The actual rape scene is so damn hard to watch but it has its authentic place depicting the subject matter The aftermath is real when the victim is the only one experiencing it along with the trauma that remains It hurts so much more knowing that people just stand by letting something this horrible happen and not lift a finger to help Yet the film does its job touching the lives of every woman whom has ever endured the horrors of assault while also dealing with the continued injustice fighting a prejudice legal system that stonewalls every time Kaplan is brave enough to tackle a subject other filmmakers would refuse to address making this relevant to this day",
    "date": "2023-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Brilliant!! Absolutely brilliant! Jodie Foster really knows how to carry powerful emotion! She absolutely deserved the Oscar she won for this picture.",
    "date": "2023-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A brutal and engrossing film on the trauma involved in the act and subsequent effects of rape.\nFoster thoroughly deserved her Oscar for her performance.",
    "date": "2023-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A bit dated but this film about the fallout from a sexual assault in a bar is grimly serious and compassionate with a great performance from Jodie Foster as the working class survivor whose life is upended as she seeks justice and has to deal with a system that is not accustomed to prioritizing the interests or the feelings of people like her.",
    "date": "2023-03-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This crime drama was really good. Jodie Foster, Kelly McGillis, Bernie Coulson, Carmen Argenziano, and the rest of the cast did a fantastic job in this movie. This true story about about a woman suing six men for rape crimes was dramatic, unbelievable, and shocking. What these men did to an innocent woman was evil, unforgivable, and immoral. These men deserved what was coming to them. If you haven't seen this movie yet, check it out sometime. It's worth watching.",
    "date": "2023-01-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The greatest 01 hour: and 50 minutes ever!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2022-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Lots of women get gang raped. Jodie Foster acting is outstanding.  And the story well written.  Despite the fact that victims can no longer be asked such questions, it's still horrifying for those of us old enough to remember when it was just fine.",
    "date": "2022-03-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A very disturbing film about a woman who was raped at a bar, in public... That, was extremely difficult to sit and watch. I watched how no one \nresponded to her pleas. We got a glimpse, as the audience, to see how some men lose their humanity and succumb to become monsters. Jodie Foster gets her first oscar win as an actress in her first unforgettable outstanding performance as the victim in this film.",
    "date": "2021-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "As one of those films so-called as born with a silver spoon, The Accused, directed by Jonathan Kaplan, starring Kelly McGillis and Jodie Foster, has left the strongest impression on audience for decades, as it is the first mainstream film dealing with the gang-rape issue in the USA, quoted in the film as \"In the United States of America, a rape is reported every six minutes. One of every four rape victims is attacked by two or more assailants.\"\nMost of the film's merits have counted on Jodie Foster's extraordinary performance. She's as good as it gets in terms of both revealing her innermost struggle with restraint and concealing her outrage with nonviolence. What exactly happened on Sarah Tobias (Jodie Foster) can't be articulated from the opening scene, in which, at night, an obvious rape victim is running out of a sleazy bar with herself shouting hoarsely. Then, as most melodramas goes, she meets Kathryn Murphy (Kelly McGillis), the assistant district attorney who will take her case. And as most human beings will do, when Sarah is showing her physical and psychological trauma, sympathy and compassion will rain cats and dogs. However, something in the film seems wrong. Her attire, deportment, temper, disposition, personality, demeanor, diction, tone, accent, hairdo, wisdom, all of them are low enough to affect Kathryn's emotion against her. Unsurprisingly, Sarah is that kind of flapper who smokes dope, is often drunken, likes to hang around. Although she has a decent job as a waitress and a boyfriend as a drug dealer, her previous conviction on drug possession charges, and to be worse, her drinking on the night of the crime which has made herself a seemingly coquette, have involved Kathryn in a dilemma that she's not confident in Sarah and chances of the final winning, not to mention that one of the rape suspects is a young fraternity man who's born with a silver spoon so that a good lawyer is served for him. As a Chinese film critic who's never been involved in a lawsuit, I'm unfamiliar enough to explain the compromised plea bargain offered to those three men who have brutally gang-raped Sarah, and who, as a result of the agreement of charges as \"reckless endangerment\", get off on a lesser charge so that the prospect of parole is quite generous. Outraged as she is, Sarah feels betrayed, quoted as \"You don't understand how I feel! I'm standing there with my pants down and my crotch hung out for the world to see and three guys are sticking it to me, a bunch of other guys are yelling and clapping and you're standing there telling me that that's the best you can do. Well, if that's the best you could do, then your best sucks! Now, I don't know what you got for selling me out, but I sure as shit hope it was worth it!\" – Apparently, at that night, when being raped, cheer, whistle and howl are collateral from those onlookers who are rubbernecking, so furiousness is fastened, and fastness is farther. Humiliation and rage of Sarah has outbroken and resulted in a car crash due to the insulting encounter with one of those onlookers who's exceptionally nagging and teasing. This turning point in the film has provoked the natural-born sense of justice of Kathryn as a female D. A., therefore she's determined to convict the onlookers who would be guilty of \"criminal solicitation\". \nThe relationship between Sarah and Kathryn, exaggerated by many clichés, is not that simply as looks like a traditional sorority in a stereotyped court film, or an affair between famous lesbians in gossip magazines (ironically, both Jodie Foster and Kelly McGillis have come out of the closet). You'll not be moved by McGillis being transformed from a lady officer into an Avon Lady. Her sympathy looks so cheap in the film that she does not even cry, quintessentially. Without tears from the higher class, the representative of the lower class, Foster, whose appearance is not that convincing as herself as an underage prostitute in Taxi Driver, has given a surprising reversal, with the help from Jonathan Kaplan, by putting up a face focusing on the traumatic part instead of the resentful part, by letting people see how she's been raped instead of what the rape means to others, by imitating the utterance and appearance of \"a low-class whore\" instead of implying the origin that has cast her as a deficient and defective woman in the film. In fact, at that time, Foster's career has been challenged. The film was viewed as a last-ditch effort to give her acting career a much-needed boost. Ultimately, the film was a critical and commercial success and she was awarded the Academy Award for Best Actress, which revitalized her career as a critical and box office draw.\nBy being informed of that Jodie Foster's Best Actress Oscar win was this film's only Oscar nomination, undisputedly, The Accused is not as good-looking as you may expect. In fact, at the time of the film's release, the film was highly controversial because of the gang-rape scene. It was the longest, most graphic, and most realistic depiction of a sexual assault in cinematic history. Between flashbacks and the chronological order, the gang-rape is detailed daringly, close to the end of the film. Both the bar and the bartender Sally, who is a confidante of Sarah, are as dim as the color of night. The introduction of Sarah's attendance does not bring much unease. She's sexy enough to attract men, even without her décolletage. Soon, by flirting with the masculine womanizer and the young fraternity man, things become dangerous. The music starts, she's dancing to it. Seductively. The disrespect on Sarah from the womanizer is intensified by both Sarah's blue humor and onlookers' incendiary cheers. Then, the Armageddon happens. Sarah is being raped by the womanizer while all the others around, except for the other fraternity man named Ken, are looking on indifferently, with some pioneers cheering and clapping. A number of indistinct \"No\" intermittently come out of her suppressed mouth. She looks pale, anguished, popeyed, desperate, resistant, vulnerable, and her status does not change a bit when the young fraternity man starts his attack. During the darkest hour, kinds of solicitation never stop. On the spot, both Sally and Ken are anxious. These only two kind witnesses are distinguishable. Sally runs away. Ken remedially calls the police. However, before anyone could save her, the third man comes to rape her. With roguish cheerleaders getting more and more excited, Sarah has finally struggled to free herself by the chance of biting the third rapist, which gives the explicit and exploitative gang-rape scene a decent ending.\nWith the pivotal testimony from Ken, the ultimate win of the lawsuit has not only sentenced three instigators into the prison, but also blew away three rapists' odds-on escape by crafty scheme. It's a film that has an intense anti-rape stance and condemnation of rape culture overall. However, it's not a film that questions the system, on the contrary, it defends the system, makes a pitch for it, blow its own horn. Briefly speaking, as a frivolous woman as she looks in the film, Sarah, potentially regarded as being served right, is impossible to win the lawsuit if the system is not suitable. The stormy criticism about the gang-rape scene has indirectly testified the film's hypocrisy and inappropriateness though the movie got a positive review overall. In fact, many stars turned down the script because the gang-rape scene was too explicit and exploitative. The argument could be made, however, the movie is based on a real incident that did happen in real life, an incident just like the one depicted in the movie; a brutal gang-rape at a bar, to Cheryl Araujo in New Bedford, Massachissetts in 1983, with onlookers cheering on the assailants. Isn't it a paradox that, in order to make people feel the rape, to rape people's feelings is necessary? And why is it impossible that someone, after watching the film, may get incentive to the extent that a rape is nearby? After all, maybe there is value that showing the audience what really happened can make them feel the pain and humiliation a rape must have caused. Although The Accused is unpleasant, it was also potent.",
    "date": "2020-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Brilliant, powerful and some of the best acting you will ever see.",
    "date": "2020-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Well-addressed. Jodie Foster!",
    "date": "2020-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This is the film that announced Jodie Foster's place at the top of the acting mountain. Horrific story with some scenes extremely hard to watch, but you will be grateful you did.",
    "date": "2020-06-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the most powerful movies I ever saw.",
    "date": "2020-02-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A beginning of a brilliant career by a great artiest and it still resonates.",
    "date": "2020-02-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Hard to watch but this powerful performance by Jodie Foster is worth the effort.",
    "date": "2019-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "So hard to watch. Great acting.",
    "date": "2019-02-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The best courtroom movie ever made!",
    "date": "2019-01-26"
  }
]