[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Goes a little long and not without its faults, but Tom Cruise does a good job and you can do a lot worse than this sci fi action flick.",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I think it’s an excellent and underrated film, though I am biased towards post-apocalyptic and/or dystopian movies.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "“Oblivion” es una película tan extraña que aún no sé si me encantó o no, y con ello no quiero decir que no me haya gustado. El Plot Twist me fascinó, al igual que la lenta resolución del conflicto. Como ya es típico en el cine de Joseph Kosinski, una imagen dice más que mil palabras, y esta película tiene unos visuales hermosos, además de un diseño de producción impecable. En cuestiones técnicas es sobresaliente. Y narrativamente, aunque me parece sólida, sí me parece que alarga demasiado el misterio para mantener intrigado al espectador, y aunque lo logra, hay momentos que se sienten como Deux Ex Machina con justificaciones confusas para darle resolución al conflicto.\n\nAlgo que amo del cine de Joseph Kosinski es su ritmo. En ningún momento sus películas aburren y, aunque el planteamiento del conflicto es muy simple, le agrega capas de profundidad que hacen que te termine genuinamente interesando la historia y los personajes. Aunque Jack está lejos de ser uno de los personajes más icónicos de Tom Cruise, a medida que comprendemos al personaje y su corrupción tanto personal como externa, termina por convertirse en un protagonista que disfrutamos ver en cada escena.\n\nUna de las cosas que no me gustaron de esta película fue su desarrollo. Por momentos (sobre todo en el primer acto) es muy lento, lo cual no me parece negativo, pero para el segundo y tercer acto la trama se agiliza demasiado, y hace que el Incidente Incitador no se sienta tan orgánico. Lo mismo sucede con el tratamiento de la fuerza antagónica, que no termina por tener una motivación totalmente clara y raya en lo superficial.\n\nEn términos generales, esta es una gran película Sci-Fi. Una historia de alto presupuesto, nueva, que no pertenece a ningún universo, con unos visuales y diseños de producción atractivos, un giro de tuerca que vuelve a este mundo aún más interesante y con un protagonista entrañable. Aunque tal vez no tenga una historia tan sólida, sí me parece lo suficientemente entretenida para pasar un buen rato y ver con buenos ojos una posible secuela. Este es el tipo de cine que, aunque no es perfecto, vale la pena apoyar, porque a diferencia de los cientos y cientos de universos que vemos cada año, este busca ser propositivo, y eso siempre se agradece.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Although it may not be everyone's cup of tea, Oblivion is an underrated film that offers a unique blend of action, suspense, and drama. With its breathtaking visuals and a captivating narrative, this movie is sure to appeal to fans of science fiction. The soundtrack, composed by M83, is equally impressive and adds depth to the overall experience.\n\nGrading: B-",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The visuals were excellent. I enjoyed the action from beginning to end. The actors were believable. Great ending. I wish I had seen it in the theater.",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very enjoyable and memorable",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Good visuals and music score but the story doesn't grip and after a while the fight scenes with the drones become dull. Acting was okay. Watchable but a bit lifeless.",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved oblivion. The cinematic escape alone is enough of a reason to see this movie. The soundtrack, visuals and great acting marry up very well. You don't have to be a genius to figure out the plot but this is a movie that can be watched over and over again.",
    "date": "2025-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Jack (Tom Cruise) and Victoria (Andrea Riseborough) are part of the rearguard of a humanity that has left earth for Titan, Saturn's largest moon. After a catastrophic war with extraterrestrials, they have to maintain the drones that protect huge water-collecting rigs from scavenging aliens that have survived the war. When an orbiting spacecraft plunges to earth, a story of deception, romance and heroism unfurls. This is one of my favorite feel-good films. 5 stars!\nPS. Critics who call it 'thinly scripted' might have to watch it again and more attentively at that.",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I thoroughly enjoyed this movie. It’s a great story to watch and lose yourself in. Tom is great as well as the rest of the cast. It’s not a mindless space or superhero movie. Slow simmer and made to perfection. Watch it.",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Love this movie it has been my go-to film since it came out. Confused why the critics lay into this movie so heavily. I think they have a lack of imagination.",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "think it’s a film that has aged well, with outstanding cinematography, editing, and production design. The story is solid and it features strong performances from Andrea Riseborough and Morgan Freeman, but aside from Tom Cruise, the cast doesn’t quite come together, especially Olga Kurylenko, whose role feels somewhat out of place in the film. Another drawback is the plot holes, such as the little girl who appears at the end, which was not well developed. On the other hand, M83’s score is spectacular, though at times it tends to overshadow the narrative.",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 2.25 hours!!!!!!!!!!!!!!!!!!!!!!! Rated PG-13 for Nudity, Brief Strong Language, Sci-Fi Action Violence and Some Sensuality!!!!!!!!!!!!!!!!!! The USA grossed over $89,000,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I’m genuinely shocked that when I went onto here that this got a 60% from audience reviews me personally I had a fun time with this movie. Tom Cruise is acting as amazing. The story is intriguing and the plot twists were very unexpected. It’s a little slow in the beginning and it takes some getting used to, but it feels like a very good film",
    "date": "2025-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Greetings from Lithuania.\n\n\"Oblivion\" (2013) is a very good science fiction story. On its core this is an action and adventure movie. I highly enjoyed it way back in 2013, and now revisiting it 2025 on 4K UHD disk - which looks and sounds amazing - i did as well. Tom Cruse was solid in this film as he always is. But its the story is what keeps this movie going, and it's a very good one - for a real science fiction film fans. Although it borrows from many others movies like \"Matrix\", \"WALL-E\" and so on, but hey, when its done this well - who cares. Story kept me engaged till the very end, and all twists and plot turns were good and involving. It is not the most original one, but a really good one. Special effects were very good, but they are not the essential thing in this film - the story is. Cinematography was breathtakingly beautiful - \"Oblivion\" is a gorgeous looking movie. Music was good. \n\nOverall, if you like science fiction, action adventure stories, which contains good special effects and a good story even if not the most original one - \"Oblivion\" is not to be missed for sure. At running time 2 hours i never drag and is a superb watch.",
    "date": "2025-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Interesting post-apocalyptic genre with adventurous seasoning. Tom is just outstanding making you believing in the storyline.",
    "date": "2025-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Most vivid post apocalyptic movie featuring some of Tom Cruise’s best acting. Strong supporting cast. Strong design choices.",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This movie strains one’s patience with it’s inscrutable storyline and lack of action. I am not sure what the purpose was of making it, but it doesn’t come through.",
    "date": "2025-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Cool visual, cool setting can be a snooze fest at times",
    "date": "2025-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "There are definitely some decent sci-fi visuals but this just goes nowhere and it gets there slowly. Cruise is not at his best in a fake plane and and with CG drone enemies.",
    "date": "2025-06-15"
  }
]