[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A wild story that will keep you interested",
    "date": "2024-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This documentary is as dumb as these victims.\nIt's more like a reality drama show than a true-crime documentary.\nSpending too much time to describe how these girls love the prince they believed.\n\nLeave more questions than more answers.\nIs the bodyguard involved part of the fraud?\nHow about the ex-wife with a child?\nAnd how about all these drivers, security teams, and models?\nWhy has Tinder Swinder himself been charged yet?\nIt seems like journalists and other victims already have a lot of chances to approach him. Why the police did not take action? Is it because the police think it is not a serious case?\nAre the police still trying to find him guilty?\nIs the news about LLD Diamonds just a coincidence, which also makes lies about his danger more convincible?\nWhat's the motive of Simon Leveiv?\n\nHow the fk these girls not realize it was a scam? Too many red flags.\nThe skill of Anna in Inventing Anna is much better than Simon Leviev's. There are a lot of similarities. However, while Anna can convince even the bank, the trick Simon Leviev uses is an everyday romance scam. It is obviously a romance scam. Sending money to a person you don't know is definitely a nono.",
    "date": "2024-04-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is insane. So hard to believe any same person would be involved in this, but there are some out. The 'surprise' saved this for me as I was not a big fan until that point.",
    "date": "2024-01-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "While the content is severely frustrating, the story is compelling. Well told.",
    "date": "2023-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I wasn't aware of this guy's scheme not until I watched this documentary. And I swear the show shows how great the guy in scheming is. Not to praise him -- I am so much disgusted with him. But after all of what his done, and how this show has been released, he is still a free man and the victims are still paying off the money he had spent. It is a fucked up reality that even a lot of people (on his Instagram) are praising him and even on his side. He is even verified on Instagram? Wtf. people are crazy. This show needs some attention to let people, especially women be aware of guys like him.",
    "date": "2023-05-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Captivating and scary at the same time",
    "date": "2023-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "a documentary as much as it is a drama, a snap biography of lives hit hard by a country whose justice system does not seem to compensate the victims basing itself on some dodgy legal excuses; even less punishes the insensitive and horrible Israeli man perpetrating the abuse of human good nature.",
    "date": "2023-01-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I am not a consumer of documentaries, but this story managed to catch me. It is really entertaining and interesting. The way in which the multiple countries where the scenes were recreated and the victims recounting the situations that they had to go through is told. The criticism of society where it is really sad that instead of blaming the person who cheats, the victims are blamed; We are all human and we can be naive and even more so when love enters the equation. My feeling is that it is a public denunciation by making this story more famous and making it known throughout the world and raising awareness among the users of these apps.",
    "date": "2022-10-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Kinda of a long and tedious production. Newb writer and director Felicity Morris did a decent job with this docufilm, but it certainly needed better editing and to have at least 20 mins chopped out, because the 114 min runtime felt really dragged out, and the slow pacing and many dragged out scenes didn't help. The story itself was remarkable, but after seeing Rogue Agent, I can't wait for Netflix to make a movie about this story.",
    "date": "2022-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The most cringy guy ever on a documentary!",
    "date": "2022-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Pierwsza połowa przeciągana i nudzi, ciężko wytrzymać. Potem lepiej",
    "date": "2022-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I've always felt conmen are amongst the most immoral of criminals. The Tinder Swindler is a sad and infuriating account of one such conman, although effectively told.",
    "date": "2022-06-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent and so entertaining. Recommend 100%",
    "date": "2022-05-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "90%. 5/16/22. The order in which they tell the story really makes it with you seeing a romantic relationship develop, a friendship develop, when he starts frauding them, the first woman taking it to the journalists and then them finding the other girl. The other girl trying to help the journalists locate the guy but get caught taking pictures of him. Then that girl is freaking out afterwards not knowing what he's capable of but then dropping him off. Then they post the story and the gf of 14 months sees it. Then we see all the overlapping times with these girls and she swindles him back with his clothes which is awesome. Then he becomes homeless and they catch him. Just a fascinating story overall. The guy is clearly really smart and good at deceiving people. Would definitely rewatch this.",
    "date": "2022-05-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Well directed and unfolds this nauseating story of deceit and fraud very well. Drags a bit at times but a great telling of this story and interesting look into us as a social-media driven society.",
    "date": "2022-05-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Interesting in parts and astonishing in unfurling the calculations of Simon Leviev.",
    "date": "2022-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Interesting documentary, with a spectacular investigation and a story that is almost absurd",
    "date": "2022-03-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "30 min too long, so I lost interest.",
    "date": "2022-03-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Tinder Swindler, Inventing Anna, Bad Vegan, take your pick they are all basically the same story of running a con for money and other believing it...Yawn",
    "date": "2022-03-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Very interesting story. The director chose to tell the story in a very specific way which shows a very clear bias, but still the film is very entertaining.",
    "date": "2022-03-20"
  }
]