[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "It is a good movie, plus I like shcargård as pennywise",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "IT (2017) is slick and energetic, but relies too heavily on loud jump scares and CGI to deliver its horror. The strong young cast brings real heart to the story, yet the film keeps interrupting its best moments with over-the-top set pieces that feel more chaotic than scary.\n\nPennywise looks striking, but his constant, exaggerated appearances drain him of mystery—he becomes predictable rather than terrifying. The movie flirts with deeper themes but never slows down long enough to explore them.\n\nEntertaining, yes—but more spectacle than suspense, and far less haunting than it could have been.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is honestly one of my favorite horror films of all time, everything about this movie is amazing from casting to jump scares to plot this is an absolute must see for any horror lover",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A creepier version of Stand By Me, and that's a huge compliment. Skarsgard redefines Pennywise in this superb recreation by the Muschietti's. Outstanding mood, cinematography, acting, wardrobe, score and set designs make this an absolute blast to watch.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "IT, é um ótima reletuira do de 1990, para aqueles que são fãs das Obras de SK, com um elenco mais do que bom, é ótimo efeitos visuais.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie has become my third favorite film of all time, the cast is well done, Bill’s performance in this movie is astonishing, and I hope more people will appreciate this movie.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "After watching both the 1990 and this version I think this version is definitely the better watch.",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Love it !! Being a huge Stephen king fan and of course having seen original IT I absolutely love what they have done w this .incredible acting. Bill S plays penny wise amazingly. A new age IT which is just the very beginning of everything!!!",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "When I first watched It, I saw scared out of my shell. Well made and good quality. Not much a fan of the second one though. There was a lot of cursing for a 15+ movie.",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "\"IT\" is a horror film directed by Andy Muschietti, based on Stephen King novel. The story follows a group of kids in Derry, a fictional town, where they are battling against the evil clown called \"Pennywise.\" The young actors give outstanding performances full of fear and friendship, while the creepy effects and jump scares keep you on edge. Overall, it's a thrilling adaptation that captures the book's terror—highly recommended for horror lovers.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Classic movie for terror/horror fans, \"It\" don't disappoints in the jumpscare, thrilling atmosphere and music works. An incredible — if not the best possible adaptation of the Stephen King's \"It\" book. This movie really sticks with you after watching it.",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Pennywise Delivers, But the Hype Inflated Expectations:\n\nGoing into IT with sky-high expectations after years of hype, I found myself satisfied but not blown away - a solid 7/10 experience.\n\nWhat works brilliantly is the Amblin-esque nostalgia of misfits on bikes battling evil (yes, it predates Stranger Things, and you can feel its influence). The opening twenty minutes establish genuine dread, and the final act delivers thrilling payoff with the Losers' Club sewer confrontation. Skarsgård's Pennywise is genuinely creepy, and the young cast (especially Lillis and Grazer) bring authentic chemistry.\n\nHowever, the middle sags with repetitive scare sequences following a predictable formula: character alone, creepy buildup, fake-out, real jumpscare, repeat. It's well-crafted but becomes mechanical. Still, as someone diving in before the new prequel series, this was essential viewing - capturing that sweet spot between horror and coming-of-age that King does best.\n\nWorth watching, even if the legend slightly exceeds the reality.",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "After the gluttony of failed late 2000’s horror remakes, it seemed the horror remake trend wore relatively thin. But when 2017 rolled around, here comes “It” (which is not a remake but rather a second adaptation of the Stephen King book, there was a 1990 TV miniseries) a beautifully haunting, brilliantly crafted & with a much more faithful story carried by a wonderful cast! I can honestly say, for my first horror film theater experience, I was genuinely scared!",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Basically a joke to even compare the original to this. Tim Curry will always be Pennywise. The clown isn’t scary and the story is meh.",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This adaptation of a book written by the greatest horror author of all time is a big step up from the original adaptation and is a very well done adaptation of the characters like Pennywise and all the losers club a well done arc of all the losers living there life to having to face a cosmic entity.",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Good,horror and entertaining",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it, i was SUPER scared to watch and attempted to watch through my eyes but was caught off guard by the comedy. I was not expecting the kids to be so funny, they gave the courage to watch it through again…but in daylight. It was a good scare and Bill was so good at Pennywise.",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A Predictable Horror Chapter.\n\nIt is a middling horror revival that leans on predictable jumps and underdeveloped thrills, failing to capture the novel’s chilling depth. Bill Skarsgård’s Pennywise has moments of menace, but the film dilutes him with rote scares that feel repetitive and unearned. The Losers’ Club—Jaeden Martell, Sophia Lillis, Finn Wolfhard, and friends—has charm, but their arcs are rushed, turning potential coming-of-age poignancy into clichés. Derry’s atmosphere is evocative, but the pacing drags, and the narrative meanders without the tension to sustain its 2017 horror hype. What could have been a profound tale of childhood terror becomes a formulaic slog, recycling tropes without the emotional or atmospheric punch to elevate it beyond standard genre fare.",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I didn't really want to watch this movie since the clown just freaked me out.  Then I saw all these It movies being offered, and I broke down and watched the trailer.  The trailer had me mesmerized, and then I watched the movie.  It turned out to be awesome!  Lots of scares, horror, and a backstory.  I'm not sure if I'm going to leave it at that or watch It 2.  Either way this was a great movie!",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Greetings from Lithuania.\n\n\"It\" (2017) isn't the most scariest movie I've ever seen, damn, its even not the most scary movie I've seen in 2017, but it is a hands down the most involving horror movie I've seen in many moons, simply because first and the most important thing - it is a very good movie /drama that so happens is a horror movie as well.\n\nScript and directing here were top notch. Music was excellent and acting by all young actors were superb.\n\nOverall, \"It\" works as a good drama and good horror movie. Its superbly well paced - at running time 2 h 5 min i was never bored or lost interest in this story. Superb movie all around.",
    "date": "2025-11-06"
  }
]