[
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Better than the original, it's okay",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Filme mais ou menos, o roteiro é fraco, as cenas são mais ou menos, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Beautiful animation and some very nice moments, but the plot is empty.",
    "date": "2025-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The different kinds of music trolls were entertaining.",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "no doubt the best trolls film",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Well this one had more cover songs and adult jokes then the first one. But that didn't make it that much less awesome and musical. Plus the deeper meaning is something that can be taught anytime.",
    "date": "2025-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Also With KPOP is actually Fun!!",
    "date": "2025-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely loved watching this with my kids during lockdowns",
    "date": "2025-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 31 minutes!!!!!!!!!!!! Rated PG for Some Mild Rude Humor!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I didn't like darkness of queen barb",
    "date": "2025-05-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "\"CANT STOP THE FELLING!\" Of thinking how trash this movie is.",
    "date": "2025-05-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A sequel that we did not ask for, but something we really love.\n\nThis movie focuses on music that we are into: classical, jazz, country, soul, reggaton, rock & of course, pop. This audience is being introduced to all sorts.\n\nIt even stopped discrimination & dictatorship with a talk about that a leader should be listening to what their people want & not have your own interests which are not everybody's dominate the world. When everybody has different things & are different, which is how we live in harmony & make the world go round. This lesson was learnt by Barb & Poppy.\n\nOnce again, the franchise is about courage & discovering.\n\nWhen you thought the story of the Bergens was over, wait until you see the mid credits scene.",
    "date": "2025-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "A sequel that we didn't ask for. To be honest trolls is better off as one movie.",
    "date": "2025-03-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Definitely had a great story to it but could have a better plot to it.",
    "date": "2025-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "'Trolls World Tour' is mostly what I expected the original film to be: an uninteresting story meshed with meh music. I, in fact, enjoyed the first flick, though this one I didn't. The all-troll story is a drop-off, who knew the Bergens were the glue that held this together?\n\nIt is practically a standalone sequel, the writers plucked this story right out of their, er, minds. That's not to say the plot is bad, it isn't, but it just didn't really hold my attention, the downgraded humour and less catchy music contributes. Character-wise, they give too much time to some.\n\nJames Corden and Ron Funches are given more prominent roles compared to last time out, but I'm too sure why; neither stood out to me and they are just as dull in this one, to be honest. Anna Kendrick and Justin Timberlake do, at least, still lead it and those two are solid.\n\nNone of the new cast members stood out in terms of who they portray, though of course their voices are well known. Sam Rockwell, Mary J. Blige, J Balvin and Ozzy Osbourne are some examples, though there are a fair number of familiar peeps scattered throughout.\n\nI found 1 to be good, 2 to be not good. All eyes on 3, 'Trolls Band Together'...",
    "date": "2025-02-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Kind of gives me a headache. Like I mean literally. Last time I watched it I got an actual headache. My siblings watch it all THE TIME. So lots of headaches. I went to the my country's premiere of it. I liked it then but, not anymore. So to to summarise... no.",
    "date": "2024-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Terrible movie\nI Hate It",
    "date": "2024-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Trolls World Tour has some snappy songs and is cute enough for little kids but doesn't offer much else.",
    "date": "2024-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "families may find this entertaining, but they do deserve a little bit better, this movie relies too much on music then it does in a heartfelt story, and at the end, \"hey you tried to destroy the world want to be friends?\"",
    "date": "2024-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "You have to make an effort to make your main character this annoying. Poppy was insufferable in this movie, it made me root for the supposed villain, whose motives I found dumb; actually the whole movie was stupid and served nothing. KPOP girls and college punk rock guy were cool. \nI might watch the new movie, see if they did any better.",
    "date": "2024-08-18"
  }
]