[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very moving film with a powerful message of hope and love in the midst of tragic circumstances. Really worth watching.",
    "date": "2020-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "You need to watch this movie...with your heart...not your eyes! You don't need to have a sick child to pray or believe in God's infinite grace and wisdom.  Get your Kleenex ready... turns out my eyes just kept expelling something called tears!",
    "date": "2020-01-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A bit heavy-handed and may even come off for some as preachy but the story is definitely a part heartwarming, part poignant one that can leave some families in tears and devastation. I'm sure this movie is miles better than some of the movies that come out of Pure Flix.",
    "date": "2019-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I love Dog so much and that is why i loved this film!!!!!!!!!! Perfect acting and a gripping story about the true love of DOG absolutely perfect!!!!!!!!!",
    "date": "2019-02-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "A fine film for kids but that's really it.",
    "date": "2018-03-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "5+ stars.  Rotten Tomatoes is exactly what they're called - ROTTEN!  How do you people justify giving a movie not only praising God, but promoting CA (yes, that's the medical abbreviation for cancer from a medical professional)  awareness and sharing stories of battles   won over CA only 25%?  Shame on all of you who contributed to that low rating.  As usual & with any movie regarding God, the user score is much higher because mainstream America doesn't live in your politically correct, liberal, isolationist, self-righteous bubble.  It was a very good movie full of love, courage and selflessness.  no foul language, political correctness & best of all, the breaking of an addiction to alcohol.  Perfect for the whole family, and you 'judges' as well if you will climb down off your little rock.  You're not the masters of this universe,  but mark my words - criticizing in an attempt to turn people away from a film like this, one day you will stand before God - we'll see who gets declared rotten then, only after you've waited too late.  From a proud, middle class east coast Reagan Republican, Donald Trump supporter - I would give 10 stars if it were possible.  You spoke your piece, now there's mine.",
    "date": "2017-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The critics who didn't like this film might be afraid to look in the mirror. \n\nIt is worth the risk to look in the mirror of your life and find God's love for you.",
    "date": "2016-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Letters to God is very inspiring and it is very heartwarming movie and it touches the heart.",
    "date": "2015-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "very uplifting movie",
    "date": "2015-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The fact that it's a true story makes it better than it normally would be, because it gives you hope for a not so horrible future.",
    "date": "2015-06-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I just recently watched this movie, and to be honest,  I balled my eyes out at the end. \n\nTyler had left a legacy. He had gotten everyone to start writing Letters to God.  \n\nWhen Tyler had passed, his best friend Samantha had put up a mailbox just for Tyler, and when you wrote a Letter to God,  you put it in the mailbox. \n\nI honestly love this movie!",
    "date": "2015-03-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Faith Drive;  inspirational movie that makes you think and go to your loved ones and hug them!!!â(TM)¡â(TM)¡â(TM)¡â(TM)¡â(TM)¡â(TM)¡â(TM)¡\nJohn 3:16.   \nRepent.",
    "date": "2015-01-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Jeez, where do I begin?",
    "date": "2014-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "WOW! I barely have words for this...one of the most amazing movies I have seen in a long time. Heartwarming, full of love and family and just how easy IT IS to actually talk to God.",
    "date": "2014-05-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie already became my favorite obviously because it is about God. Not only that! It gave me another knowledge on how God works in our life, either through the problems we are facing and also through the people around us. It made see how God uses our sufferings, pain, weakness, afflictions and hopelessness to his purpose and glory. This movie shows how ONE ACT OF FAITH CAN CHANGE THOUSANDS OF LIVES.",
    "date": "2014-01-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "ok family drama fare",
    "date": "2014-01-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Was really moved.  Having gone through 3 similar events of cancer, one with my wife, I connected and will remember many of the messages within the movie.  Brilliant.",
    "date": "2013-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie almost made me cry! I'm a ten year old boy! I'm not supposed to cry at movies!!!!!!!!!!!!!!",
    "date": "2013-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Much like Superman IV, this film has good intentions but doesn't get to do them right. The characters are barely developed, so we can't be attached to them and what they feel, the story is pretty much uni-dimensional and the message it tries to tell is obscured by these facts. Sadly, this movie is based on a real case of cancer disease, and it doens't accomplish the message? That's unforgivable.",
    "date": "2013-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The true story from which this film is inspired must be heartwarming but all emotions are lost in this adaptation for Letters to God only have wooden acting, characters whose lines were delivered without conviction, and a script that must be written by a grade school student.",
    "date": "2013-06-19"
  }
]