[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Besides the massive plot holes that come with it, Lucy is an entertaining movie. I like the premise, even though it doesn’t really make sense if you think about it but oh well. The action scenes are great and the CGI is surprisingly good. One thing I couldn’t rap my head around however is why on earth does Lucy not save the people who are getting shot/dying in the film? She has all these reality bending powers yet never saves anyone, nor does she permanently restrain the mobsters who are clearly out to kill her and anyone that stands in their way… It just felt weird to me. Otherwise this was really entertaining. I assume this whole idea of \"using 100% of our brains\" wouldn’t give us all these god-like powers in real life but I guess it’s fun to think about.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Spoilers.\n\n\n\n\n\n\n\n\n\n\nWhat i found good:\n1. They must've poured in a lot of money into the CGI and visuals. They were good.\n2. Always buildup of tension, kept me hooked.\n\n\nWhat i found meh...:\n1. The storyline. At first, it begins by saying that humans always create an origin story centered on their own. Then, it ends by showing how humanity can smh control others and gravity and travel back time and break all the laws of physics by... activating more neurones. Isnt this the most self-centered thing ever. \"We were born with Type 7 civilisation esque potential and we just need to activate it! :))))\"\n\n2. Plotholes. I dont understand. Lucy was dying because she ingested the drug and her cells chose immortality or smth. Then at the end of movie after ingesting so much of the drug, she transcends into the Internet and becomes immortal that way. Umm, someone please explain how this works?",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Another Luc Besson visual delight in the shape of Scarlett Johannson. Great to see Mr Wu away from his all you can eat buffet in Benidorm lol. Thoughtful to say the least.",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I just love these type of movies and Scarlett Johansson was amazing in her role.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Stop it with this lie that \"we only use 1% of our brains\", it is a stupid premise and actually untrue. It showcases your ignorance on the matter you intend to develop your stupid idea for a movie on.",
    "date": "2025-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This may be one of the best movies I've ever seen.\nStep back though. You will hear criticisms of how this is pseudo-science and there are plot holes, etc. and all those critics are right. What they don't realize is the potential of this movie as to how humankind can evolve.\nIs it weird? Yes. Does it have a weird ending? Yes. But the potential for humanity is expressed as I've never seen it expressed before.",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Al igual que el eje central de “Lucy” esta película habla de todo a la vez que no habla de nada, y no lo digo cómo algo negativo sino cómo el signo distintivo de esta más que película, experiencia. Siento que es de esas narrativas que una vez que la terminas de ver quedas con más preguntas que respuestas, ya que esta aborda un sinfín de alegorías al avance y significado humano, a la vez que también es una cinta de acción con algunas de las secuencias más refinadas en este genero que he visto, la escena del hospital y de la persecución son visualmente espectaculares.\n\nAlgo que me gusta del cine francés es cómo mantienen su estética aún para sus producciones más comerciales, una paleta de colores con tonos ácidos a la vez que callejeros y deslavados, que contrastan con entornos de suma opulencia, planos subjetivos e incómodos hacia los personajes, pero también contrastados con planos abiertos más tradicionales, que esta película toma en las secuencias de acción, y más allá del hermoso retrato que esta hizo de la época en la que fue creada, cada aspecto técnico rebosa en personalidad. \n\nAl final en completa sinceridad, casi no entendí ningún de los temas más metafóricos que toca esta película, pero lo que amé de esta es que no necesitas entenderlos para dejarte fascinar por esta película, porque en su exterior es tan propositiva e interesante para hacerte deslumbrar con sus visuales al igual que con alguna interpretación que logres atrapar o con cada diálogo lleno de sustancia que suelta Morgan Freeman. \n\nYo soy de los que piensan que una gran historia en el cine no se puede abordar en hora y media, ya que esta duración es más un estándar para narrativas más banales como comedia o acción, pero en Lucy cada segundo es oro, no hay ni una escena de relleno o intrascendente, cada diálogo exterioriza y le da más capas a un ensayo que en toda su duración nunca deja de ser interesante o propositivo, esta película es un viaje en acido del cual nunca quieres despertar, y es confusamente hermoso.",
    "date": "2025-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Just awful. The setup is not bad, and then it just turns into a double-whammy of the worst pseudoscience and the most gawdawful CGI, creating an unpleasant laughable wankfest of ego and wannabe revelation. Not sure how Scarlett Johansson got roped into this, but she should fire her agent.",
    "date": "2025-10-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was, unironically, one of the most amazing movies I've ever watched. I loved the theory, the beginning, the ending, the characters, the script—I loved it all. Most people hated the ending, finding it silly that she just disappeared, but she didn’t—she became. She was always everywhere; she is time and space; she simply is. The theory that time is the only proof of our existence is technically correct if you think about it, and the idea that we only use 10% of our brain’s capacity makes a lot of sense. It explains why we can’t control our cells, dopamine, or choose the languages we want to know, etc. However, if we accessed over 40%, I believe we would dangerously gain control over others. But what most people wouldn’t understand is that if you had the knowledge, peace, and equal power, there would be no reason for overtaking or fighting. The higher percentage is beyond what we can process because we have never known equality. We have never fully understood ourselves or others. We have never seen time or felt the CO2 between everyone around us. We can’t feel, and yet that’s all we do. We are such emotional beings, worried about the future, our appearance, everything. If we were at the wise percentage, like in Lucy’s story, we could be the future. We could shapeshift and bend our DNA to our will. But Lucy chose not to, because she knew if she remained physical, there would be hatred and aggression toward the powerful peace. So she chose to simply be.",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The best movie I have seen in a while. I haven’t EXPERIENCED a movie like this since the Matrix. I’m simply in shock. Definetly R rated however it is also mind blowingly amazing. Can only recommend to anyone who can handle it.",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Pseudo science at Hollywood’s most creative but tortured fiction. The action sequences are good but not great. The plot holes are enormous. The story arc is poorly conceived. And the dialogue is pretentious. If one can live with  these flaws the film is mildly entertaining.",
    "date": "2025-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Awfull waste of time, too far stretched and half way through.",
    "date": "2025-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I was just reading where this movie is still out, I probably have seen this movie six times. Many times throughout this movie I get goosebumps. It is so freaking good and I don't understand how anyone could give it less than a full five stars. It ranks with the very best of sci-fi Action flicks of all time in my opinion. And I see a lot of movies. Once upon a time when DVDs were the Mainstay media, I had over $30,000 invested in DVDs, I'm saying this so you know I am not a lightweight when it comes to movies. In my very young days I went belong to a famous actors organization. It was just brief because I had a very going career at the same time when I dabbled. For those of you that haven't watched this, I trust you you're going to get chills throughout and it is one of the best female action hero movies of all time. I always hope there would be a sequel to this, but of course the way it ends I'm not sure how that would work. I just wish many of the action hero movies were up to this level of solid excellent entertainment.",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "In my opinion, it was an interesting, if poorly executed, film. While the main character was good, I feel that the first part of the film was quite bad, and that's not even counting the exorcist scenes they included, a terrible joke that was poorly told.",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I HAVE NO IDEA THIS MOVIE WAS SO COOL 😂😎❤️❤️👏👏👏👍👍👍💯🍿🍿🍿👌👌👌🥰🥰🥰 WE NEED A SECOND PART.. WHEN?",
    "date": "2025-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A twisted thriller that gives us a promising performance from Scarlet Johannsson... it's worth a watch.",
    "date": "2025-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "As much as it isn't perfect, I kinda dig this film! Plenty to love. It can be thematically great at times!",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "A lot of movies have plot holes and \"Lucy\" is no exception.\n\nIt was going OK until the end. It was as if the writers couldn't think up an ending and just went with several minutes of computer graphics, similar to \"2001 -- A Space Odyssey.\"",
    "date": "2025-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This is certainly entertaining and it gets points for creativity and novelty. There is enough action to satisfy any sci-fi fan. There are some interesting themes here, although they only get superficial treatment, which is too bad. It crosses the border though from sci-fi to fantasy. Rather than using her knowledge to create technology to get superpowers, Lucy just gets them de facto. Narratively speaking, this doesn't work well.",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved the movie. I probably re-watch this a few times a year. Reminds me of my mortality, how fragile life really is. Puts everything into perspective and I think that was the idea.",
    "date": "2025-07-23"
  }
]