[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This is surprisingly wholesome in a creepy kind of way and leaves you feeling saddened but not hopeless. The acting is surprisingly good across the board.",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The most terrible movie I’ve ever watched do not watch it. It’s so so terrible.",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "any integrity remaining in any project ryan murphy has touched is only there as an oversight.",
    "date": "2025-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Many critics dismissed Mr. Harrigan’s Phone because it has no monsters, no gore, no jump-scares. That’s exactly why it deserves five stars. Horror is not about claws or fangs, it is about dread, temptation, and the uncanny slipping into everyday life. This film captures that perfectly.\n\nAt its heart, it is a chilling fable about the danger of “if wishes came true.” Craig discovers that with a single call, death arrives. The true horror is not a ghost in the shadows, but the seductive danger of power, justice on demand, at a terrible cost. The phone becomes a modern “needful thing,” a trap disguised as a gift.\n\nThe film itself is beautifully restrained. Its pacing is deliberate, its atmosphere quiet but tense. Performances from Jaeden Martell and Donald Sutherland carry the story with subtlety, showing grief, mentorship, and temptation with remarkable depth. The lack of spectacle is a strength; it keeps the focus on character and morality rather than cheap thrills.\n\nWhat makes the story powerful is Craig’s choice to walk away. He rejects the cursed phone before it owns him. That is survival, not triumph. It lingers because it is real horror: quiet, unsettling, and moral. For me, this stands alongside Eyes of the Dragon as one of King’s most thoughtful tales.\n\nIf you want a scare, here you go:  Boo!",
    "date": "2025-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Really good film based on Stephen King’s story. For once the don’t try to ‘improve’ the original story by changing and adding to it, it’s virtually the same as the book. Which is a good thing.",
    "date": "2025-09-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Started off slow then it got interesting but then the plot became predictable and weird and the ending was awful don’t particularly recommend this film",
    "date": "2025-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It starts off promisingly and, halfway through, offers belated flashes of tenderness; however, the ending loses its course, wandering in its rushed attempt to become a horror piece",
    "date": "2025-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Stephen King knows how to set up an eerie scene and concept.  Too bad he doesn't know how to write an ending.",
    "date": "2025-05-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Good story, well acted but much too long.",
    "date": "2025-05-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I really enjoyed this movie, it was very interesting to see this young boy spending time with Mr Harrigan gaining knowledge. Anything Stephen King makes I love to watch anyways. Not giving out spoilers but it's worth watching.",
    "date": "2025-04-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved this movie. I had went in expecting horror, but was instead pleasantly surprised by the absolute stunning story. I thought it would be a lot more of a supernatural thriller, but I’m not disappointed with what I got, not at all. \n\nIt’s beautiful. Acting was great, I thought the pacing of the story was well timed, cinematography was amazing, story itself was brilliant, and just everything about it was wonderful. I never really get this into movies, but I genuinely loved this one. I turned it on as background noise as I worked on a puzzle, but ending up almost only watching the movie.\n\nIt’s just such a masterpiece and the only thing I have to say is I just wish they expanded Mr. Harrigan’s story a little more. Felt like we spent so much time with him to know so little. Other than that, I honestly don’t have any other big complaints. Go check it out. Totally recommend.\n\nPs. A lot of the lower reviews are talking about the pacing and lack of horror, so if you don’t mind it being a little slow (at least to start with) and there being no actual jumpscares, don’t worry about that",
    "date": "2025-03-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I'm sure some people expect horror seeing Stephen King, but some of his best work is not outright terror. Don't go in expecting horror! \n\nAs a huge King fan, I was pleasantly surprised how this movie turned out. It's not as good or deeply emotional as the written story, but rarely do his characters' intensities come through on screen. That said, the cast did well with the material.",
    "date": "2025-02-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Absolutely terrible. Donald Sutherland is the highlight but little else is worthy of praise - takes over 40 minutes to get to the heart of the story but the heart is more ponderous than the build up. What is this film? thriller? horror? Psychological drama? Whatever it's trying to be it does a poor job of it.",
    "date": "2024-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The line where the mobile phone is compared to an \"entry level drug\" makes this a very thought provoking movie. Hannigan is introduced to the mobile phone whilst he tries to instill a love of books and knowledge to his young apprentice. In another scene where the boy reads the book whilst the old man seemingly ignores him whilst using his phone is priceless. Throw away the phone....throw it away!😉 Social commentary at its best...as you \"dear reader\" are reading this review on the phoniverse of your mobile",
    "date": "2024-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved this movie, though it wasn't as frightening as I expected. Instead, I was captivated by its beautifully crafted story. The screenplay stood out to me as particularly well-written. Ryan Murphy's direction was impressive, and the acting was phenomenal, truly breathing life into the characters. I'd rate it a perfect five out of five.",
    "date": "2024-10-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A truly beautiful film. it is so well paced and the cinematography is well thought out and elegantly done. The image of Mr. Harrigan sitting in his chair in that beautifully decorated room is truly captivating while also terrifying at the same time. The music was also perfectly composed reminding me of a Miyazaki film.",
    "date": "2024-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "May as well watched paint dry for 2 hours.",
    "date": "2024-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I absolutely LOVED this movie.  Brilliantly cast, perfectly paced and illicits some good and some uncomfortable emotions.",
    "date": "2024-05-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Adorable, interesting, poetic, intriguing, dark, loving and a little scary, as well as good characters.",
    "date": "2024-04-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "One of the biggest 'M'eh' movies of all time. Good acting, ok direction, should have delved more into Mr. Harrington's backstory instead of focusing on the kid. The plot could have driven a great horror story, instead it's just an adolescent coming of age melodrama, with one creepy idea and very little drama.",
    "date": "2024-03-31"
  }
]