[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Why do so many viewers have to diagnose a film to death?\nWhy can't they just enjoy a love story without violence, vulgarity or some in depth psychological revelations?",
    "date": "2025-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Maybe the most boring movie I've ever seen absolutely nothing happens in it",
    "date": "2025-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I enjoyed the acting and the story. thought the script was good and it was very well filmed in a beautiful setting",
    "date": "2025-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I had high hopes for this movie. Harry Connick Jr came off stiff to me. I was hoping for a Hope Floats performance, but it was a miss. The daughter and the love interest were both very well done. It's a good storyline, but it was flat.",
    "date": "2025-05-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The cop and the daughter were solid performances.  They had some material to work with then either or both the director just went south, begins to develop here and there then the obligatory american movie cliches pop up, Connick can not act and the scene on the stage was horrible, so he is drunk after one cocktail? Angi was decent given the script. Not worth the time...",
    "date": "2025-05-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It's a good thing Connick is a far better singer in real life. This movie is no where near as good as Hope Floats. Very disappointing.",
    "date": "2025-03-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "My grandparents are from cyprus so i wanted to check it out but it was just fine watched it throughout school with only subtitles",
    "date": "2025-02-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Enjoyable movie but somewhat lacking in chemistry between the leads.",
    "date": "2025-02-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It is something fresh and different with this special music, crazy beautiful nature and Mediterranean hot characters.\nThe American movies are getting too similar now with every second movie cursing or using super dirty language to try to sell it but this is too easy and repetitive and typically bad. \nFind me Falling has something new and special to watch.",
    "date": "2025-02-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Very enjoyable romcom. Bit dark at times but had an easy going feeling.",
    "date": "2025-01-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Loved this film and am surprised by so many bad reviews - it's not obvious - it has a presumably deliberate tounge-in-cheek quality yes, but it's not trying to be too serious. It's creative, refreshing and uplifting in a way so many movies fail to be these days. A new firm favourite film of mine. I love the slightly dry humour at points throughout - and the camerawork is a thing of beauty as is the scriptwriting - it delivers a serious message as well as a relaxed and creative vibe all at once. It’s not perfectly delivered, nor perfectly written but we don’t live in a perfect world. It’s a bit rough around the edges but aren’t we all? This movie brings great acting talent together with some beautiful songs, great comedy and thought-provoking moments. I love it!",
    "date": "2025-01-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Solid if predictable rom-com with an appealing performance from Harry Connick Jr as likeable has-been rock star John Allman, who has bought a clifftop house on the island of Cyprus to get away from it all and figure out the next steps in his ailing music career. The script doesn't break any new ground, and before you're halfway in you'll have already encountered many of the usual tropes of the genre. But the tropes are executed well, the characters are easy to care about, and if you're in the mood for some throwaway feelgood then you could do far worse.",
    "date": "2024-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Such a moving story, with wonderful chemistry between the characters, real life conflicts and stunning music. Earnest, creative and authentic. Loved every moment of it. And no, I am not a fan of Hallmark movies. This is a great film with its own unique story and form.",
    "date": "2024-12-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Ok maybe not the best movie ever but I felt good watching it and the scenery reminded me of my vacations visiting family in Cyprus. My Mom recently passed, so hearing them speak Cypriot made me smile. Its a romantic comedy and why does it have to be incredible to be good when it can simply be light?",
    "date": "2024-12-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "We’ve liked Harry Connick Jr in other things - he’s not a bad actor - so it had to be the writing. None of the actors struck me as very good, and none of the characters made you root for them. Things like the ridiculous “fence” storyline were just bad, and not at all believable. I predicted every significant event in the story.  Finally, HCJ’s hair looks distractingly like a wig (maybe it is?). I couldn’t stop staring - maybe because the story couldn’t hold my attention for more than 30 seconds at a time. I can’t believe the critic rating isn’t worse.",
    "date": "2024-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I really wanted to like this movie because I’m a Harry Connick Junior fan. But it fell flat too many times. I don’t know if it was bad editing or bad directing. But it was just bad.",
    "date": "2024-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's a feel good movie in a beautiful setting and Harry Connick Jr doesn't disappoint. Definitely worth the watch.",
    "date": "2024-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Always trust the popcorn.",
    "date": "2024-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "We loved it!  Was it the greatest rom-com of all time?  Well no but the story was great.  The music was great!  The experts again got it wrong.  Not sure how they are experts?  It’s a great movie!",
    "date": "2024-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "If you like Hallmark romances, you will love this. Ali Fumiko Whitney (Melina) was a welcome fresh face as the recently discovered daughter of Harry Connick Jr. (John) who assists with rekindling the long ago romance with Agni Scott (Sia).  Placed in Greece, the small town atmosphere was touching and added to the story.",
    "date": "2024-11-03"
  }
]