[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Absolutely awful, bad writing, acting and the list goes on… The gore is descent enough but not enough to sustain this train wreck. Also, why doesn’t Leather Face age? He’s as old( if not older) than Sally Hardesty, it’s a stinker!",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Entertaining until it gets increasingly annoying. This continuation of the story proves slightly suspenseful and fun to watch until it sinks in how irrevocably they’ve tarnished the legacy of this story and franchise. The sole survivor of the original, Sally, is honored terribly and the plot choices are ridiculous. Watch it for fun and hate it for the sad, money grabbing production it is.",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Good job directors thank you so much for this I just want to say special thanks to ruining the franchise and making me turn off Netflix.",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Just horrible. To much CGI as well which kills a movie specially a horror film. Sad times we’re in",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I made an account just to express how disappointing and upsetting this was to see, if that doesn't convince you not to watch it, I don't know what will.",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "How in the hell did you all and IMDb give this a higher score than the other movies? It's the worst. Whoever made this never make another movie again.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This new take on Texas Chainsaw Massacre is surprisingly artistic for a slasher film. The cinematography, camera angles, lighting, and set design are all outstanding. It is clear a lot of thought went into the look and atmosphere, and for that alone, it is worth a watch.\n\nThe plot, however, is exactly what you would expect: get a group together, start carving. There are a few tense moments that earn genuine nail-bites, but they arrive inside a story we have already seen a thousand times. It is the same old spine, the same predictable slasher rhythm, dressed up in new lighting.\n\nThe biggest issue is not the gore or pacing, it is emotional vacancy. I felt nothing for the characters. They are silhouettes running through a well-lit nightmare, not people you care about. When the saw revs, you flinch, but not because you feel.\n\nAnd here is the problem with Netflix horror lately. Almost every title seems to follow the same template: a woman versus a male killer. The repetition has become numbing. You can sense the studio agenda shaping the casting and tone instead of real creative risk. Is there nobody with the courage to do something new, something that actually surprises us instead of preaching the same safe sermon?\n\nThat said, Texas Chainsaw Massacre (2025) still has its strengths. Visually, it is one of the most striking entries in the franchise. As a straightforward slasher, it delivers on suspense and shock. But artistically, it stops where it could have gone deeper.\n\nIf you are here for inventive kills and stylish cinematography, it will scratch the itch. If you are hoping for reinvention or emotional gravity, you will leave the table still hungry.\n\nVerdict: Beautifully shot, occasionally tense, but emotionally hollow. A slick echo of something that once had soul.",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The movie exaggerates in the \"Tought you killed me? I'm back!\" That makes it so boring and predictable. The movie is flawless in the gore scenes, but the story itself is weak, it is not scary at all. Looks like a remake of the bad Friday the 13th movies but the killer is Leatherface.",
    "date": "2025-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Texas Chainsaw Massacre 2022 was definitely not the worst movie in the franchise, but certainly not the best. It starts with 4 influencers who want to rebuild a town named Harlow in Texas and they have a lot of investors coming by. These influencers are Melody (Sarah Yarkin), Lila (Elsie Fisher), Ruth (Nell Hudson) and Dante Spivey (Jacob Spivey). On the way there, they stop at a gas station where they meet Richter (Moe Dunford) and he is carrying a pistol with him. Lila had previously been in a school shooting and her sister Melody made fun of him for carrying the pistol. The interaction ended and the influencers were on their way, when Richter passed by them very fast on the road. They arrive at the town and they notice that the contractor they were meeting is actually Richter, but he was mainly working in the mechanic shop. The group also stumbles on a house where there are two people living in it. These people are Virginia McCumber (Alice Krige) and Leatherface (Mark Burnham). Dante basically pressed the mother and got the cops to take her out of the house. She had a medical emergency and she was taken in the back of the police van. Ruth went with the cops, and Leatherface was holding her in the back. She ended up passing away, and this when Leatherface killed the one deputy and Sheriff Hathaway. The car flipped over and Leatherface got his mother out of the car. He peeled off her face, put it on himself and then killed Ruth. Before Ruth died, she used the radio which got the attention of the gas station owner Herb (Sam Douglas). He used this opportunity to contact Sally Hardesty, indicating that this is a direct sequel to the first movie in 1974. She does not hesitate and she gets in her car right away with a shotgun. Richter was so mad that they got her killed, so he took their keys until they proved that they owned the house. Melody learns that Virginia had died and she took Dante with her to the house to see if she had legal documents that said she owned the house. While in the house, Leatherface returns and slices Dante’s face open. Melody saw this, but she quickly hid upstairs in the closet. Leatherface was still mourning the loss of his mother and Dante managed to barely get out of the house. Richter saw him walking and when he realized that Dante’s face was sliced open, he told the banking person Catherine (Jesica Allain) to lock everybody in the bus. Melody is now under the bed and Richter is in the house with his pistol. He ends up getting killed by Leatherface, but he put up a pretty good fight. Leatherface also broke the wall behind the bed to gather his most beloved weapon, which is a chainsaw. Melody was able to get the keys off of Richter’s dead hands, and almost escape. Leatherface threw a mallet at her stomach which sent her through the floor, but she was crawling under the house. Lila got out of the bus to look for Melody and ended up finding her underneath the house. Both of the girls get out and they both run to the bus, where they hand the keys to the bus driver. Leatherface got to the bus driver, by slicing his head off outside and this is when things got nasty. Leatherface slaughtered every single person on that bus besides Melody and Lila, because they escaped through the hatch in the bathroom. Sally arrives and she gets the girls in her truck, while she went inside to kill Leatherface. Sally had Leatherface in her cross hair with a shotgun, but kept asking him if he remembered her. He just walks out of the room and goes back down to her car to terrorize the girls. Sally shot at him a couple of times and gave the keys to the girls so that they could leave. Leatherface sticks his chainsaw in Sally's chest and throws her, while Melody attempts to run him over. He threw the chainsaw at the car and Melody crashed the car in the mechanic shop. Melody was trapped with a metal pole in her leg and she basically told Lila to leave, because she was going to get killed. Before Melody got killed, Lila came up behind Leatherface with an unloaded gun to try and kill him. She realizes the gun is unloaded and starts running for her life. Sally helped her out in her last moments by shooting Leatherface, which made him run into the abandoned theatre. Lila grabbed the shotgun from Sally’s dead body and followed Leatherface inside. Leatherface took her down, and she knew she was about to die. She reminisced on the time that she was in the school shooting, until Melody somehow got out and saved her life. Lila picked the shotgun up, shot Leatherface twice and Melody finished him with his chainsaw. They both thought they had freedom and they both got in the tesla. They put it on autopilot, and Leatherface grabs Melody out of the car. As the car is driving, Lila sees Leatherface slice Melody’s head off and that is where the movie ends. Leatherface's real name in this movie is Kenneth Slaughter, which differs from other films. Overall, not a bad movie and there are far worse movies in this franchise.",
    "date": "2025-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This movie is complete unadulterated stupid fun.",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "It's pretty bad, the story has a lot of flaws and this movie has a lot of \"You thogth i was dead, you fool I always come back\", this make the movie boring and not surprising.\n\nIn the other hand we have good acting, some plot twist are unexpected and  nothing more.\n\nIf you like gore and you are going to watch it ignoring the flaws in the story, you might enjoy it, personally I wouldn't recommend this movie.",
    "date": "2025-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The most surprising thing about this flick, Fede Alvarez is involved with it.\n\nOne star for the chainsaw, daym thing went through everything.\n\nAvoid at all costs!!!",
    "date": "2025-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Absolute waste of time to watch. I was pacing my room in absolute frustration at how bad this movie was. People stay alive when injured so unrealistically long/short. (ex: A lady got her insides mixed up by a chainsaw for a good 20 seconds and was thrown a few feet in the air. Still lived for well over 3 mins.) \n\nHow can a killer survive getting shot at MULTIPLE times, almost drowning, getting a chainsaw to the jaw, etc., and still survive? Doesn't even make the movie enjoyable. 😐\n\nTo put it in simple terms, the pacing is horrible, there is too much plot armor, and so many scenes just don't make sense. The movie sucks. Don't watch it.",
    "date": "2025-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Couldn’t help but root for Leatherface in this one.",
    "date": "2025-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I enjoyed it. Not a perfect movie but horror fans will dig it",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Lots and lots of gore for those that love it, but the story was very lacking and frustrating. \nThere were plenty of opportunities to kill the guy sooner, but the characters kept monologuing in instead of just shooting the guy which led to more deaths.",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is great 🪚🩸",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Leatherface is human so why can he eat 2 shotgun shots, drowning, and a chainsaw to the face and still be able to walk across almost the whole town of Harlow? And sally hardesty is like a knock-off Laurie strode atp. And she’s also human and she took a chainsaw to the stomach for many seconds and she is still alive for multiple minutes after. The two main characters are really annoying, and so are 99% of all of the other characters. Worst movie in the franchise. This got a 1.5/5 star review because we got to see sally, and that’s really it.",
    "date": "2025-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It was pure gore (which I love :p) the story building was short but not to short, the acting was great. Everyone I the movie was quite dumb but in an enjoyable way. Reason for 4 stars is because some of the acting or scenes were bad or didn't make sense",
    "date": "2025-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It is what it is. You know going in that it's going to be a blood bath, slashing, smashing and every piece of gore they can throw in between. And do they deliver. This isn't your literary horror work like Dracula or Frankenstein. It's not Freddy or Jason. It's old Leatherface and he does terror like no other.",
    "date": "2025-08-09"
  }
]