[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This could have been a cute rom com even tho the stories been done a million times but Sheilds really let the part down. She couldn't convey her character well. Plus, her eyebrows are so harsh, I was distracted looking at them the entire movie! The role between mother n daughter wasn't sorted well either. The daughter was really unfair mom n we had no idea why? Or the mother of a bride telling her daughter she's marrying son of Satan before her wedding becauseof a relationshipshe had 30 years ago? What was that? Cameron Diaz or Julia Roberts woulda put this on a better journey. Daughter looked super young too which is fine but her outfits like a 16yo didnt help. Needs alot of help in this movie from writing to read actors to story telling. Pass.",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Weird plot about the single parents of the bride and groom still having feelings for eachother after twenty years.  The father is insuferable to watch and the mother is gaslit by every other character into thinking she is wrong in an hour and a half of plot driven and manufactured conflict all resolved in less than half a minute of talking.",
    "date": "2025-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Me and my girlfriend spent the weekend watching bad movies, but we HAD to make an account so we could warn you how horrible this movie really is. \n\nTik-tok dances and music, so full of crappy influencer’s sh*t, do not recommend it at all.",
    "date": "2025-04-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Brooke Shields is back. That’s not enough to elevate “Mother of the Bride” beyond the typical romantic comedy expectations, but it is still good to see her on screen in play out of its second chance trope between the separately single parents of a young couple being wed in Thailand (cue some beautiful scenery at least).",
    "date": "2025-04-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "There are enough great actors in this that I shouldn't feel bored. But, the character development was shallow and the script was predictable. If you are looking for a mindless rom-com then go for it.",
    "date": "2025-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I don’t get the really low audience score. The film is what you assume it will be. Light-hearted, fun, predictable and an easy watch. Whether you want something to take your mind off life or have it in the background as you do something else, it does what it’s supposed to do.",
    "date": "2025-03-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "What the actual fuj! End of the movie threw me off. In what in the Alabama is going on. Parents of the bride and groom married each other??? So your mom is your step mom and your step dad is also father in law?! What a dumb movie. ZERO STAR!!!",
    "date": "2025-02-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Just tried way too hard on satisfying folks who would not watch this movie in the first place... it had potential.",
    "date": "2025-02-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This is just bad. Not a character I liked or cared about. Not funny.",
    "date": "2025-01-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A mindless film elevated by a seasoned supporting cast, who are the sole reason to give it any attention.",
    "date": "2025-01-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "what kind of twisted fruck porn industry mentality movie",
    "date": "2024-12-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I thought this was a really fun movie to watch. Light and easy and very enjoyable. Definitely recommended.",
    "date": "2024-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie basically promotes incest. Not a fan.",
    "date": "2024-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Mother of the Bride starts off with an interesting premise, where the bride’s mother finds out that her daughter is marrying the son of her ex-boyfriend. However, it doesn’t really go anywhere after that. There are also a bunch of side stories that don’t really go anywhere and side characters that mostly stand on the sidelines. Brooke Shields, Benjamin Bratt, and Rachael Harris are good actors, but they’re not given much opportunity to show it off in this bland vanilla rom-com. While I didn’t hate Mother of the Bride, I don’t think that I would choose to walk down the aisle with this movie again.",
    "date": "2024-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Decent Watch, haven't seen Brooke in awhile, thought Benjamin Bratt and Rachael Harris were great, made fun of the different generations, best part was it's a normal 90 min length!",
    "date": "2024-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Absolutely the worst of the worst, acting, script just absolute dross.",
    "date": "2024-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Watching this movie is a new torture method",
    "date": "2024-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Pelicula basica, predecible y con solo un par de escenas que pueden ser graciosas.",
    "date": "2024-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I know this movie doesn’t have the best reviews, but I liked it. It reminded me of a Hallmark movie. Predictable? Yes. Acting? Ok, but not fantastic. Does it require you to suspend your idea of reality? Yeah, probably. But it was sweet and charming with some good mother/daughter moments which I am a sucker for and a happy ending that is tied up neatly with a bow. If you like low-stress, PG but charming rom-coms, you would enjoy this movie.",
    "date": "2024-08-10"
  }
]