[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Linda Cardellini gave an amazing performance. The scares weren't that good only because the trailer ruined them. Definitely worth a watch. Tim Treakle",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A few great suspenseful moments but overall it had more potential than it gave.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Its not the worst I've seen, but I won't recommend it. Most parts of the script had very poor writing. Had some good jumpscare moments but that was it.",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Apesar do grande potencial narrativo e cultural da lenda latino-americana por trás da trama — inclusive, esse filme deveria ter sido ambientado no México, mas Los Angeles era, claramente, uma escolha mais prática e barata —, \"A Maldição da Chorona\" é genérico, recheado de sustos previsíveis e marcado por um visual que não parece, em aspecto algum, ambientado em 1973, como o filme alega, parecendo mais um episódio aleatório de \"Supernatural\" (2005-2020) do que um filme de cinema.",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I love that this is part of the Conjuring Universe, as this is a common folk tale told in Latin American households. I know we used it to test how brave other kids were, as there were horrible stories of people seeing her face and getting scratched in the bathrooms. \nI really enjoyed this telling of the story as it was terrifying and had scary jump moments to it. \nGreat cast, great facial expressions they were able to carry throughout the film",
    "date": "2025-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The jumpscares made this film bad it was not about jumpscares the it was an hell of movie now its not!",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Diving into the Conjuring universe, I figured I’d check out The Curse of La Llorona. First time watching it, and honestly, it’s not as terrible as the internet makes it out to be—though it’s definitely not good either. Linda Cardellini is hands-down the best thing here (she always elevates weak material), but the movie leans way too hard on cheap jump scares instead of actual tension. The plot is paper-thin, and the dialogue ranges from clunky to cringe-worthy. Still, it’s oddly watchable in a “don’t take it too seriously” way. Overhated? Yep. Worth rewatching? Probably not.",
    "date": "2025-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It’s so bad. Not even fun bad, just boring. Tuco Salamanca has some solid one liners, but even Linda Cardellini can’t redeem this trash fest.",
    "date": "2025-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "i agree, its total trash",
    "date": "2025-09-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The Curse of La Llorona isn’t an outright disaster, but it definitely feels like the weakest link in the Conjuring universe. While the legend of La Llorona has plenty of chilling potential, the film leans so heavily on predictable jump scares that they stop being scary and start feeling like a cheap shortcut to tension. The atmosphere, set pieces, and characters never quite live up to the quality bar set by the other Conjuring films, leaving the whole thing feeling more like a rushed spinoff. There are a few genuinely eerie moments and strong performances sprinkled in, but they’re buried under a barrage of loud sound cues and obvious setups.",
    "date": "2025-09-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Another film that I believe received unjust criticism. This movie was genuinely terrifying. The home invasion horror genre always unnerves me, as being trapped in your own house with no escape is unsettling. The ending was quite anticlimactic, but overall, I genuinely enjoyed the film.",
    "date": "2025-09-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie is painfully underrated.",
    "date": "2025-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Spooking concept, but very poor on screenplay & the scares.",
    "date": "2025-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I was excited to know more about La Llorona. Characters should have been written with more critical thinking. Had potential so sad. Mom and kids were not thinking throughout the movie pissed us off 😣😣😣",
    "date": "2025-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "this movie is a mistake and disappointment to the conjuring name dont watch unless you want to be so bored you want to kill yourself",
    "date": "2025-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The Curse of La Llorona (2019) — Let’s not sugarcoat it: this isn’t a great movie. But at the same time, it’s not the absolute train wreck some people make it out to be. The biggest problem lies in the writing—the script is scattered, uneven, and never fully leans into the folklore it’s pulling from. The pacing feels a little off, like the movie doesn’t quite know when to build tension and when to let it breathe. And yet, despite all of that, I still found myself watching it straight through without checking out completely. It’s watchable, just not remarkable.\n\nThe real saving grace is the look and feel of the film. From a purely technical standpoint, The Curse of La Llorona actually delivers some impressive visuals. The cinematography is polished, atmospheric, and loaded with gloomy tones that fit the story’s haunting roots. The direction leans into traditional jump scares, but the way those scares are framed is at least competent—never groundbreaking, but cleanly executed in a way that makes you stick with it.\n\nAnd then there’s Linda Cardellini, who is without a doubt the film’s anchor. She’s an actress who consistently brings warmth and sincerity to her roles, and here, she gives a performance that’s far better than the material she’s working with. Without her, this film would have fallen apart completely. Cardellini grounds the story in a way that gives the audience something—and someone—to latch onto emotionally, even when the script itself doesn’t know what it’s doing.\n\nThe problem is that the scares and the mythology never truly click together. La Llorona, as a figure in folklore, is genuinely terrifying and has the potential to carry a horror franchise. But the execution here is too paint-by-numbers, with the story moving from one predictable scare setup to the next without layering in enough depth. It never builds that overwhelming sense of dread that great horror thrives on. Instead, it feels like the film is just checking off boxes: creepy ghost in the shadows, sudden loud noise, another predictable haunting moment.\n\nSo where does that leave this movie? Somewhere right on the border. It’s not “rotten” in my book, but it’s not something I’d rush to recommend either. It’s a middle-of-the-road horror entry—watchable for the visuals, serviceable for the scares, but forgettable overall. If you go in with low expectations, you might have a decent time, but if you’re looking for something that lingers in your head long after the credits roll, this won’t be it.\n\nThat said, I do think La Llorona as a character has potential if handled correctly. The legend is rich with horror possibilities, and with the right script and a director willing to take more risks, there’s absolutely a foundation here for a terrifying sequel. Unfortunately, The Curse of La Llorona plays it too safe, and the result is a film that never rises above mediocrity.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "More of a Whimper Than a Wail: A Soulless Take on a Terrifying Legend\nAs a Mexican-American, I grew up with the chilling tale of La Llorona—the \"Wailing Woman\" whose mournful cries signal doom. The legend is a cornerstone of our folklore, rich with tragedy, maternal grief, and pure, primal terror. I went into The Curse of La Llorona with incredibly high hopes, eager to see this iconic specter given the terrifying big-screen treatment she deserves. What I got instead was a profoundly unimpressive and deeply disappointing film that felt more like a cheap parody than a genuine horror movie.\nThe most glaring issue is the plot, which is so formulaic and thin it’s insulting. The film discards the deep psychological horror of the legend in favor of a paint-by-numbers haunting story. It follows a predictable sequence of jump scares that are loud but never frightening, and telegraphed so far in advance they lose all impact. There is no suspense, no building dread—just a series of contrived set pieces that feel disconnected and emotionally hollow. The narrative could have been about any generic ghost, and swapping in La Llorona felt like a cynical marketing ploy rather than a story told with purpose.\nThe execution is further cheapened by sub-standard acting and a baffling lack of cultural authenticity. The performances are largely flat, with characters making nonsensical decisions that serve only to move them from one scare to the next. Even more jarring were the painfully fake Spanish accents, which were so distracting they completely shattered any hope of immersion. For anyone familiar with the culture, these elements don't just feel lazy; they feel disrespectful. It’s a Hollywood caricature of a culture, rather than an honest engagement with it.\nUltimately, The Curse of La Llorona is a colossal missed opportunity. It takes a powerful, culturally significant ghost story and strips it of all its soul, nuance, and genuine terror. Instead of exploring the themes of loss, guilt, and feminine rage inherent in the legend, the film delivers a shallow, forgettable entry in the horror genre. This isn't the story of La Llorona I grew up fearing; this is a hollow echo, unworthy of the legend's name.",
    "date": "2025-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Honestly, I watch a lot of horror movies and don’t understand the hate. Thrilling, suspenseful and gripping with a great cast and plot. Such a good film, highly recommend!",
    "date": "2025-06-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The Curse of La Llorona is one of the worst horror movies ever made, I don't think I could find any good in this piece of crap.",
    "date": "2025-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It's a generic and soulless horror film. It uses cheap scares, has a shallow script and poorly developed characters. The threat never convinces, and the film completely wastes the potential of the legend. No real consequences happen — neither the children die, nor the protagonist — taking away any tension. One of the worst in the Conjuring universe.",
    "date": "2025-05-16"
  }
]