[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Better than Jackass 4",
    "date": "2025-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I loved it, don't know why audiences hate it so much, it wasn't that bad.",
    "date": "2024-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Jackass never make single worst movie. It's fun, it's fresh, it's funny. Still golden, always forever.",
    "date": "2023-12-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Es, como lo dice su nombre, una version .5 de la película original, incluye buenos sketch´s pero va mas del tipo \"documental\" de la 4 película.",
    "date": "2023-12-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "it I crazy how people like these type of movies ,they are sooooo disgusting not funny at all and very sexualized I dont liked it because it was just so unwatchable",
    "date": "2023-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Has a few funny moments, but on the whole, this is a rather insipid affair.",
    "date": "2023-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Getting out of hand and no longer that funny",
    "date": "2022-12-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It's what I expected out of a Jackass documentary. Sometimes more, sometimes less. I thought it was fine for what it was. 🍅",
    "date": "2022-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Jackass 4.5 deserves high marks for even just discovering why Johnny Knoxville's hair is turned gray, lol. With the participation of the behind-the-scenes, it became a much more enjoyable and emotional, documentary-like job. I know that my generation would love this.",
    "date": "2022-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "More nudity than anything I have previously seen. Many of the clever qualities that made previous Jackass movies worth watching have been reduced to nothing of value.",
    "date": "2022-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Better than Jackass Forever! (And I loved that movie) love just seeing them talk and laugh together and all the behind the scenes stuff really makes you appreciate Jackass Forever even more",
    "date": "2022-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "58%. 7/8/22. Just another solid Jackass movie. No great pranks. Nothing about it was very funny.",
    "date": "2022-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "They doesn't aged well.",
    "date": "2022-06-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Outstanding new cast and a well made movie. I laughed and/or was on the edge of my seat thru 100% of the movie. job well done.",
    "date": "2022-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Basically, another typical .5 edition of the main movie but funny enough for a time killer at home.",
    "date": "2022-06-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Although it may not have the same exact zing. I love these guys 3.4",
    "date": "2022-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I always welcome a chance to spend more time with the Jackass crew but I think the addition of more in depth behind the scenes footage and interviews made this a much stronger release than any of the previous 1/2 films. 7.5/10",
    "date": "2022-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This movie explains why the new memebers were added. It wasn't explained in Jackass Forever so it's nice that we finally hear how johnny found them each. I like \"initiation\" to get back in the movie cast (just look for hot sauce scene). i laughed a lot watching this. After you watch it you might feel this really is the last Jackass sequel ever. Enjoy their goodbye. I hope they all find some future new Hollywood roles.",
    "date": "2022-06-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Some very funny bits that could have easily made it in to the feature film.",
    "date": "2022-05-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Not quite as intense as the others.  A bit more acting, a bit less funny, a whole lot more interview-y.",
    "date": "2022-05-29"
  }
]