[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "No idea why this movie gets such a bad rap. Read the backstory. A LOT of effort (4 years worth in fact) was spent just rewriting the script specifically for Bradley Cooper and Emma Stone, among others. Great directing by Cameron Crowe, not an easy movie to bring to screen. Good cinematography and visually quite pleasing. Enjoyed it",
    "date": "2025-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "What a waste of good talent. Why did Emma Stone pick this film?",
    "date": "2025-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Good cast, but a poorly written script.  Dialogue and storyline both stilted and confounding.  Only reason to watch is to make fun of it.",
    "date": "2025-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I don’t know if people really act like this, as portrayed in the movie which maybe makes it a little cheesy, maybe a little less realistic but I personally liked it very much. I liked the concept of a modern day villain.",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Good movie as long as you don't expect too much.   It passed the time.",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "A dream cast is given an incomprehensible script. Da heck was this?",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1.75 hours!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I had no idea what was going on in this movie. It felt  like key scenes were improvised as they made no sense, like the married couple seperating.",
    "date": "2025-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I don’t get the hate for this movie… great cast who all do a good job at delivering.  Not an Oscar contender, but very enjoyable.  A nice story, with amazing scenery.  Certainly better than most of the drivel coming out of Hollywood right now!!",
    "date": "2025-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Filme mais ou menos, o roteiro é fraco, as cenas são mais ou menos, o elenco é bom, mas ninguém ajuda a melhorar o filme, a história é fraca, os personagens sao fracos, e o filme deveria ter cenas bem melhores e relevantes para fazer o filme ser bom.",
    "date": "2025-05-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I could not understand the plot, minus the messy Love Square that was happening. I don't get the whole military mission side of the whole plot at all. I keep asking my wife if she understands what's going on and she kept saying no until she just fell asleep watching it. Congratulations, Cameron Crowe, you made me hate all the actors in this movie that I like, especially John Krasinski and Rachel McAdams. It never got better and then it just ended. What a convoluted mess.",
    "date": "2025-02-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Alright, so it was \"meandering\" and a bit wacky. I liked it much more than I thought I would. I resonated with the spiritual air of the film. I enjoyed how it portrayed that mystical undertone in all of the scenes. I thought the family dynamics and tension were handled with care; finally there's a moral ending that didn't involve infidelity. The acting was wonderful though Stone came off a little strong. I imagine some of the film's messages may be closer to home now than when the movie came out. Possibly my favorite aspect, though, was the mannerisms of every character. You could feel the atmosphere change with each person and all of them had a spark of something deep. It feels like their world is one without \"supporting roles\" and \"extras.\"",
    "date": "2025-01-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This vapid low grade trash insults your intelligence. I stopped after 40 minutes I cant get back. Dont be seduced by the big names...they're awful.",
    "date": "2025-01-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Cute character for Emma Stone, not sure how well it fit in with the plot. Overall the plot was rushed - it felt disconnected and as if the feeling of the scenes was being shoved into your face. A miss for me dispite many reasons to want to like it.\n\nThis felt like a parody of a Crowe film, to the point it reminded me of a Wes Anderson flick, and not the best ones either.",
    "date": "2024-12-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "O filme não se desenvolve! A capitã é muito engessada e masculinizada para o desenrolar desse romance. O roteiro não é bom e fiquei sem entender a proposta do roteiro.",
    "date": "2024-12-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "What on earth is going on in this movie!? So many great actors and scenery yet it’s like a huge plan that can never take off.",
    "date": "2024-12-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This movie felt like Cameron Crowe went on a tour of Hawaii, grabbed a bunch of facts he found interesting and decided to force a movie out of it.",
    "date": "2024-12-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Stellar cast, famous director, and yet quite possibly the worst film I have ever seen.",
    "date": "2024-12-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This movie had all the right actors with all the bad everything else in between. It was a giant pile of confusion and dots that didn’t connect while you sit watching it, hoping it gets better. Spoiler alert: it NEVER does. I’m so confused how some the actors I love were in such a poorly executed movie.",
    "date": "2024-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The storyline is a mess, even for a roncom.",
    "date": "2024-11-25"
  }
]