[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This movie was such a disappointment! It lacks so much magic that the first one had, and the CGI makes me wanna smash my head into a wall.",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Love this movie! Watch it every year",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Such a cool new spin on a Christmas movie, my wife, son (7) and I absolutely love, definitely our favourite Christmas movie. Kurt Russell nailed the role and brought a sack load of humour and fun to the film.",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Definitely top 5 Christmas movie of all time.",
    "date": "2025-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The Christmas Chronicles, direceted by Clay Caytis and released on Nov 22, 2018 is a really great movie, because if we talk about Christmas movies this is genuinely one of the best ones.\nThe film is about the two siblings Kate and Teddy Pierce that were going to hatch a plan to capture Santa Claus on Christmas Eve. When the plan goes awry, the children join forces with St. Nicholas and his loyal elves to save the vacation before it's too late. \nThe plot actually seems very intriguing and sometimes predictable.\nFor the year in which the film was released, the special effects are not bad, that is, they are decent, as well as the photography and stuff.\nThe acting is definitely quite well worked, the expressions, the dialogues, the fluency in which they speak, definitely a great work! \nIn my opinion this may be one of the best Christmas movies I’ve seen in a while, the plot is very emotional and joyful at the same time. \nI really like this movie because is basically made for almost all ages, and it’s a solid option if you are going to watch it next to your family on a cold winter night at house.",
    "date": "2025-03-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Hating this movie is like hating Santa Claus.",
    "date": "2025-01-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Actualmente es la mejor película de navidad hecha en los últimos 20 años.\nTodo un clásico para el futuro. Lastima que al salir solo en streaming y no en cines su impacto cultural es mas limitado. \n\nIt is currently the best Christmas movie made in the last 20 years.\nA classic for the future. It is a shame that, as it is only released on streaming and not in theaters, its cultural impact is more limited.",
    "date": "2024-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing movie experience and great watch! It caters to both children and adults who truly believe in the magic of Christmas. 1st on my holiday watch list!",
    "date": "2024-12-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I’ll be brief and won’t use fancy words: This movie is a holiday gem. It should be in your holiday movie lineup each year. Kurt Russell plays an awesome Santa next to Tim Allen. The movie has its funny parts and sad parts. If you hate this movie to any degree, then you probably prefer coal on christmas or you just find absolutely no joy in christmas.",
    "date": "2024-12-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Recomendado para ver en familia. Entretenida y divertida",
    "date": "2024-12-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The best Christmas movie of all times!!!!",
    "date": "2024-12-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Kurt Russell is Santa Claus. What more do you need to know?",
    "date": "2024-12-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is my 9 yr oldest favorite Christmas movie, since she was little. I've watched it many nights in December. In fact, the reason I'm writing this is bc we're watching it together right now. The sequel is also very cute. May be a good watch for a Kurt Russell or Goldie Hawn. They're a cute couple in the movie and IRL. Very enjoyable and it's not too silly for 33 yr old me to watch w my kiddo 👌",
    "date": "2024-12-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Good production quality for a Netflix film. Saw it a second time recently on the big screen and really does well there. I was susceptible to the sentimentality of it all. Instant classic.",
    "date": "2024-12-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Honestly just a really good Christmas movie. It introduced me to Santa clause is back in town which is my favorite Christmas song. Super underrated",
    "date": "2024-12-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A great new addition to the Christmas list! Kurt Russell is probably the best version of Santa we've seen on screen yet! Can we to watch this Christmas and for more Christmas' yet to come!",
    "date": "2024-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Meh. A poor excuse for a children’s Christmas movie.",
    "date": "2024-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best movie i really liked it",
    "date": "2024-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The best family Christmas movie! My boys love it. \nLots of life lessons to learn, like losing loved ones, depression, sibling relationships, believing in yourself, believing in something greater than yourself and the world, being respectful, treating others with kindness, etc etc!",
    "date": "2024-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The best ever Christmas movie.It is enjoyable even without being a Christmas movie the part where Santa is in jail is one of the most entertaining scene I have ever seen if it’s Christmas watch it now",
    "date": "2024-10-19"
  }
]