[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "HORRIBLE. Studio must have paid off Rotten Tomatoes for their RIDICULOUS review should be RT-0",
    "date": "2025-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A loud obnoxious overbearing sloppy excuse for a \"comedy\" movie. I don't think one of us laughed once. It was pitiful.  Boring, tried way too hard to stretch out a 5 min bit into 90minutes of watching in real time why Bert needs to stay off the screen. His comedy chops is as valid as Brendan schaubs blackbelt lol",
    "date": "2025-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I thought I would hate this. Bert is definitely full of himself and took his only joke worth noting and made an hour and a half film about it. But the movie itself isn’t the worst thing I’ve seen. It did make me chuckle a few times. The fact his actual wife was in it, as his enemy at the beginning was kind of funny. Unless you're familiar with Bert’s comedy or podcast there is definitely going to be some questions. 2.5/5 is about what it deserves.",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I was thinking that I'd like Mark Hamill more in this, but I also thought I was going to hate Bert Kreischer. This movie has a great story with good humor and action, however, the pacing seemed a little off at times.",
    "date": "2025-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I've watched Bert doing stand up and I've heard the story about the machine. It was funny in patches but not as good as Bert's stand up shows",
    "date": "2025-07-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A funny success in 1 hour and 52 minutes. Rated R for Pervasive Language, Drug Use, Some Sexual References and Strong Violence!!!!!!!!! Starring Mark Hamill as Albert.",
    "date": "2025-06-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I hate to even say this phrase, BUT it was honestly “LOL” funny. Bert really makes the movie and it’s non stop entertainment",
    "date": "2025-05-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "THIS MOVIE WAS SERIOUSLY FUNNY! CLASSIC BART!",
    "date": "2025-05-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I went in expecting either a decent movie or a movie that was so bad it was good ... it was just bad",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Terrible premise, terrible movie. Bert is no comedian and sure as Hell is no actor.",
    "date": "2025-05-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Despite its flawed story and Bert Kreischer's mediocre acting, this movie was still incredibly entertaining, and I really enjoyed watching it. I definitely recommend it for comedy and action fans!",
    "date": "2025-05-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Started watching it and quit after a few minutes. And I’m a Bert K fan, but still…\n\nThen I found myself with some time to kill and just wanted to watch something mindless. \n\nWell, I liked it. It’s not an Oscar movie, not even a good movie, but lots of silly laughs and jokes. I’m glad I gave it another chance.",
    "date": "2025-04-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's Bert, it's fun, don't think about it too much. :)",
    "date": "2025-04-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "🙂😐🤢🤮😖😠 my exact facial progression of this movie.",
    "date": "2025-04-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "While we enjoyed the stand-up version of the story, the movie was difficult to get through, it just wasn't that funny. There are a few good moments, but the number of scenes that dragged, greatly outnumbered the scenes we enjoyed.",
    "date": "2025-04-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This movie I thought was one that Kevin James was the star of instead of Bert Kreischer. This is exactly the kind of movie that Kevin James would make, and I kept seeing him in the part. It was just a so-so movie in my opinion. maybe I should have given it a 4 instead of a 5. Kind of a toss-up. It was pretty predictable as far as plot goes and there were a few holes in the story, but overall passable.",
    "date": "2025-03-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I never knew who Bert Kreischer was, so I got a fresh take, and I loved his comedy, and the movie. And of course Mark Hamill is always great to see.",
    "date": "2025-03-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I really like the movie the plot was ok but I really love the twist they put on Bert's story especially when the character is retelling it. I think it was a smart way since Bert hasn't acted to do it this way so you can have a flash back and go back and forth. The throat punch was extremely disturbing lol but funny",
    "date": "2025-03-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's ridiculous but watchable. I don't love Bert Kreischer but despite that the movie was entertaining enough for a night in w/ some truffles and a good friend.",
    "date": "2025-02-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I love Bert but not actor Bert. He’s terrible at it. I thought this movie was going to be his story of the actual trip with the younger him actor but of course Bert has to be the star himself haha. It has some good jokes and is worth a watch if you can’t decide what else to watch. Igor was the only top tier character.",
    "date": "2025-01-30"
  }
]