[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "One of the worst DreamWorks movies ever made!\nThe animation is terrible, even for 2005 standards because Shrek 2 and Shark Tale came out one year prior and their animation looked better than this, for some reason Madagascar has the same budget shark Tale and they couldn’t even make it that good. It makes me wonder where did the budget go?\nThe reason why I bring up the terrible animation is because most of the time you get characters close-up onto the screen either screaming, smiling or crying, makes me wonder if this film was intended as a torture device because it makes the film so creepy. I feel like DreamWorks must’ve rushed through this and spent all their work on Wallace and Gromit The Curse of the Were-Rabbit.\nAlso, I hated Alex the lion in this one because he so unlikeable and I wouldn’t be surprised if he was originally going to be the villain of the film, if that’s true, the change might have happened at the last minute.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "well it's fine i guess",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love this movie all lot and also sequel of this movie and this one right here it’s also my favorites At all time and I also give this one with the 2nd and the 3rd one 10000/10 and with a tomatoes of this one right here too and also same with the 2nd one and the 3rd one too and by the way awesome and also a great and a funny and fun movie at all time too and it also this movie won in Nickelodeon kids choice awards back in 2006",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I like to move it OUT OF HERE!!!!",
    "date": "2025-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was funny entertaining has animal characters to it love it",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Il problema di questo film è che i protagonisti sono scritti male e non si fanno amare dal pubblico, mente i personaggi più belli vengono sprecati",
    "date": "2025-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Filme bacana, o roteiro é bacaninha, as cenas são bacanas, a história é bacaninha, o elenco é bacaninha por que só sao bichos, e metade do elenco ajuda a melhorar o filme, os personagens são bacanas.",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Don't know why the critics are so stuck up on this, but it was a great movie I enjoyed while growing up",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Movie is iconic. Love the introduction to the characters in the zoo. It is a chaotic movie but I still like it.",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "¡Qué divertida película es \"Madagascar\"! Algo que amo de las películas de Dreamworks de inicios de los 2000 es su versatilidad para tener un humor más infantil, con chistes de doble sentido planteados de gran forma dentro de la trama; pero sin olvidar una historia que vaya más allá de centrarse únicamente en la aventura. Sí, puede tener escenas tan perfectas en cuanto a comedia que, a 20 años de su estreno, siguen plasmadas en la cultura pop, pero también esta historia puede tener como eje central la amistad, y cómo un verdadero amigo siempre podrá compartir su felicidad contigo.\n\nMe encantó cómo la película desarrolló el deseo tan diametralmente opuesto entre Marty y Álex. Mientras Marty deseaba salir del zoológico y experimentar qué hay más allá, Álex disfrutaba la monotonía del zoológico, donde a pesar de tenerlo todo, le faltaba lo que Marty más deseaba. Y la película desarrolla estas dos posturas de gran forma, donde en la resolución del mismo, ambas ideas colisionan al mostrar la imperfección de las mismas. Y esa resolución me pareció brillante, porque mientras otras películas tratan su idea central desde el utilitarismo, donde solo una postura es la correcta, esta abre la discusión y nos demuestra cómo no hay una resolución enteramente positiva, sino una a la que desde nuestra individualidad nos acomodamos, pero no por ello tenemos que condicionar a los demás a aceptar esa idea como única opción; siendo justamente el clímax cómo ambos dejan de anteponerse a su felicidad para compartirla con los que los rodean, ya que no tendría sentido tener todo lo que queremos si no tenemos con quien disfrutarlo.\n\nPero más allá de eso, esta película es divertidísima. Todos los diseños de los animales son en serio adorables, y casi cada chiste de cada uno funciona. Es triste que ya no se hagan películas animadas tan honestas, donde a través de una trama sencilla se puedan abordar temas más complejos, pero sin perder la chispa para que el mensaje no se vuelva tedioso. Por algo el público de todas las edades dictaminó a esta cinta como una de las más icónicas de la animación de tiempos recientes.",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A 00's Animated Classic. The voice acting is really good. It's quite an accomplishment in that this has like 7+ animals in it and manages to make all of them stand out and memorable. Outside of Alex & Marty there really isn't any character depth though. It's pretty solid all around besides that. The animation is dated and can be a little cheap looking also but it does a good job being comedic. That's one of the biggest strengths here. It's pretty funny actually and a lot of it is just good old fashioned slap stick and it's really well done and goes on for long periods. This is very much a comedy first and an adventure second. That means the plot can be very razor thin. There isn't any deep message here either. Are the jokes laugh out loud or iconic? Not really this isn't Airplane! and the references ones can be out of place. But it's fun, the characters are memorable, and it does a good job keeping everyone together and not jumping around constantly. Save for the opening. If your a fan of any voice actors here, animated comedies, or 00's animated movies check this out.",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Esse filme é deslumbrante e incrível. A premissa é interessante e o filme tem ótimas aventuras, mas tem algo vazio que faz o filme não ser 5 estrelas..",
    "date": "2025-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It was a good movie!",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Madagascar bursts off the screen like a party for your funny bone. The film’s irresistible charm lies in its rapid-fire dialogue and clever character interactions, transforming a zoo break-out into a hilarious odyssey. From the moment four pampered New York animals tumble into the wild, the screenplay’s sharp wit keeps the laughs rolling.\nThe real magic happens whenever Alex, Marty, Melman, and Gloria trade barbs.\n\nAlex’s star-struck bewilderment plays perfectly against Marty’s sardonic quips.\n\nMelman’s hypochondriac woes elicit sympathetic chuckles, especially when hijacked by King Julien’s madness.\n\nGloria’s sassy comebacks ground the group’s chaos with heartfelt levity.\n\nBen Stiller, Chris Rock, David Schwimmer, and Jada Pinkett Smith deliver pitch-perfect comedic timing. Their distinct rhythms and improv-flavored energy elevate mundane zoo routines into laugh-out-loud set pieces. Together, they turn an animated adventure into an improv showcase.\nMadagascar’s humor never feels dated because it balances clever wordplay with universal fish-out-of-water scenarios. Its quotable one-liners and vibrant pace appeal to both kids and adults, ensuring family movie nights remain filled with giggles and groans alike.",
    "date": "2025-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "es muy buena pelicula y entretenida",
    "date": "2025-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A rather mundane effort that lacks laughs. The kids may love it, but not enough there to keep adults entertained like the best animated movies do.",
    "date": "2025-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "For being back in 2005, I took for granted this freaking animation style, it still looks freaking good 25 years later!!. Marty and Alex are the best friends dynamic duo. im glad it was created, and he is the bestie that is self-conceited lol. Spy penguins, ugh, my goodness, greatness right there. I am so glad they got their own spinoff TV show. Well deserved, so funny, can't stop laughing with all the animals. High-class freaking zoo, only if that was a real thing, I would be at that thing almost every day, even if I don't have any kids. Great concept for a starter and a first movie to start a series on exploring the outside world of the zoo, I would be extremely curious too!!.  Haha, good joke lol when he picked up the phone and talked all the humans hear is the roaring, that's what I've been thinking my whole life, how animals talk, and that's a language humans will never be able to learn, unless you are a special type of person. For being in 2005, that trippy effect after being shot in the butt was great. I enjoyed that very random, but I enjoyed it. So many great adult jokes in this movie, im so glad none of that clicked for me until now, once I finally rewatched this movie, too funny. Man, you all really made a dark turn for the animals to realize reality sucks like a mf and what a savior for penguins, time to go home, Greta movie!!",
    "date": "2025-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I really like the characters in Madagascar, they are really funny, there are some fun comedy scenes.",
    "date": "2025-07-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The best thing about this film is the references to old television shows and movies. Unfortunately unless you are a Baby Boomer you won't get most of them.",
    "date": "2025-07-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wow!!!! Madagascar is funny",
    "date": "2025-06-28"
  }
]