[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thought it was really cute. I love the plot and everything. It was also really funny.",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "She plays “pranks” for no reason other than he was rude towards her so as revenge she tries to send him into anaphylactic shock and also sends him to ACTUAL JAIL. From that moment, her character is no longer likeable and any love story to come is unbelievable. Who wrote this woman? Its also worth mentioning that after all these toxicity, they fell in love in 24hs. Thats all it took.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Genuinely painful to sit through. So bland that it's not even enjoyable. Chock-full of stereotypes and cliches that are bound to make you roll your eyes and it somehow manages to only get worse. The female lead is unlikeable and downright evil, and the whole enemies-to-lovers trope here is over in the blink of an eye. If you want campy romance just go watch something else, there's better comfort rom-coms than this one",
    "date": "2025-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Loved it. I rarely agree with critics but am big on romance films that feel genuine. Critics think about structure and watch so many films how could they possibly FEEL anything? They are right, there isn’t much conflict, it’s cliche-ish, but that’s the point of it. The chemistry & energy is palpable from jump. It was refreshing to see a film make love look easy. When you’re with the right one, it’s supposed to feel easy, especially in the beginning. It matched my weird.",
    "date": "2024-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Whilst not massively original, this movie is driven by its starring actors. Kat Graham is wonderful in the role of Julie and her facial expressions are brilliant, adding depth where the script may have been lacking. Both main characters are portrayed so well that you root for then and willingly forgive their poor behaviour.  I loved this film and have rewatched on Netfix about 5 times for the easy feel good factor. What really surprised me was that my 12 year old son has also watched it and thought it was funny. He is not a rom com person but really enjoyed the bickering and the food fight!\nDefinitely worth a watch if you want to laugh and cry and feel good when the credits role.",
    "date": "2024-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Interesting the Critics reviews were not great. However many viewers including myself enjoyed this movie. I thought Kat Graham was terrific as the lead, enjoyed the scenery and the story. The me this is an excellent movie.",
    "date": "2024-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Hold on to your seats, because Love In The Villa is one of those movies that will make you feel all the feels! This cinematic masterpiece combines the timeless tale of Romeo and Juliet with the lighthearted fun of a romantic comedy. Trust me when I say that I've watched it so many times that I know every single word by heart! The performances by Kat Graham and Tom Hopper as the main characters are absolutely magical, and the supporting cast brings it all together with their A-game.\n\nBut wait, it gets better! The movie is set against the backdrop of Verona, and the stunning views of the city are breathtaking. I mean, seriously, the film showcases all the fantastic places you can visit in Verona. From the fun and adventure to the comedy and chemistry between the characters, this movie has it all. And, of course, the storyline is simply amazing!\n\nIf you're anything like me, you'll be left wondering what happened to the characters after the credits rolled. Did they get married? Did they live happily ever after? There's only one thing I know for sure, and that's that Love in The Villa deserves a perfect 10 stars!",
    "date": "2024-03-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great Movie and I love love love everything Kat Graham plays in she is amazing and beautiful!!!",
    "date": "2024-03-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This movie had a lot of funny lines, props to the writers of this script. Both Mc's were solid actors, my only complaint was the lack of chemistry. The height difference was something I'm sure those involved in the casting argued about as well. Yes, some of the stunts that she did to him were over the top, but if you're looking for a Hallmark'esk' movie this will do just as well as the next one. All in all, worth the watch.",
    "date": "2023-12-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "You don't watch Netflix's version of a Hallmark movie for great cinema so this delivers exactly what is promised. Kat Graham in particular is fantastic as the endearing protagonist.",
    "date": "2023-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Tom Hopper é lindíssimo - uma estrela. \nVerona é belíssima - outra estrela.\nA trama toda não me prendeu e não me senti atraída em nada (além do protagonista ser belo e de Verona ser incrível) durante o filme.\nNão gostei.",
    "date": "2023-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "One of the worst films I've seen. I couldn't get past the scene where she lures cats to attack Charlie, who is allergic.  That's just cruel.  Such mean-spiritedness.  How can she be a sympathetic character?",
    "date": "2023-01-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Script without innovation, simple performances, normal photography. Summary: it didn't have to be done.",
    "date": "2023-01-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Light romcom with the usual happy ending.",
    "date": "2022-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I liked it -- it was both a bit silly and a bit serious.  The story moves along and has a nice ending.  Nice photography and some nice music.",
    "date": "2022-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I liked the story.  I liked Charlie a lot but I didn't like her.  She just wasn't believable for me.   Glad I watched it though and if you are on Netflix definately give it a go!",
    "date": "2022-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "2 hours of my life I will never get back. Trust me, this bland and forgettable sad excuse for a movie is not worth your precious time on this planet. The leading character is so unlikeable and had me begging for some sort of death to come for her.",
    "date": "2022-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is a terrible and predictable movie , poorly scripted , dreadfully acted and with no redeeming features.",
    "date": "2022-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "60/100 - Love in the Villa was, as most of the other reviews state, a typical journey through a tourist gift shop, or any movie on the hallmark channel. Really bland, something to watch to pass the time, had its funny moments and decent acting for a low budget film. I'd watch if romantic comedies are your thing or if you want something on in the background that you dont really have to pay attention to. Comfort food for sure, would only watch once. Not going to be your go to love story.",
    "date": "2022-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I really like Kat Graham but this movie was atrocious! The chemistry between the main leads Tom Hopper and Kat Graham was non-existent, it's beyond cheesy and overall a big disappointment. Also, not sure who dressed the cast, but Kat Graham's outfits were awful! The European fashion is lovely and this was not it. Its almost like they were trying so hard to have a European fashion style, they ruined it and nothing elegant or classy about it. I love chick flicks and most usually have very predictable storylines as does this one. But the movie's biggest failure is the cast's pairing and lack of chemistry!",
    "date": "2022-09-11"
  }
]