[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The daftness of the story is impossible to ignore..",
    "date": "2023-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing film and the critics get it wrong yet again!\n\nForget the bad reviews, this is a classic in the making!\n\nAlready have 2 copies on dvd. 5 out of 5.",
    "date": "2023-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I enjoyed this film. Colin Farrell and Noomi Rapace did a great job. The plot was kind of messy though. The action scenes were ok. Overall, I think it's a good movie. Not great, but good.",
    "date": "2023-02-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This is a pretty fast paced, gritty crime action thriller film. There are some good special effects and its fairly engrossing. Not a bad way to spend a couple of hours. I couldn't remember too much about it shortly after seeing it, although I did enjoy watching it but I wouldn't say its either memorable or one your likely to want to watch multiple times. Its a good film, not great but good.",
    "date": "2022-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Filme ótimo  e mesmo com cicatriz  ela nao deixa de ser LINDA",
    "date": "2022-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "por momentos algo confusa pero igual es buena pelicula 6/10",
    "date": "2021-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A movie that didn't go to the overly typical predictable Hollywood movie ending. A good revenge story with a believable love story that kept me entertained throughout the showing.",
    "date": "2021-10-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie got no point, totally waisted of time, ii was so angry to my self choosing this shitty movie ugh …",
    "date": "2021-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Ok if formulaic revenge and redemption that takes a little to long explaining why Colin Farrell is doing what he is doing. The action shoot up scenes are not too over the top.",
    "date": "2021-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Not the most exciting movie and I almost fell asleep but it had some exciting moments in the beginning. With these kinds of plots anything can happen so I was expecting a surprise twist like Beatrice actually being a spy or something. Obviously that was not the case so it kinda fell flat.",
    "date": "2021-05-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A potential lost for lack of editing and sense",
    "date": "2021-03-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Dead Man Down could have -should have- been much better. Good actors, great soundtrack (Eblouie par la nuit). The problem: the plot. It's between twisted and dull. Many things in the plot don't make much sense (a civilian who just made a year of military service in Hungary with skills resembling those of Rambo's ?) and make it look like a B-movie. It's a pity because the actors, director and such had the potential to make it better.",
    "date": "2020-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Victor (Colin Farrell) has infiltrated a criminal empire run by ruthless kingpin Alphonse Hoyt (Terrence Howard). His objective is to make Alphonse pay for the murder of his wife and young daughter (Accalia Quintana) two years earlier. Victor intends to exact revenge on Alphonse through physical and psychological torture before finally killing him. Victor watches and is watched by Beatrice (Noomi Rapace), a mysterious young woman who lives in the apartment across from his. Beatrice begins to contact Victor and show interest in him. On their first date, Beatrice reveals her true motivation: she has a video of Victor killing a man, and will go to the police unless Victor kills the drunk driver who disfigured her face. Meanwhile, Alphonse is receiving threats against his life by Victor. During a shoot-out with Jamaicans whom he believes responsible for the threats, Victor saves his life and thus gains his trust. As the threats intensify, a man within Alphonse's crew and a friend of Victor's, Darcy (Dominic Cooper), investigates their source. Victor has also kidnapped the brother of Albanian kingpin Ilir Brozi (James Biberi), who was involved in helping Alphonse dispose of Victor's family. Victor plans to pool the Albanians and Alphonse's men together so he can eliminate them all at once...\n\nDead Man Down received mostly negative reviews from critics. Rotten Tomatoes consensus reads: \"While the fine cast keeps Dead Man Down watchable throughout, the film is weighted down by absurd plot twists and a slack pace.\" Peter Bradshaw of The Guardian gave the film 1 out of 5 stars, which he called \"intensely pointless and silly\" and \"violent and boring nonsense\", with Farrell \"smoulderingly, facially immobile\". In contrast, film director Takefumi Tsutsui gave the film 5 out of 5 stars. Michael Rechtshaffen of The Hollywood Reporter noted \"various thematic influences ranging from Rear Window to True Romance\" and praised the \"potent visuals and a compelling international cast\" but ultimately found the film \"uninspired\" with an unrewarding climax. The film grossed $5,345,250 in its first box office weekend.[13] Against a budget of $30 million, it went on to earn a total of $18,074,539 worldwide, making it a box office bomb.\n\n\"Dead Man Down\" is a truly generic action thriller with really wobbly and silly dialogue, silly accents, plotholes and really nothing special storywise. We´ve seen it before. Noomi Rapace is a very weak actress in my mind and her performance in \"Dead Man Down\" does not change my opinion. However, it was also a troubled shoot, so that may have effected the final result. But, all in all I would like to have back those two hours I spent watching this film. \n\nTrivia: Director Niels Arden Oplev has disowned the American advertising campaign, which he felt misrepresented the film. He also spoke of budget problems during production, which forced him to speed up the shoot, and of not being able to edit the film the way he would have preferred.",
    "date": "2020-02-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "In New York City, a crime lord's right-hand man is helped by a woman seeking retribution. \nDouble Dose of Revenge\nAn intelligent thriller that takes its time dishing out retribution. \nThis slick and stylish thriller marked the American theatrical debut of Niels Arden Oplev, director of the original The Girl with the Dragon Tattoo. Colin Farrell and Noomi Rapace star as two strangers who are irresistibly drawn to one another by their mutual desire for revenge. The acting is excellent . American Neo-Noir meets romantic European fable .The movie is, first and foremost, a revenge thriller. But surprisingly, it is also a compelling love story. This film has the pacing and build like an old crime film, complete with dramatic emotionally spilling performances down to its very ending note. The dialog and characters are so fascinating that when the violence begins occurring you generally care about them. This film is an original Neo Noir and a complex brooding character piece strung together with the dazzling imagery of humanity. \n The kind of film that has become a rarity at the box office. Fantastic performances all around.",
    "date": "2019-01-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "the plot was maybe a little more complicated than I was expecting from the trailer but well worth following.  The action sequences were not as interesting as the personal relation and interaction between Farrell and  Rapace.  As I have come to expect, Noomi Rapace got into character completely and put in an intense yet subtle performance.",
    "date": "2017-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "A little too meandering, slow for my liking, though Farrell is great.",
    "date": "2017-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Decent noir thriller, nothing noteworthy or original, as the plot goes pretty much down the path you expect it to.  It's engaging enough as it is though.  The two leads share a remarkable chemistry that boosts the quality overall.",
    "date": "2017-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's good movie to watch",
    "date": "2016-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Plenty of shooting. Not very tense as you know what is going to happen.",
    "date": "2016-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Terrific performance by Terrance Howard! Howard should have actually been the co-star of this movie, who the f_ck knows a Noomi Rapace anyway! Anywho, the movie is Four stars hands down because of Howard  and Farrel.",
    "date": "2016-09-17"
  }
]