[
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "B-writing from top to bottom with a capital 'C' for cringe.  Goes for the music as well that does everything it can to tell you how bad-ass they think the main character is and how talented she is at everything from assassination to baking muffins.\n\nMainly, though, it's the dialog that kills all cred for this show.  I like Maggie Q, but could barely make it through the first episode and that's where I stopped.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Overall a decent action movie. The plot had a few holes but was easy enough to follow. The dialogue felt clunky at times, but there were also some good lines. The ending felt a bit rushed and like the movie was trying too hard to make a point. Also, Michael Keaton? Really?? He's 30 years older than her! Maggie Q is strutting around all gorgeous and young and next to her he just looks like an old thumb. Seriously, they couldn't find anyone else who matched her age (and looks and vibe) better?",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Maggie Q is a star, but the movie is gratuitous violence.  Wasted talents.  Watch her on Ballard - much better",
    "date": "2025-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1 hour and 49 minutes!!!!!!!!!!!!!!!!!! Rated R for Language, Brief Nudity, Some Sexual References and Strong and Bloody Violence!!!!!!!!!!!!!! The USA grossed over $7,400,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Maggie Q shines in this slick action thriller, delivering both emotional depth and razor-sharp fight sequences. Her presence elevates The Protégé, and her action choreography is a real standout—gritty, precise, and believable. While the plot follows familiar revenge-thriller beats, the chemistry between Maggie Q and Michael Keaton, along with stylish direction and fast-paced action, make it an enjoyable watch. It may not be groundbreaking, but it delivers where it counts.",
    "date": "2025-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "There's nothing all that remarkable about this movie, but it's still extremely entertaining, with some decent action sequences & great acting from the three leads.",
    "date": "2025-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "My type of film. Fast moving with an almost plausible plot, the good guys ultimately triumph, but only just. Some twists in plot to surprise. The only \"fly in the ointment\" for me was Michael Keaton, he is so smarmy although he is wearing very well.",
    "date": "2025-06-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "All the main characters are played by actors about 20years too old. The dialogue is clunky, some scenes the attempt at 'witty repartee' is utterly awful. The story is thin to say the least. Some good action scenes - impossible but well choregraphed. But Keaton and Jackson are simply too old and slow. Maggie Q gets by with the weapons but the martial arts bit is unlikely. Good actors in a very B movie.",
    "date": "2025-06-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Sakto lang. Masayang makita sa isang maaksyong pelikula ang mga seniors stars na sina Keaton, Jackson & Patrick. Medyo kulang lang sa back story kung pano napunta ng Vietnam si Jackson.",
    "date": "2025-01-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Filme muito bom, mas bem pesado, o mais pesado que eu já vi. Ótimas atuações, bom elenco, bons personagens, boas cenas de ação mas o melhor pra mim foi essa atmosfera de tensão que o filme traz.",
    "date": "2024-12-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Nothing we haven't seen before on these type of \"one person army\" flicks",
    "date": "2024-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What a fantastic assassins movie!",
    "date": "2024-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Trigged with some scenes. Can’t move my eyes from screen. Very good movie 👍",
    "date": "2024-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Way better than the first. Loved the humor and action and how some of the returning characters had better character arcs. Was t as big of a fan of all the blood and violence though.",
    "date": "2024-06-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it. Kept me guessing with welcome surprises.",
    "date": "2024-02-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I had never heard of it. I gave it a try and it was better than I expected. Not an all time favorite but a good watch.",
    "date": "2024-01-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Extremely predictable but I suppose it is nice to see an old fashioned violent action movie with a bit of a modern sensibility.",
    "date": "2024-01-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Good action movie with one glaring exception. The Idea that Michael Keaton, a 70 year old man, could survive a physical altercation with a 30 year old is absurdity at best.",
    "date": "2024-01-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Terrible story.  Michael Keaton and Samuel Jackson should stop doing these roles.  They look ridicolous trying to be Rambo at their age.",
    "date": "2023-12-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "it is a great action movie, with a decent story, allthough there are some plotholes and the ending could have been better shown alternatively, but overall quite enjoyable",
    "date": "2023-12-10"
  }
]