[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A cool coming of age, dork becomes a cool kid, movie.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is awesome. But I would think that since it basically depicts my life in high school.",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This will give you some good laughs, even if you're not a Metal fan. Really entertaining movie.",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Bit cheesy in places but this is fantastic movie for us weird lot who grew up with metal.\n\nAn all round feel good flick with an excellent cast and banging soundtrack. Ignore the critics and turn it up to 11 🤘🏻",
    "date": "2025-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Esta película me recuerda mucho a escuela de rock sinceramente la recomiendo mucho si te gustan las películas estilo jack black.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This gives School of Rock vibes but in a more modern era. Yes it plays off the typical highschool movie troupes but it doesn't overdo them. The characters are funny, easy to connect with & as a metal music fan, I of course loved the sound track. Isis Hainsworth as Emily particularly shone for me. Overall it was an easy to watch fun movie full of friendship & metal music 🤟😊",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I personally loved the characters, the acting was great, and the humor was actually funny. It’s been a long time since I watched a movie like this, and I enjoyed it totally!",
    "date": "2025-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Its just to damn good to miss.",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fantastic film. As I a guy who felt musically isolated in high school I totally relate to this film. It’s a truly the greatest heavy metal comedy with a fantastic metal thrasher soundtrack with a great original track. This film will hit instantly with hard core metal fans who are in to heavy metal and thrasher metal.",
    "date": "2025-04-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Loved it. Great cameos too.",
    "date": "2025-03-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It's cringe, but it's good.\nMetal Lords is a coming-of-age comedy that blends the awkwardness of high school life with the rebellious spirit of metal music. It follows two socially awkward teens, Kevin and Hunter, who dream of starting a heavy metal band. The film captures the passion of youth and the subculture of metal while also addressing themes of friendship, self-discovery, and defying societal expectations. With a stellar soundtrack and humorous yet heartfelt moments, Metal Lords strikes a perfect balance between the joy of music and the challenges of growing up. The performances, particularly by Jaeden Martell and Adrian Greensmith, add depth to the characters, making it a fun, relatable watch for both metal fans and those who enjoy a quirky, teen-centric story.",
    "date": "2025-02-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is such a good movie they're the reason I still listen to heavy metal, recommende to newer metal heads and every fan wants and needs a metal lords 2.",
    "date": "2024-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I wasn't really expecting a whole lot from the 2022 comedy \"Metal Lords\" from writer D. B. Weiss and director Peter Sollett as I sat down to watch the movie. Why? Well, first of all I hadn't heard about the movie, so I wasn't sure what I was in for here. And secondly, then the synopsis for the movie just seemed a bit too generic for a movie of this kind. But still, I opted to watch \"Metal Lords\".\n\nTurns out that \"Metal Lords\" was actually rather enjoyable. Sure, it was somewhat on the generic side in terms of innovation and creativity for a movie such as this. But still, it proved to be an enjoyable and entertaining movie. And that was definitely a large part because of the cast and their performances. But the storyline certainly was adequate enough.\n\nLead actors Adrian Greensmith (playing Hunter) and Jaeden Martell (playing Kevin) were rather well-cast for \"Metal Lords\", and they carried the movie quite well.\n\nI was genuinely entertained by \"Metal Lords\", because it was a movie that transcended being just another run-of-the-mill movie about youngsters forming a metal band and going against the mainstream. There were also good elements of friendship, love, being an outsider and not a bland face in the crowd, and such, so it was a well-rounded movie.",
    "date": "2024-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "As metal fan enjoyed this movie started ok then ended awesomely",
    "date": "2024-06-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Was not what I was expecting. Surprisingly emotionally intelligent with frustratingly beautiful cast.",
    "date": "2024-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "If you are a young person who is looking for coming of age movies and you want to get into heavy metal music I think it's a great movie to watch. It's fun and has a good amount of band references in it. It is a little bit cringe but it's fun and has and easy plot to follow.",
    "date": "2024-03-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Metal Lords probably shouldn't win any awards but it is a genuine and funny coming of age movie about three very different high schoolers uniting around their love of metal. Worth watching for a good laugh and to reminisce about the hopefulness of youth.",
    "date": "2024-03-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was awesome from start to finish. Made me like metal!",
    "date": "2024-03-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A different look at the growing up story of teenage angst, friendship, love, with metal music woven in as context. I enjoyed it lot more than expected.",
    "date": "2024-02-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Entertaining movie for a Saturday afternoon. Music is fun, and nice to see kids that are geeky end up super cool. Relatable if you are parent of band kids, or if you were-are a band kid.",
    "date": "2023-12-27"
  }
]