[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Although the supporting roles (with the exception of the unfortunate Noah Newman) remain rather bland and one cannot shake the feeling that they do not take the whole thing very seriously, “U.S. Marshals” is a worthy successor to “The Fugitive.” The story remains exciting, and Tommy Lee Jones is as fitting in his role as he is determined to solve the case. If I had to find fault with the film, it would be that it is a little too long. The story just doesn't lend itself to that.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It’s crazy that it got this type of ratings and attention for being such an amazing movie, it’s nuts",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "brilliant movie as good as fugitive by Harrison ford but with better action",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Not as bad as people say not as good as the original. But definitely a fun time, Great game with cat and mouse. Tommy Lee Jones returns back to the role that won him an Oscar. Robert Downey Jr. kills it in a stellar pre-avenger role. Wesley Snipes doing an amazing job. In a support and cash to write home about.  The only thing this movie is guilty of is not being in The fugitive. It doesn’t reinvent the wheel. It just keeps the wheel rolling.",
    "date": "2025-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Filme bacaninha, o roteiro é mais ou menos, as cenas são bacaninhas, a história é mais ou menos, o elenco é bacaninha, mas ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, eu achei ruim o vilão do filme ser considerado o Robert Downey jr, o cara não era investigado em nada durante o filme. Os policiais foram atrás do Wesley snipes o filme todo para não acontecer nada com ele.",
    "date": "2025-06-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I enjoyed the 90s chase - complete with the twists and tommy lee in a chicken suit.",
    "date": "2025-05-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A good movie! Worth watching. It has a little bit of everything. Great acting!",
    "date": "2025-05-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I just watched it on DVD and enjoyed it immensely.  I can’t account for the low ratings the critics gave it or the mediocre ratings audience members gave it.",
    "date": "2025-02-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "In 2025, can we call U.S. Marshals a niche classic? Maybe, maybe things were simpler in the late '90s, early 2000s. With Tommy Lee Jones in the lead role, nothing could go wrong with this movie. \n\nThe story follows U.S. Marshal Samuel Gerard and his team as they pursue a double homicide suspect, Mark Sheridan. Overall, it's a simple plot, but it gradually proves to be complex when a web of corruption seems to be behind the murders that follow Sheridan. \n\nThe cast features some big names: Tommy Lee Jones and Wesley Snipes at the peak of their careers, and Robert Downey Jr. just beginning to make a name for himself. Acting standards have improved over the years, and actors like Downey have grown in their performances. Snipes is the same Snipes as always, and Lee Jones was already at his max. \n\nDirector Stuart Baird has a modest career, with only 3 films in his portfolio, all with modest ratings. He seems to work better as an editor, having his hands in various films. In this case, his direction work seems more experimental than vocational. \n\nAs for the plot itself, the events are interesting, although the final twist is entirely predictable. It works for a simplistic 1998 film, but by today's standards, U.S. Marshals falls below average. In the tone of the time, the ending feels more like an episode of a TV series than a complete film, showing how much things have changed in the twenty-fifth anniversary of the 2000s.",
    "date": "2025-02-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The reviews for this movie do not do it justice. It’s a fantastic movie. I was so excited to see Jones’ rag tag team of Federal Agents back in the saddle again. Jones, Snipes, and RDJ are all great in it and their supporting cast is as well.",
    "date": "2025-01-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Enjoyable hokum with a reasonable cast and fairly standard story",
    "date": "2024-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Uma maravilha de experiência cinematográfica. Perfeito como o filme que o antecedeu.",
    "date": "2024-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "1998's 'U.S. Marshalls' is the loose sequel to the extremely successful 'Fugitive' movie from 1993.\n\nSYNOPSIS: 'U.S. Marshal Samuel Gerard and his team of Marshals are assigned to track down Sheridan, who has been accused of a double-murder.'\n\nAlthough this film may not hit the heights of its predecessor it does have some success by piling one outrageous energetic action set piece atop another.\n\nUnlike so many of these movies that came out then, this one actually, somewhat, stands the test of time. Even today.\n\nIt's an enjoyable action romp which has Tommy Lee Miller performing at his very best.\n\nA 90's film you shouldn't miss.\n\n7/10",
    "date": "2024-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A perfect example of an unnecessary sequel. Very poor, didn't enjoy it.",
    "date": "2024-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Love this film, great action, great action, great one liners . A 90s classic I can watch over and over. I wish there were more movies like this.",
    "date": "2024-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Poorly written, carbon copy. Not watchable.",
    "date": "2024-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I watch the Fugitive over and over. Once is enough for US Marshalls!",
    "date": "2024-01-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Good movie with good action as well as a plot twist",
    "date": "2023-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Just riding on the potential of TLJ, can't keep up with the image and the gripping of the first movie.",
    "date": "2023-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "An overly convoluted tale that does not measure up to the excitement provided in the previous film, 'The Fugitive'.",
    "date": "2023-07-30"
  }
]