[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Those who gave it five stars, obviously do not even know about the book. Completely disappointed…",
    "date": "2025-06-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Having read the book before watching the movie, the movie is extremely disappointing. Most of the movie is the complete opposite of what happened in the book, and there were things in the movie that never happened in the book.\nIf you are watching without reading the book, this would be a 3/5, good story line, but extremely sped up from what it was.",
    "date": "2025-05-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I've watched this movie twice and will watch it again.  Some reviewers seem to think the story is pretty far-fetched, but having flown in small planes through the Rockies in good weather, I can tell you the fear of such an accident is very real. I do think an experienced pilot wouldn't fail to file a flight plan, but otherwise it could happen.  If I had to be in a crash, I'd hope to have a doctor with me like Ben.\n\nThe two stars in this movie have interesting chemistry, they are both really good actors and combined with the beautiful mountain scenery, it's worth a viewing.",
    "date": "2025-03-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Squandered plot and story. Not interesting, enaging, or challenging. I am not sure if I would have finished without the desire to give a fair review of the entire film. If you like predictable and cartoonish romances driven by circumstance and survival stories, perhaps you'll like this. Then again, you may also enjoy appreciating the main main actors. :)",
    "date": "2025-03-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Too unrealistic and gringe i guess.\n\nI just didn’t like it. Didn’t really need that ending either.",
    "date": "2025-02-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "A big waste of time. Silly story with awful direction.",
    "date": "2025-01-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Two strangers find love through hardship and survival when they are stranded on a mountain, likely to die. Both leads do a great job in carrying us through an isolated journey.",
    "date": "2025-01-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A lovely tale of two people falling in love as they fight for survival.",
    "date": "2025-01-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Wow that was bad. I thought it was going to be a drama/ action film and instead it ended up being a love story. Unfortunately, Winslet and Alba have about as much chemistry as a wet noodle. The movie would have been infinitely shorter and better if no survived the plane crash.",
    "date": "2025-01-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I kept thinking it was a dying person's last memories, well two persons, or something being looked back on in the future.\n\nA future where the dog is defrosted and using mind reading tech, we discover the dog’s final thoughts. It turns out that they too can write lame stories. And did.",
    "date": "2025-01-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This was a very nice movie. There were definitely a lot of scenes that were very unrealistic, but overall it didn’t matter. You fell in love with the characters, and the dog! A lot of the times you could guess what would happen, and it was a bit long. But it still had some very good elements. I loved the actors and it was some very nice shots throughout the movie. I loved that almost the whole movie was only two actors.",
    "date": "2025-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I really enjoyed this movie. Very suspenseful that keeps you wondering if survival will ensure. The romance adds to this story of hope and optimism. Highly recommended.",
    "date": "2025-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Firstly, no woman ever has come down in a plane crash, is on a survival mission, and is still wearing her bra (unless strictly necessary) several days later. We can't even wait to get home from the office to get rid of this thing. This may have been overlooked by whoever made that decision about this film. It is however a dumb but not too painful holiday movie if you like Kate Winslet and can suffer a Hallmark style movie. I'm not familiar with Idris but he did a lot of the heavy lifting and given Kate is a great actress, I can only assume she wanted to tick this kind of nonsense off her list. I will be writing a spoiler if I write what kind of Mills & Boon outcome I want at a certain point in the movie.",
    "date": "2025-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "An overall engaging tale, filmed in snowy British Columbia, the narrative tracks the traditional perils-of-Pauline in a Western Canadian winter. (The American flag in the old cabin’s window is a huge boo—as if we who live in this wild and gorgeous country wouldn’t recognize it.) Knowing Winslet’s penchant for films that end badly for the protagonists, I was surprised and pleased by the gentle and rather natural conclusion. Of course one counts on Idris Elba to bring his magic, and he sure does. THE DOG LIVES. R",
    "date": "2024-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Our family loved this movie. If you just watch it uncritically you too should appreciate it. Fully \nengaging, great acting performances particularly from Kate Winslett, but Idris Elba excellent as usual.\nBruce McLaren",
    "date": "2024-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was a great watch. I couldn't keep my eyes off of it once I started. It isn't a movie I would watch more then one time but overall it was a great movie",
    "date": "2024-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Beautiful movie. Enjoyed the actors who carried the dialogue almost completely alone. Loved the authenticity Kate brings to a character and the soul Idris brings to his emotions. Also found the whole survival struggle captivating. Well done to everyone!",
    "date": "2024-12-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "With such a grand title and such an impressive cast, I honestly expected something moving and profound from this story. The plot, however, is straight out of a paperback novella you may find in an airport bookshop. The survival scenario just seems poorly conceived, the romance forced, the revelation about his past - predictable, the cabin in the woods - fortuitous. Really low brow stuff for a cast from the upper echelons of hollywood",
    "date": "2024-12-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Intense masculine holding and almost unconditional love expressed  by Elba .. Beautiful expressions of love by both.. Kate displaying the beautiful feminine nature, receiving the grounded masculine energy..  Soulful..",
    "date": "2024-12-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Underrated. Much better than these ratings. Fantastic movie that captures your attention from the start and  continues to captivate you throughout. I guarantee you will not be disappointed if you give it a watch.",
    "date": "2024-12-25"
  }
]