[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Breathtaking, captivating, with the right balance of motivation and reality. I liked how the story of Ken Carter was presented and executed beautifully by Samuel L. Jackson. In terms of African American actors, Samuel L. Jackson is one of the best supporting actors. The rawness from his execution as a drill sergeant-type coach in shaping high school kids into grown-up gentlemen was impeccable. Surprised to see Channing Tatum in one of his younger portrayals. The violence in the neighborhood and the way teenagers tend to get together at an early age were relatable. In the film, you learn about the balance of academics and doing what you are passionate about. It is a film worth watching on a down day.",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Not really my type of movie, but I really enjoyed this film. Samuel L. Jackson's performance was amazing.",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Based on a true story of a coach who went beyond the call of duty to make sure that his team worked well on the court and off the court.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Okay movie",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "excellent for a sports drama, but not a standard for a moral message",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Our deepest fear is not that we are inadequate. our deepest is that we are powerful beyond measure",
    "date": "2025-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I hate sports films but enjoyed this way more than I thought I would. Samuel L Jacksons performance is a real highlight \n, this film is worth watching at least once.",
    "date": "2025-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What an amazing, inspiring and beautiful movie. Definitely my favorite sports movie of all time. It is such a compelling story, due to the message and events that take place within this film. Coach Carter, played by one of the greats: Samuel Jackson, is a basketball coach, but wants a lot more than just success in the sport, he wants these students to succeed academically as well. Due to the way life is around their neighborhood, Richmond California, school is definitely not a priority for the people. This mentality is what keeps students behind in society. But basketball for the lucky ones who get to have this privilege, is the only place in their lives where they can shine bright and show the world what they can do. This is a very interesting conflict we see throughout the entirety of the movie. We see what society expects of them, versus what they can really accomplish. first with the students, but also with school staff and the parents as well. We slowly see these students evolve from gangster rebellious teens,  into mature young adults, by the teachings of coach Carter. We also get to see different perspectives on some of the lifestyles from within the community, such as Kenyon, played by Rob Brown, having early pregnancy slash relationship issues. And Timo Cruz, played by Rick Gonzalez, having gang affiliated issues. This just builds depth, and also a better understanding of the world around them for us, the viewers, outside of the court. What an amazing and lively performance by these young actors. Rick Gonzalez, Rob Brown, Antwon Tanner, Channing Tatum, Robert Ri'chard and Nana Gbewonyo. Their acting just feels so natural and realistic, love to see it. What an amazing watch, definitely recommend.",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Ken Carter é convidado a ser o treinador do time de basquete do Colégio Richmond. Ele aceita e aplica um método de trabalho que leva o time à vitória, porém acaba levando a entrar em conflito com os jogadores, a direção, os professores e os pais. Coach Carter, com certeza, não é apenas mais um filme de um treinador que acerta um time perdedor e o torna vencedor. Na verdade é um filme mais sobre motivação pessoal. Carter sabia que ser apenas um jogador de basquete não era o bastante. Aqueles jovens deveriam ter mais oportunidades. Não apenas jogar basquete, mas também fazer uma faculdade para ter algo mais. Além do bom elenco dos que fazem os jogadores, como Channing Tatum e Rick Gonzalez, o filme é feito para que Samuel L. Jackson brilhe e ele não perde a oportunidade. O filme peca por não desenvolver mais os jogadores, tirando os personagens Kenyon (com a gravidez da namorada) e Cruz (sobre uma vida no crime), para os demais são jogadas algumas informações que não são aproveitadas, como o pai do Lyle estar preso e a dislexia do Battle. No fim, o que talvez seria o ponto alto da história, a paralisação dos treinos e jogos por Carter para que os seus jogadores melhorassem a nota, foi muito rápido, podendo levar a mais discussão dentro do filme: uma carreira que se sabe curta no esporte ou o investimento em uma educação que os levassem mais longe?",
    "date": "2025-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 02 hours, 16 minutes, and 18 seconds!!!! Rated PG-13 for Sexual Content, Language, Some Drug Material, Teen Partying and Violence!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Filmed on: January 14th, 2005, in color!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Copyright 2005-2025 by Paramount Pictures and MTV Films!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "EXCELLENT FILM!! 10/10",
    "date": "2025-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "It’s hard to imagine anyone but Samuel L. Jackson in the role of Coach Carter. He embodies the perfect balance between a respectable gentleman and a no-nonsense basketball coach, delivering a performance that feels both authentic and commanding. While instilling purpose and the value of education in a community that seems to have lost all hope against a bureaucratic system, his story resonates even more deeply. The fact that the film is based on a true story adds further weight and impact to its message- an absolute must-watch.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very emotional, samuel Jackson's performance is fantastic",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Samuel L. Jackson is phenomenal as the stern and concerned Coach Ken Carter.\n\nDirector Thomas Carter’s sports drama Coach Carter (2005) has held up beautifully with its dedication to the well being of students at any cost. Coach Carter takes the positive messaging of sincerely believing in a brighter future for yourself of poor kids out of Dangerous Minds, applying yourself academically from To Sir with Love, trusting in your coach from Hoosiers, and using teamwork right out of Remember the Titans. Coach Carter features strong acting from a very natural ensemble. Everyone feels invested in making these characters feel real and the message feels crucial. It is still an inspiring story.\n\nI really appreciate Thomas Carter’s direction that focuses on the serious dramatic conversations Coach Carter has with his basketball team about their learning, respect, confidence, teamwork, dedication, fitness, positivity, pride, kindness, and choices. Writers Mark Schwahn and John Gatins do a particularly great job of making Carter feel smart, serious, stern, but also genuinely considerate of the potential future for each boy on his team. He wants them to become men and find a path to walk in life. Coach Carter is wildly underrated now as it really hits home that a student and parent should be concerned with the kid’s academics and not just their sports career. It’s all important.\n\nSamuel L. Jackson is absolutely absorbing as the formidable Coach Ken Carter, who does not suffer fools and never gives up on his students. Jackson takes this movie so seriously that he brings real gravitas to Coach Carter. His every word feels like a precious moment of good advice, smart wisdom, and measured warnings. He’s a great role model in general in this movie. Robert Ri’chard is great as Coach Carter’s steadfast son Damien Carter, who swears to keep up his grades and tries to uplift his team.\n\nRob Brown is excellent as the more mature baller Kenyon Stone, who is trying to choose between being a father and a ball player in college. Ashanti is amazing as Kyra, who loves Kenyon, but also is considering her own future. Rick Gonzalez is moving as the troubled youth Timo Cruz, who is going to end up as a drug dealer unless Coach Carter can motivate him to stay in school and play ball. Nana Gbewonyo is amazing as Junior Battle, who can play well, but struggles to read, cope with his dead brother, and gain the motivation to try to apply himself in class. Octavia Spencer is fabulous as Junior’s concerned mother Mrs. Willa Battle. Antwon Tanner is very strong as Worm, who is funny, but also deflects his pain and insecurities with humor.\n\nChanning Tatum is fun as the lively Jason Lyle, who struggles with the fact that his father is in jail. Debbi Morgan is nice as Coach Carter’s supportive wife Tonya Carter. Vincent Laresca is sinister and raw as Renny the drug dealer. Denise Dowse goes from a foil to a supportive figure as Principal Garrison, who never believed in the potential of her students. Mel Winkler is honest as Coach White.\n\nIn all, Coach Carter is an entertaining movie elevated by Samuel L. Jackson’s standout performance. However, I’ve come to really appreciate the genuine attempt to motivate kids to apply themselves in school and seek a higher education and better for themselves.",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Love basketball. Loved this movie. Key word “loved”. It was promising. The movie shows a message thats powerful and important, im all with that. The only problem is that the movie is terrible, only because of one crucial mistake. The ending. Oh my days the ending is so disappointing and frustrating. I would give this movie 0 stars if it didnt have a good message tied to it. But for my stand point im not the one this message reaches out to so i honestly regret watching coach carter. I shouldn’t have watched this movie, it was a waste of time.",
    "date": "2025-05-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "i watched it at school its was okay i give it a 3 of 10 i love basketball",
    "date": "2025-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "An inspiring true sports story is like comfort food to me, and \"Coach Carter\" is no exception. This feel-good story is consistently entertaining and kept me engaged. Samuel L. Jackson gives a great lead performance here and it is what makes the film memorable. I do think the movie falls into some genre trappings but there are also moments where it feels like it is very different from the rest. This movie is long but it covers a lot of ground, so I felt the pacing was mostly good. I like the messages in the movie and think young people could take away a lot of terrific lessons from it. I also enjoy the sport of basketball and think the sports sequences are a rush to watch. Overall, it is a very good sports movie that gives genre fans what they want, and also celebrates a true story that is well worth telling.",
    "date": "2025-04-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "An amazing amazing movie, the emotions, the thrill, the coach’s resolve, the length, everything was done right and realistically it had me screaming Richmond at my PC lol. No unnecessary drama and sends a perfect message",
    "date": "2025-04-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I only put this 5 star out of fear of doing 1,000 suicides and 25,00 push-ups. This movie is smooth I guess. I will never forgive them for that ending that they had. They should have made the state championship. I hate this movie for the ending but pretending the ending don't exist ts fire twan. If you got a problem with ts review imma find you and make you run suicides. The end. on folknem. btw Paul S has dementia",
    "date": "2025-03-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "No surprises on this insp sports film led by Samuel L Jackson. Channing being a bad boy is kinda humorous.",
    "date": "2025-03-05"
  }
]