[
  {
    "user": "Carson Timar",
    "rating": null,
    "text": "There is a lovely sense of authenticity to the world and characters that make Wish Dragon up and especially for those with children, this is an easy recommendation!",
    "date": "2022-02-22"
  },
  {
    "user": "Mat Brunet",
    "rating": 6.0,
    "text": "So, is Wish Dragon a rip-off of Aladdin? The answer is yes, it undeniably is. But does that mean its a bad movie? Not really.",
    "date": "2022-02-15"
  },
  {
    "user": "Lauren Miles",
    "rating": null,
    "text": "An endearing modern retelling of Aladdin, Wish Dragon ticks all of the boxes for a memorable family film - adventure, comedy, and sincerity.",
    "date": null
  },
  {
    "user": "James Croot",
    "rating": null,
    "text": "Writer-director Chris Applehans, best known for his animation work on everything from Coraline to The Princess and the Frog and Wonder Park, has crafted a charming, contemporary and surprisingly emotional Chinese spin on Aladdin.",
    "date": null
  },
  {
    "user": "Sandy Schaefer",
    "rating": null,
    "text": "What Wish Dragon lacks in storytelling innovation, it makes up for with lively, vibrant CG animation that paints contemporary China in pleasant shades of pink and purple, much like the enchanted shape-shifting dragon at the center of its action.",
    "date": null
  },
  {
    "user": "Angie Han",
    "rating": null,
    "text": "I feel so indifferent about this whole thing... I forgot it as soon as I saw it.",
    "date": null
  },
  {
    "user": "Charles Solomon",
    "rating": null,
    "text": "It's a pretty shameless ripoff of Aladdin.",
    "date": null
  },
  {
    "user": "Courtney Lanning",
    "rating": null,
    "text": "Is it as bad as The Emoji Movie? No. It's light years ahead of any of the Hotel Transylvania sequels. But it's still a few inches short of a decent movie.",
    "date": null
  },
  {
    "user": "Mae Abdulbaki",
    "rating": null,
    "text": "But while Wish Dragon rehashes quite a few familiar storylines from the Disney classic, it offers enough new elements to be entertaining and sweet.",
    "date": null
  },
  {
    "user": "Rachel Wagner",
    "rating": null,
    "text": "Wish Dragon isn't terrible but I found it to be bland with slow pacing",
    "date": null
  },
  {
    "user": "Peter Debruge",
    "rating": null,
    "text": "\"Wish Dragon\" delivers a whole new world, a new fantastic point of view, and that's plenty.",
    "date": null
  },
  {
    "user": "Petrana Radulovic",
    "rating": null,
    "text": "Sure, the lowbrow gags and rote combat drags the film down, but in the moments where Appelhans breathes contemporary specifics into the story, Wish Dragon is a quirky, appealing ride.",
    "date": null
  },
  {
    "user": "Kevin Carr",
    "rating": null,
    "text": "The voice cast was fantastic, and the animation is different enough from what you would get in a Disney cartoon to get you away from worrying it's a rehash of Aladdin.",
    "date": null
  },
  {
    "user": "Nguyên Lê",
    "rating": null,
    "text": "...the magenta deity houses plenty of lightness, lesson and laughter to be his own being - if you can keep up, that is.",
    "date": null
  },
  {
    "user": "Deirdre Molumby",
    "rating": null,
    "text": "Wish Dragon is definitely a rip-off of Aladdin. But it has enough fun, laughs and heart to make it an enjoyable one-off watch.",
    "date": null
  },
  {
    "user": "Natalia Winkelman",
    "rating": null,
    "text": "\"Wish Dragon\" is a transporting experience, but it's far from a whole new world.",
    "date": null
  },
  {
    "user": "Mark Dujsik",
    "rating": null,
    "text": "The plot's routine only emphasizes that the whole of Wish Dragon is pretty rote, regardless of any comparisons we may be tempted to make.",
    "date": null
  },
  {
    "user": "Rendy Jones",
    "rating": null,
    "text": "There is enough freshness in the writing and direction to strengthen the emotional component. It deserved a fate better than Netflix for its hysterical humor and huge heart.",
    "date": null
  },
  {
    "user": "Joseph Stanichar",
    "rating": null,
    "text": "Wish Dragon's environment and time period helps shake things up, but it still feels unavoidably derivative.",
    "date": null
  },
  {
    "user": "Jennifer Green",
    "rating": null,
    "text": "Charming characters, attractive settings, and universal messages balance a familiar storyline inspired by the same Chinese fable as Aladdin in this enjoyable animated film.",
    "date": null
  }
]