[
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I enjoyed the plot, but i not using proper accents for the movie really brought it down.",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Liked the historical elements to this one and was reasonably well done. Not the greatest, but worth a watch.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The screenplay lacks substance, the female main character script is overextended and boring. Some good fight scenes and decent photography. Wasted potential.",
    "date": "2025-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "An interesting period film based on real events. I felt it was okay. Some beautiful shots, good fight scenes, and well enough acting, though nothing really stood out. I feel like it wanted to be more than what it was. Plus our hero Jan is supposed to be considered one of the greatest military leaders ever. I'm not sure if that was expressed well in this movie. My main issue lied with the flow of the story. It wasn't bad, but it not great.",
    "date": "2025-05-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Ben gets chance to be a lead an doesn't disappoint. Great story good cast great fight scenes. Based on true events is hard to keep exciting but this pulls it off . Have watched twice will at least 1 time a yr. For near future. Which I only do that with couple movies.",
    "date": "2025-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Medieval had the potential to be a gritty and intense war epic, but it feels like a film that was hacked apart in post-production and left to rot. What could have been a gripping and immersive historical drama is completely undermined by shoddy editing, abysmal dubbing, baffling casting choices and some of the worst American accents ever heard in a medieval setting.\n\nThe most immersion-breaking issue is the post-production dubbing, which is genuinely awful. Michael Caine, one of the film’s biggest names, sounds like he’s been replaced with a random voice actor in post. His dialogue is completely detached from his performance, making every scene he’s in feel bizarre and unnatural. But it’s not just him. Several other characters have an odd, out-of-sync quality to their lines, making conversations feel disjointed and lifeless. It’s impossible to tell if the original performances were bad or if the atrocious ADR just sucked the soul out of them, but either way, the result is a disaster.\n\nThe film’s biggest crime, though, is its casting. While Ben Foster does a solid job as Jan Žižka, the rest of the cast is all over the place. Some actors look lost, others overact like they’re in a pantomime, and then there’s William Lizár, who delivers what might be one of the worst performances I’ve seen in years. To make matters worse, a handful of actors speak with thick modern American accents that completely rip the audience out of the medieval setting. There is nothing more ridiculous than watching a gritty historical war film where half the cast sounds like they’re about to order a burger and fries. The fact that no effort was made to adjust their speech for historical authenticity just reeks of laziness and lack of attention to detail.\n\nEven if you can overlook the atrocious post-production work, the pacing of the film is a mess. Scenes drag on with clunky dialogue that adds nothing, and then suddenly, the story lurches forward with no cohesion. There’s very little emotional weight to anything, which makes it hard to care about the characters or the stakes. The plot, which should have been a thrilling political and military drama, feels hastily thrown together, like a series of disjointed set-pieces rather than a fully realised story.\n\nThe only redeeming quality here is the action. When the film shuts up and lets the combat take centre stage, there are glimpses of something better. The fight scenes are gritty, brutal and well-shot, with a sense of weight and impact that few medieval films manage to capture properly. Unfortunately, these moments are too few and far between, buried under layers of poor direction and an editing job that feels like it was done with a blunt axe.\n\nIn the end, Medieval is a frustrating experience. There was potential for a gripping war epic, but it’s been completely ruined by post-production incompetence, wooden performances and a fundamental lack of historical immersion. If you’re looking for brutal medieval combat, there are flashes of quality here, but it’s not enough to save the film from being a clumsy, poorly put-together mess. It feels like something that was rushed, chopped apart and left to bleed out on the editing room floor. A massive disappointment.",
    "date": "2025-02-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A solid film, with a strong cast. It plays a little too traditional and safe, and a few type casts, and it has not-much-needed romantic sub plot.  But it chronicles some of Jan Žižka early battles and displays some of his tactical brilliance and innovations, albeit condensed. And the visuals are great, the action strong and it features an absolutely stunning soundtrack.",
    "date": "2024-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I was presently surprised by this movie which had some how slipped under the radar. The choreography is outstanding, no flashy sword play but emphasizing the struggle to survive. The plot is woven together by political espionage which won't be everyone's cup of tea.",
    "date": "2024-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "First thought: How the hell did they get Michael Caine for this movie? Well, he’s not in it very much. A brutal riverside-cliff melee sets the tone for the graphic violence in Medieval, a story about Czech folk-hero, Jan Žižka (Ben Foster). “Love Triangle” isn’t the right term, but Katherine (Sophie Lowe) is captured, re-captured, re-re-captured ad infinitum (or so it seems) that it becomes tedious to follow. She’s the betrothed of some guy named Rosenberg (Til Schweiger) who doesn’t even have a title in this title-laden era, so why the F should we even care? I’m here for most Medieval European settings, and when it comes to the ultraviolence that pervades the era, the movie doesn’t disappoint — despite the maces to the face and stakes finding their way through a lightly armored soldier, the nastiest moment comes when maggots are used as first-responder medical care. It’s a fine pocket of history movie with numerous skirmishes and a couple of larger battles. The dialogue is textbook and dull. It’s recommended for a very particular audience but not for any sort of mass appeal, unlike, I will argue The Last Duel.",
    "date": "2024-09-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Honestly this barely was watchable i had to hang in there to finish the movie.. I guess the fighting scenes were alright for a medevial. but wasnt my cup of tea at all.",
    "date": "2024-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "No nonsense reenactments. Supreme emotional intelligence of all major creative aspects. Full of moments that gives a viewer a rare insight into realities during medieval times. Exceptional acting even of extras. Exceptional project delivery. Highly recommend.",
    "date": "2024-03-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Great movie, anyone who likes war epics/adventure movies should definitely see this. Brutal, visceral, unrelenting, it's definitely not for kids or the feint of heart, so disclaimers here, but Ben Foster shines as a historical military genius that's very understated, I had never heard of Cizka before I saw this movie.",
    "date": "2024-01-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great medieval war movie\nGreat action,great storyline \nI recommend to see",
    "date": "2023-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Disappointing period piece that does little to explore the fabled Jan Zizka, who truly deserves a proper movie.  The cast is solid, with the always welcome Ben Foster playing Zizka nicely as a conflicted religious man with a brilliant military mind.  Behind the camera, writer/director Petr Jakl tries to tell the story of Jan Zizka through his little known early life but doesn't quite get there.  The action is nicely choreographed and brutal along with showing off Zizka's innovative military tactics, such as using armored carts like tanks.  However, the story is thin and confusing, doing little to set up the history and Zizka's life.  All in all, a disappointment in what should have been an epic movie.",
    "date": "2023-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's underrated film that deserves more praise, because the middle and are perfect masterpiece storytelling alot of heart. That you can feel,  great sound track. Definitely deserves a Oscar worthy proformance from Ben Foster .",
    "date": "2023-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Insist know what the critics are smoking: this movie was fantastic. Cinematography was breathtaking. Battle scenes were well shot. Ben Foster was great in the lead role (and his career trajectory has impressed me, I remember him from Six Feet Under). Michael Caine has a small but important role, and his presence gives the film some cachet. Anyway, immensely entertaining film; I was immersed from start to finish.",
    "date": "2023-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This motion picture is well done, Medieval, 2022 English-language Czech historical drama film directed-written by Petr Jákl on the story by his father, Petr Jákl Sr...\n\nA script by the leading actress, Sophie Lowe inspired me our Old Chinese saying that coming from \"the Analects of Confucius\" :-The Master said, \" If a man in the morning hear the right way, he may die in the evening without regret\"...",
    "date": "2023-06-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I like how Rotten Tomatoes can't cope with the Z's in Zizka's name and just refers to him as Jan ika in the description of the movie.",
    "date": "2023-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "If it's blood you're looking for, you'll get it here, but just one question…why does Ben Foster sound like he's from Huntington Beach, California? Here's my review: what a farce!!",
    "date": "2023-04-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Visually striking. An honest heartfelt film with the right amount of gore and a love interest thrown in. It kept me interested throughout. There were some great honest battle scenes.",
    "date": "2023-04-01"
  }
]