[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The chaotic nature of A Simple Favor works very well, as if a large cauldron of satirical characters, shocking plot twists, and a touch of dark humor were served on a fancy plate, standing out mainly thanks to the performances of Kendrick and Lively, a sharp duo who sink their claws into this plot which, whether you like it or not, may lean towards the revisited, but you won't know how it will end, no matter how hard you try, you will be surprised, and that's exciting.",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is objectively bad. The twist is so overdone. The acting is atrocious. I don't understand why people like this? It's trash and not even the fun kind.",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "It's got strands of DNA from Gone Girl, Bad Moms, The Ice Storm and Frank Perry's near-lost Compromising Positions, and it's a candy-colored cupcake made with buttercream and bile about those who strive to maintain the illusion of perfection.",
    "date": "2025-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I wanted to like the movie.\nComplaint #1: She invited Kendrick to help solve \"who done it\" if something happens, because she's supposedly an expert at it, but she figures out nothing the entire movie. She spends the whole time with a puzzled look on her face, and has the whole plot spelled out for her at the end.\n\nComplaint #2: They never even mentioned why her mother wears a wig. Poor character development \n\nComplaint #3: Midway through the movie, out of right field, there's a dude jacking off in the shower, and not even in a comedic way. It was gross. WTF. No thanks.",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Nancy Drew: The Case of the Killer Martini.",
    "date": "2025-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The multiple twists in this are done well imo.",
    "date": "2025-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A Simple Favor is a Gone Girl that takes itself less seriously and succeeds very well precisely because of this. Despite a \"small\" difference in the ending compared to the book, the movie remains faithful to the book on which it is based. Anna Kendrick and Blake Lively both give spectacular performances, especially Blake who (evidently) had a lot of fun playing her character.",
    "date": "2025-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A Simple Favour is not a comedy. The trailer was tonally deceptive but I'd argue that this is a thriller with more levity than usual compared to how self-serious films in a similar genre such as Gone Girl and The Girl on the Train are but having the main conflict taken seriously enough to avoid coming off as a spoof of the genre. Indeed, Paul Feig described in the BTS featurettes as a \"fun thriller\"...and I can't say I disagree. Maybe it borders on mood whiplash at times but A Simple Favour is a fun film with great performances from its leads, a few memorable side characters (or maybe I'm just biased because I like how Linda Cardellini looks here), a twisty story that has an enjoyably suspenseful climax and amusing comedic timing, even if it seems clear to me that Feig had to tone it down when compared to the pure comedies he makes with Melissa McCarthy. Not a perfect film but still a fairly enjoyable flick that by having a slightly-more-lighthearted-than-usual tone does something different from the angst-fests other missing-person thrillers can be.",
    "date": "2025-06-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "A boring movie — I don’t understand the hype surrounding it. It was very forgettable, despite Anna being such a great actress.",
    "date": "2025-06-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Es una de las películas más malas que eh tenido la infortunia de ver",
    "date": "2025-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A prime example of Kendrick's specific screen presence of a kind, quirky, intelligent puzzle solver. The jocularity of the jokes are as quick as eggs being broken aside a stove. This mystery always finds a way to twist the plot without any extreme cliches or familiar devices.",
    "date": "2025-06-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "An old-fashioned domestic mystery given a dark, modern mommy edge, Anna Kendrick excels as a lovable, quirky protagonist, but Blake Lively plays a very unpleasant gaslighter through and through. ￼",
    "date": "2025-05-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love this mystery movie. I hope they make another one.",
    "date": "2025-05-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The plot started out well enough and then ventured in the ridiculous. Anna Kendrick has a constant smirk on her face even in the darkest moments making her act much less believable. She had one good scene and the rest of the time I thought she would bust out laughing which did not fit the movie at all. Either poor acting or poor direction, take your pick.",
    "date": "2025-05-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I was so excited to watch this, the first is one of my favorite movies. This one felt over-the top, trying to be funny/shocking. The twist was ridiculous, the acting wasn't great (even though none of these people are bad actors...I'm so confused lol). I feel like I wasted my time watching this, and being excited about it. What's with all the prolonged sequels that are so much worse than the original??? It was like watching third graders put on an impromptu play for you...things didn't make sense and it just wasn't funny lol",
    "date": "2025-05-20"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "horrible, lost precious time looking at this film, poor acting and poor story, don't start to watch this",
    "date": "2025-05-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I wanted to like this because I love the book and it’s a great cast. I was ok until the ending. so disappointing and such a jarring shift in tone. It starts as a great noir story but turns into a joke.",
    "date": "2025-05-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely loved it. Must see!",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Boring, poorly acted, kendrick sucked, lively sucked, not sure why it got a sequel.",
    "date": "2025-05-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A truly interesting mystery with some well-timed and unexpected comedy.  It was surprisingly enjoyable.",
    "date": "2025-05-12"
  }
]