[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is the most accurate representation of what life is like deployed. This unit in particular had an extremely bloody tour but the movie itself focuses on the entirety of their tour and not just the gruesome event that ended it. They looked at aspects beyond the deployment, in getting care and continuing the battle once they were back, something that very much is not touched on and is needed more. I have been to some of the areas here on my tour and think they did an amazing job of choosing a location to depict afghanistan. 2009-2010 was the bloodiest years of the occupation of Afghanistan. The way the troops talk to one another was perfect, the sudden loss of a leader, how that came out of nowhere jarring troop morale hit home for me personally. It comes out of nowhere, hits hard and fast then nothing but the silence and a screaming mind was depicted accurately too. For me this is the one film that is the most realistic depiction of life overseas as a soldier.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "From a former army veteran, this movie really nailed it with authentication . This movie was definitely better than expected.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The Outpost (2019)\nGreat War Movie Based on a True Story\n(11,850 – 24 Jul 2025 – by Claudio Carvalho)\nDuring the War in Afghanistan, a helicopter brings a group of soldiers to the Kamdesh Outpost located in a valley surrounded by mountains. The base is totally vulnerable and a death trap and the Taliban frequently shoot at the troop from the mountains. In 2006, a horde of Taliban attack massively the outnumbered outpost and the fifty-three soldiers need to resist until air support comes. \n“The Outpost” (2019) is a great war movie based on a true story of Battle of Kamdesh, were a few American soldiers resisted to attack of the enemy. The screenplay is very well written and shows the bond created among the soldiers. The battle scene is magnificent and gives the sensation to the viewer that he is watching a real battle. I am not military, and I do not understand how a base is installed surrounded by mountains, jeopardizing the lives of the military. The conclusion showing the actors and the real soldiers is heartbreaking. My vote is eight.\nTitle (Brazil): “Posto de Combate” (“Combat Post”)\nMy Blog: https://maniacosporfilme.wordpress.com/",
    "date": "2025-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Really enjoyed this. Great story. Heaps of action. Never heard much spoken about this movie, I came across it by accident, but it's a real hidden gem.",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The gripping realism of the fight scenes is weighed down by the threadbare characterisation and simple plot... So as far as drama is concerned this is on the wrong side of passable, but if it's a visceral experience of war that you're after then it's hard to beat...",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "One of the best war movies I’ve ever seen!",
    "date": "2025-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Good action movie, the only critic is that the actors are mostly replaceable not so original or profound.",
    "date": "2025-06-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "🍅 7.4/10\n\n\n“this time my sources are telling me that the Talibans are coming on us”\n\n“how many are gonna come on us?”\n\nI feel like with this film it perfectly captures the brotherhood and camaraderie of the soilders and all the lil banter. It also has its fair share of intense and even emotional moments. It’s consistently entertaining throughout and worth the watch it’s a good little gem on Netflix and it’s leaving pretty soon do check it out if you’re into he’s kind of movies. Also the stay tuned for the interviews at the end of the credits.",
    "date": "2024-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great War movie and about as accurate to real combat as you’re gonna get",
    "date": "2024-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Netflix is kinda hit or miss with their action movies, their military films are a little bit better, but they hit this one outta the park. Very surprising intense non-stop military action with no soft spots.",
    "date": "2024-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Not quite sure all the five star reviews and what they saw, but they really isn’t a storyline. The acting is subpar and it’s just a bunch of sensationalism if you are a military buff you will just shake your head for the whole movie. Better ways to tie up two hours of your time.",
    "date": "2024-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Enjoyed this one. I'd put it up there with the better war movies. Kind of movie that grew on me the longer it went.  First half is the set up with brief flurries of action then the second half is non-stop entertainment.",
    "date": "2024-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Good movie one can not deny they held out, but of course it is all from the American side of things, to make America look good, when they were in a country they had no business being in.",
    "date": "2024-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie. Never forget our fallen heroes and the hell they went through so you could be safe to complain about nothing here at home.",
    "date": "2024-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Thrilling, action packed, and beautyfly shot. A no nonsense - all in - good movie. Maybe sometimes it feels a bit too confusing, specially regarding the characters. None the less, a great watch for all action genre lovers.",
    "date": "2024-05-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I don't know why war movies make me so sad inside. This one in particular made it clear to me. Showing the rawness, the trauma, the deaths and everything that was experienced in a battle so that the public feels sad. Because despite being a movie, you know that this happened in real life, and it makes you sad when you see that these soldiers lived in the flesh. Highly recommended",
    "date": "2024-05-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "82%. True story about a basically indefensible base camp at the base of a mountain in Afghanistan, protecting from the taliban trying to enter from Pakistan. Documents four or so head officers that head things for portions of the film. Pretty intense throughout with the Taliban constantly coming down the mountain and ends with a long battle. Cool to see the comraderie amongst the guys but not much real character development. Don’t get to know anyone too well. Good movie but not great. 3/5 on rewatch",
    "date": "2024-04-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This is a really good film. The performances are good, the actors resemble the real soldiers they portray and honor them well. The battle is brutal and intense. Worth a watch if you're into war films",
    "date": "2024-04-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Very intense movie, I very much appreciated several of the actual soldiers playing themselves, I'm sure it wasn't easy.",
    "date": "2024-03-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very solid war flick. Orlando Bloom gives a great performance.",
    "date": "2024-03-02"
  }
]