[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing cast and story. Great movie!!!",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Haven't got a chance to finish the rest of the movie til today and man is it so good! They should of got an oscar, such a good movie they need to make a sequel!",
    "date": "2025-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best movies i have ever seen. However bad your start in life was, a good \"mother\" can make it all go away. And if she gets killed, you're up in arms. Never pretending, great acting from everybody including supporting role of Sofie Vergera, just perfect",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Four Brothers nails it’s blend of dramatic tension and slick thrills, thanks in large part to its popular lead cast. The film's exploration of each character's complex past and bad-boy persona add depth to the film, making it a compelling watch. However, the ending may not resonate with everyone due to certain plot developments.\n\nGrading: B+",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This somehow being a \"reboot\" of 'The Sons of Katie Elder' is wild to me. However, this is a pretty good action flick. The four adoptive brothers have a strong love and bond with their adoptive mother who gets murdered. So this is through and through a pretty great revenge story with some nice action sequences. Mark Wahlberg is Mark Wahlberg and does a good enough job. Having some Hip-Hop/R&B stars like Tyrese Gibson, and André 3000 as some of the brothers is actually a nice touch in this. Especially since Marky Mark was a thing. So it leaves me going, who is Garrett Hedlund? The fourth brother?",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Drama, comedy, thriller, action, just about everything. Confusing, and I am not so sure I understand what really happened. The soundtrack pulls the movie down. A not too exiting movie.",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was great and interesting. An absolute banger...",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Entertaining in bursts but never elevates above a by-the-numbers revenge flick.",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "FOUR STAR BROTHERS !!! (SPOILER WARNING)\n\nFour Brothers Is One Of Those Movies For Me That Really Hit Home. The Movie Is About Their Mom Getting Killed By Two Store Gunmen And Bobby , Jeremiah , Angel And Jack Going Back To Detroit And Finding Their Killers They Eventually Do But More Problems Arise. The Movie Is Super Fun To Watch And It Makes You Feel Like Your Part Of Their Squad And Like I Said At The Beginning It Hits Home As I Grew Up In Part Just Like Detroit But Just Football/Soccer More Around. This Is Also Your Typical Action Movie So There’s Obviously Gonna Be Guns,Drugs And Viva La Locas Lol. But Overall 8/10 Movie A Perfect Buddy Movie Or Sleepover Movie… ANYONE WANNA PLAY TURKEY CUP !!!",
    "date": "2025-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Great fun cool nice yay",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Four Brothers est un film d’action urbain qui, malgré une intrigue simple et parfois prévisible, parvient à offrir un divertissement honnête. Il s’inscrit dans la lignée de films comme Boyz n the Hood, mais avec beaucoup moins de profondeur émotionnelle et de portée sociale. On pourrait presque le considérer comme une version plus brute et orientée vers le spectaculaire, sans chercher à proposer une réelle réflexion.\n\nL’histoire de quatre frères adoptifs unis par la vengeance est assez classique, mais fonctionne grâce à l’alchimie entre les personnages. Même si le scénario manque de subtilité, on s’attache à leur lien fraternel et à leur détermination. L’action est bien menée, le rythme est soutenu, et l’ambiance urbaine donne un style identifiable au film. Ce n’est pas un chef-d'œuvre, mais pour passer un moment sans trop se prendre la tête, Four Brothers fait le job.",
    "date": "2025-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Painfully average, boring and then random spurts of unrealistic shootouts",
    "date": "2025-07-04"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is one of the movies made for people stuck in puberty. People who have slurry in their skulls instead of braincells.",
    "date": "2025-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Confusing plot, violence for the sake of it, thin characterisation, plenty of stereotypes- ugly and dull at the same time.",
    "date": "2025-06-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "An absolute must see! A combination of great acting and action packed greatness.",
    "date": "2025-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "As usual, the critics have no clue as to what people actually like. I can't believe that I had never seen this movie. It was well written, the acting was great, and it was action packed.",
    "date": "2025-01-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie is surprisingly good definitely would recommend.",
    "date": "2024-12-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This is such a great movie, many emotions watching",
    "date": "2024-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Typical \"tough neighborhood\" film. More action than I was expecting, though. I thought it would be more of a crime drama",
    "date": "2024-06-29"
  }
]