[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It’s a wonderful film for anyone (well, all of us, at one time or another) who has felt they’ve adopted a stereotypical role in life—mother, father, breadwinner/provider, whatever—and finds themselves questioning the point of it all, and wondering what would happen if they just…stopped. Just lived somewhat selfishly, discovered their lives, did what they felt was right instead of doing what they’re supposed to do.",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "In general, it is a very good, light comedy film about a woman in a mid-life crisis, who is not happy with her life - her husband perceives her as a housewife, and her grown children - as a nanny. Therefore, one day Shirley packs her things and secretly flies to Greece for a short vacation - and meets a handsome Greek there. By the end of the film, he turns out to be nothing more than a fraud, pretending to be a loving husband in front of female tourists, and Shirley still stays at the hotel - already as a waitress who abandoned her past life in Britain. The only negative of the film is the open ending. In the end, a man does come to see Shirley, but we are not shown anything about what they talked about, nor how the meeting ended. \nMy rating: 8/10",
    "date": "2024-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved it. Comedy drama movies always exciting",
    "date": "2024-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Liked the point. Makes me think abour who is in charge for your happiness",
    "date": "2024-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This is a comedy drama film with some amusing moments but its also quite clearly a film that has aged. I suppose its a nice form of nostalgia, in a way. Its an easy watch and its even somewhat thoughtful. This is a good film.",
    "date": "2022-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Lovely movie, with a lot of humor, but serious and with a good message ast the same time. Cute, sweet movie",
    "date": "2020-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I don't know if it was better suited for the stage but I found everything overdone.",
    "date": "2020-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Shirley is the cure for depression.",
    "date": "2019-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Pauline Collins reprises her stage role with delightsome comicality as the eponymous bored and bullyable Liverpudlian housewife coming of age during a holiday to Greece in this winning comedy dedicated to any similar repressed homemakers.",
    "date": "2018-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved this tale of a middle aged housewife yearning for more.  I believe many woman would also say, \"I've lived such a little life\".",
    "date": "2018-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The plight of the bored housewife is explored in this film. I forgot how funny it is. Women will probably love this film and Men will probably hate it",
    "date": "2017-12-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Pauline Collins, best known for portraying Sarah on \"Upstairs Downstairs\" gives her SECOND best known performance as the British everywoman who is nevertheless extraordinary once you get to know her and follow her on her journey from bored housewife to liberated adventurer.",
    "date": "2015-04-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Funny and touching with a great performance from Pauline Collins.",
    "date": "2015-03-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "My favorite movie, but cannot seem to be able to buy it",
    "date": "2015-01-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Just a tad bit too silly. Your mom will love Pauline Collins. The rest of the audience, perhaps not. Non offensive..in a dull sort of way.",
    "date": "2014-03-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I've always liked this film. Her husband's face when she gave his steak dinner to the dog, priceless! 4 stars for Shirley Valentine.",
    "date": "2014-02-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Good film, similar to Educating Rita. \n\nHow women today will look at this film, I have no idea.",
    "date": "2013-12-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "dug this one out a little while back- ok, it has dated somewhat but the message is still relevent and its still funny to watch.",
    "date": "2013-05-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Still one of my favourite movies ... Sweet, funny, insightful look at what we'll do - or not - to escape our self-built treadmills.",
    "date": "2013-05-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Brilliantly performed and cleverly written, Shirley Valentine will have you curled up on the floor laughing one minute, while the next verges on the sublime. While some may dismiss this as \"a film for middle-aged women\", there's something in this touching comedy for everyone to enjoy, and one may learn a little something from it too.",
    "date": "2013-04-21"
  }
]