[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "So poorly written it's cringe worthy, the script is awful and every line for Sarah Connor was out of character or trying too hard. Film opens with terrible de-aging, and expects the audience to care about new, underdeveloped characters or geek out on nostalgia for characters we used to like who are now irrelevant and 1 dimensional. Super disappointing.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Dai su! È una versione aggiornata di Terminator 2 🤦🏻‍♂️",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is quite trivial",
    "date": "2025-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Yeah, yeah... we have to kill masculine leadership, and replace it with som random Mary Sue.",
    "date": "2025-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Terminator: Dark Fate attempts to revisit the tone of the original films, acting as a direct sequel to the first two with a more female-centric approach. Unfortunately, the plot fails to deliver, essentially rewriting Terminator 2 with a female lead and cyborg protector. The film's reliance on familiar themes makes it feel less original and more like a reimagining of a classic story.\n\nGrading: C",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It's OK, what all these Hollywood types have proven is that they will never top T2. This was better than Genisys and Salvation, but that's not saying much. I hated how this departed from the original timeline, but it was a decent story in it's own right and I would probably have a different opinion if T1 and T2 never happened but... they did.",
    "date": "2025-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "“Dark Fate” still packs enough to make this enjoyable especially for franchise fans. The characters are the biggest treat, the fresh faces and the series vets.",
    "date": "2025-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I would like to know what the writers for the last few terminator movies were smoking. Clearly anyone can get hired as a writer",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "It zips along at a good clip and the action is plentiful but it all feels artificial, overly CG’d with patchy physics. It’s clearly a female cover version of previous installments and weaker for it. Literally re-writing John Conner as a Mexican woman. Very 2019. The worst crime is the lighting at night. Some seriously bad decisions. If you can’t even see the actors facial expressions because it’s all dimmed and dulled down then you’ve failed the assignment. Make movie lighting competent again.",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The best Terminator movie since T2, but nothing beats the original duology.",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Brings nothing of value to the table. Baffling discarding of the plot of the originals. Sarah Connor is a caricature. Child-killer Arnie inexplicably becomes a docile OAP. The Terminator is bland. The glowering heroines are tired and uninspiring.",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "What were the makers of this huge pile of s**t thinking?\nThey kill off John Connor in the first five minutes by Arnold T-800, who comes out of nowhere and then walks to the beach while Sarah Connor grieves about her dead son.\nWhat was T2 then all about when you just kill John Connor in this direct sequel to T2?\n\n\nThen you recycle T1 and T2 by doing a reset: \n- there is no Skynet, now it‘s Legion.\n- now, another woman (Danny Ramos) is the saviour against the machines, and it‘s not her unborn child, now it‘s she herself who will save humanity \n- again two characters are sent back in time, a good one - Grace, an upgraded human - and the antagonist - Rev-9, a T-1000 like Terminator with a stupid feature \n- Grace is the worst protector imaginable, that collapses after a fight and needs a big amount of medicine. She‘s upgraded, but Kyle Reese was the best protector ever.\n- the antagonist Terminator isn‘t even near the performance by Robert Patrick from T2. \n- Sarah Connor is a joke and not well written compared to the excellent characterization and acting from T1 and T2\n- The T-800 is even more a joke: didn‘t know what to do after killing John Connor and became husband and father, calls himself Carl, has a dog and works as (you won‘t believe it). It’s a parody of the characterization established in T1 and you can‘t take this T-800 and the whole story around him for serious.\n- the CGI is bad, really bad and looks worse than in Terminator Genysis. The movements are clearly visible as computer generated, it‘s like stopmotion only worse for a big budget blockbuster movie. While in T2 the action was real, real helicopter, real stunts, here it’s computer generated and feels hollow, cheap and nonsensical.\n- the finale is just ridiculous with a bomb inside Mackenzie Davies to kill the Terminator. 🙄\n\n\nThe whole movie has no real own ideas and is just copying from previous movies. \n\n\nAnd for this crap Linda Hamilton came back as Sarah Connor? 🙄\n\n\nVery inconsistent and disappointing reboot effort that is hopefully the final movie of this franchise. \n\n\nThere are only the first two Terminator movies that are masterpieces. All the other sequels are forgettable, poor and disappointing.",
    "date": "2025-09-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It’s a good Terminator movie. Obviously nothing can beats the first two episodes, but I’m still sad that the sequels of Dark Fate have been cancelled.",
    "date": "2025-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Solid sequel, but pales compared to the original\nTerminator: Dark Fate (2017) ***1/2\n\nPretty solid sequel ignores parts 3, 4, and 5 and serves as a direct sequel to T2. Picking up immediately after the events of that film, Sarah and John Connor are hiding out in Mexico when an Arnold T-100 appears and kills John. Fast forward to present day, a new, even more powerful of Terminator has been sent back in time to kill Natalia Reyes, who plays an auto plant worker in Mexico. Lucky for her, an enhanced human soldier from the future, a fantastic Mackenzie Davis, who easily steals the movie, which is saying something when you have both Linda Hamilton and  Arnold Schwarzenegger reprising their roles from the original films, arrives in Mexico as her protector. The film starts incredibly strong with an unrelentingly suspenseful chase sequence where the deadly new shapeshifting Terminator, Gabriel Luna, goes after his prey at an auto plant, only to be saved by Davis’ badass future soldier. What’s great about this sequence is that it felt tactile and real, versus later in the film where the action gets much larger in scale to the point the film more resembles a MISSION IMPOSSIBLE or Marvel movie, which is to the film’s detriment. I read that James Cameron gave the director of this film a collection of action scenes he’d written, but which were not attached to any particular film or story, and the director picked a few of his favorites and incorporated them into the story. That might explain why the set-pieces in the film feel as if they’re from a completely different film. After watching DARK FATE, I decided to watch some of the original film. Although this sequel has a much bigger budget and production values, it made me appreciate the original even more. What made the original so frightening was how real it felt. It seems strange to say, but it’s the relatively low budget of the original that gives it a gritty realism that’s missing from any of its sequels. That original TERMINATOR seems to exist in the same ugly world as James Glickenhaus’ THE EXTERMINATOR or Charles Bronson’s 10 TO MIDNIGHT. This is not a world of airborne cargo plane fights or dam explosions. It’s a world of police cruisers, grimy streets, and shotgun blasts to the gut! I kind of digress, but DARK FATE had the potential to recapture some of that, but when it decided to go big, like it’s a TRANSFORMERS movie, which is where it goes wrong. That’s something that the much derided TERMINATOR GENISYS actually got right. I kind of have a soft spot for GENISYS and wish they’d have gotten the opportunity to make their planned trilogy. Emilia Clarke was a terrific Sarah Connor! But I digress again. Overall, DARK FATE is absolutely worth watching for fans of the franchise and has a story worthy of its progenitors, but the scale of the action felt out of place for a Terminator story, and made DARK FATE feel like a missed opportunity. \n\nAI Capsule Review: “Terminator: Dark Fate” works as a worthy follow-up to T2, with Linda Hamilton and Arnold back in action and Mackenzie Davis stealing the show as a fierce new protector. The opening chase is thrilling and grounded, but the film loses some of its impact as the action balloons into blockbuster spectacle. Solid and entertaining, but ultimately a reminder of how raw and haunting the original film was.",
    "date": "2025-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "* Delivers on all levels ✨Mackenzie Davis and Linda Hamilton are outstanding as is Natalia Reyes. A most worthy addition to the storied Terminator franchise.",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Terminator Dark Fate is another Terminator movie but this time not with John Connor as the savior. We know this because even though every other Terminator movie, comic book, video game, tv show, has Connor as the savior this time Arnold's Terminator kills John Connor at the start of the movie. Arnold then takes a vacation, gets married, and opens a drapery business; I'm serious that actually happens. A new savior, Dani Ramos, emerges and her protectors will be two other women, Mackenzie Davis and Linda Hamilton. Anyway Skynet has been replaced by Legion and are still sending back evil robots to kill the future's saviors or whatever. The usual tropes ensue and the new Terminator is eventually destroyed. So, I've seen all of the Terminator movies and this was pretty terrible. The acting is just awful, somehow the SFX were better in 1991, and the plot was worse than idiotic. How is Sarah Connor killing Terminators? Why is Arnold's Terminator old and making and installing drapes? Why is the new savior as bland as dry toast literally doing nothing inspiring or heroic in the entire movie? Suffice it to say I did not like this movie and cannot recommend it.",
    "date": "2025-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "awful awful movie. terrible action and arnie treated like a babysitter\nonly redeming actor was the female terminator.\neverything else. even action was terrible",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "L'influence néfaste du féminisme a aussi corrompu Terminator. Comme quoi rien n'échappe aux Féminisme.\n\nQue dire, j'avais bien aimé l'idée de base d'éliminer l'espoir de l'humanité qu'on a essayé de sauver pendant pratiquement tous les films de la saga pour trouver une nouvelle lueur d'espoir, et honnêtement je m'en fou que ce soit une femme l'héroïne, mais comme la plupart des films féministes, c'est très caricatural et mal amener. La nouvelle héroïne est assez ennuyante, le nouveau Terminator est un copié coller des anciens, mais il est juste un peu plus cailleux.. Par contre j'ai apprécié les scènes avec Arnold Schwarzenegger.\n\nBref, pas le meilleur Terminator et malheureusement pas le pire.",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The only impressive things to take away from this movie were the opening scene and the REV-9. Not even Linda Hamilton or Arnold could save this movie. This film is just the same old terminator movie from start to finish: The target and the protector run away from the killer machine until they kill it at the very end. The franchise is just burned out at this point. They tried to make fans think they were getting something new when it’s literally just copying and pasting the same thing they did 4 other times (minus salvation because it is a little different). Watch it at your own risk. You’re either gonna be bored or upset the whole time.",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I have not watched a Terminator movie in awhile and watched this one and it was very good.   Worth the watch.  Non stop action that moved the plot along.    Although Dani being the savior was a bit much just being so small.",
    "date": "2025-08-03"
  }
]