[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie. Julia Roberts is powerfully!!",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Powerful. Emotional. Stellar performances from the whole cast.",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Powerful.  Well done and tasteful. I hope everyone gets a chance to learn from this story.  Bonus:  Julia is A1+++",
    "date": "2024-03-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I found the first half of this film quite compelling as we are introduced to the characters involved and become quickly intrigued by Ben's unexpected return home and the varying emotions that his arrival evokes. Roberts and Hedges are compelling and successfully elicit both sympathy and frustration. And then halfway through, the film makes a drastic 180 degree turn that leaves behind the character development and becomes more of a thriller that relies on an increasingly hard to swallow series of events that feel more like screenwriting conceits than true to life drama and strain credibility. That's too bad, because the first part is so strong that I was really rooting for it to continue on a path of greatness. Everyone has their hearts in the right places, but by the end, after one too many coincidences have occurred, you may find yourself rolling your eyes rather than wiping tears from them.",
    "date": "2024-02-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Ben is back but is he really? Lucas Hedges and Julia Roberts co-star as son and mother along with Courtney B. Vance and Kathyrn Newton A teenager Ben Burns returns home just in time for Christmas Eve after being released from rehab His mother Holly is ecstatic about her sons return but tries to hide anything that'll bring back his drug addiction But something comes back to haunt Ben and he has to try and fix it Does Holly really know her son as well as she thinks she does? How much more trouble is he knee deep in? She will do anything just to have him back from before he went away This is a very slow moving drama being more of a character piece There's virtually no music throughout Yet the film really gets by on both Roberts and Hedges' performances My only real problem was the ending; it doesn't really wrap up as it just stops The first half is so much different from the second half that's for sure and this has a more direct to video feel to it Yet both performances are magnetic despite it straining credibility in many parts The actors alone should be viewed for this",
    "date": "2023-12-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Boring. All I was worried about during the last hour was the dog. Don't waste your time.",
    "date": "2023-12-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Amazing movie. So well done. It is very realistic. I think this film will help addicts stay sober.",
    "date": "2023-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I'm a fan of Julia Roberts and her work, but I didn't particularly like her in this one. The story itself was a difficult subject and I think the main actors did a good job with the script given, but it just didn't appeal to me how it was delivered.",
    "date": "2023-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie! A mother trying to save her son from addiction. Son became addicted at 14 after a broken arm. Dr said pain meds weren't addictive. Very great performance by Julia Roberts! I would have ended it differently but that's just me\n I would prefer to see Ben clean a year later because that's how I want it to be in real life",
    "date": "2023-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "i love when julia roberts quietly tells a person off - spoilers\n\ni could cut an hour out of this movie and it would be really good.",
    "date": "2023-01-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A surprisingly really good, at the start i though some of the acting and the script could have been improved, but not long after it started to really show its strengths, helped out by an amazing performance by Julia roberts. A heart felt and motivating storyline.",
    "date": "2023-01-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Heart-wrenching because of how true this story is for so many families.  Julia Roberts is relentless both in her character's traits and her talent.",
    "date": "2022-12-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Excellent performances, and script around the devastation caused by addiction",
    "date": "2022-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Minha opinião: Um drama que relata o caso de um drogado que esta lutando para vencer o vício. Pena que o filme não mostre ao seu final, se ele vence ou não. Até a metade do filme é um drama, mostrando o sofrimento de uma mãe e sua família em ter um filho drogado, que já foi internado varias vezes. E se o filme continua-se nesta visão, o filme seria muito melhor. Pois a atuações de Julia Roberts, de sua filha Kathryn foi muito boa. E claro Lucas. Que desde igreja, a grupo de ajuda, velhos amigos e a próprio pré-conceito da família, principalmente do padastro e sua própria irmã. E sua mãe que parece um pitbul que não solta de seu filho em único momento. Mas depois do meio para o final o filme se transforma em uma perseguição da mãe ao filho que para recuperar o seu cachorro, vai encontrar com antigos amigos. E se torna uma perseguição. Até que chega no fim com Lucas tentando se suicidar e no final sem saber que fim deu ele.\nRoteiro: a 1ª metade foi muito boa, depois se perdeu.\nVale apena assistir? sim\nNota: 5",
    "date": "2022-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Intense, gripping movie from start to finish.  Really well done with great acting by Julia Roberts and Lucas Hedges.",
    "date": "2022-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Terrible acting, terrible end but did make me tear up a bit, also cringe a ton 3/10",
    "date": "2022-05-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Scaringly real. This movie is one everyone and anyone should see. I myself have known of someone who passed from drugs and know people who have struggled with it. I sure hope everyone sees this it is so important. Roberts and Hedges are a power dynamic together in the film and at times this one keeps you on edge. The ending really packs an emotional, real punch as well. 5 out of 5.",
    "date": "2021-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "An upsetting reminder of how destructive and cyclical drug addiction can be, and how the collateral damage to a loving (and increasingly wary) family is entwined with the habit and its underworld. Well acted with terrific screenplay, this can't ever be labelled an uplifting picture and nor should it. Everyone seems helplessly trapped in this never-ending cycle of addiction, hope and devastation. Terrific piece of film, if heartbreaking.",
    "date": "2021-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Worth the watch, Julia Robert's never fails to amaze with her roles. A great story about the tug of war with addiction, and the affliction it can have on personal life, family and relationships.",
    "date": "2021-06-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The adventure in the second half of the movie felt a bit contrived. While it certainly hit close to home, it still felt unlikely. The ending was sad, but realistic. Kathryn Newton is great, I wish we had more of her story. They hint at things in the past, but we never see them.",
    "date": "2021-05-15"
  }
]