[
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Decent action, not great acting. Not a bad war film based on true events",
    "date": "2022-12-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie is ostensibly a reenactment of how Seal Team Six performed the assassination of Osama Bin Laden. Yet the movie begins by slamming Republican politicians, and then it shows American soldiers acting like Keystone Kops and getting themselves hurt and killed. Some unseen interviewer allegedly talks to people involved, but they give mumbling answers. The movie broke down in the middle of viewing, but I already gave up in disgust. The only person being honored is our great leader Barack Obama. Kim il-Sung would laugh at this travesty.",
    "date": "2021-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Shooting in the middle of Mumbai, with vehicle number plate displaying them being registered in Mumbai, national political party's flag fluttering in the background, extras used in the scenes were clearly appearing to be from Mumbai. And this set up is introduced as a city in Pakistan. \nPoor observations and low skilled editing. \nThe starting 10 minutes were a tell-tell sign about the full movie.",
    "date": "2020-05-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "i like the other film more.",
    "date": "2020-04-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It’s pretty boring, cheaply made",
    "date": "2020-03-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very good film but too much live cam type film towards the end and not really able to see much.",
    "date": "2016-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I give this movie three stars.  I liked how they showed us all the parts and what happened in trying to find Osama.  But, at some point of the movie it would get a little slow and confusing.   Also they could have showed more of the CIA investigating and how they got all their information and then maybe a little more showing them actually going in and getting Osama.",
    "date": "2015-03-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Only a small view into the sacrifices of our military on a daily basis.",
    "date": "2014-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "good war/historical pix",
    "date": "2014-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I get that it's historical, but it is also ugly to watch... The background music is awful... And I was annoyed by all the interviews. I've seen better historical movies with better acting on The History Channel.",
    "date": "2014-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The movie is based on the raid of osama bin laden...well according..to me i rate it 3 stars...the movie is a bore at some places..u will be literally yawning..and in some place u will have goosebumps...the movie also shows the strength and courage of those six officers and intelligence agency of U.S.A  who made a brilliant plan to kill bin laden..the movie lacks actions scenes...the movie feels like a documentary at times",
    "date": "2014-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Very good propaganda movie for the Obama administration showing how courageous Obama was to have made the call to raid the compound when nothing was mentioned about all 17 of the Seal Team 6 getting slaughtered a few months later because Joe Biden told the national media they killed Bin Laden.",
    "date": "2013-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not great, not terrible -- just your standard-issue movie about a well-known historic event regarding Osama Bin Laden.",
    "date": "2013-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "SEAL Team Six: The Raid on Osama Bin Laden is really quite a bit better than its lower budget made-for-television and, it might seem, made-for-controversy and made-for-political-gain aspects all suggest. There's a lot to like in its straightforward, no-frills approach; politics aside, it paints an intriguing picture, no matter how accurately, inaccurately, or somewhere in between the story captures history. It's not a guns-blazing picture but rather a thoughtful character study of the men and women, technologies, risks, and rewards of making one of the 21st century's (so far) most historical moments happen. It's well-acted and well-made, a movie that should please all viewers who appreciate a good story inside the military and political arenas. It does get its own political two cents thrown in, but outside of a few such moments, this is solid entertainment for the mind as well as the eyes and ears.",
    "date": "2013-09-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Worth watching movie about the slain of Bin Laden. Good war movie.",
    "date": "2013-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "My Review: 5/10\nDate: 9/4/2013\nMelodramatic jingoistic propaganda, but interesting and exciting at times. Sounds like there were a lot of inaccuracies but I didn't know a lot about it to begin with.",
    "date": "2013-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Couldn't get past viewing it as more than propaganda. Cynical maybe but that's my view.",
    "date": "2013-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Same feeling as Act of Valor except these are actors and not real soldiers.  I'm proud of the men and women serving in our armed forces and intelligence committees. I wonder how this movie compares to Zero Dark Thirty?",
    "date": "2013-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Robert Knepper (best known as Theodore 'T-Bag' Bagwell from 'Prison Break') plays the movie's best character, a soldier who just wants to get his guys home safe; the most moving scene was that with soldiers video chatting with family and loved ones. Alright film, but kind of a let down considering the subject matter.",
    "date": "2013-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "After seeing Zero Dark Thirty you realize how flawed and half-assed this film is. It may not have anywhere near the budget that Zero Dark Thirty had but I felt that they tried too hard to add drama by exploring one of the Seals private life which didn't really lead to anything in substance. Any added drama seemed untrue and irrelevant. Some good performances from Cam Gigandet and the American Pie guy.",
    "date": "2013-08-09"
  }
]