[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great acting, great sets and a solid script.",
    "date": "2025-02-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Thought the Netflix series was a little better. Billie Piper looked a bit out of her depth. And how many BBC investigative reporters for Newsnight live in council flats and take the bus? Well done, just about worth a watch. But I guess we all know the story...",
    "date": "2025-01-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "\"Scoop,\" the 2024 film featuring Gillian Anderson, Billie Piper, and Rufus Sewell, offers a gripping portrayal of the infamous interview with Prince Andrew that sent shockwaves through British society. Directed with a keen eye, the performances are commendable and effectively convey the weight of the subject matter.\n\nThe film excels in many areas, but it is heavily dialogue-driven—no surprise considering it’s centered around an interview. However, the sheer volume of dialogue can at times overwhelm the narrative, making it challenging to stay engaged and leaving the audience yearning for a moment to catch their breath.\n\nWhile I believe it's a well-crafted film, there's an abundance of content that feels overly packed, which detracts from the overall experience. I hope that in 2025, filmmakers will take a different approach, as the current trend of dialogue-heavy narratives can feel monotonous. It seems we've strayed from the essence of storytelling, whether it be an emotional drama or an action-packed thriller, and instead find ourselves mired in films that lean too much into lengthy conversations.\n\nI wouldn't classify \"Scoop\" as boring, but it fulfills its purpose effectively, leaving you ready to move on to something else once it concludes. I appreciated the film during my first viewing, but I doubt I would revisit it; I fear a second watch would induce drowsiness, as the impact of the first experience would likely fade away.",
    "date": "2025-01-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Great cast, great script, great acting, great acting. What could go wrong? The strong, independent, empowered girl boss narrative.",
    "date": "2025-01-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I liked it a great deal. The inner workings of media and the Palace. Yes, I will recommend it.",
    "date": "2024-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I'm not really sure why we're glorifying journalists just for doing their jobs, also not really sure why we should care so much just because it's about royalty.",
    "date": "2024-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I enjoyed this film ,its well acted and I found it interesting to see the work that goes into securing these types of interviews.",
    "date": "2024-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "You need to know this is a movie about Sam McAlister primarily, the former newsnight booker for the BBC. \nIt's somewhat entertaining but was a huge disappointment viewing experience as it felt like 50% of the movie was watching shots of Sam travelling around London and staring at Chanel logos.",
    "date": "2024-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Movies that depict journalist always either lean to be good or bad. This does a decent job of staying in the middle. Boring at times and sometimes exciting.",
    "date": "2024-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "La adaptación de una historia real que logra cumplir con lo que se propone. Simple, lineal pero a la vez entretenida, no pretende ser mas de lo que es. Buenas actuaciones.",
    "date": "2024-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was one of the highlight experience that can take from film",
    "date": "2024-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very formal movie. Liked the discipline and the facts. Also easy to find, netflix 🤞",
    "date": "2024-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I really liked the camera used in the movie. Because the angles and small details are captured very well.",
    "date": "2024-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Elegante trasposizione di una storia vera estremamente scomoda da raccontare e che viene trattata in maniera molto \"british\" esattamente come sono i personaggi da cui è tratta.\nLa sceneggiatura naturalmente si basa su pochi elementi certi e non può forzare troppo la mano sulle opinioni personali o sulle congetture non confermate, quindi cerca di riempire i tempi morti con i rapporti interni al giornale che non riescono ad appassionare particolarmente ma che evitano grandi noie.\nSicuramente ben eseguita la sequenza dell'intervista, clou del film e dell'intera vicenda; trattata in maniera lucida e schematica, senza mai eccedere nelle interpretazioni o in nessun tipo di esagerazione.",
    "date": "2024-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Thought this was a really well made film, through the ins and outs of how Prince Andrew is a nonce!",
    "date": "2024-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "If this journalistic drama has its own light, it is because it follows a scandal that occurred in real life; and inspires curiosity to find out more about the events. And that's what mostly counts.",
    "date": "2024-05-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Highly watchable, nailing all the important parts of this sad episode where a supposed \"royal\" was made to foolish, dishonest and a predator.",
    "date": "2024-05-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Rufus Sewell is terrific and the story held my interest even though I don't care about any of this stuff in real life.",
    "date": "2024-05-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Sewell works, the others are good, the movie feels a little unnecessary",
    "date": "2024-05-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It was a good movie but as someone who had no idea how big of am impact this in real life interview had on his career, it was just another story about Jeffrey Epstein which their are plenty of.",
    "date": "2024-05-06"
  }
]