[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The first couple of Bad Boy movies were fun and not quite so ridiculous.  But looking at the audience rating for this film, you can see why Hollywood has shifted even more towards childish fantasy, glorified mass killing, unstoppable super-heroes, dumbed-down, predictable, moronic movies. And no wonder that there is such a massive migration to TV shows where it’s still possible to find something a little more satisfying. Most movies are simply not worth watching (unless you’re your stoned or drunk).  This being one of them.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Great to see them back again, been down since 95! First movie! Still greatness.",
    "date": "2025-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Pretty good! I would actually enjoy a Fast and Furious crossover!",
    "date": "2025-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing, just as good as any other bad boyz movie!",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I did like the movie, but it has its non interesting moments.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "ONE of my favorite movies that I would recommend to my friends a mix of comedy and action🫶🏻",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I was about as invested in this movie as Will Smith was.",
    "date": "2025-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Another in the \"turn off your brain and have fun\" franchise, and precisely for that reason, it's not a technical masterpiece or a spectacular script, but it fulfills its role as entertainment with action, comedy, and explosive effects. Will, as always, takes center stage, but the others don't compromise as much.\nI recommend it when you're not in the mood for reasoning.",
    "date": "2025-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "It blends the action, comedy, and serious moments really well! Enjoyed it a lot.",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "الفلم عبارة عن انك طفي مخك و تشاهد بس كمية المشاهد الكرنجية تخلي لي مخه طافي ينزعج و مع ذلك استمتعت بالفلم رغم عيوبه الغير المتناهية\n\nلو اخذوا الفلم بجدية لارتفعت جودته لان القصة كانت مثيرة للاهتمام و كيف انه تم الاشتباه برئيس الشرطة السابق المتوفي محاولتهم لحل القضية\n\nالمشاهد القتالية كانت ممتعة للمشاهدة و مضحكة نوعا ما\n\n🧠اكرر فيلم لاقاف المخ",
    "date": "2025-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "One of the better Bad Boy movies, which felt like the original movie. I really enjoyed this movie.",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Bad boys never disappoint. The jokes/ humor were hilarious!",
    "date": "2025-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It was good and funny",
    "date": "2025-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Not bad but not great. I think this should be the last one",
    "date": "2025-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Surprisingly entertaining however if you don’t watch it you are not missing much. Good if you are bored but definitely not a must watch movie.",
    "date": "2025-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Owwww yeah, this just keeps hitting the right spots !! Mercikes Adil en Bilall, goe bezig mannekes!! 😁",
    "date": "2025-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Really good movie and very funny!",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "OMG its like being stuck in a time machine, its well directed and the script is fast moving, its slick, its Hollywood, the two main protaganists will still be doing this in their OAP home in wheelchairs because some people will still be willing to pay to see it, my advice is, If you have not seen it, don't, if you have seen it, try electro-shock-therapy its great at erasing your memory, I can testify to that, stephen,",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Absolute trash.  It's unfunny, the plot non-sensical, and Will Smith is trash.",
    "date": "2025-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "**Review:**\nAs a long-time Bad Boys fan, I walked into *Ride or Die* already rooting for it. Will Smith and Martin Lawrence still crack me up—their chemistry is evergreen—but man, this one lands squarely in the “mid” category. The plot? Predictable. The jokes? A little too thin. It keeps trying to inject weight and drama, but you never really *feel* it, and in the process it kinda loses that chaotic Bad Boys energy. Seeing Ioan Gruffudd pop up is always a treat, but even that can’t mask the mediocrity of the dialogue. It’s not boring—just never special. If you’re a diehard like me, you’ll squeeze a bit more fun out of it, but honestly, they should’ve stopped after the trilogy.\n\n---\n\nWant me to punch it up with a snappier “closing line” for extra bite?",
    "date": "2025-08-25"
  }
]