[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Extremely well made documentary. It was a very sad but very informative film.",
    "date": "2025-01-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The onion that keeps on peeling. So tragic but well told.",
    "date": "2024-12-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This documentary was one of the most bone chilling docs I have ever watched.   It made me sad, angry and scared all in one.",
    "date": "2024-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very well made documentary detailing a horrible story.",
    "date": "2024-01-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best true crime docs I have seen.  It's just so twisted.",
    "date": "2023-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely fascinating. Like a good book you don't want to put down. There are so many layers to this story. And so many wonderful people who came together to solve the mystery and find peace for the victim. It is a difficult watch because she endured such horrific abuse. I hope her life is better now than it was here on earth.",
    "date": "2023-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This just might be the best true crime documentary I've ever watched. The story is heartbreaking, tragic, and enough to break anyone, albeit extremely fascinating throughout its entire run, and yet still in its conclusion there is enough hope and positivity to make anyone cry. I think this story is one that will live with me forever.",
    "date": "2023-04-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Filmed very well and almost all people involved in this twisted story were interviewed which is great. At first being introduced as a hit-and-run case, I could not have imagined so many mysterious and unordinary details appearing throughout the whole documentary.",
    "date": "2023-03-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "\"Girl in the Picture\" is an absolutely insane new documentary from Netflix. Typically these sorts of true crime thrillers aren't what I immediately gravitate towards, but I liked this one. Although the story is pretty upsetting, there are many fascinating mysteries that unfold in shocking ways until the very end. I found myself wanting to see where the story would go next but also anxious to see how much worse it could get for the people involved. Overall, it is one of those documentary films that will surely appeal to those who like this sort of content but is also well made for those like myself who don't often seek them out.",
    "date": "2022-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "'Girl in the Picture' is a documentary true-crime mystery that has many tentacles.  Skye Borgman manages to bring out the emotion via the gravity of the situation.  There are so many layers and so many interviews and the visuals are different in each one which keeps your attention.  Tons of photos and news clippings add to the drama.  The recreations make it feel like an episode of Unsolved Mysteries and you milage may vary on that aspect.  It's painful, it will make you cry and make you want to hold your kids close.  There are a couple plot lines that aren't tied up, but this is reality after all and we don't always get the answers we desire.  Final Score: 8/10",
    "date": "2022-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's really good, but it made me feel bad",
    "date": "2022-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I think I never told this to anyone, but the documentary is a genre that I always had laziness to watch, and I don't know why. 2022 is the year that I'm little by little losing this stigma, especially thanks to my Philosophical Fundamentals (I'm doing maths, but also studying to be a teacher) teacher, who made the class write a review like the one I'm writing now to a 2005 Brazilian documentary named \"Pro Dia Nascer Feliz\". For that documentary, I gave nothing but compliments. \"Girl in the Picture easily has a more complex, involving and profound story, and they're honest with their pieces of information and they're very well-connected. What impedes this production to reach perfection is the emotional factor. When the direction chooses to pull the viewer to the emotional side, it becomes very manipulative. To be honest, I'm not a big fan of the emotional side of documentaries (that's the main reason I hated the 3rd season of \"F1: Drive to Survive\"), I think their only focus should be the information they're telling. Here, for example, when the soundtrack isn't appealing for the emotional, it's minimalist and fundamental to keep the spectator interested in the story, which is already interesting, atrocious and must be shared worldwide.",
    "date": "2022-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Mysterious documentary that was created very well.",
    "date": "2022-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A truly haunting documentary and one of Netflix's best in a while.",
    "date": "2022-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very good documentary. Strong and sad.",
    "date": "2022-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This true crime documentary will have you mind blown.  The difference between this documentary and most of the others is that is does not put the suspect in the spot light and the victims and people close to the victims get to tell the story from their point of view. There is also a lot of twist in the story that will leave you mind blown.",
    "date": "2022-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Really scary! Must watch!",
    "date": "2022-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I quit the movie more with 59 minutes to go,  This movie is for people who wonder how weird an adult male could be.",
    "date": "2022-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Impresionante! Triste historia, narrada a la perfección.",
    "date": "2022-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Muy buen documental, en sí, muy buena historia para contar y muy difícil hacerlo mal . \nSin embargo, seguro no fue fácil contarla y recopilar datos, por eso mis cinco estrellas . Muy buena dirección e imágenes,  congratulation!!",
    "date": "2022-07-18"
  }
]