[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent storytelling and great lesson.",
    "date": "2025-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Heartbreaking and infuriating. A must watch.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's not an interesting story. Just sad",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I absolutely recommend this movie, although it will (should) make you angry. We don't typically get to see the full story of how racial friction leads to tragedy, but that is what this film lays bare. It's frustrating and infuriating to watch this older woman rage against her neighbors for simply playing football and roller skating and being kids around her house - but people like her do exist, unfortunately.\n\nThe way the film was edited was incredible, considering that most of the video came from bodycam footage. Watching the police do what they can to help the situation within the limits of the law was interesting, and of course disappointing when they couldn't take greater action to discourage the \"perfect neighbor\" from her ridiculous behavior. What a miserable person! But it was worth watching to have a better understanding of how some community relationships develop and deteriorate around us.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This is what happens when a crazy woman thinks she can go off kids in the community.  It is sad to see that someone had to die to see what our life has become.  We are so barbaric",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie is not as much entertaining as it is thought provoking and unsettling, and that’s exactly what makes it a must see.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wow what a way to include the spectator. I felt like the chronological order of events allowed the audience to understand all events that led to such a horrific ending",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Rating is not based on the entertainment level of this docu. But the way the story is told and the content of the docu.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The use of real footage and audio recordings, rather than interviews and dramatized reenactments, makes The Perfect Neighbor all the more powerful and impactful. It's the best documentary on Netflix.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "If you don't sob... really shows how backwards USA has gone. Grateful somehow they got all this footage. You see how laws affect generations. Must watch.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The footage of the night this incident happened was extremely sad. I am glad justice was served.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Really, Really sad story of two women who are worlds apart, but are neighbors. One is lonely and afraid and one is a big mouth that has loud annoying kids. Someone gets killed, someone goes to jail. Very sad that this kind of thing happens, and happens a lot. RIP",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This was movie was terrible. The main girl was so awkward and annoying and I cringed multiple times. This story is important and they ruined it. There was no need for a 1 million Dollar budget when I could’ve filmed that on my phone. Horrible movie waste of time don’t watch it.",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "As a movie it is totally weird as the content is in no shape of form enteraining and shouldn't be something to watch to be entertained. Now as a documentary I think the use of solely raw footages is great and the whole story is heartbreaking and harder to get through than most movie, however I'm just not sure about whether we should be exposed to such raw and personnal footages and if it's a good idea to label such content as movie as this should only be something to be used in a courtroom or for a studying purposes",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I cry a lot during movies, but this really got me. You get to see raw and real emotion and it just broke me. It was insane but very interesting at the same time. I feel so incredibly sorry for the family, though. No one should go through such a thing.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This documentary was formed to strengthen the prosecution, then during the settled aftermath it’s become an invitational conversation as we observe with intimate access over the compelling craft, as well demonstrative over the procedural system. The vocal forum will no doubt be divisive in further questioning the case that suggests inquired thoroughness, whether if decidedly acts as the devil’s advocate or just biased without much thought. Maybe acted on insisted gimmickry and questions are answered afterwards beyond the lens, but the consensus overwhelms the defendant’s problematically layered mentality. Educationally raw over the societal prospects whilst provocatively engaging and agreeably unsettling like any dark impacts that ripples into a documentary’s conceptualization in spreading the story just as it was witnessed. This true crime documentary’s complex case edges this as one of this year’s best to the format, a deserving contender to be ranked among the best. (B+)",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very interesting. Everything was unbiased except for the title.",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Ive seen the true crime doc all over youtube but this in paticular adds a human touch to that is somtimes lost when we talk about ture crime docs. we forgot that there are communityes, friends, families that are effected that are not shown or even talked about. So great to get that perseptive.",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Both unsettling and engaging the narrative device of this documentary is both thrilling, tragic and very real.",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "sooo sad omg. F that lady.",
    "date": "2025-11-14"
  }
]