[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Title doesn't really depict the movie but it's a pretty decent storyline",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "To be honest I cried",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I’m probably not the target audience for the movie.  It was cute. I really liked Haley Lu Richardson in white lotus, she’s comes across as a natural actress without overdoing it.  And of course rob Delaney is always great.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A current favorite. Multiple watchings. Very appealing young couple. Snappy dialog. I believed their relationship. First watches I wasnt into the two subplots but on repeated watchings, Im good with both families story. Both sad but nice too. On my list of watch every so often- I highly recommend it.",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I found the movie absolutely charming! It was such a delightful watch, allowing me to kick back and enjoy without overthinking anything.",
    "date": "2025-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This movie should definitely have been called Love at First Flight.\n\nLove at First Sight delivers exactly what it promises: it’s light, entertaining, and easy to watch. However, it’s also extremely basic and predictable, with no real attempt to break the mold or bring anything new to the genre. The script plays it completely safe, leaning entirely on the most typical romantic comedy clichés. That said, it does have some charming moments and decent chemistry between the leads, which may be enough for viewers who just want to enjoy something simple without thinking too much. It’s not bad, but it definitely lacks originality and the courage to stand out.",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "In its thematic content it's a tad deeper than the average rom-com splattering on streamers... But the problem is a lack of real laughs in its comedic attempts, and it's bereft of even these in its last third. This isn't good enough for a successful theatrical release, but worth a watch on a streamer...",
    "date": "2025-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A tad deeper than your regular romcom but not deep enough to make a mark.",
    "date": "2025-06-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It feels a teenager movie.",
    "date": "2025-05-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The movie has a cute and promising premise, but it falls short in the moments that should be impactful. The chemistry is there, but poorly used. The story drags in the middle, making everything feel predictable and flat. It's okay as a time-killer, but not memorable. Best for those who enjoy light romances or have nothing better to watch.",
    "date": "2025-05-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Clever, quirky, engaging, inventive and delightfully uplifting. The chemistry between the two lead characters is beautifully symbiotic. Crafty and marvelous. A wonderful watch while holding hands.",
    "date": "2025-04-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I didn't feel any chemistry between the leads. But the story was good. I like the narrator style layout.",
    "date": "2025-03-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Charming, quirky and original.  The Lad is a Statistician and the film quotes lots of (probably made up) stats. An enjoyable not too demanding watch.",
    "date": "2025-03-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I only watched like 15 minutes of it and got bored, and am sorry the actors aren’t that attractive. I feel like they could have done something better with this movie",
    "date": "2025-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "this feels like the old rom-com movies like serendipity and the holiday!!! i’ve missed movies like that so much that Love At First Sight felt like a breathe of fresh air from the terrible rom com movies lately that are too gen Z. I literally cried towards the end because of the main leads story but it was so heartwarming and of course it ended with a happy ending!! just watch it i literally don’t ever write any reviews but I had to for this one because it was great, not too cheesy and just the right amount of romance",
    "date": "2025-02-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A delightful movie. No notes.",
    "date": "2025-02-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "i can't believe they just fell in love like that... missed the airplane and Boom ... met each other .... 8 hours .... fell in love - i mean movies are supposed to be unrealistic but this is just unrealistically unrealistic. okay so leave the part that they fell in love too fast aside. Hadley travelled super far from her father's wedding to his mother's memorial to meet him and he said something bad to her and he let her go. She was so miserable (phone out battery, didn't know how to get back) and he just sat there doing nothing. It was only thanks to Miss Narrator giving Hadley's backpack to Oliver that they met again, otherwise he would not have been there. After all those bad things he said to her, he just came to find her and then they were kissing... i was like what the..? i would have give this movie only 2 stars but the 1 bonus star is for Ms Narrator -_-",
    "date": "2025-01-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Sometimes you just need a good ,sensitive , old fashioned love at first site movie .",
    "date": "2024-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "For my part this is a very good little film. I grow weary of reviewers “this does not break new ground” just shut up. It is a charming story with nice lead characters whom have very good chemistry and do it all with a clever script and very good acting. Pulls on the heart strings and makes you smile all in under 90 minutes. What else could you ask for.",
    "date": "2024-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Easy, christmassy, romantic watch!",
    "date": "2024-11-04"
  }
]