[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Joel Kinnaman was the only reason I watched this snoozer through to its dull ending.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Worth watching 100 percent good after a long watching a good movie with intelligent good plots intelligent movie making best crime thriller",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1 hour and 53 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $300,500.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not bad but also nothing special.",
    "date": "2025-05-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie provides excellent insight to what could be happening in your neighborhood. Only goons and thieves hate this movie. Like the 1 percenter tv show. Exposing what was hidden and how he infiltrated numerous clubs. This is a great movie.  Leads to community involvement",
    "date": "2025-02-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "#Recommended 7/10",
    "date": "2024-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Pretty good. Not too cringe, if you know what I mean, and it's entertaining.",
    "date": "2024-03-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Eindelijk een film die vele clichés achter zich laat. De moeite van het bekijken waard.",
    "date": "2024-03-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Meh, was expecting more of a prison drama, not a split story between prison and the outside that becomes too fictitious to take as seriously as the first half,  Still, it was interesting enough to keep my attention.",
    "date": "2024-03-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I watched this on dvd recently.  It's violent and brutal at times, although the story starts off well and the scenes set in New York are quite exciting to watch.  However, once Pete is sent back to prison it looses it's finesse and it feels like a different low budget episode of the first part.  This is another one of those movies where the NYPD and FBI don't get on which reminded me of how different Councils used to clash, despite working cooperatively as public sector stake holders!\nThe plot is far too complicated and reaches the point where the credibility of the whole story is lost, resulting in an empty experience for the viewer.  The more I watched the worse it seemed and I soon began to hope it would end.  I fast forwarded through some of it to lessen the ordeal. Sadly, I can't recommend this movie.",
    "date": "2024-02-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Intro and middle was good, but conclusion lacked goodness",
    "date": "2024-01-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Worth the time investment.",
    "date": "2023-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's a well casting motion picture, The Informer, 2019 directed by an Italian director basing on the novel, Three Seconds by a Swedish duo, Roslund & Hellström, deceased in 2017...\n\nA Cuban actress, Ana de Armas, later a Bond girl portraying the Character Actor, a Swedish, Joel Kinnaman who starred in 2014 RoboCop remake...",
    "date": "2023-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Good movie for the most part, but bad ending.",
    "date": "2023-06-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "3.5 stars;    Well done. A movie that has combined street crime, Polish mafia,, prison, undercover agent drug dealing, along with a crooked cop versus a good cop. You get more than your money's worth with this flick.\n\nAnd to make it even better, Joel Kinnaman gave you a victim of the system character that you could pull for through the entire movie. Good job by all!!",
    "date": "2023-02-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This has been done so many times before, and done better. I was hopeful this would be pretty good given the cast (always liked Joel K), but it is a bit if a letdown. If you're up for a dawdling movie to pass the time away, half watching while you are on your phone, this is a movie for you.",
    "date": "2022-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Solid suspenseful movie. Really good acting and a wild storyline.",
    "date": "2022-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Wow. This script could have been written by two privileged teens.",
    "date": "2022-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "So boring i wanted to die.",
    "date": "2022-06-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Minha opinião: Um drama policial que tem um criminoso infiltrado pelo FBI para descobrir e prender um rei do crime polonês. Porém quando tudo irira terminar, ocorre um problema de assassinarem um policial e ele é obrigado a assumir a responsabilidade e é enviado a prisão. Na prisão dão a ele uma missão. Quando ele cumpre é traído pelo FBI. Sua família também é pega pela máfia então ele fica num mato sem cachorro. Até que no fim ele consegue fugir da prisão e resgatar a família, eleminar o mafioso e os traidores serem desmascarados. Joel teve uma boa atuação, mas Ana teve mais, pena é o seu cabelo cacheado loiro que a deixou horrível. O filme foi meio raso nos assuntos e nas cenas. Um filme razoável.\nRoteiro: teve momentos que forçaram. Mas mediano\nVale apena assistir? Se não tiver outra opção e você gostar de filme policiais.\nNota: 6",
    "date": "2022-06-12"
  }
]