[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Don’t know why it is getting bad audience reviews. The storyline is decent and the action scenes were great.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The best action movie of all time I can't stop watching it it reminds me of Call of Duty and GTA",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Simply a waste of time.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I thought they stopped making bad action movies awhile ago. I guess they’re still a thing. \n\nWomen are the most formidable warriors and the action is ridiculous.\n\nRetarded gore. Storyline completely unbelievable. \n\nMeant for the shapeshifters.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "When the trailer came out , I thought it looked sick, with Tom Hardy as the star , action packed , but when it released I was disappointed because yeah it is action packed alright, but that’s literally it, there’s no story or plot to it, it’s just a 2 hour highlight reel of shooting blood & gore.  Not the greatest quality either. Not even the elite cast could save this movie & im a big Tom hardy fan. Can’t recommend",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is surprisingly amazing!\n the action reminds me of Grand theft Auto with some elements of sleeping dogs.\n it has amazing characters it leaves you hating some characters but the acting overall performance is top notch.\nTom Hardy once again crushes his very believable acting I see him as a cop a grizzled one at that and the way the characters come together is amazing it's not annoying , no unnecessary chatter and the ending leaves you wanting more \n\n10/10",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A bit too much. 99% of all people appearing on screen die within 10 seconds of being shown for the first time. Entertaining but too much gore and too little logic.",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Think I'd have to be totally screwed on drugs to enjoy. Music too loud. Characters yeuch. Can take all the gore but hardly a story.  American crap. A waste of time.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Story lands straight into the center of storm and the hero enters with unwrapped Xmas gifts cranking up the style. But as the story goes on it defies all logic, climbs down the shelf and disappear into the cinematic FMCG. There's enough power in visuals, audio and the performances of this star studded cast but the story becomes too predictable and preposterous to hang onto. However the action sequences would definitely keep any audience entertained.",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Utter garbage. The incoherent writing was garbage, the camera-on-a-vibrator cinematography was garbage, the slapstick martial arts were garbage, the soulless acting was garbage and especially the directing was pure garbage.\n\n It would have some redeeming quality if it was intentionally funny, but I was definitely laughing at this movie and not with it.",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Great cast but what a shitty movie.... Almost turned it off after 5 minutes, because the action scene was terrible and the cameras were shaking too much.\nStayed with it but still hallway through I had enough... Not even Whitaker nor Hardy helped pushing to a decent level of movie. Too bad",
    "date": "2025-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Easily Evans' worst movie, the two set piece action scenes were decent but nowhere near to the stadard we've expected from him.",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Violence for the sake of violence. Barely any story, no characters to emotionally invest in. And oh my god, the violence. Granted, the choreography of it all is impressive from time to time, but there's so much of it. In the end I was surprised that there were people alive.",
    "date": "2025-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Brutally entertaining despite its weaker narrative threads, this is perfect if you want explosions and punches. If fights and fury are your thing, it delivers fully.",
    "date": "2025-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Just another awful movie. Dont waste your time like i did",
    "date": "2025-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "senseless bloodbath, barely a plot and story",
    "date": "2025-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It's terminator, but everyone is a terminator and capable of taking 200 bullits. Don't remember to have ever watched a worse movie. A plot does simply not exist it's just people shooting each other with 20000000 HP. Definetly don't recommend it. It's just a waste of time.",
    "date": "2025-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Hellish \nAbysmal \nVisually -\nOver-the-top \nCrap\n\nI was looking forward to another enjoyable Tom Hardy movie.",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Dumb! Exactly what’s wrong with Hollywood. Over the top gratuitous violence and gore and nothing else. Worst movie I’ve seen in a long time.",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Despite a top tier cast and an insanely high bullet to second ratio, the plot never came together. It had way too many parties and motivations it just seemed like a clustered mess. It's also a hyper-violent shoot 'em up that despite the excessive number bullets being shot most of the time nobody has any accuracy -- not even nearly point-blank with a shotgun. Decisions like that just take you out of the action.",
    "date": "2025-09-03"
  }
]