[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Awsome movie. A must see. Great cast. Great story. Great acting.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Overall a good watch. Nothing new to write about. The villain wasn’t convincing. Not scary or weird enough when you see someone like tom hardy doing it better.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Decent psychological survival horror thats well worth a watch. Said that writing does get stupid towards the end when everyone gets very bad injuries and still going. I think some of these injurys would put you in a lot more pain in which is not acting very well. Overall I think the ending could of been better and less predictable.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "How the hell do these directors make such movies….!  the bad guy keeps walking and playing strong along the entire movie after a stab on the neck, hit on the head, steady punches from the hero, gets choked and still he wakes up in no time, but the victims always wake up after they get tied up rit? 😂 \nAbove all, there is no sound of water in the entire boat scenes…. The bloody yacht does not shake or move in any of scenes whilst in waters, it is very steady like it’s on ground resting isn’t it? \nThere is no wind in most of the scenes in the ocean…. The entire movie does not show a life boat tied to this yacht but when the villain wants to catch the girl back from the island he suddenly gets a life boat with a speed motor fitted in it already😂!\nThe girl cannot hold her breath whilst getting choked for 10 seconds but when she’s underwater watching that shark come close to her, she can hold her breath for soo long changing into a mermaid huh? How did she even see the shark inside the water soo clearly in the dark? \nAnd that one scene, just one scene where they needed to put some money with the cgi, shark biting off the villain, the CGI is worst than a cartoon man! \nWith all due respect, whoever has made this movie, please go shove it up ur mom’s azz! \nLogic comes from ur brains or from ur diks? \nBaaaastards! \nU better make some logical movies otherwise I wish u all the bad luck!",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I'm from Australia so this movie gave me chills and to know that this is the best reviewed shark horror movie since jaws I gotta watch it. Omg they were right this movie was amazing watch and can't wait to watch it again",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie was crazy! It wasn't so much about the sharks but about the people, so if you're looking for a ton of gore, this isn't the movie. It's more suspenseful and creepy. Loved the final girl - she was a badass and didn't feel like a mary sue at all. \n\nI've watched it twice since buying it and regret not seeing it in the theatre!",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "One of the worst fucking movies i've ever seen.",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Dangerous Animals (2025)\nExcellent Horror Thriller\n(12,036 – 03 Nov 2025 – by Claudio Carvalho)\nIn Australia, the tourists Greg (Liam Greinke) and Heather (Ella Newton) seek out Captain Bruce Tucker (Jai Courtney), who owns a shark cage diving company. They sail with him, see the sharks and out of the blue, Tucker kills Greg and kidnaps Heather. Meanwhile, the surfer Zephyr (Hassie Harrison) meets Moses Markley (Josh Heuston), who asks her to give a jump-start in his car with her van. Zephyr is a free-spirited independent woman who lives in her van, and Moses is a realtor and surfer. There is a chemistry between them, and they have one night stand, but Zephyr leaves his house early in the morning. When she stops her van in an isolated area, Tucker sees her and abducts her. When Zephyr wakes up, she realizes that she is cuffed to a bed with Heather in Tucker’s vessel. Further, they learn that Tucker is a deranged shark-obsessed serial killer that films his victims being eaten by sharks and selects lonely women to feed the sharks. Meanwhile, Moses notes that something happened to Zephyr and seeks her out. \n“Dangerous Animals” (2025) is an excellent horror thriller with a gripping story. The plot is tense, and the characters are well developed throughout the story. Jai Courtney has a magnificent performance in the role of a deranged shark-obsessed serial killer. His performance is impressive from the very beginning and is worthwhile watching. Hassie Harrison is one of the most beautiful actresses and very talented, and her character Zephyr is attractive and charismatic. Josh Heuston successfully complete the trio of protagonists, never giving up of Zephyr, My vote is eight.\nTitle (Brazil): “Animais Perigosos” (“Dangerous Animals”)\nMy Blog: https://maniacosporfilme.wordpress.com/",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It was like Wolf Creek on water.  Certainly had me yell at the TV once or twice.  Good enough to keep me interested right to the end.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "O longa combina o suspense característico dos filmes de terror com a assustadora temática de tubarões, apresentando cenas sangrentas, tensão e atuações marcantes. Embora haja algumas reviravoltas excessivas, o filme ainda tem suas falhas, mas proporciona uma experiência intensa e sufocante que mantém o público envolvido. Como uma fusão de um thriller de sobrevivência e um filme sobre criaturas mortais, essa produção entrega emoções que geram um prazer culposo e vários sustos eficazes. Para aqueles que buscam um filme que traga algo diferente, mas que não seja completamente original, há uma boa sequência de mortes criativas e sangrentas.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Great cast performing well. Nasty killer and lots of jumps and twists. Really good",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "this was fine; not the best thing i've ever seen but most definitely not the worst.",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I thought that it was a pretty solid movie. Jai Courtney is exceptional.",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I can't remember the last time I saw a shark film that was actually watchable. Jai Courtney is excellent amd Hassie Harrison puts in a solid performance too.",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Two played out premises that find an interesting novelty by coming together with suspense filled primal fear. Lots of solid parts on their own but all together they make a predictable & cyclical plot, even if that’s the point. The score is really good & fuels all the emotions of each scene. The leads bring crowd pleasing performances from psychotic to empowering. It’s fun & has easy investments but a bit too heavy handed & cheesy to fully work for me.",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Worst movie left half way",
    "date": "2025-10-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Um filme de um serial killer com peculiaridade de matar em alto-mar. Seus métodos são interessantes e é nítido o medo extremo de suas vítimas, porém o ponto baixo desse filme é a falta de inteligência do assassino e a conveniência para quando a protagonista necessita, recurso este para que a história possa prosseguir.",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Definitely worth a watch. Zephyr is beautifully mesmerizing. She is my new girl crush. She also is in a battle for her life and no one to save her but herself. Watch this movie just to admire her. I can't wait to see more of Hassie Harrison. A couple of things made me like this movie less, the introduction of a love interest really wasn't necessary. What was the point? Did we need that? Did she need that? Also, I'm a little tired of the serial killer dancing in his underwear. Do we know if they really do that or are we still romanticizing toxic men?",
    "date": "2025-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "***WARNING*** this movie will cause heart palpitations, blurry vision, unsteady respirations, and will likely result in necessary therapy in some individuals, view at your own risk. Jai Courtney's performance is nothing short of Oscar worthy. His demented vision of a shark obsessed serial killer is the best work I've seen from him. His menacing madness will haunt you well after the credits have rolled. Hassie Harrison is no final girl either. You will feel all her trauma, her horror, and her desperate drive for survival in every drop of blood that spills onto the deck of this wave tossing thrill ride. This is an independent film. IF there are studio production execs that turned down this movie, fire them today!  This movie delivers!",
    "date": "2025-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "How does that have good reviews?! Don’t waste your time.",
    "date": "2025-10-18"
  }
]