[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Worst ending ever. No resolution. Such a shameful way to end a great build up. Acting was good, story could have been good, but so much lost. Total waste of time.",
    "date": "2025-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I get why this movie is so polarizing - the actors were great, I liked the atmosphere, the music is gonna either grate on you or add to the noir for you (I'm in the latter camp), and it opens really strongly.  Then it goes down what I consider a well-paced path with unfortunately underwhelming plot points littered along the route.  By the time we got to the end, I was like, welp... that ties up most things, so, I guess we're done.  In other words, the script doesn't really cash in on all the good elements, which was a shame. But not a bad way to spend a rainy October evening.",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Garbage movie with no begining or end. Atrocious acting and so slow. This movie sucked, I want my hour and 40 minutes back to watch TikToks instead",
    "date": "2025-10-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I'm stunned by the negative reviews from viewers. I'm guessing most prefer entertainment that requires no thought. This movie was excellent, a great mystery with a very satisfying ending.",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The premise is actually a good one.  A young girl witnessed a kidnapping then 25 years later reports it and investigate on her own when no one believes her.  \nThe problem is so many plots holes, lack of detail,  poor character development and mediocre to lacking relationship between the characters. \n\nThe only backside e get is a few minutes of the girl seeing the boy soar to be kidnapped.  We see nothing of her trying to do anything about it. The menacing characters aren't that menacing, especially when they say \"scram\" in a french Canadian accent. I guess Canadians are just too nice to be thrilling or diabolical.",
    "date": "2025-06-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The soundtrack is atrocious. It's a film with a seedy vibe with a serial killer soundtrack. Left me so confused throughout. Not a fast paced thriller, dull and slow. It's sinister and torture to watch",
    "date": "2025-05-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The real achievement here is pure torture of the viewer on every level. The dialogue, acting, editing, music, storyline are all a jumbled mess of nothing. This is a sedative of a movie & an insult to the viewer. Nothing here ... keep moving folks.",
    "date": "2025-03-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I was confused the entire movie and just when I finally thought I knew what had happened, the ending threw me another curve ball … so in the end , I have no idea what the actual  plot was and who the actual villains were!",
    "date": "2025-03-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Dull and nonsensical.",
    "date": "2024-06-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "There was some good suspense and twists and turns, but the plot was a mess. Trying to follow what exactly was going on was difficult. The ending made no sense at all. It was not great. Not worth wasting your time.",
    "date": "2024-02-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "2.5 stars;      I guess Canadian Film Noir is an acquired taste. I just didn't get it.\n\n\"The Maltese Falcon\"..... it wasn't.",
    "date": "2023-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Weirdness can be good.. however over-cook it and you can slide quickly into daftness...",
    "date": "2023-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The plot is off in so many directions it did not hold my interest.  Too bad, as when I was up to speed, it changed yet again.",
    "date": "2023-03-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Sort of a good start. But ends up being slow and boring.",
    "date": "2022-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Good beginning and set up. Turned into a major waste of time",
    "date": "2022-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Clifton Hill's disappearance is tricky and involves magicians and tigers - so it's also a little white trashy. If Abby wasn't a pathological liar, it would be cut and dry what happened to little Alex 20 years ago...but this one holds you right up until the end.",
    "date": "2022-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I feel as if I'd like to see a remake of this movie with a more compelling central character. The elements of a really good film noir are all there, they just don't hit on all the cylinders because the main character, Abby, is just so \"meh.\" That doesn't mean the actress is \"meh,\" she does a perfectly fine job in the role, as does everyone in this film. Abby is just not that interesting. She sort of shows up and is obsessed with this crime she may or may not have witnessed as a child, and she's a compulsive liar (for apparently no reason, it isn't explored at all) so no one believes her, though even if she *weren't* a compulsive liar there would be no reason to believe her because there's nothing inspiring about her. The character is like the color of dishwater hair come to life. There's no reason to root for her or care about the crime she's trying to solve because she's just a very bland character. I was genuinely glad for the twist at the very end and didn't see it coming, but still. This was a movie in search of a lead character that ultimately came up lacking.",
    "date": "2022-06-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "If you're a fan of 40s-50s noir with its twists and sometimes absurd arcs, you'll  find this movie an homage to that style. Hitchcock fans would like this one too. The gag is amateur sleuth figures out the mystery, but isn't believed (for good reasons). Bonus: David Cronenberg as a podcaster. If you're  looking for a standard crime drama you hated this.",
    "date": "2022-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Spoilers: This planet ain't no boy scout camp descends upon a 7-year-old Abby, as she sees a boy with a bloody gauze patch on his left eye abducted in the woods by a road and a lake even in Canada, while she and her sister and parents are on vacation or at least a day trip. Next, it's 25 years later and she is still held captive by that memory. Is she working out her carved-up psyche, or is she seeking justice for the boy listed as a suicide over the falls? Yes, or no. Things aren't always so clear, as we see magicians fooling us, fireworks exploding, fun houses, casinos in tacky Niagara Falls, both sides. The river for the umpteen millionth time in film is a metaphor for the flow of life, and the dangerous falls, one for: Look the hell out, this could kill you! And, ah, there is Tuppence, whose acting is way more than two pennies worth, more like a million pounds. She aggressively makes it her mission, says she went to journalism school, to get to the bottom of what happened to that kidnaped kid from her childhood. She goes back to the kidnap site, and voila, out from the bowels of the lake ascends a diver in full gear. What does he know, how can he help? He helps some, and the plot pushes on with a performing tiger, an abused kid in several ways, suspects pop up, and for a kicker, the power/money family of the place  is now run by a loquacious pedophile. The cops don't help her, her past seems to show some mental sidetracks, and she finally finds a way to solve the puzzle, involving the shady tiger trainer and her husband who is in a wheelchair and whom she abuses. The bad guys finally pay by criminal charges for the abuses, etc. and for the \"suicide death\" of the kidnaped kid. The transitory nature of life is also given the metaphor of her Mommy ran a motel, where she is temporarily staying. And the shaky nature of truth about anything takes a punch in the gut at the end when a guy with a left eye patch appearing to be the kidnaped kid as an adult checks into the hotel where Abby/Tuppence is working.  They see the arrested pedophile's face on the front of the newspaper, and he says the guy actually saved him. He leaves, and it clicks on who he is, and at first she looks not happy, as in: I did all that stuff for nothing because the kid lived? But then it turns into a smile, as in: He's alive! As we move along, with our messed up heads, life goes on, we can pursue a goal, and maybe, somehow, we might even stumble into getting it done. Fireworks, please! It seems less noir and more: Look out, life is rough, with a hopeful wink. Maybe we can do something right. Maybe even a bad guy can help, even save us from worse, like murder. What a planet!",
    "date": "2022-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This was the most painful, muddled mess I've sat through in years. It wants to be twin peaks set at Niagara Falls but instead felt like a disjointed art house mess made by a pretentious grad student.",
    "date": "2022-06-01"
  }
]