[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Taut, potent and thematically relevant, Kibwe Tavares and Daniel Kaluuya's \"The Kitchen\" is less sci-fi, more speculative fiction, with about as much to say about the current moment as you can possibly imagine. To wit, it's actually an incredibly depressing watch lol and I'm nowhere near sure what I was expecting, given the subject matter. I'm not gonna get on my soapbox here too much, but make no mistake, we need more movies like this nowadays. The futuristic setting, the \"action\" — it's all window-dressing for a challenging story about uncomfortable truths in our world. Tremendous work here from Kane Robinson and newcomer Jedaiah Bannerman, both of whom have no small feat to accomplish in bringing to life the material they're both given here. Needless to say, though, their efforts are not in vain. Super interested to see where/when either/both of these filmmakers apply their directorial talents next.",
    "date": "2025-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Thought the movie was heading for a British dystopian action movie. But instead it slows the pace and chooses the path of a slow paced drama giving an insight into the inner conflicts and struggles of community gentrification, opposed to \"the people versus the system\" route.",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The film contained a lot of elements that were good: a good soundtrack, actors I love, beautiful location sourcing and set building, a futuristic setting.\n\nThe main problem I had with the film was the pacing. It seemed like it was trying to take its time for you to get to know all the characters but a film can only be so long and their motivations were unclear as a result  they felt quite shallow. There were a lot of plot points left unaddressed. There was no catharsis after the main conflict at the end. It would have done better as a limited series (6-8 episodes) with enough time to do some more worldbuilding, explore the different factions within the Kitchen, make us understand what drives each or the main characters. Benji’s relationship with his mother, and their past (why did he not go get stuff from his old house I was so confused), Izi’s connection to Benji’s mother, was he a part of the gang in the past? What happens with the people trees?; Staples and the gang, what do they do, how do they plan their raids, what is his past?; Ruby (Benji’s girlfriend) and her relationship with Benji, what was her life like? I feel like the concept of the movie was cool, and I wish it had had better writing.\n\nThe film seems like it’s trying to send  a message, but the message it sends is vague and not well thought out. I’m guessing it was meant to bring light to governmental oppression of the lower class and police brutality, but it didn’t address the issue in any way, offer solutions, or show how to effectively support and resist with your community.",
    "date": "2025-04-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Horrible movie, so slow. Could have developed better scenes. Actors were okay. Storyline was very boring. All about exploited resources.",
    "date": "2025-02-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "one of the worst movies of it's genre. Empty characters and empty story, just nice photography.",
    "date": "2025-01-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The film is excessively lengthy and features lackluster acting from everyone involved. The tale provides no clear information other than the fact that we are seeing a small kid whose mother has died, hinting to his probable biological father. The distant relationship between the two, and how a lonely dad begins to care about and worry for his son. There is nothing unique about the film. I'm not sure why it has earned so many favorable reviews on RT. Throughout the film, I waited for something unusual to happen, to see why the film was made. But that was it, I suppose.",
    "date": "2024-12-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Slow burn mood piece, not really that compelling, with plenty of social commentary, seems incomplete, don't expect a lot to happen, it's a mood piece.",
    "date": "2024-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "For the most part, this is a rather boring affair. Outside of some decent social commentary, there isn't a lot going for this movie.",
    "date": "2024-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie is a complete mess. The plot is incoherent, and 55 minutes in, you’re still left wondering what it's even about. The pacing drags painfully, with nothing to keep you engaged. It's frustrating and confusing, making it a waste of time. Definitely a skip.",
    "date": "2024-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Love the actor, hate the film.  Just a dreadful film at a slow pace.  Critics are pretending it's thought provoking.  It's not.",
    "date": "2024-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "A boring modern sci-fi.",
    "date": "2024-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Something about the police taking a bunch of people from their homes in the \"shithole\" is something that happens, but the movie doesn't explain anything about it, so I'm not sure what to think about that. All I can say is that the radio man was an irritation, so I applaud the cops for getting rid of him. Overall, 4.5/10.",
    "date": "2024-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The only likeable character is the main teen in it. His father is a loser and waste of space . Nothing really happens. The only thing I like about it is that it's a British film, filmed in London",
    "date": "2024-05-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Not for me, incredibly boring movie. Long winded, not much of a storyline. Very gangster like, you can predict the ending within the first 10 minutes.",
    "date": "2024-04-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie was honestly pretty intriguing most of the time. I'm impatient so there were parts that I felt I needed to skip through (only by 10-30 seconds) but I'd always go back to see facial expressions, or details that i may have missed, and whatnot. I think overall it was a well done film, the ending had me in tears which is saying something- I got attached to the characters as the storyline progressed.",
    "date": "2024-04-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Almost all of the critics' reviews were positive.  Did I watch the same movie they did?  I kept waiting for something else to happen - and it never did.  The movie just ended.  Can I have my hour and 48 minutes back?",
    "date": "2024-03-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "For all the near future stuff and all the sci-fi elements, it's a character drama",
    "date": "2024-03-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "If you want to see a epic movie. Then this one for you",
    "date": "2024-03-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very good moovi \nVery good moovi",
    "date": "2024-03-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Outstanding movies characters are  realistic",
    "date": "2024-03-20"
  }
]