[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "הסרט הכי טוב בעולם כול מי שכותב שזה סרט רע מקומו בקבר",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "You don’t have a sense of humour if you don’t like this movie",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "It's literally a cult classic, the Wayan brothers really managed to pull a typical buddy cop movie into a full blown comedy show along with the prosthetics they used to turn white lol",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I know that this movie isnt necessarily a fan favorite, but i would say it is my favorite movie. This isnt because of its amazing CGI, Camera quality, plot, no none of that, it is because i can go to it for a good laugh anytime i want. When i dont know what to watch, white chicks it is. No matter how many times i watch it i always laugh, and so do the people i watch it with. Just make sure you are at least 13 before you watch the movie, a good, corny, and stupid joke movie",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is ment to be silly, and I feel like most people are not understanding that. It's goofy, it's naughty, it's funny and relatable in a weird way. It's exaggerated and for me that makes it even funnier. This movie is my go to favourite comedy. I can never get tired of watching it. It's so stupid and I love it. Everything came together well and no scene is wasted or boring or just a filler. This was a very clever movie.",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Though White Chicks wasn’t warmly received when it first came out, it’s become a cult classic over time. If it had been released a decade later, I’m convinced it would have earned much higher ratings. In my view, this is the Wayans brothers’ strongest comedy.",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "stupid as hell. i LOVE it !!!!",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Classic comedy. Had a laugh and it will never get old. Not the best movie i watched but not the worst.",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Ok. It is a MASTERPIECE !!!!!!..... THE BEST COMEDY OF THE NEW MILLENIA",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "definitely a cult classic and now i know why!!! this movie was just fun from the very beginning, and in a way, it encapsulated perfectly the 2000s vibe that is so special to look back on now. a very quoted phrase or meme came up my screen every minute or so, and that says a lot about the impact this specific movie had in pop culture. it was simply fun, iconic and although highly unrealistic, very clever in terms of storytelling and execution! it was just what i had expected and more :)))",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's nothing much. Maybe not the funniest jokes, I had to turn off a few braincells while watching it to enjoy it. The toilet jokes were annoying, but sometimes I genuinely laughed, even tho it's better to laugh at bad films. It was cute, I will probably forget about watching it tomorrow, but maybe I'll even rewatch it. Could be worse, like scary movie.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Contemplem, isso é comédia.",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely hilarious and my favourite movie to watch when I’m down. Love it. It’s a must see",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "O melhor filme de comédia ja feito",
    "date": "2025-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "So funny! Absolutely love this movie.",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I watched this after an acquaintance described it as a \"hilarious cult classic.\" It's lowbrow garbage that will appeal to a certain demographic, but I couldn't make it past the 45-minute mark. I had low expectations of the Wayans brothers, but nothing could have prepared for how excruciatingly unfunny this was. Some movies can be enjoyed by simply switching your brain off for a while, but this requires that you remove it and boil it in acid before launching it into the sun. It's unrelentingly idiotic and crude, which can work when done well and with a degree of self-awareness, but there's only so much slapstick and toilet humour I can endure. It'll probably be enjoyed by 12-year-old boys or those with the minds of 12-year-old boys. If this is what Americans think is gut wrenchingly funny satire it explains a lot.",
    "date": "2025-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Hilarious, campy, and totally absurd. Mrs. Doubtfire is gonna have a BF about this film.",
    "date": "2025-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Cult classic, hilarious to watch anytime with the family!",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie and great cast",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Literally one of my all time favorite movies lol",
    "date": "2025-09-20"
  }
]