[
  {
    "user": "David Griffiths",
    "rating": 3.0,
    "text": "Brilliant film. A great animation for the whole family. A wonderful way to end the trilogy.",
    "date": "2024-10-29"
  },
  {
    "user": "JD Duran",
    "rating": null,
    "text": "Dreamworks may be best known for its Shrek series, but it’s How to Train Your Dragon that aligns them next to Pixar and Disney as creating some of the best animation to date.",
    "date": "2024-08-19"
  },
  {
    "user": "Brian Eggert",
    "rating": null,
    "text": "The Hidden World is easily the best-looking entry on visual terms, and the familiar plot and themes aren't so repetitive that the basic appeal of its boy-and-a-dog setup has lost its charm.",
    "date": null
  },
  {
    "user": "Britany Murphy",
    "rating": null,
    "text": "And although it's sad to know that this will be the final act in this journey, the ending is one that will certainly leave audiences with smiles on their faces.",
    "date": null
  },
  {
    "user": "Lonita Cook",
    "rating": null,
    "text": "It is a thrill ride... [The Hidden World] is beautifully done.",
    "date": null
  },
  {
    "user": "Nicholas Oon",
    "rating": null,
    "text": "You have all these photorealistic details in the background. If you like, you can see every grain of sand or every hair on the cheek of a character. It's just that realistic!",
    "date": null
  },
  {
    "user": "Kip Mooney",
    "rating": null,
    "text": "This is a spectacular finale for a special franchise.",
    "date": null
  },
  {
    "user": "Michael J. Casey",
    "rating": null,
    "text": "A satisfying conclusion to a delightful trilogy of films-not because the message at the heart of 'The Hidden World' rings true, but because DeBlois and company don't bludgeon the audience to death with it.",
    "date": null
  },
  {
    "user": "Cassidy Olsen",
    "rating": null,
    "text": "The film's logic is often unclear, and its insistence on some rather regressive jokes about marriage, sex and body type is disappointing and pedestrian, especially when compared to the comedy of the competing Lego Movie franchise.",
    "date": null
  },
  {
    "user": "Jesse Hassenger",
    "rating": null,
    "text": "Years may pass for these characters, but they aren't growing up alongside their audience.",
    "date": null
  },
  {
    "user": "Richard Crouse",
    "rating": null,
    "text": "Feels like a film that has grown along with its core audience. Determined to supply a satisfying end to the franchise it's a movie that pushes the boundaries of the series while still maintaining the soul that earned the fans in the first place.",
    "date": null
  },
  {
    "user": "Mike Massie",
    "rating": null,
    "text": "With a never-ending supply of anti-dragon warlords providing never-ending opportunities for battle, it's possible that this franchise can keep going indefinitely.",
    "date": null
  },
  {
    "user": "Richard Propes",
    "rating": null,
    "text": "It's difficult to describe the ways in which the How to Train Your Dragon films have immersed themselves in my life.",
    "date": null
  },
  {
    "user": "Andrew Gaudion",
    "rating": null,
    "text": "This final instalment confirms this franchise as DreamWorks finest (sorry Shrek, but it's true).",
    "date": null
  },
  {
    "user": "Matt Cipolla",
    "rating": null,
    "text": "Grimmel is little more than a bundle of tics, emblematic of the film's simplification of morals and motives into 'good,' 'bad,' and 'because.'",
    "date": null
  },
  {
    "user": "Yasser Medina",
    "rating": null,
    "text": "This third installment of 'How to Train Your Dragon' represents a successful conclusion to the trilogy. [Full review in Spanish]",
    "date": null
  },
  {
    "user": "Zehra Phelan",
    "rating": null,
    "text": "A fitting end to the much-loved series deliciously visual spectacular with an emotional arc of dog-like proportions.",
    "date": null
  },
  {
    "user": "Allen Almachar",
    "rating": null,
    "text": "It's thrilling, adventurous, and poignant in all the right ways. There may be more popular animated properties, but few have been as consistently good as this has been for nearly a decade.",
    "date": null
  },
  {
    "user": "Doug Walker",
    "rating": null,
    "text": "A few small problems that do start to add up, but still a strong finish to a great trilogy.",
    "date": null
  },
  {
    "user": "Damond Fudge",
    "rating": null,
    "text": "It's one of those rare feats of storytelling where you don't simply feel like you've been on the traditional 'hero's journey' with the characters. It's more like a life journey, where the characters feel as though they're part of your family.",
    "date": null
  }
]