[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Psycho Noah.  Watch it on a double bill with 'Unhinged'.",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "as a fantasy movie i guess it was ok, but MY GOD it resembles the facts not at all.  poetic licence is fine i giess but if u gonna tell a biblical story then tell it... not just use the framework to make a terrible parody!!",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Noah is Scam in this movie. Clearly these guys never read Genesis",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Horrible.  They wanted to take the title and biblical history of Noah to gain the Christian demographic/Market, but they also didn’t want to offend people who aren’t or don’t care about the Bible and Christianity.  AND they also didn’t think about or care if they offended Christians by making such drastic changes and departure from the actual biblical history. The result is a character and storyline so far removed from biblical history to gain and please the masses of non-Christian Movie-goers, but needed hold onto the person and title of “Noah” to  market to Christians whom they still hoped would pay for tickets - even if those Christians were led to believe they would be watching the biblical account of Noah - Which this definitely is not.",
    "date": "2025-05-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely underrated movie, most people watch it expecting it to be a christian movie, that's why they get frustrated; It is not biblically accurate nor it tries to be, it treats the christian mythology as hollywood has always treated others like the greek mythology. This is an absolutely astonishing drama and a very interesting iteration on the myth.",
    "date": "2025-04-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Absolutely pathetic lacking any substance or credibility!",
    "date": "2025-04-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was so hilarious! I was laughing though the entire thing! I loved the middle where Noah was walking around like Jason from Friday the 13th! even though it was not accurate to the bible I enjoyed it very much.",
    "date": "2025-04-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "When Hollywood takes the story of Noah and twists it for its own pleasure, it drowns.",
    "date": "2025-04-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "If anything, this film offers even more reason why this story is absolutely ridiculous. Way too long to even enjoy. The fact that people actually think this happened is mind blowing",
    "date": "2025-04-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It was jaw-droppingly awful (so much so that I continued to watch in disbelief AND googled afterward to see if I had somehow forgotten some disturbing facts from the original story.). I’m not sure what drugs the people who gave this a good rating were taking, but just “No”.  Great cast, but beyond that, just disturbing, dark, and dysmorphic.",
    "date": "2025-04-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Very, very dry, humorless movie. It was like a tranquilizer. It's obvious the actors all thought they'd win an Oscar from this. This is the darkest and most ridiculous version of an old fable.",
    "date": "2025-04-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Epic. stop factually comparing it to the one you know about, it is a MOVIE f g s .... and it is exceptionally well done. It will not be surpassed on any grounds, writing, cinematography, visual effects, cast interpretation and authenticity, mystery, supernatural, for what it really is. Extremely fascinating and keeps you wanting to see what happens next. Outstanding",
    "date": "2025-03-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Filme fraco, o roteiro é fraco, o elenco é Bom, mas ninguém ajudou a melhorar o filme, nem mesmo o Russel croww como Noé para salvar o filme, os personagens são fracos, a história é fraca e desinteressante, e as cenas são fracas e não tem nenhuma cena relevante para fazer o filme ser bom,",
    "date": "2025-03-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Could've been a great movie, the lead actor and good visuals had potential but failed in the execution. Goes from \"ok, I see what you did there\" to \"what the hell is going on here\" losing all sense and all the interest the viewer had originally. Could've been the key word here.",
    "date": "2025-02-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Darren Aronofsky’s Noah is an ambitious reimagining of the biblical story, blending warrior battles with theological myth. Russell Crowe delivers a gripping performance as the tormented Noah, while the film’s bold artistic choices—such as the Watchers, towering rock-like fallen angels—add a unique, though strange, fantasy element. The movie excels in its environmental themes and thought-provoking moral dilemmas but falters in pacing. While Noah is a daring and visually arresting take on the Genesis tale, its mix of blockbuster action and biblical storytelling with only impress a small margin of people.",
    "date": "2025-02-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Came upon this movie by accident flipping channels and saw a scene in some woods..., never heard of it.   Saw Russel Crowe and thought it was a Robin Hood sequel or something but then heard the Noah reference.\n\nFlipped it on to watch while doing a few things in the office.........  It was very watchable and enjoyable.  As a Christian and student of the Bible it was an interesting perspective and screen adaption.",
    "date": "2025-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Cumbrous in the extreme, the movie is almost as bad as the original source material. Sorry theists.",
    "date": "2024-12-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I thought it was a great film .\nObviously got it’s low rating by the unread and boring atheists carping on",
    "date": "2024-12-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Unbelievable, Incomprehensible and lackluster by any stretch of my over active imagination. Not worth 3 hours of my life and wish I could get it back. But I loved Russell Crowe in \"A Beautiful Mind\" and \"Gladiator\".",
    "date": "2024-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "He really couldn't please me\nFor me he could not get along in any of his proposals\nThis movie makes less sense than the Bible itself, and that seems difficult\nstoned film.\n\n\n\n\n\n4/10",
    "date": "2024-09-06"
  }
]