[
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "If you want to watch a plot the centers around a woman wanting sex and nothing else, this movie is for you. The writers totally ruined it. It was so fun at first, until they made this woman think and do nothing but want sex. This was clearly written by a man. There were some really fun moments and ideas that were all ruined by her obnoxious, overacted, over-the-top bedroom antics.",
    "date": "2025-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Funny, sometimes haha, sometimes peculiar. Toni Collette and Monica Bellucci makes it worthwhile, although their talent is hugely handicapped here. Silly at times and not really clean writing, but watchable. If you have a strange sense of humor, this will fit the bill. Enjoyed it in a type of uneasy way?, perhaps ...",
    "date": "2025-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I am a big fan of the mafia genre when it comes to movies. I knew this was a comedy and I did not have high expectations. I was wrong. I enjoyed this film. It was so funny that I found myself laughing out loud at some scenes. Toni Collette did a great job together with Monica Bellucci. I never imagined that I would have so much fun watching a comedy mafia flick. If you are up to date with you mafia movies, then this is a must watch for you.",
    "date": "2025-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It’s such an under-rated film, couldn’t believe the bad review it got.  The plot and the dialogues were so funny, Toni Colette’s performance was amazing, she’s effortlessly funny and her humor was on point.  The movie is reminiscent of the old Stephan Chow comedies.",
    "date": "2025-04-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "If you have had a few wines and are looking for something mind boggling simple, crass but still watchable then this is the movie. Why Toni Collette did this movie is a mystery and even she is guilty of appalling over-acting.",
    "date": "2025-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Certainly satirical as its prioritized business with little laughter, while Toni Collette embodies the underlyingly flawed adrift as the exchanges are banally shot down by a weak, stereotypical screenplay that exposes the obvious. (B-)",
    "date": "2025-01-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Toni Colette reminds me how watchable she is in this fun summer movie. It turns rom com on its head with absurdly violent vignettes and girl powers her way to empowered: just what every hard working mum aspires to. Reliable. Picturesque. Enjoyable. Pinkies up.",
    "date": "2024-12-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Definately more empowering woman quasi action film than a drama but I loved it. Haters pointing out inaccuracies. Please. Not the point.",
    "date": "2024-12-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Surprisingly bad. The scenery and sets made me want to look around the room or the scene more than watch the actors - one ultra-violent scene was so out-of-place over-the-top gory that it seemed completely out of synch with the otherwise light “comedy” of errors… it wasn’t funny enough to be a comedy, the acting wasn’t good enough to make it a good mafia movie - notably bad in almost every way. Also, we generally like Toni Collette.",
    "date": "2024-12-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Over the top acting and cheap sex jokes ruin what might have been a good story. I thought better of both Collette and Bellucci",
    "date": "2024-12-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I like it. It’s fun, frenetic and woman rage turns this lady & the family around.",
    "date": "2024-12-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Junk. Then more junk",
    "date": "2024-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Just terrible - worst movie in several years",
    "date": "2024-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very silly and fun. I can see why reviewers rated it as they did but I'm glad I didn't look at Rotten Tomatoes before we decided to watch it. Yes, it was ridiculous but Toni Colette and the actors held it down and we stayed till the end. If you're in need of comedic fun and don't mind an outlandish plot, watch it. I recommend it.",
    "date": "2024-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Toni is such a badass...just not in this movie.",
    "date": "2024-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "A complete waste of time and talent.  The protagonist is a European stereotype of an American and the film leans into it",
    "date": "2024-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I have a short list of very talented actresses who are just not my cup of tea (Elizabeth Perkins, Laura Linney, Angela Bassett) and, even though Toni Collette tops this list, I felt sorry for her for being in this caca doody film. She couldn't elevate this material in the least. Just BAD.",
    "date": "2024-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This is a good concept, however it didn’t quite come together and was sillier than I expected.  Everyone just kinda overacts and the film is overly gory for no reason.  2.5 stars",
    "date": "2024-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "\"MAFIA MAMMA\" struggles to find its comedic footing, delivering awkward and bizarre moments that fall flat. Despite attempts at humor, the film's disjointed narrative and lackluster execution left me unimpressed and disengaged. Overall, it fails to deliver the laughs and excitement promised.",
    "date": "2024-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A fun, charming comedy featuring the always great Toni Collette.",
    "date": "2024-03-27"
  }
]