[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This film reminded me of those old school fantasy adventure stories that you grow up with as a kid that is brought to life in the big screen. Good acting, simple storytelling, that provided an above average watch experience that will leave a positive memorable impression on younger viewers.",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1 hour and 54 minutes!!!!!!!!!!!! Rated PG-13 for Some Sensuality and Fantasy Action Violence!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $48,000,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved everything about this movie! Charlize Theron, again, played an excellent evil queen!",
    "date": "2025-04-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Would not call it an unnecessary sequel at all, it is entertainment people! Still an amazing and very capable cast, still epic cinematography. Enough twists and turns. Very very entertaining and just a joy to watch, more than once",
    "date": "2025-04-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The Huntsman: Winter's Wars fue una interesante propuesta para expandir el nuevo universo de Snow White usando esta vez como fuente uno de los cuentos de Hans Christian Andersen. Decidieron incluir a La Reina De Las Nieves como antagonista y fue algo bastante curioso debido a que para ese entonces se había desatado la fiebre por Frozen. Aunque La Reina De Las Nieves es uno de los mejores cuentos de Hans Christian Andersen y ha tenido adaptaciones en el cine y la televisión, su personaje no tuvo tanta popularidad hasta que fue adaptada por Disney en la película Frozen. La creación de Andersen reencarno como Elsa y se convirtió en todo un icono para las niñas de los años 2010. Los realizadores de esta secuela parece que estaban al tanto de la popularidad de Frozen y por eso se decidió incluir a La Reina De Las Nieves con un origen diferente y ahora conocida como Freya. Es muy fácil notar el parecido que hay entre Elsa y Freya, ya que ambas provienen de la misma fuente de origen. Lo único que las diferencia y la historia de origen. La Reina De Las Nieves nunca tuvo un origen como tal, por eso Disney invento una historia de origen para Elsa. El origen de Freya es mucho más trágico y a diferencia de Elsa, Freya toma un camino más oscuro que la vuelve la antagonista de la película.\n\nLos secuestros de niños que Freya lleva a cabo son una referencia al cuento original. En el cuento de Andersen, la reina secuestra a un niño llamado Kai y su amiga Gerba es la protagonista que emprende un viaje para rescatarlo. Es por medio de los secuestros que la película nos revela el origen de Eric y aquí pasa algo curioso que se siente como una contradicción a lo mencionado en la película anterior. En esta película conocemos a Sara a quien Eric había mencionado en la película anterior. Lo raro es que se había entendido anteriormente que Sara había muerto cuando Eric estaba en una batalla y que Finn fue quien la ejecuto. Esta película da una explicación diferente en la que Eric creyó a Sara muerta cuando intentaron huir del castillo de Freya. Esto es bastante confuso y la única justificación sería que Eric se habría casado con otra mujer también llamada Sara que sería la difunta esposa que se mencionó en la película anterior. Sería demasiado raro pensar que las mujeres con las que Eric estuvo tenían el mismo nombre. En esta película Eric y Sara serían los que ocuparían el rol de Kai y Gerba. Eric sería Gerba porque al igual que en el cuento, el amor de Eric hacia Sara es lo que lo hace seguir luchando aún tras descubrir la verdad sobre Sara. Sara en este caso sería Kai porque se mantiene fría hacia Eric creyendo que la ha abandonado, pero el amor de Eric la hace recapacitar. Así como el amor de Gerba es lo que rompe el hechizo de Kai, la película usa la idea del amor como el arma más poderosa del mundo.\n\nAquí la película ya plantea que el espejo mágico es un objeto maligno con fuerte vínculo hacia Ravenna, algo que se había hecho en Snow White: A Tale Of Terror. Aunque el espejo mágico no tiene origen, lo más probable es que en este universo su origen sea igual al del cuento de Andersen. En la versión original, el espejo es una creación del diablo mientras en otra versión se dice que el espejo fue creado por un poderoso hechicero. La hermandad entre Freya y Ravenna también es un guiño al cuento de Andersen porque este vincula los fragmentos del espejo con el hielo. Según el cuento, después de que el espejo se rompe, sus fragmentos se meten en las personas convirtiendo el corazón en hielo y los ojos en espejos. Esto se ve representado en Freya y Ravenna. El corazón de Freya se vuelve hielo tras perder a su bebe y sentirse traicionada por su amado. Ravenna se vuelve parte del espejo tras su muerte y ese espejo es lo que hace que Ravenna vea belleza en sus ruines actos.\n\nLo que vemos al inicio de la película es como fue que Ravenna consiguió el espejo mágico, pero no explican mucho sobre su relación con Freya más allá de que son hermanas. La película anterior jamás mencionó que Ravenna tuviera otro hermano aparte de Finn, pero aquí Ravenna confirma que Freya es de su linaje y que ambas tienen poderes que les fueron heredados. Lo más probable es que ambas son hermanas que fueron separadas y que de alguna manera se reencontraron. Finn no aparece en esta película, así que es seguro que Ravenna fue separada de él cuando era niña y años más tarde se reencontraron. Tomando en cuenta que en el cuento de Andersen es el espejo mágico lo que influye maldad en los ojos y frialdad en los corazones, lo más seguro es que el espejo haya estado de alguna manera involucrado en el origen de ambas hermanas y por eso tenían interés en él. Ravenna y Freya estaban interesadas en el espejo por algo más que solo su poder. Aunque el cuento no lo explica, La Reina De Las Nieves podría ser un producto de uno de los fragmentos del espejo al tener un corazón helado. La película no explica quienes fueron los padres de Ravenna y Freya o como se originó el espejo mágico, pero basado en lo que relata el prólogo del cuento de Andersen, es seguro que hay una posible conexión entre ellos.\n\nPara terminar, la película cumple bastante su función como una historia de fantasía. La producción, el vestuario, las actuaciones y los efectos digitales son muy prometedores. Chris Hemsworth, Emily Blunt y Charlize Theron son lo más cautivador del elenco. Puede que la ausencia de Snow White haya sido decepcionante y que la película se sienta como una secuela innecesaria, pero al menos quisieron ofrecer un universo interesante de cuentos tradicionales. The Huntsman: Winter's War es una buena película con algunas cosas que se podrían haber resuelto en más películas, pero que al menos se molestó en ofrecer un vistazo a otro cuento involucrado en este universo de Snow White y demostrar que era posiblemente un mundo bastante rico con más fábulas para contar. Mi calificación final para esta película es un 9/10.",
    "date": "2025-03-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It’s like Frozen, but on steroid's!❄️🥶💙🩵",
    "date": "2025-01-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Only worths watching just because of the CGI effects",
    "date": "2024-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "i loved Theron and Blunt story and acting carried",
    "date": "2024-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Pretty clear that most reviewers didn't get this movie as it's probably more clever than they anticipated. They probably wanted a simple action movie, however this is much more than that, focusing, like the first did to a lesser extent, on themes of different types of love and relationships set on a fantasy world with adventure, intrigue and action.",
    "date": "2024-06-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "To rate this movie as unnecessary and anything other than pure entertainment is to miss out. Not only did it bless us with an amazing cast, an epic soundtrack and beautiful effects, it also touched me deeply. It's not for everyone, I can imagine but loving fantasy and everything witch-like it was no surprise that I loved this. One of my favorite movies 👌🏼",
    "date": "2024-04-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I had high hopes when I saw the cast and was let down by the story and the fact that the action was a let down.",
    "date": "2024-01-31"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The Huntsman: Winter's War\" could be summed up as a frosty misstep in the world of fairy tale cinema. This Snow White-less sequel brings together a stellar cast, including Chris Hemsworth and Charlize Theron, but it's a classic case of not bringing their A-game to the table. The poor CGI leaves you longing for the enchanting visuals of the first installment.\n\nThe film's premise is decent, exploring the world beyond Snow White, but it's executed with all the finesse of a wrecking ball in a china shop. This unnecessary sequel feels like a low-budget production from the start, with a plot that's as cold as the movie's snowy landscapes. The unfunny jokes fall flat, making you yearn for the wit and charm of its predecessor.\n\nIn the end, \"The Huntsman: Winter's War\" is a chilly disappointment that leaves you pining for the warmth and magic of the original Snow White tale.",
    "date": "2023-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I thought it was a very good movie. There is always more to a story and this movie told you more of the Snow White story.",
    "date": "2023-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I think I watched this when it first came out and didn't understand how it relates to the first movie.  The second time, I appreciated it for its own value!  The effects are stunning!  The performances given are really good, and I loved the chemistry between Theron and Blunt as sisters!  Worth watching!",
    "date": "2023-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A mishmash of Frozen, Willow and the first Huntsman movie.  Clunky script, great costumes.  Get me rewrite!",
    "date": "2023-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I recently saw this movie when it was released on Netflix and I really liked it. Story was cool, actors were great and I thought the way everything came together was innovative! I don't get the ratings tbh.",
    "date": "2023-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Aside from Hemsworth trying to be Mel Gibson in Braveheart the entire movie, it wasn't terrible. It wasn't fantastic either but if you want to lose yourself in violent silliness for a bit under two hours, I'd recommend this movie.",
    "date": "2023-06-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "There were several moments that were so bad -- for example, they didn't make sense -- they were laughable. Also, some of the dialogue is head-scratching. Further, the special effects were poor for a film of this magnitude. I wonder why Universal Studios didn't invest more into them. Despite those items, the few good elements of the film are incredible.",
    "date": "2023-05-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "3 & 1/4 stars.  Never saw a combination prequel and sequel until this movie.  Very clever as it did as advertised with beautiful costumes, great cast, and striking cinematography.  I usually don't like fantasy, but this was a winner.",
    "date": "2023-02-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It's beautifully made.. Costumes are to die for, CGI is done well.. But the movie itself, well, it should never have been made.. Loss of talent for those who did it right.",
    "date": "2023-02-18"
  }
]