[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Really liked it, not sure what's with the over the top bad reviews, probably politically driven.\n\nI loved how Gina shows how vulnerable Claire is but also how strong she is (has to be). Acting wasn't bad, as some comments say, but it wasn't mainstream either. I think it showed some realness that many populair movies don't have.\nOverall a good watch and I was quite invested in the characters.",
    "date": "2024-12-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Tiresome, clichéd, with annoying music and bad cinematography. Wash your hair instead.",
    "date": "2024-12-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I'm so happy I watched this movie rather then not watch it  based on what people were saying about it because they don't like Gina Corano. This movie was action packed and it havld a great story line. I've wated 3xs this week already. It's a fun movie .",
    "date": "2024-12-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I’m glad I did not read any reviews before I watched this movie or I probably would not have watched it. I liked the movie . Those who gave a bad review has missed the main point. A mother fighting to get her son back and will stop at nothing to complete the job! Use your own judgment but I’m glad I watched it!",
    "date": "2024-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The acting is laughable.  The way the movie begins feels out of sync and you just don't have the ability to even care about the characters.   I cared so little I quit watching 10 minutes into it which was a generous waste of my time.  I love how the main character wears false eyelashes to her son's drop off/exchange.",
    "date": "2024-04-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Pretty awful,  1.5 hours of my life I won't get back.  If the lead was a military specialist I don't know what in , but she wouldn't have made the marines, maybe she was a cook or bottle washer.\nI wouldn't waste your time.",
    "date": "2024-02-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Pathetic excuse of a movie. Don't even bother. Each of these words is a waste of my life.",
    "date": "2024-02-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie is so boring with Pathetic 4th Rate acting. So predictable with little to no real action. Quite sure when she ran the rednecks off the road she was in a different vehicle from the one she arrived in. She did something truly amazing, picking up two shotgun cartridges off the floor of the vehicle she was driving, this was such fantasy making a scene like this. I would rather watch paint dry than watch a movie like this, all I could suffer was about 5.20 minutes.",
    "date": "2024-01-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "It started out very average, but impressively it actually managed to get worse towards the end. Really bad acting.. very predictable. Would not recommend!",
    "date": "2023-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Pretty awful plot. Could easily have been quite a good story but they took the weak, stupid option every time.",
    "date": "2023-06-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's an ok film, nothing special, but an easy watch. The wolf dynamic was interesting. It seems the wolf saw the main female lead as an alpha.",
    "date": "2023-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I normally come to TubiTV for B grade SciFi but I saw Gina Carano was in this movie so I though I'd give it a go. Fleshed out characters with back stories and genuine motivations for their actions. It has been a while where I didn't just skip the talking to get back to the action. More movies like this please.",
    "date": "2022-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I enjoy Gina Carano as an action movie star, but the script in this film is downright messy and unrealistic to the standards of Gina Carano.",
    "date": "2022-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Special Effects: 0,5/Sound Effects: 0,0/Acting: 0,0/Story: 0,0",
    "date": "2022-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Minha opinião: Um filme cheio de remorso do passado. E o mais rancoroso é Richard que por causa disso sequestra o neto um ex-amigo e quando ele morre. Mas oque ele não conhece é a mãe que e Gina, e ira buscar seu filho mesmo que seja no inferno. E vai matando um a um. Mesmo sendo lançada de um penhasco. Um filme onde Gina não mostra todo seu potencial de Fight, uma pena. Mas oque ela mais tem é um santo forte, pois tudo ocorre para que alcance seu objetivo.\nRoteiro: mentiroso\nVale apena assistir? Se não tiver outra opção. \nNota: 4",
    "date": "2022-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Whata hell the interetion with the woman and the Wolves?",
    "date": "2022-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Bleh, was not entertaining on any level. Sometimes something like this can be an amusing watch to pass the time but this movies does not rise to that level.\n\nShame to see an accomplished actor like Richard Dreyfuss in something like this",
    "date": "2022-04-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Pitiful movie. Silly plot with unbelievable sequence of events. The scenery was beautiful however. This could have been a far better movie.",
    "date": "2022-03-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A shame to see Richard Dreyfus, who I have enjoyed in so many movies, finish the last chapter of his career in this movie.  Not sure why this movie was made.  Had zero redeeming qualities.",
    "date": "2022-02-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This was confusing, in that more time was spent developing the bad guy, than the hero. Lots of holes in this film.",
    "date": "2022-01-17"
  }
]