[
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Like a typical Roland Emmerich (Moon 44, Godzilla) disaster movie; the script is overlong, characters that are generic to stereotypes and sometimes laughable science but the solid ensemble cast, great set pieces and impressive special effects make it a decent thriller",
    "date": "2025-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-09-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Ludicrous, idiotic plot but some good special effects",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What can I say? I love disaster movies. Sue me.",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love movies like this! - Movies that conjure up feelings of fear and sadness, yet, thrill-seeking and perseverance.  It excites the senses!  What it does not do, is motivate one to embrace “climate change” and invest emotionally / monetarily into “solutions” to this inevitable and unstoppable phenomenon.  Sure, climate change / global warming exists- but is there anything we can do about it?  The answer is an emphatic “hell no”.  Hypothetically, if everyone on the planet (6 billion+) were to dramatically reduce their carbon footprint, Planet Earth would still erode.  Reducing their carbon footprint may slow this erosion, but the results would be negligible.  This is because God has other plans.  For this planet WILL die off with or without our input.  God knows what he’s doing 😉.",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "If you ignore the science in this movie, it was enjoyable.",
    "date": "2025-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Very underrated movie, in my opinion. Storyline was good. It may not be real or factual, but you have to remember it’s a movie = supposed to entertain its audience.",
    "date": "2025-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Watching this in 2025 on blu ray and oled tv. I can’t help but wonder if this was kinda prescient although the real changes are happening much slower of course. Political figures ignoring the science. Check. Funny watching the Mexican government block US people fleeing into mexico for safety. Won’t be so easy now if Trump finishes his wall. Walls keep things out but can also be a prison for those inside. \nPretty looking picture. Good cast. Environmental fx were good. Great sound lots of lfe noise of the storms. Enjoyable if feeling a little too real for comfort. Maybe that’s the point…",
    "date": "2025-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Although the end of the movie is a bit slower than the first half for me. Everything from the tsunamis to the tornados was great. One of the best Roland Emerich disaster movies. Highly recommend a watch.",
    "date": "2025-05-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This has to be one of my favorite apocalypse movies of all time. The story was intriguing, the visuals were amazing, and the characters were written really well. I definitely recommend it for sci-fi fans!",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Special Effects: 0,5/Sound Effects: 0,5/Acting: 0,5/Story: 0,5",
    "date": "2025-05-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Un film catastrophe sympa à regarder un dimanche après-midi quand on s'ennuit.",
    "date": "2025-04-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "More entertaining than it has any right to be, but, like all Roland Emmerich disaster flicks, it's best to stop watching after the second act.",
    "date": "2025-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is chef's kiss! The very best of environmental apocalypse, human relationships, cause/effect + hope. Disregard the bad CG wolves, the rest is a perfect marriage of tension/social justice/environmental justice/love stories/future possibilities. Press \"play\" any time you see it available!",
    "date": "2025-02-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The day after tomorrow is good but there is some issues I noticed. the ending felt rushed but the effects were amazing for 2004. Boat scene added nothing to the polt and everything good happens at the mid point tornados and a flood. in conclusion a good disaster movie but bad ending",
    "date": "2025-02-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Highly underrated. Great special effects, story is not unbelievable, some great actors. Perfect disaster movie.",
    "date": "2025-02-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Pay attention all you film fans this is movie is a life lesson on climate change it presents it with realism and courage and it does well combining it with an unpredictable plot of Dennis quaid and others wanting to help survive and/or evacuate the ice age era and it interesting how Jake gyllenhall a great actor he is is with friends caught in the disaster. Don’t be deceived by the errors in science because as long as there is involving drama/ dramatic tension and suspense just like in that of a Hitchcock movie then this movie is not predictable and that it sparks 🧨 your interest and attention after all it’s not like some typical mindless blockbuster it had intelligence such as the charachters being serious and the acting as mature. And where the interactions between these charachters are compelling and have development and motivations you get invested in how gyllenhall has a relationship with his father and they reconcile as well as the plot line of him and Emmy Rossum ( she was also in that awful remake Poseidon and she is way better here and making a better teen love interest here with gyllenhall than whoever she was in love with in that awful remake. ) this is a perfect movie to watch on a snowy stormy day in winter and this film should be shown in schools during science classes on climate change emmerich is like the real school teacher here. It’s thought provoking with it musical score and scenes that happen in the film. Emmerich is a True filmmaking god hope he wins an Oscar one day. And they say this or 2012 are the mother of disaster movies and i agree as a result how can it be bad when it is the ultimate disaster movie as it’s not an ordinary one because of how it happened around the world everywhere it’s more of an apocalypse disaster. We have enough human emotion here along with hearfelt moments towards the end like that father and son reunion this is a really good movie and emmerich should be proud of himself I would easily give this a perfect ten if it weren’t for the science errors like the climate change happening fast but outside of that this film needs love and praise for its suspense, drama, plot, and tension it  has along with emotion and human touch it’s an absolute must see for those reasons ⛈️🌊❄️🌨️🌎",
    "date": "2025-02-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "people who are looking for a great story and characters, this movie is not for you. But, if you like intense sequences that leave you on the edge of your seat, you will love this movie.",
    "date": "2025-02-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It was kinda a good that's all.",
    "date": "2025-02-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This is so ridiculous bad that is fun dumb disaster movie about climate change and the characters are really we don't care we just hear for destruction.",
    "date": "2025-01-28"
  }
]