[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A movie that doesn't pull any punches. It outright impales your soul, forcing you to think about humanity's place in this world, and how insignificant we really are. The tutor, a very angry 100ft spermwhale.",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Ahhhh the incredible era of super bad cgi, the story is not even immersive, also in the 21st century i don't think most people like to see whales being hunted, cgi or not, this movie add everything to fail from the start.",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Freaking awesome true story.",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Based on a true story.  Visually, the movie could have benefitted from less use of CGI, which was mediocre.  Cinematography could have been better. Some of the deleted scenes should have been left in the movie, and would have added more depth to character development, particularly for Captain Pollard.  Overall a good movie from Ron Howard.",
    "date": "2025-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Thoroughly recommend.\nMust see if you enjoyed Moby Dick.\n\nCall Me Ishmael.",
    "date": "2025-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I believe this movie received undue criticism. While it's not the best movie based on true events, it's far from the worst. The movie is solidly crafted, boasting an inspired sea-faring aesthetic. As the story unfolds, the escalating trials endured by the sailors become increasingly dire yet undeniably gripping.",
    "date": "2025-05-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's alright all around. It's a pretty standard stuff honestly for a sea faring adventure. Chris Hemsworth isn't bad and for sure the best thing. The other crew members are all pretty forgettable, don't have much character, and thus it really doesn't resonate when they die off. The all sort of blend in and that's saying a lot given Murphy and Holland are in this. The music is pretty forgettable too and at best just your standard adventure stuff. Not really catchy but not terrible. The cinematography is the biggest problem. It ain't that good man. This is overloaded with way too much CGI in it and it's so noticeable. Than other times it's dark, dull, and lifeless. The whale is fully CGI too. There's nothing really tangible in any of the sea action scenes and it's really noticeable because most of this movie is on water. Everything else is ok though. It makes sense and is pretty standard lost at sea type of stuff. It feels like though when we hit those key beats of a story like this we bounce around to pointless interactions with the side crew that doesn't really add up to anything and drags things out. If you take any of those things out nothing much changes. This needed a much more tangible production, better direction, and better side characters. Just stick with Moby Dick and skip this.",
    "date": "2025-03-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "My husband and I watch this one on a whim the other night and thoroughly enjoyed it. So many movies these days reuse ideas and setting over and over, so it was refreshing to see something I've never seen before. I've never thought about the whaling industry in the 1800s, but was fascinated by that world and the people for whom it was reality. The movie took on some really dark themes without being overly heavy, which I really appreciated. I'm shocked by the negative reviews, but can only think it's because people were expecting Moby Dick. This movie is not about Moby Dick. It's the real-life story of the whaling ship that was sunk by a whale and the fight for survival that ensued. I thought the acting and visuals were both stellar. Loved it.",
    "date": "2025-03-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing movie! Love the story and the effects !\nTotally worth it",
    "date": "2025-03-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Started off well, but kept descending into darkness. A totally unpleasant experience to watch.",
    "date": "2025-02-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Have been reading Moby-Dick and Melville and that era of writers; and while I never saw this when it opened I passed because it looked too Hollywood.  So when I finally decided to watch it to complement the reading, I confirmed I was right.  For one, all the star-power involved and the at-times over-emotive American acting. Nantucket looks like a set, actors look just got in from the makeup trailer.  The lighting at times looks fake, and of course they had to use a lot of CGI to simulate whale-hunting.  That being said, it does at times bring you into the grip of the action - some scenes do feel realistic and I imagine viewing on a big screen would be entertaining.  At 2 hours it isn't going to claim much of your life.  While there is some character crisis in the movie, they aren't explored enough; it can be difficult to pull off with multiple characters, so what are we supposed to identify with?  The Nickerson character as old man drinking the rest of his life away, reflecting on his wide-eyed greenhorn boyish self?  Or the manly Owen Chase?  His is the man leaving family behind trope, doing what he knows; circumstances lead him into some spiritual questioning of their trade, but it isn't too deep.  You can almost guess the next line of dialogue or story beat.   The poster with the great whale eye pretty much says what it's about for the theater-goer; and so didn't generate so much interest.  An action film about whale-hunting.  A limited series with photography that feels more realistic and gritty (Master and Commander set the bar for this genre), and perhaps an actor with some gravitas and writing that can deliver something more than typical class struggle melodrama, could deliver what this story and era deserves.  Melville's novel about Whaling is complex and multi-layered and explores almost every corner of history, society, America, character, psychology, legend, and narration.",
    "date": "2025-02-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I encountered the movie on Netflix by chance.  It looked good as advertised and had some well-known actors, so we went ahead and watched it, really not knowing what to expect or what the movie is about.  More often than not these days, that turns into a few hours wasted on a movie not worth watching.  This one was, however, and so much so!  The visuals are fantastic.  Old Nantucket, the boat, the whales, the sea: it all looks remarkably real.  The life at sea and its challenges for these men was vividly brought to life.  The movie first focuses on the tension between the captain and first mate, then on the encounter of the dreadful whale, and finally the survival ( and non-survival ) story after that.  I was gripped by the movie, the story telling and the characters from beginning to end.  Afterwards, I read up on the real life events shown.   I have no idea why people seem to be so down on the movie.  Perhaps my advantage was that I really didn’t know what was to unfold.  Anyways,  fantastic movie, and a surprise find that evening.  Go watch it!",
    "date": "2025-01-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Not close to the book, which is fantastic.  Book starts off with a whale boat being discovered in the sea with a few men in the boat sucking the marrow from the bones of their shipmates.",
    "date": "2025-01-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "It is based, quite accurately, on a true story. I was captivated by that and that it actually lead to Melville writing Moby Dick, which is only loosely connected to it.\nBrendan Gleeson, Chris Hemsworth, and Cillian Murphy were very good in a nice script, well-directed by Ron Howard, whose movies always give me pleasure and occasionally a tear or two. I found it moving and engaging.",
    "date": "2025-01-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Interesting, but the actors did not reach their full potentials, and it never quite grips you.",
    "date": "2025-01-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A great adaptation of a true story...worth a watch",
    "date": "2025-01-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I read the novel In The Heart of the Sea when it came out 24 years ago. The book was excellent. I resisted watching this movie as there is no way the movie could capture the narrative of the story. I watched the movie today and I was correct. The movie however is pretty good overall as a stand alone prospect, but lacks the depth of the suffering they endured.",
    "date": "2025-01-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Has Ron Howard ever made a good movie?",
    "date": "2025-01-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "An epic version of the Moby Dick tale. Solid performances by everyone involved.",
    "date": "2025-01-09"
  }
]