[
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I have to assume that most of the reviewers are equally insane as the protagonist. This is supposedly a serious, deep movie that shows us that a girl of about twenty who spent two years in a cultish community, is not aware anymore, after she escapes , that you don’t swim naked in a public body of water, neither you enter your sister’s bedroom and lie next to them while she is having sex with her husband. Elizabeth Olsen is beautiful and plays her miserable role well, but the whole enterprise is misguided and a waste of everyone’s time.",
    "date": "2025-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Deprogramming ain't no easy thing. Neither is making a satisfying ending, I guess.",
    "date": "2025-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I was upset by the cat being killed. Also by the man who was killed after promising he wouldn’t call the police. Olsen is a good actor. The ending was awful for me. They were being followed on their way to a psychiatric institute; then the movie ended. \n\nFrom my perspective, I feel my emotions were toyed with; I was lured into caring, twisted into anxiety, with no resolution. It’s as though the movie ended at its climax, its peak of tension, with my hoping she, Marcy May, could get help.\n\nToo many plot strings unraveled, leaving me hanging. Gratuitous violence and sex aren’t appealing to me. If there had been some kind of ending, then I could have been far more satisfied. As it was, watching this movie wasn’t worth the emotional effort I expended, hoping she could survive, and perhaps one day, thrive. Also, her sister could have realized very soon after picking her up, Martha needed counseling, “debriefing.”  But I thought Martha’s sister did try very hard to help her.",
    "date": "2025-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Buena película de drama sobre el tema de traumas, soledad y como un culto se aprovecha de ello. Lamentablemente es de esas a ritmo lento que no es para todo el mundo, además de que el final me resulto decepcionante.",
    "date": "2025-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not everyone's cup of tea!",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Garbage. Anyone who gives this a high rating is sniffing their own farts .",
    "date": "2025-05-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "the cult Martha belongs to literally destroys her psychosis and the film really plays on the psychological damage of it all Elizabeth Olsen gives an outstanding performance as a damaged, young woman who tries to escape her past but just can't break free from the scars for me this movie took a long while to get interesting and again there's no music plus the fact that this is non-linear storytelling; half the plot is told in flashbacks to get an idea of what happened to her I love Sara Paulson, too as the caring, affectionate sister who tries to repair her the acting is really good here another amazing character piece that puts Martha in a harsh position of not knowing what to do and where to go when all is lost and lastly, no real ending it just stops",
    "date": "2025-02-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Good movie overall, the only really frustrating thing was how dismissive the sister and husband were to the main character, like it was painfully obvious this girl has been abused or in a not good situation but it's overlooked a frustrating amount of times. It's unrealistic that they didn't notice that. I think if the movie went to a direction of the sister and husband getting her help, it would have been a lot better, instead of just frustrating.",
    "date": "2025-01-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The sister and her husband are so un-likeable. They can't manage to be compassionate for a clearly abusive situation for even 24 hours, let alone 2 weeks? I know you're supposed to believe there's an escalation that makes the situation untenable, but even the stair scene is so unbelievable. None of the husband's or sister's reactions makes sense to a person with common sense. Borderline idiot plot. The only redeeming factor is Elizabeth Olsen's acting, which is always amazing. It's one of those movies where it's fine to watch but in retrospect just doesn't make sense.",
    "date": "2024-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Could be confusing for some; the structure is unique, a bit different, and it isn’t really necessary for anything other than to cover up the fact that this film only pretends to have some deeper meaning without explaining what that meaning is and leaving it purely speculatory.  Started giving me a headache about forty-five minutes in and, except for a couple blips here and there, it became pointless and meaningless for me from that point on.  Very stupid ending stays instep with the pointlessness of everything else.  I guess the moral of the story is - don’t join anyone’s homesteader commune.",
    "date": "2024-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love movies that have me googling stuff after watching them: the story, the actors, the reviews. This was one of those movies for me.",
    "date": "2024-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Much like Vagabond, this is the tragic saga of a young, very spirited and strange woman who doesn't fit in...Anywhere in society...And who in many ways pays the ultimate price.... And so this girl, Martha, is caught in the crosshairs of two oppressive ways of life; and two separate societies...  And both Paulson and Oleson are outstanding in this show...Particularly Oleson; who plays a very angry, wounded tigress here... Completely unique, very volatile, and also very vulnerable... This compelling character study and thriller is definitely worth your time.",
    "date": "2024-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Film critics delight! Truly a waste of time - DONT BOTHER!",
    "date": "2024-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This haunting psycho-drama about someone's sense of belonging, and the psychological trauma inflicted within cults, stands out due to the performances of Hawkes & Olsen. A fine feature length debut as director for Sean Durkin.",
    "date": "2024-02-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "\"Martha Marcy May Marlene\"  most monotonous movie making me mad missing mispent minutes !!!!!!",
    "date": "2024-01-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "According to prominent deprogrammer Rick Alan Ross, Martha Marcy May Marlene is the film which most accurately portrays real world cults and the psychological effects they have on their members, and this is what attracted me to the story. We often sees cult movies sensationalising and playing up how abusive they are, but here much of it is done subtly, even quietly, and it actually make it a lot more affecting. The lead, played by Olsen in her big screen debut, is made to feel like part of a family, treated kindly and given encouragement. You can pick out all the tactics cults use to draw in and brainwash their followers, and while you can see moments of doubt in her eyes, she is clearly still one of the family, for lack of a better term. I liked how her time during and after her cult life is spliced together, allowing us to see how the events of the past 2 years are shaping her current state of mind. It doesn't have her acting hysterically or screaming at everybody or running round the house in a panic. She's shown having trouble in social situations, not understanding manners and etiquette and rebelling when her beliefs are being contradicted. None of us like the idea of being manipulated, especially by those who claim to be our friends or family, and the notion that it can be done so easily and so insidiously is what makes the story and its concept so genuinely unsettling, and its so convincing largely because Olsen sells it so well. If you have any interest in cults and the psychology behind them, then Martha Marcy May Marlene is a film that can fairly be called essential viewing.",
    "date": "2023-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The best filmmaking debut ever from Sean Durkin!",
    "date": "2022-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This is really quite a dark and murky film - its sombre and unsettling. There are many flashbacks shown, which give you an idea as to what happened to Martha while she was a member of the cult. There are plenty of things which aren't clarified, so as a viewer we have to come to our own conclusions about certain things. Its both dark in terms of tone and also lighting wise at times. \n\nThere's a juxtaposition present, with scenes showing Martha in the present day, with reaquainted parents and friends, trying to act normal again, while we know there were some dark things she had to escape from, trauma she's forced to keep. I found it quite frustrating watching the parents struggle to deal with their daughters new personality. Its a sobering watch, a well made film that I'd recommend, if your ok with it being a grim film.",
    "date": "2022-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Watched the entire movie, dragged, repetitive.\nThe ending was annoying and unfinished .\nLike the director just walked off set and forgot to come back .",
    "date": "2022-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This movie doesn't really launch after establishing the characters and tension. Strong performances.",
    "date": "2022-07-23"
  }
]