[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "LOVE THIS ❤️ yes that is true",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I hate this movie, I can't explain why but I just hate it",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "\"Smurfs: The Lost Village\" may not have been a masterpiece, but it is definitely a worthy final contribution from Sony Pictures Animation to the \"Smurfs\" franchise. It's definitely one of my favourite animated movies as a child.",
    "date": "2025-09-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Smurfs the lost Village was such a good conclusion to the Smurfs series following the main character Smurfette find it out that there are more Smurfs out there and trying to find them but Papa Smurf restricts them from going but that doesn't stop Smurfette from going and you have Gargamel looking for them too and he some how start to use Smurfette to find them so he can capture them and the other Smurfs too",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "how is this on Disney+",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Está película creo que es mucho mejor que las otras con su encanto de animación y todo es buena para un 4.5",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The reason why I watched Smurfs: The Lost Village when I was 11 because this is the best CGI animation ever, but some scenes are scared like Garagamel capturing Smurfs at Smurfy Grove. I love the voices and quotes such as Trust us, he's a goner or Well, I know 4 Smurfs who have some explaining to do. I love the movie ending called I'm a Lady after Smurfette revives. I can't stop listening to that until am out of high school.",
    "date": "2025-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Since this film came out in 2017 I watched it recently in 2025 boy it was very fun perfect for the whole family",
    "date": "2025-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is AMAZING GUYS",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "bad story but how much fun I had with the characters and scenes idc",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Smurfs: The Lost Village wasn’t that great for me. The animation looks good, sure, but the story feels way too simple and mostly for little kids. Everything happens super fast, and the jokes aren’t that funny — kind of silly, actually. The characters don’t really have depth, and the whole “new village” idea seemed cool at first, but they didn’t really do much with it. Honestly, it’s a forgettable movie. If you’ve seen the older ones, this one just feels like more of the same, but weaker.",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "At least it’s not live action",
    "date": "2025-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Isso definitivamente não é os Smurfs, acabou no live action, foi um dos piores filmes desse ano sem dúvida",
    "date": "2025-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The only non terrible smurfs movie",
    "date": "2025-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is the only good smurfs movie we had.",
    "date": "2025-05-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "LOL, 1 hour and 31 minutes of humor!!!!!!!!!!!!!!!!!!!!!!! Rated PG For Some Mild Action, and Rude Humor!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $45,000,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!! Now attractions in Florida, California, and Tokyo!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This is a huge nostalgic fav of mine",
    "date": "2025-05-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Even though I haven’t seen this film in theaters when it first came out back in April 7, 2017 I have recently watched it last month 2025 in March. I have to say it’s kind of a good Smurfs movie. I’m very excited for the new one, even though people saying it looks trash, but I think it will do well",
    "date": "2025-04-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Unlike the others Smurfs films, Sony's animated feature Smurfs: The Lost Village follows the new adventures of Smurfette, Brainy, Hefty and Clumsy. With new characters and a lot of detail and humor, Smurfs: The Lost Village is an absolute must-watch for the whole family.",
    "date": "2025-02-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Only reviewing this because of the upcoming 2025 Smurfs. No joke, I forgot nearly everything about this movie an hour after I watched it. It was literally that forgettable.",
    "date": "2025-02-25"
  }
]