[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Minions is a really funny animated movie with lots of funny parts, a good villain and cast.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Minions are goofy in a very good way",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It was okay to me I loved it as a kid cause I saw it in the theatre but now today it just seems werid to watch it",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It’s just dumb entertainment and nothing else, but it gets too much hate",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Loved seeing the London set and the antics improve as the film progresses. Not overlong which helps. It’s not a bad watch but hardly noteworthy. Watched on DVD.",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Very funny movie, but not a good story. The villain in this one was super weak but still cool.",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I Personally enjoyed this movie. I honestly don't see why the ratings are not at the highest rating. its an absolute masterpiece and an nestolgic one of a kind",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "yall hatin ts was fire",
    "date": "2025-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "If I would give it 0 stars, I would. Minions is the WORST mainsteam animated movie ever made. I can't even keep a clear story to save it's life. There is nothing in this movie to enjoy whatsoever. Somehow, this is even worse than Hop (2011). At least Hop, as atrocious as it is, tried to tell a decent story. It failed miserbly, but at least it tried. Minions did not try to tell a good story at all. All it tried to do was make as much money at possible. At it succeded. You just can't have a movie starring yellow tater tots who can't even speak a human language. IT DOESEN'T WORK! 0/10. DON'T WATCH AT ANY COST!",
    "date": "2025-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Ho da sempre odiato questo film, lo trovo insulso e stupido da non far ridere.",
    "date": "2025-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "In my top 5 fav movies",
    "date": "2025-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I thought this was completely fine. Nothing special, but still had the minion charm I was expecting.",
    "date": "2025-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Showing a flashback of despicable me is just good the story line how the minions got to gru and how whre they made the perfect",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's good, but it doesn't live up to the hype.",
    "date": "2025-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Pode ser um pouco besta e inferior devido a proposta dos Minions basicamente serem um alívio cômico, mas este filme marcou minha infância e é relativamente divertido",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "“I think it’s a really good movie to watch with the family. It brings a valuable lesson for families. You can watch it more than once, and it will bring the same joy and excitement every time, because it’s very entertaining and you don’t get bored easily\nDanna reina 1001",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "\"I like it but not alot, I don't like it\" - Gru",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Minion go adventure to evil boss so yeah uhhhhhhhh",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The Minions is a fun movie that shows how they always look for someone to help. Even if they make many jokes and problems, they teach that working together and being friends is important.",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Juanita Rondon \nThe Minions is a very funny and entertaining movie that made me laugh from beginning to end. I really liked it because the characters are hilarious, mischievous, and always getting into trouble. The minions, with their silly language and clumsy but lovable behavior, are unique and super original.\n\nWhat I liked the most is that, even though they don’t speak a real language, you can understand everything they mean. Their facial expressions, gestures, and actions are so exaggerated and comical that it’s impossible not to laugh. Also, the story is simple but fun: the minions are looking for the most evil villain to serve, but everything always goes wrong, which makes the situations even funnier and crazier.",
    "date": "2025-07-15"
  }
]