[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This film made me lose faith in Rotten Tomatoes. Slow, cringeworthy, and obsessing in detail about absolutely nothing. It was genuinely painful to watch the cops pretend to be Sherlock Holmes.",
    "date": "2025-02-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A deep look into a bandit's life who lived in a time ahead of his actual era. Whole mission was to paint this notorious criminal in a different shade that's not seen by many. In any reality theft is severely damaging but looking at Scott's behavior, his approach and his giving back signs us towards a rebellious side of the character. He engaged in a chaotic, unbeatable battle with a behemoth that most people can't even look at, much less yell at. So this reunion of both sides to narrate explicitly how Hollywood's story went down is greatly entertaining. Excellent visuals and footage. Makes this documentary well worth the time.",
    "date": "2025-01-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was addicting to watch. Scott is a unique and interesting person and this documentary really made me like/dislike him.",
    "date": "2024-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "How To Rob A Bank - 9/10. Finally, a Netflix doc that offers up a great retelling and explanation to the events that are covered in great (and entertaining detail). As a huge Oceans film fan, this was a fun and cool watch. I’m fascinated with the idea of a bank robber. Why do these individuals do the things they do? Why do they want to rob? Is it for ego, or for another purpose? This is a fascinating documentary which chronicles a famous robber and how that robber terrorized the city of Seattle. The interviews are actually interesting, and the retelling and chronicling of this robber leaves you interested and intrigued with how the robber did what they did. The doc also offers up a very interesting portrait about the robber themselves. The robber has such an interesting back story, and you see why and how they ended up being so successful at what they did to get their money. This could’ve easily been a movie, but I liked the way they crafted together this doc! Solid work!",
    "date": "2024-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Enjoyed! Fascinating with great scene to scene movement.  With today’s technology this guy would have been in the news much earlier.",
    "date": "2024-10-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The documentary was of special interest to me because Scott and I both loved the same girl and even had a brief confrontation over her. I've actuallly been in the tree house and it was much larger and more interesting than any documentary could show. You had to climb up a twenty foot rope ladder to get to the first floor! Overall the documentary was well done and worth seeing.",
    "date": "2024-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Not too bad. One of the FBI guys needs to be careful,  he is gonna break his arm patting himself on the back.",
    "date": "2024-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Just mildly entertaining",
    "date": "2024-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Leaves alot unexplored. The cartoon parts are a nice touch but not enough to save this doco from turning into a slog to get through.",
    "date": "2024-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "While the documentary was well done, I am much more interested in a much deeper look into the pathology of Scott Scurlock rather than just the real crime story.",
    "date": "2024-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This documentary about an enigmatic bank robber is so entertaining and beautify interspersed with such aesthetic animations.",
    "date": "2024-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great bank robbery documentary in Seatle in the 90s. Loved the use of cartoon in it. Very interesting. Loved it!",
    "date": "2024-06-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Straight forward and uninspired documentary about a string of bank robberies in the 1990s throughout Seattle, WA area, told mostly through interviews and animations.",
    "date": "2024-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "As with everything in life, we are only privy to approximately 20% of what we see in any given experience. Surely the remaining 80% has compelling untold facts that would make an amazing movie. How to Rob a Bank does not vary from any other experience in life. This documentary was outstandingly produced, the music is also amazing, but again, we are only getting about 20% of the facts here.\n\nThe lead FBI Special Agent on the case, Shawn Johnson, epitomizes the quality of agents the FBI used to have in its prime. His interviews and compassionate comments show regard for human life, including the bank robbers, unlike that of other members of the task force. The comment that stands out particularly is that Agent Johnson indicated that there was always another day to catch \"Hollywood\". The Seattle cop who was also interviewed for this show seemed like he preferred blood over justice. Isn't pride one of the seven deadly sins? Not a quality I would want in an officer.\n\nIf you really pay attention to how things played out, you would understand that the investigation took 4 years because of the skill of Hollywood and his accomplices. This does not in any way diminish the immense skill of the FBI agents or other individuals involved in this case, who were also handling all other bank robberies in Seattle (which they indicated was about 1 a day on average). If I remember correctly, it was said in the documentary that Agent Johnson actually accurately predicted (based on facts, evidence, and pure skill) where Hollywood was going to rob next. It seems that the Hollywood robberies would have continued indefinitely if not for his level of competence.\n\nMark Biggins and Steve Meyers, Hollywood's accomplices, appeared to have integrity, compassion and remorse for their actions. I disagree with other reviews stating that Scott (Hollywood) is being glorified. This documentary takes a deep dive into the psyche of Scott and what lead him down this dark path. Mark and Steve did their time, completed their debt to society, and specifically state that they are remorseful for the harm their actions caused to others. This doesn't seem like a group of people who are proud of the harm they caused (unlike the cop).\n\nThis story has so many layers and so much information that it would be impossible to condense 4 years of investigation, all of the facts and information to accurately and completely be represented in 90 minutes. Even so, the directors and producers were still able to create quite a detailed and immersive storyline. The reenactments fitting in seamlessly with the animation storyboards was such an interesting and seemingly effortless effect.\n\nI will definitely be recommending this to others. It was far more accurate than the FBI files or the Ann Rule book which I watched/read years ago. It was nice to clear up some details that seemed questionable in those.",
    "date": "2024-06-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It’s definitely worth a watch I found it very interesting and informative, I like it.",
    "date": "2024-06-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "In a world where True Crime documentaries is a genre, this story will captivate you from beginning to end.",
    "date": "2024-06-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is one of the best documentaries I’ve seen and is gripping from the start. I enjoyed the use of story boards to tell portions of this tale and the old film clips. The characters were intriguing and complex. It’s an excellent film and I hate to say too much or I’ll give some of it away.",
    "date": "2024-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A unique story of a troubled man in 90s Seattle. The real life footage and raw style helped convey the subject’s state of mind in a way that felt authentic and true. The emotional aftermath felt by family and friends will leave you in tears. Definitely recommend.",
    "date": "2024-06-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Really well done documentary -- the story telling/animations/editing/filming etc is all top class. Very lucky to know someone who worked on this and so in awe of the final product.",
    "date": "2024-06-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Good overall movie love the drawings and animation very beautiful to show the way he died",
    "date": "2024-06-07"
  }
]