[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Ruth and Boaz was a great movie. Tyler and Serayah did a great job with the acting. I really enjoyed the soundtrack as well. I would love to see a part two. I would definitely recommend this movie.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The plot is right out of the Bible’s story of Ruth and has religious messages. I guess with all the bad news about our country’s demise I needed a romance with a positive ending.",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It was a cute movie but the love story is rushed. There wasn’t enough there for me to truly root for the characters.",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very sweet! I would watch it again.",
    "date": "2025-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Ruth & Boaz is a great movie that delivers as intended.  It will have your emotions go from holding back tears, to talking to the screen and then the warmth of the sweetness of love.  Great job cast and crew.",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I found the story line somewhat interesting, however, it was very cookie cutter.  The was the good person who made some bad choices and when that person wanted to change found that they were actually indebted to some evil sources. So, a typical run away from bad to a better lace thinking the past was behind but only to find the past locate her and come to claim what was thought to be his.  Confrontation between the good guy and bad guy…..etc.  This is what made the movie rather boring.  Good actors and pleasing scenery does not a solid movie make.  It reminded me of a Hallmark movie and I think that says enough.",
    "date": "2025-10-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "cringey. corny. predictable. this is a high budget tubi movie. i’m not even christian and can clearly see this is a mockery of there faith. tyler perry movies used to be entertaining dramedys and now are just cringe 😬",
    "date": "2025-10-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "In one word: trite. What a waste of talents.",
    "date": "2025-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "i've watched movies for close to 25 years of my life and this is the first movie i enjoyed and was moved enough by to find the means to post feedback and thank the team that bought this together, as a non-Christian i was able to feel and appreciate the essence of the heart of this movie and was so moved by it, it gave me hope! well done everyone that worked on this piece <3",
    "date": "2025-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Beautiful, modern retelling of the story of Ruth. The acting, production value, cinematography etc is as good as any made for television movie. Enjoyable for romanic hearts who love, love stories, people familiar with the story in history and audiences who like to see something pure and untainted being offered on tv.",
    "date": "2025-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's watchable and a simple movie to pass the time but that's kinda it.  You may find your eyes rolling to heaven at some of the questionable dialogue. The characters are rigid, and you cannot feel any connection between them. There's a lot missing from this to make it a good movie. Even the songs didn't hit. The lyrics were clunky. Decent but meh",
    "date": "2025-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A modern take on the Book of Ruth from the Bible. Good adaption for these times.",
    "date": "2025-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent family. I enjoyed the modernization of the story. It is not a huge block buster, but it is an enjoyable film. Sit back relax and have a real Netfix and Chill night.",
    "date": "2025-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Movie was trash the girl couldn't act it seems like it was just put together at the last minute",
    "date": "2025-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Review: https://wp.me/p65txm-hL2",
    "date": "2025-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The movie should have been called something else and not Boaz and Ruth. The movie was not bad but it wasn't good. Because I know the biblical love story of Ruth and Boaz this movie did not give it justice.",
    "date": "2025-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I thought the movie was great.  There are too many critical movie watchers out there.  Lighten up.  Sure, some creative liberty was taken but the gist of the story of Ruth & Boaz comes across.  It's somewhat difficult to take an experience that is over 2000 years old from a completely different culture and modernize it without completely losing the relevance of the story.  I think the writers and actors did an amazing job bringing a modern look at a historical story.",
    "date": "2025-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The movie was just ok. It took the power out the story and made it just another regular love story. Nothing about it felt redeeming. I felt the movie didn’t capture the heart of what the scripture says. It should not have been called Ruth and Boaz maybe inspired by with and boaz but nothing like the real story or the hood version of Ruth and boaz told by the streets or something lol I would definitely not watch again. Was disappointed!",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved it! I thought it was well written.\nThe main characters did an awesome job.",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Very casual acting. No stakes or real conflict from Ruth or Boaz. I couldn’t tell if Ruth liked Boaz and couldn’t tell if Boaz really liked her either. The dialog was weak and didn’t deal with the issues in a real human experience way. The relationships were not shown strong. No chemistry between Ruth and Boaz. It felt like a boundary was up from both sides. This is why as a viewer I felt nothing. Sure they all looked great. But that does nothing for my heart strings. It felt forced and rushed all the way through. I didn’t feel like Ruth was in a real commitment to her boyfriend in the beginning or cared for Naomi. The way the screenwriter presented their relationship, didn’t tell it. I was confused why Ruth went with Naomi because they didnt appear close enough for her to just go with her and let alone it didn’t show at all that she wanted to care for her. The writer presented it like she just want to get out a bad music deal. It seem like producers were more focused on the looks of the actors to tell a visually pretty love story.",
    "date": "2025-09-28"
  }
]