[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I watched this movie and it was the funniest movie I have watched in 2025 after all is a 2017 movie. In my opinion its just a fun movie filled with good jokes and a surprisingly great chemistry between Dwayne Johnson and Zac Efron.\n\nDefinitively worth a watch if you are looking too have a laugh.",
    "date": "2025-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Laughed my ass off. Jokes are golden. I was very hesitant to see this and it took over 8 yrs to watch it and I'm glad I did. Anyone who says it's terrible clearly doesn't Like entertainment.",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I know the movie is a bit stupid, but I love it, I enjoy it a lot every time I watch it again.",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Lots of immature humor.  Not much else",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Baywatch is dumb, poorly written and features bad characters. It's not very funny either and at times it looks really cheap. It's watchable thanks to the cast but overall not very good.",
    "date": "2025-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 56 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated R for Graphic Nudity, Crude Sexual Content and Language Throughout!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $58,000,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I like this movie. It really feels like \"Baywatch\".",
    "date": "2025-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love this movie; it's a laugh-out-loud movie, and the women are fantastically well-matched, with great looks. Zac and The Rock are in fantastic shape. The rest of the movie fits perfectly into the overall picture. There could be a sequel.\n\nA movie to end the evening on a light note and de-stress :)\n\nI absolutely love this movie. It's a \"light\" movie to laugh at and watch something fun and light :), the actors and actresses are superbly chosen :)\n\nI'm definitely looking forward to the next installments.\n\nI'd like to add that Zac's performance was perfect, plus his physique is perfect.",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A true Baywatch muscle and curves promotion....LOL",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "made it 30 minutes thru the movie then saw that unbelievably horrible CGI during the Boat fire scene. THAT IS GOD AWFULY DONE. how do u have a budget to afford Dwayne Johnson and cant pay someone who knows what they are doing in special effects",
    "date": "2025-03-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Please make it stop",
    "date": "2025-03-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "this was so stupid but why did i like it. the sexualization of all characters, regardless of gender, was refreshing but some of the scenes (e.g., that weird dance-off scene with the dizzy camera work) dragged on for too long.",
    "date": "2025-03-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I liked the movie and how it teaches that you can do your part to bring justice",
    "date": "2025-02-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Wasn’t awful but by all means is not fantastic",
    "date": "2025-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "LOL!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2024-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It is what it is and it was funny. 🤷🏻‍♂️",
    "date": "2024-12-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It's not funny, and I'm honestly just sick of seeing the rock in movies.",
    "date": "2024-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "One of the worst film I have seen. What was it about? Have Baywatch half crime film.",
    "date": "2024-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Baywatch is brilliant movie",
    "date": "2024-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "What a colossal waste of time.  Corny with childlike humour and some x-rated scenes, this pokes fun at the original tv show and has a story line of lifeguard cop wannabe.",
    "date": "2024-10-26"
  }
]