[
  {
    "user": "Don Shanahan",
    "rating": 5.0,
    "text": "Between that life lesson of choosing kindness and many invaluable others, the film's buoyant messages are the moving jolt of empathy this generation needs.",
    "date": "2022-06-26"
  },
  {
    "user": "Joe Lipsett",
    "rating": 2.0,
    "text": "While the film's success has shone an important light on disability, the casting controversies, inability to let Auggie be a real person and inspiration porn messaging verge on insufferable. Wonder desperately wants you to cry. I did not.",
    "date": "2022-06-03"
  },
  {
    "user": "Matt Brunson",
    "rating": null,
    "text": "For a picture that begs to be drowned in sentimental syrup, Wonder feels emotionally honest rather than willfully manipulative.",
    "date": "2021-09-01"
  },
  {
    "user": "Hosea Rupprecht",
    "rating": null,
    "text": "Wonder shows just how superficial some differences can be and the wonderful things that can happen between people when we get past those differences to get to know each other...",
    "date": null
  },
  {
    "user": "Richard Propes",
    "rating": null,
    "text": "Kudos to Stephen Chbosky for stepping back and allowing Julia Roberts to breathe life into the role of Isabel.",
    "date": null
  },
  {
    "user": "Andrew Gaudion",
    "rating": null,
    "text": "Take your partner, take your Mum, take your Dad, Grandparent, sibling, whoever; just make sure that to see it with someone that you love.",
    "date": null
  },
  {
    "user": "Zehra Phelan",
    "rating": null,
    "text": "Manipulates the tear ducts and the heartstrings with a choking effect with a lack of investment into its supporting characters diluting the inoffensive script of any edgy nuance.",
    "date": null
  },
  {
    "user": "Matt Cipolla",
    "rating": null,
    "text": "It knows that kids are aware of the adult world -- or at least how they perceive it -- and how pop culture influences their conversations and actions.",
    "date": null
  },
  {
    "user": "Steven Prokopy",
    "rating": null,
    "text": "Sometimes you're simply powerless to resist being emotionally manipulated by truly good film about compassion.",
    "date": null
  },
  {
    "user": "Peter Gray",
    "rating": null,
    "text": "A conventional story at its core, but one heavy on heart all the same, Wonder utilises its assets and winds up being a far stronger film than one may be expecting",
    "date": null
  },
  {
    "user": "Sarah Knight Adamson",
    "rating": null,
    "text": "You will shed a tear or two, as this inspirational story tugs at all the right heartstrings.",
    "date": null
  },
  {
    "user": "Linda and Al Lerner",
    "rating": null,
    "text": "This is a good holiday film for the family.",
    "date": null
  },
  {
    "user": "Kate Rodger",
    "rating": null,
    "text": "A faithful adaption of an excellent book delivered with a welcome gentle restraint.",
    "date": null
  },
  {
    "user": "Udita Jhunjhunwala",
    "rating": null,
    "text": "Wonder is a sentimental family film. While it's not devoid of clichés, these are offset by solid performances and a winsome, uplifting story told with tenderness.",
    "date": null
  },
  {
    "user": "Karl Delossantos",
    "rating": null,
    "text": "I don't want to say that if you didn't like Wonder, then you don't have a heart. But this is really one of those movies that can cheer anyone's day up.",
    "date": null
  },
  {
    "user": "Lara Ben-Ameur",
    "rating": null,
    "text": "The fragmented narrative providing several points of view of the same event helps to approach different sensations. [Full Review in Spanish]",
    "date": null
  },
  {
    "user": "Mattie Lucas",
    "rating": null,
    "text": "This could easily have been a cloying and sappy film, but it is a testament to Chbosky's skill as a director and screenwriter that it isn't.",
    "date": null
  },
  {
    "user": "Kaitlyn Booth",
    "rating": null,
    "text": "Wonder is one of those movies that's supposed to make you cry and feel good, but it lets you get there organically instead of being too heavy-handed.",
    "date": null
  },
  {
    "user": "Jason Escamilla",
    "rating": null,
    "text": "Charming and eye-opening to how difficult it is for adolescents who are different feel as they go throughout their lives.",
    "date": null
  },
  {
    "user": "Rachel Wagner",
    "rating": null,
    "text": "In the end, the film was just too vanilla with a plucky kid that was more self-absorbed than wonderful.",
    "date": null
  }
]