[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Very cute and family friendly. Me and my family enjoyed this movie",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I hate Mondays.. and I think this came out on that day...",
    "date": "2025-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Actual slop movie that goes by at 3 ads/second",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I had high hopes for this, I love Garfield and thought the animation looked great, but as a movie it ain’t so great…",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 41 minutes!!!!!!!!!!!!!!!! Rated PG for Mild Thematic Elements and Action/Peril!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Filmed in 2024 in color!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Based on the long-running comic strip by Jim Davis, who loves all pets equally!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Garfield Movie is funny but not one of my favorite animated movies.",
    "date": "2025-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Very disappointed, I'm a big Garfield fan and really was looking forward to this. The movie just falls flat on its premise though, I feel like Garfield is portrayed out of character, they try to make you sympathize with Garfield's dad but it just falls flat, though I honestly don't think Garfield really can work as a movie, cause Garfield's whole character is that he's lazy, but for a movie you have to actually make him do something. You know it's bad when jon is the most enjoyable character in this movie, give us the Jon Arbuckle movie please, though honestly I didn't really mind Chris pratt's performance, I thought he did decent with what he was given",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I generally thought it was pretty funny",
    "date": "2025-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie. Very engaging and funny. Bring it back.",
    "date": "2025-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "loved the movie Garfield is a classic and the movie did it justice.",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "My kids love it and I also enjoyed it. It's Not supposed to be some deep epic movie. I think the critics are too hard on it looking for some kind of nostalgia for adults instead of taking something old and turn into a new adventure.",
    "date": "2025-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Definitely a butchered film. Chris Pratt is, once again, the worst casting choice. There is no effort to sound like Garfield. Just like his performance in the Super Mario Bros movie, it's the worst thing about the movie. The other aspects are also very mediocre. The jokes are rarely funny and the other characters seem very flat and boring. A waste of film and time",
    "date": "2025-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "“The Garfield Movie”, with a great cast, is funny and emotional, making it a good choice to watch.",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was one of the best movies I've seen all year. Every character was funny, the jokes hit everytime and Garfield is still a grouch (but a softy inside). The only big difference I noticed from the original comics is that Odie is now insanely talented, but honestly I think that works better than him just being a mindless tool for Garfield to push around. I stayed away from this movie because of the critics, but I regret that decision. Watch this movie!",
    "date": "2025-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "it Was Alright Just Not As Good As The Garfield Show.",
    "date": "2025-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie brought back childhood memories!…I LOVE Garfield!…",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Dang I guess Rotten tomato critics are the new Yelp reviewers yall gotta get a life 😂🤣 this movie was fantastic and that’s coming from a near thirty year old who grew up on all the classic cartoons from Garfield to cow and chicken to Ren and Stimpy. Y’all are some real sad miserable human beings you probably ate up all those Disney remakes even the train wreck that was Snow White! I came on here just to see because I knew it would be bad , literally nothing lives up to yalls standards\n, you’re douchey pretentious snobs , this movie rocked and my toddler loved it , just because it’s a remake god forbid it be recognized as good, yall do realize that the Garfield yall grew up on was a remake , the first Garfield’s adaptation came out in 1976 in a comic and the first cartoon in 88.. The one we grew up on wasn’t even the original , it’s been remade so many times!! Also here’s something that’s really gonna have yall shat your pants , just because it came first doesn’t mean it was the best version..😁 Yall are no better than the paparazzi, rockstars that do insurance commercials,  or that person that works at a call center hammering you with calls to use their gutter services , you sold out for your dishonest fabricated review. A",
    "date": "2025-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This Movie is Underrated for me at least the Mondays and then the dark tone of Lactose Farms is such a balance for the movie! even though there are some lame thingies like the horrible products which should never be in a movie and a few generic feels but, overall an fun ride with a very Garfield Emotional connection  10.5/10!",
    "date": "2025-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "That Was A Good Movie Ready For The Sequel",
    "date": "2025-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Garfield's origin story, of sorts. Pratt couldn't make this thing fun, though. Was like a full belly of bad lasagna.",
    "date": "2025-07-08"
  }
]