[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a great film.  Fast paced and well acted.  It is not perfect but I have watched this film more times than I can remember.  It is a good evenings entertainment.",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very underrated movie. Fast paced, excellent effects/sound, solid cast, and tells the griping story from the perspective of the GRS soldiers. At the end of this ride, it will leave you questioning some of your beliefs.",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "“13 Hours: The Secret Soldiers of Benghazi” delivers phenomenal acting and incredible intensity, with action that keeps you on the edge of your seat. The score heightens the experience, and the true story is told in a powerful, compelling way. Overall, it stands out as a favorite and a masterpiece. At its core, the film carries a meaningful message about fulfilling your call to be a warrior until the end—an enriching and transformative reminder of courage and sacrifice.",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Going into 13 Hours, I wasn’t expecting more than a run-of-the-mill war/action movie. However, I was pleasantly surprised and ended up really enjoying this film.\nWhat really helps this movie stand out is its core group of protagonists. They’re lively, entertaining, and you genuinely want to see them make it through the ordeal. Michael Bay knows how to shoot action scenes—he always has, even during his Transformers days—and he really gets a chance to shine here.\nThe film may lose points for those who care about historical accuracy. Personally, that kind of thing doesn’t bother me, but I understand it could be a dealbreaker for some viewers. I also recognize that action movies aren’t everyone’s cup of tea. If you're not into this genre, 13 Hours probably won’t change your mind. But if you enjoy action films, you’ll absolutely love this one.",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fantastic movie with at least three of the main characters in real life actually acting as consultant.",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great and amazing film that keeps you on the edge\nOf your seat",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Started slow but got really good and moving by then end. Made me angry at Hillary Clinton.",
    "date": "2025-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Putting politics aside this really is a great movie start to finish. You fall in love with the characters and you will feel like you're right there in the fight with them\n\n Not a full 5 stars because Michael Bay once again goes overboard with his love of pyrotechnics.",
    "date": "2025-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Another movie that reinforces not to pay attention to the critics scores at all. Great Movie from start to finish. Action packed, pacing was excellent, good cast, good character development. Totally invested in the characters and the outcome.  Loved it.",
    "date": "2025-06-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best war films I've seen. Thrilling. 👏💜🫶",
    "date": "2025-05-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I enjoyed every minute.   15 year air force vet.  Best experience ever.",
    "date": "2025-04-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Ces films qui retracent des évènements vrais sont toujours très puissant à regarder.",
    "date": "2025-04-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Love how the self absorbed critics (all Clinton voters) couldn't bring themselves to admit that it was a great movie and had to highbrow this thinking their words still hold any sway with the public. They got ratioed",
    "date": "2025-03-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "awesome movie specially during the time of a dangerous war",
    "date": "2025-03-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Every critic who rated this movie rotten voted for Hillary Clinton.\n\nSeriously…read the critic reviews and make up your own damn mind.",
    "date": "2025-03-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "VERY fast full of action movie and fun direction by M. Bay, once again. Even when at many moments we get lost between places and characters (I guess it blends in with the topic that everybody is lost and confused even within the movie).\nOn the other hand, the drama was a bit exaggerated and watching Krasinski trying to cry felt like watching Tropic Thunder. Also, the whole ''why are we far from home fighting again in a battle that's not ours'' catharsis, was simply answered with ''money'' in their case (They make it clear at the beginning with the whole jobs back home not paying enough).\nAll in all, nothing unpredictable but good entertainment for more than 2 hours.",
    "date": "2025-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's a Michael Bay movie so don't expect too much depth or nuance. Hollywood demands lots of bombs and bullets and endless body count. It's very possible to make a movie that's exiting and thrilling and still accurate and patriotic.  This is not such a movie. It's just cliche and typical Bay.",
    "date": "2025-02-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "13 Hours is a great action movie.  The all star cast does an incredible job to make the storyline come alive.  The fact that this is based on a true story is mind blowing.",
    "date": "2025-02-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Fair action and some decent visuals. Bafflingly over-saturated, making everyone look like ruddy alcoholics. 2.5hrs is excruciating for a movie where the only character development is trite zoom calls. Hilarious that they expect us to root for Blackwater goons.",
    "date": "2025-02-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The story, the way it was filmed and depiction of war overall is great, it made me glued to the screen. The characters are pretty cliche, classic army brotherhood style, it's not an innacurate depiction or too over the top but not very original either. All in all it's a solid 7.5/10 and definitely worth a watch.",
    "date": "2025-02-08"
  }
]