[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I was deciding between 1/2 star or 1 star. It seems like a good movie at first. Just skip to the end of the movie, it sums up everything. No plot twist, no drama, just nothing.",
    "date": "2024-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Awful. It's like stepping back into a poorly developed 1990's movie with bad camerawork, really bad acting, and a story that seems to be lacking any real writing",
    "date": "2024-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Cringey movie, poor acting. Definitely waste of time.",
    "date": "2024-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The film has plenty of issues, with much of it suffering from weak direction and acting, but the flashback scene where Dayo remembers his daughter’s death is outstandingly executed. If the whole movie were like that scene, it could be considered a masterpiece.",
    "date": "2024-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Absolute mickey mouse of a film wasted an hour 30",
    "date": "2024-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "By far the worst film I’ve watched this year if I could give it a minus score I would… \n\nIt’s interesting some one compared this to a student film, having been a film student I can honestly say this is worse!\n\nActing is all over the place and quite cringe to be honest. \n\nThe sound clips in several places becoming distorted \n\nThe editing cuts seems to speed up and slow down for no apparent reason and is quite jarring at times. \n\nI hope Netflix got this for free because this is shockingly bad!",
    "date": "2024-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Should win all the Razzie Awards",
    "date": "2024-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "i just wondering it’s a great action movie but hm im so disappointed with their acting and so on huhu",
    "date": "2024-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Coming From An Aviation Geek When They Make These Movies They Need To Use Aircraft Specific To The Time Period The Airliner Used In This Movie Was A 747 - 8 Intercontinental \nThat aircraft was not even built until 2012 that time period would have been a 747 - 200 case and point Air Force One Was Brand New In 1993 And It Was A 747 - 200 NOT A 747 - 8\n\nRuins the whole movie not using period specific airliners at least for aviation geeks ‼️",
    "date": "2024-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This feels like a movie made by students for an assignment. I couldn't finish it.",
    "date": "2024-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I watched the news when this event happened but apart from that didn't know much about it.  Reading other reviews I agree that some of the acting was a bit poor but found that more fitting and authentic in this film... these were real people as opposed to plastic 'actors' from the usual Z-list",
    "date": "2024-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Badly acted..boring storyline...give thus one a speedy fly by",
    "date": "2024-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Very poor. Acting amdram standard, pacing awkward. Should have baled after 20mins but the remote was out of reach.",
    "date": "2024-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "If you are looking to watch rubbish, watch this.",
    "date": "2024-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "it is absolute garbage. Nobody should watch it.",
    "date": "2024-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "As someone unfamiliar with the motive or backstory of the 1993 hijacking, the film left me with more questions than answers. The storyline felt confusing at times, and the inconsistent emotions displayed by some of the lead actors only added to the disjointed feel. The unconvincing accents didn’t help either.",
    "date": "2024-10-25"
  }
]