[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Personally, it’s my favorite movie of the trilogy. It has more action, it’s the most tense, and it’s the one that scared me the most out of the three",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Story about two spoiled, inconsiderate kids that are solely responsible for hundreds of people being massacred. Joining forces with a Benadict Arnold in a completely stupid, non realistic adventure escaping the U.S. military and numerous mobs of zombies. Terrible, repetitive, disgraceful movie just plain stupid.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I think this was my favorite one. Mainly because of the soundtrack and overall story. I don't feel like watching 28 Years Later.",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A decent zombie film that ultimately falls short due to weak storytelling. Unlike the first installment, this sequel struggles with character development. It fails to build a compelling dynamic among the protagonists or tie their arcs to a larger thematic idea, which was one of the strengths of the original. The film actually hints at potential with one character having a promising internal struggle that could have grounded the story emotionally, but he’s pushed aside in favor of following another group in basic \"survival mode.\"\n\nAs a result, we’re expected to care about characters simply because we spend time with them, not because the film meaningfully defines who they are or what makes them worth rooting for. When they make big decisions, the motivations feel thin. On top of that, the plot relies on contrivances and coincidences that strain believability and exist mostly to keep the story moving.\n\nTonally, the movie is relentlessly bleak. It lacks the spark, hope, or emotional core that gave the first film its resonance. The descent from bad to worse feels more punishing than purposeful.\n\nWhat does work are the technical elements: cinematography, sound design, score, editing, makeup, and special effects all elevate the tension and atmosphere. The horror elements are stronger and more frightening than in the original, and the larger-scale action sequences add entertainment value.\n\nOverall, it’s a film that excels technically but falters narratively. I’m not sure I’d recommend it on its own merits, but if someone wants to watch the full series, it’s not weak enough to skip.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Meh eh kill em all the usual motif",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "One of the best openings in zombie movie history. Keeps your attention the rest of the film even with half an hour of down time.",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The sequel to 28 Days Later takes place just over six months after the events of the original, following the efforts of United States-led NATO forces to reestablish a safe zone in London. However, when two young siblings break protocol to retrieve a photograph of their mother, they inadvertently trigger the reintroduction of the rage virus into the supposedly secure area.\n\nIt is a gripping and tense follow-up that, while not as groundbreaking as its predecessor, still captures the bleak intensity and core ideas of the original. The film delivers plenty of thrilling action sequences and a well-constructed escape that keeps viewers engaged, even if the ending makes it all feel somewhat futile. However, the story leans too heavily on the reckless actions of the children, whose poor decisions drive most of the chaos. Some plot choices also feel questionable—particularly the implausible absence of security in key moments and the father, Don, conveniently showing up wherever the kids are. Despite its flaws, 28 Weeks Later remains an entertaining and visually striking apocalyptic thriller that effectively sustains the franchise’s haunting atmosphere.",
    "date": "2025-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Embora careça do peso narrativo e da profundidade humana do seu antecessor, \"Extermínio 2\" entrega mais uma boa dose de terror frenético, atmosfera imersiva e zumbis assustadoramente insanos, descontrolados e implacáveis.",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Bastantes sin sentidos a lo largo de la trama, momentos \"dramáticos\" que lo único que provocan al verla es el preguntarse, ¿porque los personajes en la película toman siempre la peores decisiones posibles?.\nMe siento decepcionado porque es un gran retroceso a lo que fue 28 días después.",
    "date": "2025-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Recommend this movie if you have insomnia, it's so boring and uninspired I'd rather watch slow drying paint settle,",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Ok not my favorite had some moments tho",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Alright then, I Watch it 28 Weeks Later, When I Was Pre Teen, Before I'm Becoming Teenager",
    "date": "2025-10-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Ramping up the intensity and scale of 28 Days Later and while not as good as the original the stacked cast and solid direction make it an good but not great follow up",
    "date": "2025-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A step up from the previous movie.",
    "date": "2025-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The budget on the all star cast should have been repurposed for a better director and cinematographer.  Poorly written, directed, and executed.  Some of worst action sequence ever filmed.  It is a money grab sequel and it shows.",
    "date": "2025-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Cheezy and infuriating. Just stop walking around and screwing everything up, kid.",
    "date": "2025-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Watched in 2025 before watching 28 years later and was thoroughly impressed! Great plot which remained interesting throughout with a nice mix of scare/gore and storyline. There are a few plot holes-ish like the zombie entering the supposed safe quarantine zone but honestly didn’t think too much of it when watching the movie because it was all so gripping. If you haven’t watched any of the films and feel maybe the original is slightly too old deffo recommend. Excited now to see 28 years later and also makes me want to check out the original.",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It was ok. To me I didn’t like that it was a genetic thing that kept them fine and for years they don’t go into it.",
    "date": "2025-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I didn’t like this movie, the first was better & that’s not saying much. The writing and acting here was subpar. Hoping the newest one is better..",
    "date": "2025-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Just as entertaining as its prequel, 28 Weeks Later delivers equally tense scenes and characters as the first in the series. Rather predictable, the film does a mediocre job establishing and fostering the deep relationships between its characters, leaving the spotlight for only a select few. The supporting characters could have had more depth, something that differentiates the first from the second.",
    "date": "2025-09-24"
  }
]