[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I didnt even make it through the first 5 minutes of this movie with my kids because right off the bat because they decided it would be okay to appropriate christainity by making the three wise men into women. The bible is God's inspired word, not inspiration for your women's equal representation crap. This has got to stop, you will not instill your lack of respect for the bible in our children.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I really like this movie. I thought the humor that while somewhat juvenile was delivered well and it had a lot of heart.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A classic Christmas cartoon",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Desenho:\tAquele NAtal\t#aqueleNatal\t\tAssistido: 18-11-2\nModelo: #natal #desenho #emocionante\nDuração: 1h 32m\tAno: 2024\nMinha opinião: Que desenho maravilhoso, tocante, que construção da estória. É um desenho mas a estória é muito adulta, faz refletir e emocionar. Coloca a estória de crianças alguns dias antes do Natal, fazendo uma construção de cada personagens, cada um com suas qualidades e limitações. Colocam os adultos em um segundo plano. Conta a estória da professora que todos tem medo, mas tem seus traumas e o garoto que tem seus pais divorciaram e se sente só no dia do Natal, depois que o pai havia prometido estar junto, mas não veio. E de duas irmãs gêmeas que uma é vista como toda certinha e outra ovelha negra. Até que chega o dia do Natal o PApai Noel tem vários desafios. A colocação do Papai Noel se torna em segundo plano aqui. MAs de forma muito inteligente. Onde temos a estória do garoto sozinho e sua professora, das duas irmãs gêmeas e do grupo de crianças que estão em uma casa sem adultos que estão presos na Kombi, depois do acidente. Desde a superação do garoto e entender o amor a sua mãe. Da irmã e os pais compreender a intenção da outra filha, que sempre foi de proteção. E de as crianças poderem extravasar a criatividade e transformar do limão uma limonada. E ao final fechar com desaparecimento da irmãzinha e toda a cidade se unir para encontra-la. E ter um final feliz.\nVale apena assistir?: Parabéns!!!!!! Chorei de emoção, várias vezes. Tocante. Simples e perfeito. \nTraz o Espirito Natalino na essência.\nNota: 10",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Surprisingly funny yet heartwarming. I think the runtime of the film is perfect and the little jokes fit right in without losing the 'christmas magic'",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely loved that movie. 9999/10000",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Decent cast cant save this from being self indulgent swill. Neither funny nor charming.",
    "date": "2025-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is absolute amazing. You must watch it. This movie is can be in top 10 animation list. So good for wathcşng with whole family. Some scenes will make you cry and some scenes will make your day good. Animation quality, characters and story is very very good. You don’t bored anyway. This movie must be in your watchlist",
    "date": "2025-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "👍👍👍👍👍👍👍👍👍👍",
    "date": "2025-06-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It’s a simple but magnificent story. Felt like, life is supposed to be like this. Lookout for each other, a tightly knitted community. Old school, yet charming.",
    "date": "2025-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I really enjoyed this heartfelt christmas film . the story was very touching and you could feel the holiday emotions all around .",
    "date": "2025-03-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What a absolutely fabulous feel good film . It makes a change to see such innocent  entertainment.",
    "date": "2025-02-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A charming homage to the Christmas spirit, That Christmas tells us a unique take on the titular holiday spearheaded by a very British(but talented) cast.",
    "date": "2025-02-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Nope Not That Christmas. Must have been another one.",
    "date": "2025-02-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "My 3 year old loves this and I thought it was great also.  Fun and warm movie. Great message about family and friendship.",
    "date": "2025-02-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I absolutely loved this movie I thought it was to mainly do with santa but it wasn't instead they spread the film showcasing 3 different families I loved it. It was heart-warming and I loved the animation",
    "date": "2025-02-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "How does this have a mediocre rating?! This movie was awesome! My kids watched it multiple times over the Christmas season. It has depth and some hard topics too that adults can understand. It does start slow but by the end I loved it.",
    "date": "2025-01-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Great visuals and heart warming.  My 2 year old loves it.",
    "date": "2025-01-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Someone complained that it was a movie for a much younger crowd then it let on? It’s a children’s cartoon! I’m surprised who people would’ve thought this was intended for. That Christmas was an incredibly enjoyable movie. It had several stories going on because it was imitating Love Actually style. Whatever, it was great and I want more movies I can watch like this with my kids that don’t have obnoxious characters with bad attitudes.",
    "date": "2025-01-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A lovely film for all ages. I watched on my own as an adult while taking down the Christmas decorations and loved it. Great script, heartwarming story, lovely characters, loved the animation",
    "date": "2025-01-04"
  }
]