[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "En lo personal me encanta la película y la banda sonora se gana un Oscar para mi",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Guy Ritchie's take on King Arthur is one full of dramatic effects and humour, it's not 'a cup of tea' for most, but if it is, you'll find it entertaining.",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A Frenetic Arthurian Flop.\n\nKing Arthur: Legend of the Sword is a hyperactive, overstuffed epic that crumbles under Guy Ritchie’s stylistic excess, turning Arthurian myth into a disjointed, CGI-saturated farce that prioritizes frenzy over fable. Charlie Hunnam’s Arthur has grit, but the nonlinear script’s whiplash flashbacks bury coherence, the rise to kingship lost in bombastic montages. Jude Law’s Vortigern hams it up, and Astrid Bergès-Frisbey’s Mage teases wonder, but the ensemble, including Djimon Hounsou, drowns in chaotic set pieces that stun visually yet numb narratively. What should have been a mythic ascent devolves into repetitive swordplay and hollow magic, the 2017 blockbuster trend wasted on a saga that meanders without gravitas. It dazzles in spurts but collapses into forgettable bombast, a knight’s tale told in fits of fury.",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I came here to look at the reviews long after I watched and enjoyed it very much. And I am shocked at the horrible overall Tomatometer-rating. It’s a medieval/knight movie, get off your high horse and get with the fun. It’s not that deep, movie experts, I promise. The movie’s engaging, with a great cast, humor and action.",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Must see whether you like action or drama, or both. Riveting and engaging throughout.",
    "date": "2025-09-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I think most critics opinions of this movie are that of a typically bored “professional” with nothing more entertaining to do than to provide a false negative image of this movie. \nPersonally I found this move to be endearing from the get go. It has the dark, magical medieval feel whilst Ritchie also implements his own twist on the tale as he normally does. The fast paced humour mixed with the more profound elements of the story make for an interesting story to get sucked into. \nNow I do think they could’ve slowed the general pace of the storyline especially given that this was supposed to be the first of 6 movies. they could have focused more on uthers reign and his battle against mordred and vortigens slow betrayal of his brother and then moved on to maybe a cliff hanger at the end setting up the next movie. \nHowever I believe this film deserves more credit, the casting was excellent, plenty of talent. enjoyable watch but of course not for everybody.",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Charlie Hunnam trying to be Ragnar Lothbrok but failing miserably. God awful film with a poor story line which veers too far away from the legend. David Beckhams appearance made a mockery and after seeing his performance, I realised the rest of the film was gonna be sh*t. Guy Richies directing style has no place here and Game of Thrones/Snatch it certainly isn't.",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I think the movie was awesome. Acting , cast , direction, cinematography was brilliant. Lacking in screenplay.  Still the movie is worth watching...",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it the first couple of times we watched. Watched again recently, and that hasn't changed. It's a well told, brilliantly cast, cleverly directed telling of the tale",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Definitely one of my favourite films, with huge potential for sequels that, sadly, never saw the light of day due to low box office returns. It’s worth noting that the plot strays far from the original legend of King Arthur and the Knights of the Round Table—but that’s clearly no obstacle to enjoying it.\n\nIn this version, Arthur is raised in a brothel and hardened on the streets of Londinium (the future London), where Guy Ritchie has relocated the setting. With his friends, he controls the local scene and takes a cut from the earnings. But when the legendary sword in the stone resurfaces, Vortigern—Arthur’s uncle, who seized the throne after killing Arthur’s father, Uther—gathers all young men of age in search of the one who can draw Excalibur. By pure chance, Arthur, long having forgotten his royal lineage, ends up in the selection and unexpectedly pulls the sword—sparking the main chain of events.\n\nYes, the “street kid becomes a hero” plot is nothing new, but the film convincingly shows why Arthur, who genuinely cares for his people, would make a far better ruler than the power-obsessed Vortigern. We also see that Arthur is a natural leader, not just a puppet of Merlin’s envoy or Uther’s loyalists. Vortigern, meanwhile, is genuinely menacing—a man who values power over loved ones and will do absolutely anything to keep it.\n\nThe movie packs in plenty of action, keeping boredom at bay. Guy Ritchie’s signature editing style is still noticeable, even though he didn’t have full creative freedom and co-wrote the script. I especially enjoyed the sequences where characters narrate events—whether recounting a day or laying out a battle plan—while we see those events play out visually in parallel. The scenes of Arthur interacting with Excalibur are especially creative and striking. The film also introduced me to the excellent Charlie Hunnam, who forms a compelling, tension-filled on-screen dynamic with Jude Law. And of course, the music—it’s absolutely top-tier, always fitting perfectly with the scene, whether it’s Arthur’s coming of age or Vortigern addressing a crowd, making each moment even more powerful.\n\nAll in all, it’s a high-quality, dynamic film with engaging characters and a fresh approach—absolutely deserving of your attention.",
    "date": "2025-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Review: A Bold Reimagining That Deserves More Credit\n\nWhile it’s fair to say that some of the acting wavers in places — moments that don’t quite land emotionally or feel slightly overplayed — this film dares to dig deeper than most mainstream retellings. The director takes a notable risk, opting to explore more complex themes rather than playing it safe, and that gamble pays off in many compelling ways.\n\nThe story, familiar to audiences across cultures, isn’t simply retold — it’s reshaped into a journey that offers both escapism and introspection. Isn’t that the very essence of cinema? To be transported from the everyday into something richer, stranger, more stirring? On that front, the film certainly tries hard to succeed.\n\nIt’s no masterpiece — not a flawless five-star triumph — but it’s far more ambitious and affecting than its Critics Rotten Tomatoes score might suggest. The cinematography is charged with urgency: the handheld camera work and kinetic framing reflect a world that’s constantly in motion, mirroring the characters’ relentless pursuit of truth, safety, and freedom.\n\nMusically, the score is vibrant and evocative, adding texture and emotional depth that helps set this version apart. It breathes fresh life into a story some may think they already know — and that freshness alone is worth applauding.\n\nOf course, opinions differ — as they should. It may not be perfect, but it’s a brave, exhilarating cinematic adventure that leaves a lasting impression. My family love this film!🙂",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wow! I can’t believe the negative reviews. This movie was epic. I loved it. It’s one of my favorites.",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I simply cannot understand why this movie has such low ratings, fantastic cast, good graphics, amazing soundtrack, great storyline, I genuinely love this movie",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of my favorites. Granted there are some horrendous scenes, specifically the ones with David Beckham. But overall good movie and I love Richie's quick fire dialogue.",
    "date": "2025-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "There was a good movie beneath all of the misguided, all over the place finished product. I hope this doesn't prevent a remake done right in the future",
    "date": "2025-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie is a journey through the mind of Arthur and the action is amazing",
    "date": "2025-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Guy’s take on this classic tale breathes fresh life into the story. It is completely unique throughout and I thought the action sequences were great. The score fit the theme of the story and the movie and Charlie’s acting was incredible. Casting and story was just top notch.",
    "date": "2025-06-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing movie. I have loved it forever. And that music, it always gives me goosebumps. Can't understand how it didnt perform at the box office. One of the best. I wish i could see it in theatre once again",
    "date": "2025-06-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Here I am in 2025,  trying to find where I can stream this movie over and over! This was a great movie and the acting was superb. Thanks Peacock.",
    "date": "2025-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Most underrated movie ever made",
    "date": "2025-05-27"
  }
]