[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I read this book when I was in grade 7 and I LOVED it. When I heard they were making a movie, I was beyond excited and I couldn’t wait. I thought it was taking forever to release because they were making sure it was an appealing and accurate movie compared to the book. Absolutely not. I was extremely disappointed. I waited 4 years for this and I walked away wishing they either left Uglies as a book or actually took the time to at least have decent CGI.",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I Thought this movie was really good and is relevant to todays \"beauty standards.\" I love this movie and I am as to see how badly it was rated. i love it sooooo much and highly recommend it",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Uglies è un film che mi ha sorpreso in positivo per atmosfera, effetti visivi e per la tematica centrale, semplice ma allo stesso tempo molto importante. Il messaggio di fondo funziona, e durante tutto il film ero davvero coinvolto.\nPurtroppo però il finale rovina completamente l’esperienza: è tronco, incompleto e lascia tutto in sospeso senza una vera conclusione.\nNonostante gli elementi positivi, non posso consigliarlo perché dà la sensazione di essere solo ‘metà film’. Il finale è talmente deludente che compromette tutto il resto.",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazingg!! I would love to see the second movie!",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I acually liked the movie and I really hope for part 2. I dont now what to think about all he hate because it was nice and to be honest I didnt know people can be that beautiful",
    "date": "2025-10-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Okay, I will say that the preview of this movie had me running to the book store to read the book before I watched the movie. I personally think they did well in the adaptation, which is no small feat. It's a spectacular movie. Nothing about Joey King us ugly though. \n\nI've watched the movie multiple times now. I hope we get a movie based of Pretties.",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Horrível! Do início ao fim ele é péssimo, lavagem de dinheiro.",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Whilst I can only award this 1 and 1/2 stars for the shallow (no irony intended) storyline, slightly strange concepts and lack of an engaging story lines or characterisation, I can't claim to have completely not-enjoyed this film and I would watch a second if there was one to be released. So, if you find yourself needing what I categorise as an 'evening filler', this wouldn't be the more terrible choice you would be making... as long as you understand that it's just that, a good movie to fill a lazy Sunday evening with and could be followed along with whilst also completing the laundry, or cooking etc.",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Loved this movie, can't wait to see uglies 2 if they decide to make an uglies 2!!!",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Me and my girls loved this movie. We are hoping for a second one to be released.  It may not be for everyone but it is an eye catcher. I'd love to see tge finish of nose and David's story.",
    "date": "2025-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "We loved making fun of it all the way through!!\nIf you want to laugh at your past self who enjoyed movies like Divergent, Hunger games and Twilight, this movie is perfect.\nTho otherwise it's really trash and intellectually distasteful.",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "We really enjoyed it! If was like Divergent! It had a really good message for young people today who are influenced in an unhealthy way by comparison through social media. We hope they make a part 2.",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Unfortunately a waste of time",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Really bad movie.  Obviously made for middle schoolers.  Seemed very low budget.  The script was so infantile. We couldn't through 20 minutes, before we decided to fast forward to see how it ended.  Also the attempt at positive messages was ridiculous, especially since the \"Lady\" who was supposed to be the face of \"beauty\" was a man dressed like a lady!  Those scenes were especially unwatchable.  Do not waste your time.",
    "date": "2025-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "If you are older than 15, and have more than 2 brain cells, not invested in an argue as who takes the 3rd spot, spend your time on something else. Maybe take a 1h:47 mins long s**t? This movie is not just a bad investment of your time, but bad in general. The special effects will be the only things to keep your eyes from falling asleep, not because they are good, because they are too overly flashy... risk of seisure, not for the faint of heart. The plot is so foreseeable, the comunication between the characters is so weak it seemed for me that not only it is a teen movie, but it is made by a teen.",
    "date": "2025-09-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It was very difficult to watch. The second-hand embarrassment was through the roof. It felt like a knockoff of Divergent. The ending suggested a sequel, and I will be surprised if they actually make one.",
    "date": "2025-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "All of the books need to be made into films, I’ve listen almost all of them and I’m half way through listening to specials on audible and have watched uglies many times! Can’t wait to see it all on screen hopefully soon.",
    "date": "2025-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Blaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaand",
    "date": "2025-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Honestly, it’s extremely forgettable and I definitely was not the core audience for this movie but if I had to put myself in the shoes of the core audience of this movie I’d still think it’s cliched and a movie you shouldn’t waste your time on. The pacing is something I want to get at most I get it’s a short runtime but Joey King’s character literally killed Keith Power’s character’s parents and then he’s just supposed to forgive her and still trust her enough to try the “antidote” on her in the supposed sequel that I hope never comes out.",
    "date": "2025-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best movie I have seen in a while. I LOVED DAVID AND TALLY!!! And lowkey tally and shay together as welll, but have to admit, trope seems very similar to hunger games within the love triangle that’s sort of going on but I do really want David and tally to meet again. Really really want a second movie OMGGG",
    "date": "2025-07-31"
  }
]