[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Time Trap? More Like Time I’ll Never Get Back\n\nIf I had the power to time travel, I’d go back to the exact moment before I pressed play on this movie and slap the remote out of my own hand. Time Trap is the cinematic equivalent of a lukewarm gas station hot dog  looks kind of interesting at first, but you instantly regret the experience.\n\nThe plot stumbles around like it’s lost in its own time loop, the pacing is somehow both rushed and painfully slow, and the characters make choices so brainless I started rooting for the cave to seal itself shut. And then there’s Cara… easily one of the worst performances I’ve seen in years. Every line delivery sounded like she was reading a grocery list, and every reaction felt like she was realizing she left the oven on at home. If bad acting were a competition, she’d be a time-traveling champion.\n\nBy the end, I wasn’t just bored I was angry that no time machine exists in real life to undo this mistake. File this movie under “Do Not Watch Unless Trapped in a Cave With No Other Entertainment.",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I get it. It’s B movie acting. But I knew that going in and I love anything with time travel and sci-fi elements. That being said, I’ve watched it several times because it’s such a unique premise that has a neat and satisfying ending. Time dilation is a rare subject for a movie so while this isn’t necessarily the best execution, it’s quirky enough to justify cult status in time travel cinema. It was better than I thought it would be going in, and strangely, I find myself going back for more viewings to see if I missed anything. That’s a testament to a good movie! Can we get a sequel?! lol",
    "date": "2025-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Did not have high expectations but thoroughly enjoyed this film. It was well done. I really like the time dilation aspect of the plot. Not your ordinary confinement story.",
    "date": "2025-06-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is so unique. I loved it!",
    "date": "2025-04-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "9/10 Awesome!!! This movie was very good and had me on the edge throughout. I only wish they would have showed the man who saved them that died being brought back to life too.",
    "date": "2025-04-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great hard sci fi.  Great science.  Too bad for the low budget.",
    "date": "2025-04-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I mean it wasn’t to and of a movie but it was a low budget film and not great acting. But I never heard of it until I saw videos online about it and I had to watch it. I wouldn’t mind watching  it again.",
    "date": "2025-03-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I thought this movie was very good, it had a good way of keeping it interesting and had some interesting themes. I loved the concept and would definitely recommend it, interesting fun and the characters are cool. Not the best acting for some of them but other then that I thoroughly enjoyed this movie.",
    "date": "2025-02-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fantastic movie . Must watch . Whole movie i was on edge and didnt know whats gonna happen next , really good and refreshing storyline . I give it 5 out of 5 .",
    "date": "2025-02-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Time Trap is a fun, intriguing sci-fi adventure with an ingenious central premise—but while the ideas are fantastic, the execution doesn’t quite match their full potential.\n\nThe story follows a group of students searching for their missing professor, only to stumble upon a mysterious cave where time moves at drastically different speeds. This high-concept setup immediately hooks the viewer, and as the characters delve deeper, the film cleverly unravels layers of history and time anomalies, leading to some genuinely mind-bending reveals.\n\nUnfortunately, while the film’s visual storytelling and sci-fi elements shine, its simplistic dialogue, uneven pacing, and flat character development hold it back. The characters often feel like they exist just to push the plot forward, rather than fully fleshed-out individuals we can invest in. Additionally, the film introduces some incredible ideas—ancient civilizations, futuristic beings, and time distortions—but doesn’t fully explore them, leaving a sense of what could have been.\n\nThat said, Time Trap is still a fun, thought-provoking watch. Despite its meandering execution, it’s a great film for fans of low-budget indie sci-fi who enjoy high-concept time travel mysteries like Coherence or Triangle.\n\n✔️ Verdict: A brilliant sci-fi concept, wrapped in a film that is engaging but lacks depth and polish. Worth a watch for time-travel fans, but don’t expect a masterpiece. 3/5 stars! ⭐️⭐️⭐️",
    "date": "2025-02-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The concept of this short movie was pretty interesting, but the dialogue was really bad at times. The movie itself wasn't bad however.",
    "date": "2025-01-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It was ok I didn’t like the writing though I thought that was a little weird.",
    "date": "2025-01-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The movie is A class for a C grade low budget sci-fi movie. It combines many elements that somewhat fit well in the narrative it portrays. Some of the execution however leaves much to be desired, as most of the scenes were cut in post production to fit the time allotted for these kind of movies. The acting and script were as expected for a low budget film, however the casting of characters were on point in my opinion. The Science fiction side was surprisingly good, and gave a dazzling array of detail that is enough to intrigue the viewer.",
    "date": "2024-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The first few minutes had me absolutely questioning what I had chosen to watch but I’m so glad I stuck with it and finished the movie. This isn’t a Hollywood quality blockbuster, but it is a highly creative and original thriller that will keep you guessing. To be critical, the plot and acting weren’t amazing, but it gave the movie a cult-classic type feel that absolutely charmed me by the end of the film. I literally made an account to leave this review because I genuinely believe it deserves more credit.",
    "date": "2024-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The acting and script was absolutely dreadful.  \"Maybe we fell asleep\" worst line I've ever heard in my life",
    "date": "2024-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The title is a vindictive play on the time you will never get back.  But the acting! Oh the acting! Oscar worthy.  If there is ONE redeeming quality about this movie it was the superb acting abilities of Furby. Sarcasm. The concept would have been amazing if it were directed by non-Mormons. Very Wrinkle in Time. If the acting was remotely passable. I want them to remake this.  Correction - They as in whoever made this version should make G rated kids shows for Disney.  The dialogue is SO BAD. Someone ELSE should remake this concept and scrap the script. \n\nStraight up I will never get that time back.",
    "date": "2024-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "So many sci-fi movies stop short of going all the way. This one does not and is worth a watch and a rewatch despite some other issues.",
    "date": "2024-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "An intriguing premise (the Fountain Of Youth is really a local time distortion) that unfortunately goes nowhere particularly interesting. A collage professor investigates a disappearance then, becomes lost himself. His students follow up only to become similarly ensnared. It starts out OK but becomes sillier as the plot develops—including a hilariously goofy band of cavemen-savages. The actors are attractive, but not strong enough as characters to make us care much about their fate. Also, animal lovers will wonder what happened to “Boss”!",
    "date": "2024-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "In my opinion it's great because it has plenty of action the cast is wonderful   I enjoyed it enough to watch it again",
    "date": "2024-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I thought that the plot wasn't that bad, and was quite interesting, but they kind of lost me with the psychotic cavemen and the eight feet tall humans who speak alien language, but overall was a pretty good movie, although I wouldn't watch it again.",
    "date": "2024-07-27"
  }
]