[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved it. A horror film with a tender backstory that lures you (and Logan Marshall Green) in until the rug pull moment. It’s a slow burn but never dull. This is how tension and thrillers should be done.",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This was creepy, hypnotic, tense and it unfolds like a great story should.",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A slow-burn thriller that builds tension in a disquieting way, The Invitation keeps you on edge as the mystery unfolds. While the pacing drags at times, the suspense pays off with a finale that’s both eerie and satisfying. A decent watch, though it could’ve used a bit more emotional punch.",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "What a pile of garbage. The protagonist walks with a long face the whole damn movie while a bunch of friends keep asking \"how are you doing?\" and answering \"great\" after not seeing each other for 5 years. Can't think of a more stupid screen writing",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Was good. Shows being paranoid can save you in the end",
    "date": "2025-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Such a an awesome movie! Don’t watch the previews…it will surprise you!",
    "date": "2025-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Got the plot the first 20 minutes of the movie. Some characters are unbelievably idiotic for their choices and the sentences they make. Dialogues are terribad to say the least. \n\nComplete NON SENSE mixed up with some blood. \n\nBelow 0.",
    "date": "2025-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The Invitation is one of those movies that’s not trying to be a masterpiece, but still manages to keep you interested. The story itself is pretty predictable, nothing in the plot will really surprise you, but there’s something about the way it’s put together that just works. The writing isn’t anything to brag about, honestly, and a lot of the dialogue feels like it’s there just to fill the gaps. But I found myself actually enjoying the tension and awkwardness as the movie goes on.\n\nActing-wise, no complaints. The cast does a decent job, and nobody feels out of place. The production is solid, with some really good use of the setting to make you feel trapped right along with the characters. Lighting and camera work do a lot of the heavy lifting here, creating that unsettling vibe the whole way through. It’s definitely a “watch once and move on” kind of movie, but I have to say, the last scene delivers a punch that sticks with you. It’s the kind of ending that almost makes up for everything you already guessed. Overall, worth a watch if you want some low-key suspense, but don’t expect it to blow your mind.",
    "date": "2025-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The movie was definitely a slow-burn (sometimes too slow) and seemed to be missing a certain elemental part of suspense (don't get me wrong...it was suspenseful, but there was just something missing that doesn't allow the viewer to get completely wrapped up with anticipation), but it was engaging enough. However, the last 20 minutes or so really ramp it up a notch. \n\nThis movie intertwines elements of grief, delusion, denial, and impending doom efficiently, but there's always something just out of grasp missing that I can't quite put my finger on. The acting was decent for the most part, albeit some of the characters seemed a bit too cliche, and the revelation at the end left me quite irritated and definitely took some of the believability away, but I'd say overall, this is a solid thriller.",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "No other movie in history builds suspense better than this film. Seriously…Invitation does a unique, incredible job continuously building curiosity and confusion while just adding enough every 5 minutes to thicken the plot. Somehow, the movie feeds you just enough not to tease you, but feed you while at the same time raising the suspense MORE. Brilliant…just brilliant.",
    "date": "2025-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A great thriller with a surprise twist. Tim Treakle",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The invitation 2015 has an expected twist from the start. In my opinion it lacked depth and was too predictable. From the start it’s clear that something is off, and when finally the plot comes it is disappointing to say the least. The ending felt rushed and did not offer anything more to the story than your typical protagonist vs antagonist fight. There is noting really bad about this movie but I would not recommend spending your time watching this.",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Found the movie boring, the twist you can see from a mile away disappointing.",
    "date": "2025-05-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The beginning was solid, slow-burn suspense that had me interested. But by the end, it felt like they threw all the buildup out the window. Suddenly it’s just cliché cult chaos and people dying. The final reveal is cool and saves it a bit, but overall the shift didn’t totally work for me.",
    "date": "2025-05-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Mind bending all the way to the end....especially the end. I was surprised by this one. I'd watch it again with friends",
    "date": "2025-05-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I think the movie is good, but it made me uncomfortable.  I thought about turning it off.",
    "date": "2025-05-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A must-see, unless you're inclined to quickly decipher the script and deduce the film's outcome, since the main interest here lies in the final surprise it's supposed to hold. Which is my case, so 3* only.",
    "date": "2025-04-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A psychological thriller that had me gripped from beginning to end. Excellent, natural acting, tension builds and builds, and I didn't guess the climax. As for the final scene, wow, truly disturbing.",
    "date": "2025-04-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Slow burn but good burn. Some great acting, good writing, good dialogue. \nAnd most of all, a creepy atmosphere that gets under the skin. The finale could have been a bit more... spectacular or revelative or something. Still, a good one.",
    "date": "2025-01-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Sometimes I want to gather all the world's horror filmmakers in a single room and yell at them until they agree, by binding legal document, to stop their lazy, rote, trite, and frankly offensive use of dead animals as a stand-in for good storytelling.",
    "date": "2024-11-08"
  }
]