[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The most realistic movie i have ever seen about American people,",
    "date": "2025-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "One of the worst acting and corny writing I’ve ever watched. Felt low budget and no care.",
    "date": "2025-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Good movie in fact it's a brilliant movie great action some people say it's garbage but it's not it is a great movie they need to make another movie with the same actors and carry on from the end off the first one please make another one",
    "date": "2025-03-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I’m with the audience on this one. This has got to be Deon Taylor’s best thriller, really good and good acting across the board especially by Grillo",
    "date": "2025-01-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was such a good movie! The cast did a phenomenal job, the writing was great, and it was filmed well. The cinematography and film score were on point. Tyrese and Naomie had great chemistry and played off each other well. This movie was so much better than I thought it would be! If you like drama, suspense and thrills,  or if you just like damn good movies, I highly recommend! ⭐️⭐️⭐️⭐️⭐️",
    "date": "2024-12-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely captivating.\nFrom the moment the movie started, my eyes have been glued to the screen. The movie was intense and had my full attention until the end. I thoroughly enjoyed the action, the story, and the message. I had a amazing time watching it, which is the whole point of watching a movie, to enjoy it.",
    "date": "2024-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Esta película es una Joya del género \nJunto a \"Misantropo\" definitivamente ambas se llevarían la corona .\n\nMuy bien ejecutadas en todos los sentidos 🫶",
    "date": "2024-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A bit overrated. Typical corrupt cop movie. This is the kind of movie where you watch once and never watch again.",
    "date": "2024-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is such a poorly written movie being held together by nothing but convenience. Her phone battery conveniently goes flat and it's conveniently left on charge when gun fire sounds off so she leaves it behind. On top of that, she did two tours in Afghanistan, TWO but she has zero common sense? She kept trusting other cops despite seeing that THREE from her precinct were already crooked, it takes another three for her to realise that she shouldn't trust cops. She also never listens and never opens her mouth to say \"I have proof that it wasn't me, don't kill me\" until close to the end of the movie. It's hard to be interested in a movie and root for the main character when she has zero logic and doesn't use her brain. It also doesn't really tackle on the whole corrupt police thing at all. It's like a minor thing.",
    "date": "2024-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Whether or not the topical discourse meant to serve just the plot over continuous gimmicky or to socially reflect with a “coherent” but grasped point, it’s tense enough to justify engagement over scenic stirs and through both Naomie Harris’ grit and Tyree Gibson’s layered earnest. (B)",
    "date": "2024-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This was a compelling movie with good acting and storyline. It's worth the watch.",
    "date": "2023-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "good cop movie intense definitely worth a watch.",
    "date": "2023-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Minha opinião: Este filme mistura a luta pelo trafico com gangs e policiais corruptos além tratar com racismo. Temos aqui uma nova policial Alicia que troca de turno para ajudar seu companheiro. Mas isso faz ela presenciar uma execução de um sobrinho do chefe do trafico da região. Os policiais corruptos que viram ela presenciar começa uma caça atrás dela e acabam mentindo para o traficante que foi ela que matou seu sobrinho. Porém ela havia gravado tudo em sua câmera portátil. Mas ela caçada pelos policiais e a gang de traficante, ela estaria morta se não fosse Milo, que trabalha em uma conveniência. No inicio ele reluta mas acaba a judando e se envolvendo. E assim os 2 lutam. Até que chega o final onde Alicia vai até o chefão do trafico e quando a verdade é revelada a policia invade o reduto deles. E acabam matando a quadrilha e na hora Terry o líder dos policias corrupto a encurrala, a policia descobre também a verdade. Um filme que faltou a profundidade. E Naomie não convenceu bem no papel, talvez se os papeis fossem invertidos com Tyrese desse mais certo. E pelo fato de Grillo no papel também faltou aquele cara das artes marciais também, acredito que daria outra dinâmica ao filme.\nRoteiro e enredo já conhecido, poderiam ter trazido algo melhor.\nVale apena assistir? Se não tiver outra alternativa.\nNota: 5",
    "date": "2023-03-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's pretty clear what's happening here with these reviews. This is more or less an updated Training Day. Well acted, decent cast, plenty of WTF moments where you really have to imagine what happens from one scene to another. In the end, the film is OK with a typical story in 2020. You can see how everyone one the whole \"blue lives matter\" front gave this 1 star, and everyone else gave it 5. The few unbiased reviews in between generally reflect a film that delivers exactly what you expect from a crooked cop / good cop situation. Could be a lot worse. I'd say watch it if you liked Training Day and see if it compares to that similar feeling of the whole world being a horrible place that they got right.",
    "date": "2022-12-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Brings nothing new to the table but is effective at what it does.",
    "date": "2022-12-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I thought it was ok overall as the plot seemed interesting along with the twists, but some of the filmed scenes made it look like a B caliber movie. Also, there wasn't any notable names in the cast and we didn't really care for any characters other than the main one which made it hard to relate to",
    "date": "2022-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Pretty good. Kinda reminds me of Training Day.",
    "date": "2022-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Great movie 4.65/5 stars",
    "date": "2022-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It had some action but was otherwise had the main character NOT doing the logical and smart thing, time and time again!",
    "date": "2022-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I wanted to love this movie but like so many of its kind , it is stupid. The main character and her friend do everything wrong and nearly get killed. A police officer/soldier would know better. This stupid part was just to cause the action in the end.",
    "date": "2022-04-29"
  }
]