[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great “feel good” movie, easy watch. The plot was entertaining throughout the whole movie, but there was plenty of moments foreshadowing what’s to come. I really enjoyed the accuracy with each scene portraying the 1950s well (from the cars to the outfits and so on).",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Easy to watch, feel good story. Source material was interesting and thought I was going to love it within the first 15 minutes. Felt a little thin at times and golf scenes were just okay.",
    "date": "2025-03-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The first half of this movie had me thinking it was by far the most poorly thought out and least engaging underdog sports film yet. Some redeeming scenes in the second half, but still not worth your time.",
    "date": "2025-02-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "it's good but the movie just dragged and just yapping but the girls clutch fine",
    "date": "2024-12-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Incredible and inspiring true story!",
    "date": "2024-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "THE LONG GAME is an underdog sports movie in the classic inspirational style, bolstered by a meaningful fact-based story, and surprisingly engaging despite being about golf. Good writing and a committed cast, accompanied by a charming Cheech Marin, help convey the nuanced challenges of overcoming prejudices internal and external. Go Mustangs!",
    "date": "2024-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The fact that someone didn't win an Oscar over this just shows how worthless that award is.",
    "date": "2024-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Full of clichés, super predictable, really bad acting, nothing gels, couldn’t stand more than the first 30 minutes actually, which was an enormous waste of time already. Make no mistake, all the good reviews here are « planted » by phoneys and are therefore absolutely untrustworthy.",
    "date": "2024-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is pure cinema. It gets straight to the point and delivers an amazing story. Every scene was absolutely essential to the story. All actors in the film delivered such a powerful performance. This movie had such a good underdog story feeling to it, and contained an emotional ending that has all the makings of a soon to be classic.",
    "date": "2024-10-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Refreshing to see Hispanics not being portrayed as gang or as criminals",
    "date": "2024-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It has all the hallmarks of a successful and well-rounded underdog story, with the source material providing solid foundations. It works. With solid casting, great settings, and directed with a compassionate and understanding eye, this is one to return to for sure",
    "date": "2024-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was one of those under dog stories where they prevail and end up top dogs.  We all love those, but better yet it was true.  And even better yet the entire story placed focus on Latinos.",
    "date": "2024-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "You have seen it all before but will still have fun.",
    "date": "2024-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "An underdog story that is based on a the true story. While the film feels like a familiar narrative, the acting and truth behind it make it stand out.",
    "date": "2024-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The movie makes many patriotic references and takes place in 1955 and a couple years thereafter. In several scenes the US flag is shown, but every time it’s the 50 star flag following the admission of Hawaii and Alaska to the US the end of 1959. You think that although the movie depicted discrimination against Mexican Americans it would use the correct flag,",
    "date": "2024-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This a great movie. It was well acted and the story was awesome. Typical underdog movie, but since it was true it is better. I enjoyed it very much.",
    "date": "2024-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "So corny, bad acting, seems like a weird Netflix misinformed version of what a good story would have been.",
    "date": "2024-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Somewhat predictable and formulaic, but very well done and worth watching, even for someone who isn't a big fan of golf.",
    "date": "2024-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Amazing story but horribly boring (and corny) movie.",
    "date": "2024-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great Movie! Well acted, superb cinematography, and a very inspiring story. Definitely worth the watch.",
    "date": "2024-07-29"
  }
]