[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Got round to watching this film about a physiological freak and psychological nutter who climbed all 14 of the 8km peaks in six months. Was excellent. Watched on Netflix.",
    "date": "2024-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It had it moments. A little self indulgent.",
    "date": "2024-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Phenomenal camera work and story",
    "date": "2024-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "In April of 2019, Nirmal Purja embarked on Project Possible, a seemingly impossible attempt to climb the world's fourteen highest peaks, all greater than 8,000 meters, over the span of several months.  14 Peaks: Nothing is Impossible is a story of the importance of family, of pride in your nation, of unflinching devotion to a dream, and the ability to overcome impossible odds.  While there may be some faults with the documentary (the animated sequences feel unnecessary and some of the background details may be excessive), it is an inspirational film featuring absolutely stunning scenery and an immensely likeable protagonist who spreads positive vibes to all of those he comes into contact with, including the audience of the documentary.",
    "date": "2024-02-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie! Specially for those who like mounting climbing.",
    "date": "2024-02-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "71%. 12/15/23. Watched in two parts, pretty far apart. No insanely intense moments from what I remember but cool seeing him climb each of the mountains. Crazy to think the shape he must be in",
    "date": "2023-12-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "absolutely amazing and unreal documentary",
    "date": "2023-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Doesn't get more motivational than this. A great challenge, perfectly orchestrated by Mr. Netflix.",
    "date": "2023-03-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Unbelievable and extraordinary!",
    "date": "2023-01-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I don't think Nims is worried about living up to anyone's expectations but his own. I like that he sees his role as part of something greater. In this case, showcasing long overdue respect, recognition, and gratitude toward the Nepalese climbing culture. Nims and his team above all just seem like good people. Good people, accomplishing the near impossible while holding the view of benefitting others. Highly recommend!",
    "date": "2023-01-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "An inspiring watch that takes you deep into the Himalayan territory with a distinct project- it is an exciting affair with emotional aspects to it as well, even though this movie's more slow moments definitely doesn't help on the feelings of rush hovering above.",
    "date": "2022-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "this movie is beautiful and inspirational. a must watch",
    "date": "2022-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Incredible!!! The greatest achievement in mountaineering by Nims and the team will probably never be surpassed in this century.",
    "date": "2022-05-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": ")\nI loved the movie because it celebrated the Sherpas who, as a community, deserve so much more recognition than they get. It was rightly mentioned that you usually hear an explorer guided by a 'Sherpa', never the name of the Sherpa. Also great to finally see Nepalese achievements getting some limelight in Western media.",
    "date": "2022-03-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "登山だけでなくどんな分野でも成功できる人だと思う。実際にマーケティング分野はとても長けている。それにストイックで、行動力があるから他の業界にもチャレンジしてほしいと持った。\nこんな偉業が全然報道されていないことを考えると、アジアと西洋への関心の違いは時間が経っても全然埋まっていない。日本も劣等感からか白人コンプレックスなのか西欧への憧れは続いていて、東南アジアでの人の活躍などは全く報道されない。過去の後進国に抜かれているのに気づかなかった人たちが報道の視点からももっと自国の危うさに気づいてほしい。",
    "date": "2022-02-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I cannot stress enough how GOOD this film is. \n\nFitting cinematography with a clear, definitive story and an amazing documentation of an incredible achievement. \n\nTo think Nims not only climbed all these mountains but also was the cinematographer in the film recorded whilst he was climbing is incredible. \n\nMake sure to check this wonderful piece of film out. I can assure you it is better than 90% of what Hollywood puts out these days.",
    "date": "2022-02-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Nice pictures and story about perseverance. However, a lot of his record-time feats lose their luster once the documentary admits midway through that he uses oxygen masks. That's like giving steroids to a baseball player.. yes still impressive, but a major asterisk*",
    "date": "2022-02-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "An inspiring watch that takes you deep into the Himalayan territory with a distinct project- it is an exciting affair with emotional aspects to it as well, even though this movie's more slow moments definitely doesn't help on the feelings of rush hovering above.",
    "date": "2022-01-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I Loved! Nimsdai Purja is resilient, determined and knows what he was doing.\nThis documentary is going to give you a sense of respect for life. Must see!",
    "date": "2022-01-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "14 Peaks: Nothing Is Impossible is a documentary film on the Nepalese mountaineer Nirmal Purja and his team as they attempt to climb all 14 eight-thousander peaks within a record time of under 7 months. The real-life footage of the vistas captured during the expeditions is stunning. It is motivating to watch an individual's willpower, spirit, and determination, how he and his team make the impossible possible.\n\nLoved the way they celebrate the inspiring community of the Sherpa's, the best kind of nationalism which should be shown on screen. This documentary deserves more renown.",
    "date": "2022-01-06"
  }
]