[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I’ve only watched the movie because of Union but it was the most mediocre movie I’ve ever watched. Just a case of a failure of a partner when announcing pregnancy and no apologies given when they got together and a case of a mama boy for a fourty something women. The bar is in HELL.",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I only hope the original author was satisfied with this film, as mediocre as it is.",
    "date": "2025-03-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great performances, chemistry, and costumes. The script provides an earnest examination of a relationship between an older woman and a younger man. Well known actors are definitely worth a watch.",
    "date": "2024-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Unreal bond, I dislike the 20year old granny line. So much unreal moments",
    "date": "2024-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Akward, not funny at all.",
    "date": "2023-12-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This romantic film is truly captivating, with the lead characters displaying a deeply intense and believable connection. The dynamic within the entire cast adds to the film's charm, making it a satisfying watch. The script is skillfully crafted, reflecting authentic everyday conversations. While it may not quite reach the heights of \"Love Jones,\" it certainly comes close. Gabrielle Union delivers a standout performance, showcasing her impressive acting skills. Kudos to both the actors and the writers for creating such a resonant piece. Gabrielle Union, in particular, always connects deeply with roles like this, proving her exceptional talent. Special mention goes to the young male lead, whose performance is remarkably engaging and gave me goosebumps, a fresh face with an impressive portrayal. The women in the cast, whose careers I've followed and admired, also deliver memorable performances in this ensemble.",
    "date": "2023-12-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "vast backdrop of New York City. The portrayal of love felt genuine, characterized by realistic and relatable characters. The film's fashion was exceptionally crafted, adding to the allure and genuineness of the predominantly melanated cast.\n\nThe movie excels in presenting a love story that is both beautiful and unfiltered, a rare combination. From the start, I found myself invested in the characters' journey. The film breathes new life into the often bleak \"older woman-younger man\" narrative, delivering a refreshing perspective that captivates with each twist and turn of the plot. A job well done! This is a film I am eager to watch again.",
    "date": "2023-12-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A 20 years boy falling in love with a granny... Disturbed mentality accept such things. 🤮🤮",
    "date": "2023-10-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "With a bland story, zero humour that lands and nonexistent chemistry between the two leads, \"The Perfect Find\" is one of the most painfully boring movie experiences I've had this year.",
    "date": "2023-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A good romance with fun performances.  The adaptation was good, but there were some changes to the plot.  Worth watching",
    "date": "2023-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Not enough rom or com for me. The lead male actor wasn't strong enough to hold the film and bring it to life. Their story wasn't particularly romantic and the cast could've benefitted from some stronger comedic actors.",
    "date": "2023-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "No. Just no. And the ending was so bad. Tia Williams wrote a great novel which does not translate well into a film. \n\n1 star and 3/10 rating because the acting isn't bad but the storyline is very bad.",
    "date": "2023-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I am a person of color and I must say I am IN LOVE with this movie. I feel most non POCs wouldn't understand",
    "date": "2023-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "What a low budget romcom🤦🏽‍♀️",
    "date": "2023-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Really love some of this cast so I'm giving it a chance but really I want to turn it off midway through the movie. The editing and script are really junk. Unbelievable and trite. Finishing it out of respect but disappointing.",
    "date": "2023-06-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie got the reaction out of me quite similar to the first time I watched Pretty Woman with Julia Roberts & Richard Gere . This was a Perfect Find on Netflix !",
    "date": "2023-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Great to see Gabrielle Union back in a film. And yes I noticed the Dwayne Wade cameo at the gala!  Good movie worth a watch.",
    "date": "2023-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Hmmmm it didn't give what I thought it would give.  The book was so much better!  I disliked that some of the best parts of the book were changed in the movie.  Also, it wasn't paced right.  It was just okay to me.  Great actors not the right acting direction.",
    "date": "2023-06-23"
  }
]