[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I LOVE YOU JACK FROST",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Rise of the Guardians' unique premise and incredible animation for its time sure makes it feel all the less satisfying when its middling story struggles to keep up.",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Loved this as a kid, still kinda love it now. Didn't really lose it's touch much.",
    "date": "2025-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Um filme incrível que revive a infância de qualquer um, Rise Of Guardians é uma narrativa com muita aventura e ação, dando muita diversão!",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Rise of Guardians is one of the best animated movies there is like I would watch it every Christmas with my family good job to the production team",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A very good movie that I've been watching since my childhood, it has a good theme.  I feel like each character needs more development or more problems in the story, but otherwise it's very good 😍😍\n\nJhesua Díaz",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I don't like Pitch Black.",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1 hour and 37 minutes!!!!!!!!!!!!!! Rated PG for Thematic Elements and Some Mildly Scary Action!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $103,400,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was spectacular! The animation was mesmerizing, the story was compelling, and it was so much fun to watch. I definitely recommend it!",
    "date": "2025-06-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Rise Of The Guardians is so underrated, it's such a lovely movie.",
    "date": "2025-04-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was an absolute classic! It’s an absolute must-see.",
    "date": "2025-04-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very funny and interesting",
    "date": "2025-04-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The idea of making guardians for kids is fantastic.",
    "date": "2025-04-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I remember watching this movie as a kid, so I went back and watched it again now thr it’s on Netflix. I’m happy to report that it holds up very nicely, with a pretty good moral! They don’t make movies like this anymore.",
    "date": "2025-04-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Rise of the Guardians comes with excellent plot twists, engaging story line and presents us that optimism can be found on the darkest nights. Just \"believe\" and be determined. Whoever, it goes very far on the \"believing\" part.",
    "date": "2025-02-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is my favourite movie, it is so good. I wish that we could have a sequel.",
    "date": "2025-02-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is my go to holiday movie! The characters are amazing, and I love their interactions between each other.  I would like a book or a movie that would give more background information on Santa, the Easter Bunny, Tooth fairy, and the Sandman, that explored their origin stories. They do give us a peak in Jack's beginnings, though, and that's because he's the main focus. We get to see him grow as a character. It's a nice little fantasy story that has some action and wholesomeness packed into one. If you need a cozy movie night during Christmas or Easter,  I highly suggest this movie. It's perfect to watch alone or with your kids.",
    "date": "2025-02-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's simple, charming at times, and has a solid voice cast.",
    "date": "2025-01-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Easily one of my top three movies. Absolutely so well done.",
    "date": "2025-01-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I remember watching this as a teenager and really enjoyed it then. I have a 2.5 year old and this is now her favorite movie. I love the style of animation and the storyline is really great. I definitely feel like this is an underrated movie and deserves more hype",
    "date": "2025-01-02"
  }
]