[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Long live the Kaiser. Well executed, good storyline, emotional and includes action. A good documentary about a sad event.",
    "date": "2025-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "We all miss Michael! This tells a lot of interesting things about Michael's career and private life.",
    "date": "2024-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "prolly my favourite documentary of all time",
    "date": "2024-04-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Felt as good as the Drive to Survive series but about Schumacher. Really enjoyed it and it's a shame that such a tragic event happened to such a great person.",
    "date": "2024-01-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Good overall & interesting documentary about the man behind the race car and how he achieved success from an early age.",
    "date": "2023-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Documentário sobre um dos maiores pilotos do mundo, sou apaixonada por fórmula 1 desde 92, felizmente tiver sorte de assistir a grandes pilotos como Senna, Prost, Schumacher, mas te vejo em felicidade de torcer para Alan ao invés para Ayrton, uma infantilidade doentia que hoje eu compreendo e reprovo... Gostoso ver a determinação dessa excelente profissional, desde a infância, quando tirava água de pedra, utilizando-se de carros mais simples por falta de verba… Emocionante #Chorei...",
    "date": "2022-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This was a chronological record of his life and greatest achievements and enjoyable to watch. But it was woefully short on interesting details, it came across as a fully sanitised version for his family to remember the good times by. I watched this to get an understanding of what happened to him in the accident and beyond, yet the film completely glossed over this. I learned more from a google search than the film on his life, disappointing.",
    "date": "2022-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "As a Schumacher fan going back to his days at Benetton, much of this was a blast from the past. I think it could have gone a bit deeper on his legendary work ethic. The film touched on that, but If you're unaware of his reputation in this area, the movie leaves you wanting. I really enjoyed the glimpses into his off-track life. Despite his cold, focused, intense reputation on-track, I was impressed by how devoted he was to his family while racing, at his basic humanity. Great film for any F1 fan, especially Schumi fans.",
    "date": "2022-02-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great film. Well told story and showed another side to Schumacher you didn't see as the racing driver.\n\nBrought back lots of memories watching him drive when I was a kid. The absolute best.",
    "date": "2021-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "As a Formula One fan, the movie is a great tribute to one of the greatest of all-time. However, I finished the film wanting more. The film described some of the pivotal moments of the career, but I would have preferred more racing content and a breakdown of what made him such a great driver. That technical analysis would have been fantastic. And then the personal life of Schumi also could have been explored more. My takeaway is that he is a perfectionist, but we are only given a few examples of when he crosses the line, and it is unclear what the consequences of those actions were. Ultimately, I think the movie was constrained by the fact that Schumi is in a critical medical state and that they needed the cooperation of the family. Not a bad movie, but not particularly inspiring film either (despite Michael's brilliance)",
    "date": "2021-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A good storyline of an incredible man with an incredible career. Learnt a lot of things about his early days before he became the worlds best.",
    "date": "2021-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "To simply say this movie is great is an understatement, but let me break down some personal biases that I have. I am a huge Formula One fan and have always grown up around it, and my dad is a Mercedes fan, so Schumacher is someone our family loves.\n\nHowever, If you are watching this film to find out whats happened to Michael Schumacher then you are wrong. The point of this movie is not to be a status update on Schumacher, rather a tribute for him and his family. The movie showcases never seen footage of his well-documented life. From his early childhood, up to his championship titles.\n\nIs the movie emotional? Yes, this movie if you are a Formula One fan or know anything about Schumacher your heartstrings will be pulled at for sure. But, this film truly is a tribute and honouring of Michaels life, and we must respect that. So yes you and your family should go watch this film.",
    "date": "2021-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Muito bom, só é meio forçado (como todos os documentários Netflix) em alguns pontos, como um drama exagerado.",
    "date": "2021-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Excellent! It made me love Schumacher really much",
    "date": "2021-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I liked the fact that this documentary ran away from the obvious: Michael's peak between 2001 and 2004, his retirement in 2006, and his return with Mercedes between 2010 and 2012 are footnotes, a controversial decision I liked, but I can understand who hated it. Its focus is on Michael's difficult ascension, his relationship with Senna, his consecration at Benneton, and the most difficult challenge of his career at Ferrari, from 1996 to 2000. This movie also changed my opinion about an incident, but lost me when Willi Weber, while speaking about the 1997 crash between Schumacher and Villeneuve, said with these words \"Michael is Capricornian\". I needed time to recompose myself. Some presences surprised me, like Mark Webber, but a guy who I missed and would add a lot is Fernando Alonso. Most people missed Rubens Barrichello, who was Schumacher's teammate during his five consecutive world championships for Ferrari, but their story was already told dozens of times, so I don't think his presence would add many relevant things, at the same time I agree with these people who think it would be nice to have him. Another thing I liked is the fact that the documentary doesn't require nostalgia to work. I was born in 2001 and started to watch F1 in 2010, the only Michael Schumacher I saw live was the Mercedes one, who was older and constantly behind Nico Rosberg. The music is a little bit manipulative but the documentary can touch the public. It's an approach more honest than Drive to Survive's 3rd season, which overdramatized 2020's F1 season.",
    "date": "2021-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This sports documentary was really good. The entire crew did a fantastic job on bringing Michael Schumacher's story to life. It goes into great detail on his life and career as a Formula One race car driver. He was a true inspiration not only in Formula One, but to the world as well. Throughout his life, he never gave up and learned from his mistakes to be a legendary race car driver and a great man to his family. If you're a Netflix member, you should watch this even if you're not a racing fan. It's a must see.",
    "date": "2021-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I think he deserved a more honest, insightful documentary...the good and the bad.",
    "date": "2021-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Where can I start? I was a huge fan of F1 back in the day, and I followed Schumacher's career. The story has holes everywhere. I watched it with my partner, and I had to keep explaining all the bits missing because they were relevant to the story. If you don't know F1, you will end up very confused with the movie.",
    "date": "2021-09-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Como Documental fue increible recordar su leyenda, con todo y eso que nunca me levantaba en las mañanas a querer verle ganar a él precisamente. Buena elección de cast para contar sus anecdotas, de una carrera que desconocia de sus bajones deportivos (vistas 1)",
    "date": "2021-09-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Quite good, never really gets under the skin, almost like a greatest hits tour, didn't feel as though I learnt anything new.",
    "date": "2021-09-16"
  }
]