[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I’m mystified by the bad reviews for this film. I was hooked from start to finish. A well acted, human story with a sci-fi background. Truly emotional with real characters to care about. If so many people don’t like this film, there really is no hope. Please ignore the negative comments and give it a chance. I loved it.",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Android/Mother is one of those movies that looks promising but totally falls flat. The only real highlight is Cloe, who pretty much carries the whole thing just by showing up. The acting is stiff, the script is awkward, and whatever emotional moments they tried just don’t land. Also, for some reason, like every other apocalyptic movie, everyone ends up hiding in the woods, even though you’ve got an android with every tracking sensor imaginable. Makes no sense.\n\nThe only highlight is the random Converse ad (which, I gotta admit, made me like the shoes even more), but aside from that, nothing here stands out. The story tries to focus on Cloe and her husband, but their connection never really clicks. Overall, skip it unless you’re a big fan of Cloe or just want some shoe inspiration.",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Huge Chloe Moretz fan and she holds up well in this movie. While not the best of it's genre it's still an enjoyable watch. Steady pace and enough to keep you viewing. But probably easily forgettable as well",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The acting is great, Chloe is wonderful as always. The fear, and urgency to arrive at their destination before giving birth was palpable for me. \n\nAs the audience we know the baby is not going to die, that just doesn't happen in American films, that fact alleviates a lot of opportunities for certain outcomes, because we know mother can't die, at least not yet. That doesnt mean their journey is not going to be dangerous and interesting. \n\nThe story jumps at spots which may bother people, it's to move the story along and focus on the important aspects. I enjoyed it.",
    "date": "2025-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It was slow in parts and the whole thing was farfetched but it had some twists at the end that were pretty good.",
    "date": "2025-05-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "¡Malaza! La trama es ¡meh! Y el presupuesto se nota que se fue en los actores. Además, tenemos a una copia de Will Smith, con una interpretación, blanda, sosa y perezosa. No ver a menos que se use como fondo para hacer el amor.",
    "date": "2025-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This is the movie that made me sign up to reviewing... 32% are you kidding me? It's a slow burn with (viewer beware) no slasher porn or violence. Ok, a highly uncomfortable, off-screen bit of violence, without which it'd probably get 20%... it explores the underpinnings of family, loyalty and what makes us human, with a beautiful bit of acting from Raul Castilllo. A debut by Mattson Tomlin, which frankly is a breath of fresh air and I had to check wasn't an actual book before resuming counting my toes before the next streaming gift. Everyone else can resume watching SAW reruns or whatever it is that gives you joy.",
    "date": "2025-03-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A very sad depressing poignant end to a dystopian Sci-Fi movie.  Lots of a untold gaps in the story.",
    "date": "2025-01-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "happened to my buddy jaehyun once",
    "date": "2024-06-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This film consistently leaves you wanting more... a lot more. Every 10 minutes or so I debated shutting it off, but it's just BARELY entertaining enough that I kept watching until the end. It offers you the absolute minimum you can expect from a film. The female protagonist isn't likeable until like 3/4 of the way through the film, however they don't play on this well; it's like they thought they were making her character likeable the whole time. Multiple opportunities for exciting scenes are thrown in the trash, for example *spoilers in next paragraphs* (but you may as well read the spoilers)\n\nWhen the robots take over initially the protagonists just barely escape a house and see chaos all around them. Then BAM! 6+ months later they're safe in a tent in the woods. Wearing clothing that looks clean and new as if they took it off the shelf yesterday and ironed it. There was no explaination whatsoever of how they escaped the city and survived that long in the woods. Later they just barely escape a bunch of robots again, and the birth they've been building up towards for the whole movie isn't shown for a second. BAM! She wakes up in a hospital safe and sound and dialogue is used to tell the audience what the hell just happened. Also near the end of the film there's a montage of how much the female protagonist is suffering by giving up her baby to live safely in Korea, which makes sense, (Pretty much the only good, compelling, scene btw) HOWEVER it is just implied the boyfriend will succumb to his wounds eventually. Without a word or second thought it cuts to the female protagonist walking around alone, after having presumably watched her boyfriend die, or ditching him assuming he will die soon. Like okay?? The whole film was about him surviving together and they skip right the heck past him dying / her leaving him. Horrible.",
    "date": "2023-12-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Mother/Android is a new Netflix original film. It was an odd film because while I enjoyed the film, the rest of everybody (who's seen the film has not). Now usually I watch Netflix films with a bit of reservation, they're not always one hundred percent. Netflix has a pattern that shows in all their films; the narratives tend to have weak strings connecting them, and many times these films are filmed with obnoxious novelties that sometimes just don't work. \nNetflix, however, has been bringing surprises, in my opinion. First, with ‘Don't Look Up' that pleasantly surprised this fan of disaster film with a down to earth film that dare I say broke the cycle of disaster film disasters, and now with, what I believe to be a very misunderstood post-apocalyptic film with a terrifyingly realistic future. \nTo begin with the positives, I liked the concept and plot of the film. I liked the characters and believed their story to be brought out in a mostly compelling way. I loved the ending because I thought it was actually smart. The film's decision to keep Sam alive until the end, defending his family built tension and carried weight from the beginning of the film where his death is eluded to.\nMy biggest critique of the film would be that while the concept is rather interesting, the setup for some scenes I found to be lacking creativity, and the way scenes are brought together on screen is somewhat generic. Another issue I had was with the twist at the end of the film involving a character introduced halfway in. The film attempts to subtly hint that he is a robot but sadly most of the film best tries come off actually on the nose.\nMy last looming flaw with the film is that from the beginning of the film Georgia is sideswiped with the fact that she has become pregnant and at first she doesn't know if she even wants to be with Sam. Immediately after the ‘blitz' her attitude towards Sam completely changes and now she cares more about him than she did at the beginning of the film even though he makes dumb and impulsive decisions throughout the film. Her increased care for his character, I found to be unwarranted and therefore makes her attempt in the film to save him and have his back seem unearned.",
    "date": "2023-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Slow burner but a good story and compelling ending!",
    "date": "2023-06-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "If you wanna have a good 2hrs nap that's the movie for you.\nIn ones hire and fifty something minutes there are literally 10 minutes worth of your attention. The rest is all big yawn.",
    "date": "2023-03-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Mutter/Android ist eine postapokalyptische Science-Fiction–Thriller, geschrieben und inszeniert von Mattson Tomlin. Eine interessante Geschichte, über eine schwangere Frau, die mit ihrem Freund auf den Weg nach Bosten sind… . Der Film besitzt einen starken emotionalen Kern, aber genügt das? Dem Film fehlt eine überzeugende Handlungsentwicklung in jeder Richtung… . Chloë Grace Moretz ist in ihrer Rolle eine erstaunliche gute Schauspielerin… . Mutter/Android ist ein sehenswerter Film, er ist kein Science-Fiction Film im klassischen Sinn. Science-Fiction Anhänger werden ihn nicht mögen, aber die mehr auf ein Drama mit starken Emotionen stehen werden ihn lieben… . Ich persönlich habe den Film, trotz einiger Mängeln ehrlich genossen.",
    "date": "2023-01-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Was good but pretty slow and emotional. More should have happened and had kind of a bad ending",
    "date": "2022-12-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Simply, not credible at all.",
    "date": "2022-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A couple's uncertainties about the practicalities of having their first (unplanned) child with the added drama of being set in a dystopian apocalyptic setting.  Moretz definitely looks the part as the exhausted but determined mother, but the slow pace and focus on the family drama rather than the wider science fiction setting meant it struggled to hold my interest.  It briefly covers the same themes to every other subservient robots gone rogue story and the emotional ending does hit hard, but the song choice spoilt it a bit and there was nothing surprising about it.",
    "date": "2022-09-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Nudny. Fabuła z czapy. Przypomina amatorskie, bardzo niskobudżetowe filmy",
    "date": "2022-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "33%?  Are you kidding me.  The underlying message of the power of the family unit was just too much for ....well the critics.  This movie built slow and made capital out of every emotional opportunity...but damn....Is 'I will die for my family\" lost... really?  \nIt was good. Chole was good.  The element of the mild mannered black responsible husband was bolstered by the fact he was a big time bad ass and personal and family integrity out the roof.  If they would show this movie to 6 and 7 year old black males it might change the world.",
    "date": "2022-05-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Certamente la trama non porta praticamente nulla di originale e la protagonista incinta è tutt'altro che interessante, soprattutto per il monopolio delle scelte che comporta.\nBuone le ambientazioni nella natura, protagonista per larghi tratti.\nCol passare dei minuti sale la tensione che culmina con l'operazione di salvataggio che offre delle interessanti sequenze ad alto contenuto ansiogeno.\nIl finale è sicuramente la parte più originale; il colpo di scena funziona e la colonna sonora è perfettamente adatta.\nPeccato che non si capisca bene la situazione all'interno della città, troppi punti confusi sulla battaglia.",
    "date": "2022-05-24"
  }
]