[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I don't care what other people about this film being bad, as a teenager I can say it's a good film👍 Give Uglydolls credit it needs.",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Y'all leave ugly dolls alone it's SO GOOD. The music is amazing, the story is just fine imo. Moxy is so adorable. 10/10 ending. Even cried a little. Toddler also approves!",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I liked the ugly truth song good movie",
    "date": "2025-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The music is amazing. The animation is amazing. The storyline is… uhh… kind of weird.",
    "date": "2025-04-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Uglydolls is a 2019 animated film  based on the toys I don’t own a Uglydolls merch but we need a sequel before gta 6 or else I will never play games until we get a sequel at least give us a tv series please I beg you 5/5 wonderful🤧😍🥰😍😍🥰😢😍😂🎎🤑💵💸💲🤑🤑🤑🤑🤑",
    "date": "2025-04-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Amazing positive message for children. Great Soundtrack as well.\nAccepting yourself for being different is the main theme of this movie.\nThe world can be so unkind.\nLove yourself. 😀❤️\nWe are not perfect but we're still amazing in our own way.",
    "date": "2025-02-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The critic reviews about this cute film are absolutely absurd. My child loves the music and the lesson is learned in the storyline in a way that is gentle yet impactful. I think some people have forgotten the innocence of childhood and are harshly judging movies like this which is very unfortunate. It is hard to find children's movies free of scary events that are difficult for toddlers to comprehend. What is the point if kids aren't having fun? I love the songs and the graphics. We laughed together throughout.",
    "date": "2025-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I wanna be playing it so bad and I wanna trade for the big world",
    "date": "2024-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is phenomenal Kelly Clarkson was amazing at voicing Moxy. One other thing I loved about this movie was Moxy herself i have a huge connection to her and I love her soo much ❤ ❤❤",
    "date": "2024-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Está es una buena película ya que te enseñan una gran lección \nEs de no rendirte ante lo que digan las personas o sociedad \nY te cuentan el pasado correctamente",
    "date": "2024-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It’s Super Fantastic, These all UglyDolls wants to be a hugs for friends. It has to be higher gross of this film.",
    "date": "2024-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "3X the audience score of star wars, let's Goooo!",
    "date": "2024-06-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's a great movie. It is very enjoyable and entertaining. There is great creativity in the story and the characters, especially the UglyDolls. The music and animation of the film is also very good. I enjoyed it very much, highly recommended movie.",
    "date": "2024-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It's terrible, but I would rate this a 43% it's not good and the animation is good, cast us good, but it's too much like toy story 3",
    "date": "2024-04-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Es mediocre las canciones son buenas y animación es increíble Lou es gran villano Moxxie es plana la película es entretenida es un 5.4 de 10",
    "date": "2024-01-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Il film perfetto per tutti.\nCome insegnare ai bambini che le diversità li rendono loro stessi",
    "date": "2023-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The Songs are good and heartfelt & the Vocal & song performances of Kelly Clarkson, Pitbull, and Blake Sheldon, are very nice, but that's the only reason to watch the movie, other than that a Less Than Moderately Bad and Shallow movie; because it's Derivative of Toy Story 3, Trolls, and The LEGO Movie, and executed poorly and soullessly... sometimes there is a heartfelt and sentimental moment that is somewhat relatable and a feel-good vibe to it, but that's not enough to somewhat pass the time... I was mildly Apathetic and sort of bored of the rest of the movie, I only felt happy-good for the songs and musical numbers... 4/10",
    "date": "2023-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "pretty garbage........",
    "date": "2023-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I liked the lesson that the movie gave",
    "date": "2023-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "RESSES PUFFS RESSES PUFFS, EAT EM UP EAT EM UP EAT EM UP!",
    "date": "2023-07-06"
  }
]