[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This is another movie that's been unfairly rated by old men who use nostalgia to drive their bitterness at a world that doesn't conform to them. It was not Oscar worthy but it was a fun watch that kept the MIB franchise alive.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This is yet another very average film. It’s hard to place why I didn’t like it more as it had excellent production quality and on paper much more potential than the direct sequels to the original. Sadly I found it very forgettable and pretty much the same level of enjoyment and engagement as the previous sequels but it should be better. I liked the casting but the only character I liked was Molly. The villains were cool. I don’t know, it just didn’t come together somehow.",
    "date": "2025-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "What a waste of time with trash dialogues.",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It's marginally better than MiB II, but otherwise it's a pretty dumb & boring action comedy with some fun effects work.",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Was expecting so much of it, but it disappointed me. They indeed have a good CGI and special effects, but the story is just boring, it's not a big plot or a \"mid\" movie, it's just bad, I was relieved when the movie finally ended.",
    "date": "2025-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, o elenco é mais ou menos, e ninguém ajuda a melhorar o filme, a história é fraca, os personagens sao fracos, e o filme deveria ter cenas bem melhores e relevantes para fazer o filme ser bom.",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Not like the original movies but decent",
    "date": "2025-04-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I love the MIB trilogy but this movie disappointed me. I had high hopes because I love Chris Hemsworth and Liam Neeson but I honestly just found this movie boring. First actual bad one in an otherwise great franchise.",
    "date": "2025-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It is a kids movie after all.\nStill better than Cars 2.",
    "date": "2025-02-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Was nice to be back in the MIB universe but this felt like a disingenuous remake. It's hard to follow up the original masterpieces but they should've tried harder.",
    "date": "2025-01-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "**** you, Sony Pictures!!!!!!!!!!!!!!!!",
    "date": "2024-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "While superficially similar to MiB 1-3, in fact it's lightyears away from them.\nIt's simply missing almost everything that made those ones vastly enjoyable: the creative firework, the tons of jokes that go beyond the usual, the believable humanity of its lead characters, the ability to constantly surprise the viewer; and, perhaps most of all, the deep irony that hangs above the whole thing and makes the viewers smile half of the movie time. \nInstead, this is a lazy movie that opts to fall back to cardboard leads and well known, worn-out Hollywood cliches. It tells a story the audience has seen a hundred times already, ending up as predictable and, despite the action, somewhat boring even. Ultimately this is a movie that displays Hollywood’s stringent technical professionalism in many ways, only it lacks the inspiration to give it an actual soul.",
    "date": "2024-12-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This just doesn’t feel like the “MIB”",
    "date": "2024-12-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "There isn't another movie that made me want to walk out the cinema as much as this",
    "date": "2024-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was by far the best MIB film....hopefully they make a sequel with the same actors! Please don't listen to these low IQ people that only complain about BS! 'ahhg it's not the same as the first 3 films' yeah no Sht Sherlock a reboot is not supposed to be the same!! It was and still is the best MIB film!! Rotten tomatoes meter should be 100%",
    "date": "2024-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I enjoyed it more the second time around and seeing the MIB world from the another perspective was probably what we needed. So I am kind of glad W. Smith turned it down, especially now that he's proved himself to be so incredibly unlikeable. I wouldn't mind seeing a sequel that connects both the USA and London branches in some way. But I'd imagine we're more likely to see a reboot.",
    "date": "2024-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "An insult to the first film , this is a bland and tedious film full of all the worst aspects of Hollywood. There is no story arch for the lead character Tessa Thompson who plays agent M is one of the least likeable and believable characters in any film , she for no reason and with no training knows everything and can beat and outsmart agents who presumably have work for MIB for years . It’s pure garbage don’t watch it.",
    "date": "2024-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Entertaining and action-packed. Not particularly creative or novel compared to the previous movies but it delivered on my ecpectations.",
    "date": "2024-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It felt underdeveloped and very predictable, I think this could have been much better but the leads do not give the same comedic energy as Will Smith and Tommy Lee Jones",
    "date": "2024-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The worst Mib movie👎",
    "date": "2024-07-22"
  }
]