[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "i absolutely loved the movie so much gore",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Was not really focusing just studying its om",
    "date": "2025-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Sadie Sink was incredible",
    "date": "2025-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is one of my favorites in the fear street trilogy, it actually does feel like 1978, and also, I love the references to older slasher movies such as Friday the 13th and the shining, and it also has great gore once again, but also the ending genuinely made me tear up. I highly highly recommend fear Street part two.",
    "date": "2025-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This second Fear Street movie was great. Sadie Sink, Emily Rudd, Ryan Simpkins, Gillian Jacobs, McCabe Slye, Ted Sutherland, Jordana Spiro, and the rest of the cast did a great job in this movie. The plot of the movie was insane and thrilling. It's about what happened at a summer camp in Shadyside and how it's connected to the first movie. If you haven't seen Part 2 of this trilogy yet, check it out sometime, but see them in order. It'll all make sense.",
    "date": "2025-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Love this trilogy, great sequel to the first movie",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I absolutely couldn't wait to watch this after getting through Part One this afternoon, and it more than lived up to my expectations. \n\nWhereas the first film was a decent but very flawed love letter to 90s horror, this movie is a more clear reference to 80s slashers, especially Friday the 13th. But it's so much more than that. I genuinely cared about these characters (a standout performance by Sadie Sink, who between this and Stranger Things is one of my favorite young actresses, helped a lot there), and was tearing up during the ending. Add to that great expansions to the lore, a darker, gorier story, and an intriguing twist to perfectly set up the next film, and you have a rare middle chapter that stands out. I'm unbelievably hyped to watch Part Three.",
    "date": "2025-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Fear street part 2 is an awesome prequel with a great twist and a savage killer.",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Fear Street Part Two: 1978 improves slightly over its predecessor but the story is less interesting and has an ok performance by all the cast.\n\nAs a standalone, it’s a fast, fun watch with lots of nods to classic films and a good sense of humour, but as part of a whole, Fear Street is building to become something genuinely unique and special of its own.",
    "date": "2025-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Although I prefer the first one, this sequel is a fun and intense while also paying homage to other camp slashers.-💀💩L",
    "date": "2025-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "my favorite of the three, the characters, the setting, the plot, all was definitely better in this one. The Berman sisters are superior",
    "date": "2025-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Like Empire Strikes Back & Back to the Future 2, this one is a solid middle story that takes us back to the age of CAMP BLOOD & THE CROPSEY MANIAC. Anyone who grew up watching cut up slasher flicks on TV will dig this gem.",
    "date": "2025-06-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Really good.",
    "date": "2025-06-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "By far the best of the series and that still stands with the release of the fourth in the series.  All the characters were compelling and it had a mixed feel of Scream and Friday the 13th.",
    "date": "2025-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wow just wow my favorite movie of them all. All movies i watch is being drowngraded by that",
    "date": "2025-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "BETTER THAN THE FIRST - SOMEHOW. its giving friday the thirteenth but with witches. i loved it, a movie that doesnt hold back on gore, sex, drugs or language and it PAYS OFF",
    "date": "2025-06-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best movie I love it",
    "date": "2025-05-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It makes good use of the film's universe and the characters remain charismatic, albeit with some reservations.",
    "date": "2025-05-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Better than the first one, it’s a slow burn but the slow burn is worth it when the result is actually scary and not just a fall off.",
    "date": "2025-05-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "26-5-2025\nIt was far superior to the last one. I was particularly thrilled when 'The Man Who Sold the World' by David Bowie, one of my favorite songs, began to play.",
    "date": "2025-05-26"
  }
]