[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Understanding that this is a inexperienced Lara...the film still lacked the empathy, courageousness, and intelligence of the previous(Angelina Jolie) films in the franchise. Don't enter this film with any expectations of a true explorer/tomb raider",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This Laura Croft had 0 skills. She wasn’t even particularly coordinated. It’s like the producers asked “what if Laura was a completely unremarkable person”.",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Dull and lifeless, lacking any of the grit of the recent games or the campy fun of the previous movies.",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Tomb raider.....s daddy issues",
    "date": "2025-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1 hour and 58 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated PG-13 for Sequences of Violence, Action and Some Language!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $57,300,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Vikander looks great in a small vest top and….that’s pretty much it. The plot was basically scooby doo having a day off. Not entertaining. Watched on DVD.",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Great movie adaptation from the 2013 game. It could have been a bit more faithful in terms of the supernatural elements - it presents rational explanations to things that happen in the game, but Tomb Raider is not about that. Alicia Vikander is a great rebooted Lara Croft, yet very similar to what a classic version of Lara should be - which is great!",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "She doesn't have the assets to play Laura Croft.",
    "date": "2025-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "They hired Alicia Vikander for the role, an actress who is very different from the version of Lara Croft in the latest Tomb Raider game series, for this reason I decided to never see the movie, because for a film adaptation I did not want an identical actress, but at least I wanted her to have a medium or small resemblance, I do not despise Alicia Vikander for that, in fact I like this woman, I liked her before the movie was made and I still like her, although she should not play Lara Croft in such a movie, it was not at all suitable, since Lara in such a story is practically a young girl just out of her teens, the villains call her a child, while Alicia Vikander could not be called a child, in fact if in the movie they call Alicia Vikander a child, the viewers are stunned because she looks very mature, but that does not mean I am going to despise the actress, I simply refuse to see the movie and I am still a fan of Alicia Vikander although I consider it a mistake the fact that chosen to star in such a film.",
    "date": "2025-06-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A rather weak film. The legend of Himiko is interesting, but it’s left unexplored—just like the rest of the plot. There are way too many questions and far too few answers, with lots of miracle rescues and sudden revelations that the whole story relies on. I didn’t like the soundtrack choices, and there are clearly too many sentimental moments—though they don’t really evoke much emotion.",
    "date": "2025-05-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not bad for a video game movie or a remake. A decent action/adventure film.",
    "date": "2025-05-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Perfect tomb raider. Insane graphics. Makes me truly remember the game.",
    "date": "2025-04-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Alicia Vikander was awesome for the role. Thing that pisses me off is that they made Lara a stubborn idiot. Her whole trip could've been so much easier if she would have just taken a moment to sign for her inheritance. She may have saved her dad with a proper team, better equipment, better boat and even a helicopter. Hell she could've taken guns, why you say, why not I say, you don't what or who you're gonna find. Also why tf did she even leave and become a regular Joe in the first place, just to struggle for a living when she doesn't need to. Typical Hollywood adding pointless struggle to the mix to try make things more interesting. Turned out okay though.",
    "date": "2025-03-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "If your a fan of the new reboot trilogy, go for it for sure, if not youll find a cheesy and pretty straight and narrow adventure flick",
    "date": "2025-03-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It's unfathomably boring unfortunately as Alicia Vikander does great as Lara Croft - but it simply isn't well written to maintain your full focus",
    "date": "2025-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's a time me pass good film it's would be great film but nevermind it's a worth a good try for studio n vikander is incredible for her performance n all over it's a fun to watch 😃♥️",
    "date": "2024-12-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Poor camera work, poor script.\nWhy bother.",
    "date": "2024-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Good movie of you if hungover. If your fully engaged then Mabey keep scrolling through Netflix",
    "date": "2024-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The first 20 minutes of the movie is the main character not succeeding at anything.  Lost interest after that.",
    "date": "2024-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I had a good time watching it, but I am a really big fan of the games so if you are not into this universe this movie may not be for you.",
    "date": "2024-10-22"
  }
]