[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The worst movie ever.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Some people are going to love this movie, and some just won’t, and honestly, a lot of that might come down to the color of their skin and what they’re ready to face. But as a Black woman, I loved it. This film sparks the kind of conversations that need to be had, real, raw, and overdue. It’s a step in the right direction, for sure.\n\nThat said, I have to be real, Nia Long deserved way more lines. Period. She’s a star in her own right, and limiting her made certain parts of the film feel less authentic. Adding a few Black producers behind the scenes would’ve easily pushed this movie into my top 10. Still, I give credit where it’s due,  it made me think, feel, and talk. And that’s what good storytelling should do.\n\nStop hating - lol . Great movie.",
    "date": "2025-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "You People tries to update a tired culture clash premise for the modern world, but only succeeds at being wildly uncomfortable.",
    "date": "2025-09-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Like others have said, even a great cast couldn’t save this lemon…. Yes we get the idea behind it but so sick of hearing the N word all the time, it was just so forced and cringy.",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Kind of heavy on some wo ke messaging, a few laughs.  Overall just okay.",
    "date": "2025-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Made me laugh really hard",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "i love jonah hill but this is a flop they made it all about politics",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Super flat. No texture. Zero connection. I could only watch up to the part where all the parents met at the couple's new home. I wanted to stop watching much earlier but I like Jonah Hill and was expecting some actually funny stuff from Eddie Murphy. It's sooo bright and all their clothes are new; it's irritating. Kenya Barris and his Blackish people made sure you feel their presence with soulless everything.",
    "date": "2025-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it, a little cringe but you gotta find the humor in it!! The cast is awesome",
    "date": "2025-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It had a few funny moments but it wasn't enough to save the movie from the old white and black narrative",
    "date": "2025-05-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I see people writing things like \"oppression olympics,\" but they obviously have zero idea about the commentary the movie presents. The top review says it best: \"It's a social commentary and romantic comedy, but the movie can't seem to commit to either...\" (paraphrased)\n\nA lot of people commented about the insane lack of chemistry between the two main characters, which is fair. I mean, sometimes movies have bad direction and/or bad writing --It's not really the actors posing the problem. \n\nThere are quite a few cringe moments (but, for the love of God, it's gotten better since the early 2000s where the peak of \"black & white people are different 🤯\" comedy was like, a stuffy old granny who ends up wearing a sideways cap & rapping by the end of the movie 😆) and I was a bit upset that when his mother was trying really hard (TOO hard) she got super-angry. I get being tired of the perceived microaggressions, or maybe even afraid you're just another prop, but I feel like the anger just perpetuated the whole \"angry black woman vs. tiny, frail white woman\" thing, rather than sending a message against it. \n\nI'm glad it didn't have a s•x scene. Not prudish, I just don't like watching other people bªng 😅 It was a good \"popcorn movie.\" If you have a lazy weekend for once, grab a snack & let your brain rot for a while. One of these days we'll get the interracial love story correct...",
    "date": "2025-04-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "As someone in an inter racial relationship this was spot on. The religious concepts to going on dates and telling your family about your partner was all great. Was definitely more a romance than a comedy but all around great film with great characters & cast.",
    "date": "2025-03-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Stupid movie, only bright spot is Eddie Murphy as a Nation of Islam guy—pretty hilarious. I think they were reaching for straws here. Most of the scenes that played out seemed like they belonged in a different decade. I don’t think over 90% of Americans give a damn about so called, “Inter-racial relationships”. Trying to force a lowest common denominator on the audience, felt exploitative and counterproductive.",
    "date": "2025-03-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thoroughly enjoyed this - best comedy in a long time. Really shocked by the low ratings",
    "date": "2025-02-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "First of all DONT ever make fun of Jesus Christ...\n2end of all there are very few funny scenes but waaaay too many bad words/foul language and bad songs. Not a good movie imo. Don't recommend. And definitely not recommend for children...",
    "date": "2025-01-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Easily 10/10.\n\nGreat humor, comedy, and a real love story going on here. Casting is fantastic and the ending could've been a bit better, but ovarall loved it. We need more movies like these!",
    "date": "2025-01-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The actors are the only redeeming part of this movie. However they can't stop the inhuman dialogue and terrible scenes they have to act. The message they preach is the opposite of what they wanted to achieve.",
    "date": "2024-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A movie that very well represents the cultural clash between two very different cultures, making you reflect on how we are as people who are part of this culture. It gives us lessons in empathy and reflection, while also being a film that can make you laugh and think. Great performances by Jonah Hill and Lauren London. Recommended when you want to have a good time and end up with a positive attitude after watching it.",
    "date": "2024-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Simply awful....this is the standard of modern cinema in 1 movie",
    "date": "2024-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A terrible film about two groups of people, that seem to hate everyone else that's not in their group of people, fight it out to see who can play the victim of things that only happened to Thwir ancestors. \nAnd another side likes it when the other hest the upper hand at being the victim. \n\nJust awful all round.",
    "date": "2024-06-29"
  }
]