[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Filme clichêzasso, uma prostituta, um cara rico conhece ela, eles se apaixonam, tem umas briguinhas durante o pouco tem que tão juntos e no final eles dão certo, a trilha sonora é boa mas tirando isso nada de absurdo no filme, filme sem empolgação nenhuma. \nNota 6.5",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "With Julia Roberts and Richard Gere bonding like glue, Pretty Woman is a contemporary fairy tale that has plenty to say about public perceptions of prostitutes, as well as being kind across class distinctions.",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Schmaltzy and predictable, but charming and full of heart thanks to Richard Gere and Julia Roberts.",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Pretty Woman (1990) is one of those rare romantic comedies that has truly stood the test of time — a sparkling blend of humour, heart, and undeniable chemistry. Directed by Garry Marshall, the film is a modern Cinderella story that brings together two unforgettable performances and a message about love, transformation, and self-worth.\n\nJulia Roberts shines as Vivian Ward, a spirited and kind-hearted woman whose charm and honesty light up the screen. Her performance is magnetic — full of warmth, humour, and humanity — and it’s easy to see why it launched her into stardom. She brings depth to a character who could have been a stereotype, instead making Vivian funny, strong, and deeply relatable.\n\nRichard Gere is equally captivating as Edward Lewis, the polished businessman who hires Vivian as a companion for a week — only to find himself falling for her genuine nature. The chemistry between Gere and Roberts is effortless, giving the film its heart and magic.\n\nThe supporting cast adds flavour and comedy throughout, and Garry Marshall’s direction keeps the tone light while still allowing for real emotional moments. The film’s Los Angeles backdrop sparkles with style and glamour, and the now-iconic soundtrack — featuring Roy Orbison’s “Oh, Pretty Woman” — perfectly captures the film’s playful, romantic energy.\n\nWhat makes Pretty Woman special is that beneath its glitz and humour, it’s a story about two people helping each other rediscover who they are. It’s about acceptance, growth, and the idea that everyone deserves love and respect — no matter where they come from.",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "If you can completely disengage your brain and avoid the characters (not very likeable) and plot (billionaire buys prostitute as a love story??) then this can be a completely enjoyable movie by just enjoy looking at how pretty Julia Roberts and Richard Gere are.",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Easy watch. Funny, cute and you watch it smiling at the scenes involving Julia and Richard. One of my favorite Rom coms",
    "date": "2025-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Pretty tail!\nUplifting cinematic showcase of female empowerment. Any stepfather would hold up as an example to his three boys Vivian's eschewing of controlled substances. Any mother to her three girls would likewise be heartwarmed by Viv's monogamous focus on a stable, high profile trick. Any middle sister would be green with envy over Vivian's enormously good fortune. Any housekeeper would no longer regret her choice not to have children. Ignoring the obviously distasteful reality of Hollywood's faux plot line, this is an enjoyable example of rooting for the plucky underdog.",
    "date": "2025-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "As a child I would watch this movie over and over again on television...as an adult I wonder why I was allowed to watch this movie over and over again on television. \n\nI just re-watched this movie for the first time as an adult. I have to say with full honesty that it was better than I was expecting it to be with my childhood memories. Julia is perfect, she is endearing and intoxicating. I don't believe for a minute that she passes as a worker in that profession; but if we found an actress who did the movie might have a different light. \n\nCinderella meets My Fair Lady.",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "é um filme maravilhoso, com um elenco IMPECÁVEL. julia roberts foi incrível, interpretou cenas icônicas e deu a vida na atuacao. um romance extremamente gostoso de assistir, vale muito a pena tentar adivinhar o que vai acontecer em seguida. ótimo!!!!",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Cute. not a favorite but loved Julia Roberts in there",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Just as great today as it was in 1990! I love this movie.",
    "date": "2025-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's a nice movie, for a one time watch...",
    "date": "2025-06-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It has a charming actor and a charming actress. But it still misses a charming cinematic experience.",
    "date": "2025-06-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is film is dope, 65 percent is misleading, it’s fire,  like Anora in that it’s a problematic portrayal of being a sex worker  but unlike anora in that it’s actually a positive watching experience, it’s like hopelessly naive in a really wonderful way",
    "date": "2025-05-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This is your average rom-com with an outcome that feels highly predictable. It's enjoyable overall, but it doesn't offer anything special aside from the performances, particularly by the wonderful Julia Roberts.",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Classic movie! I love Richard Gere & Julia Roberts in this film. Entertaining & funny at times. Rodeo Drive baby!",
    "date": "2025-04-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The only good sex worker movie you’ll probably ever see. Completely timeless and charming.",
    "date": "2025-03-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Why are they trying to glamorize prostitution? Prostitution has a lot of abused women in this profession. It bothers me that some young girls watch this and think it is an acceptable life. Now Hollywood is pushing another movie that glamorizes prostitution.  Anora.",
    "date": "2025-03-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "So we’re supposed to believe a tall, handsome, successful businessman who could have any woman he wants just so happens to falls in love with a 304 with a chip on her shoulder who makes a living on her back? This isn’t a comedy…it’s pure Hollywood fantasy.",
    "date": "2025-03-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "i understand why this was a good movie for the time it was made, but it seriously did not age well. the entire message was weird and the relationship was completely toxic but portrayed as a serious, unironic romance.",
    "date": "2025-03-02"
  }
]