[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Filme: \tAjudante de Natal\t\tAssistido: 28-12-24\nElenco: @merritt_pattrsn @daniellissing @melaine_leishman @lilygao1 @michael_hanrahan11 Alecrim Dunsmore\nModelo: #natalino #romance\nDuração: 1h 26m\tAno: 2023\nMinha opinião: Um filme de romance natalino. Como sempre uma pessoa abastada e outra uma pebleia. Que o príncipe encantado se apaixona pela plebleia. Onde a plebleia é uma cozinheira e pega o trabalho de fazer um jantar de confraternização de Natal. E terá como ajudante Carson (príncipe encantado de uma família tradicional na região). E nesse momento o interesse entre os 2 vai aumentando, aumentando e aumentando. Até o momento que a carreira profissional, possa afastar os 2. Qual será o caminho? A carreira profissional ou o coração. É claro que nesta véspera de Natal o Amor irá vencer. E assim ficam juntos felizes para sempre.\nRoteiro e enredo de um roteiro conhecido, mas muito bem executado e construído. E um casal que inspira o amor. Parabéns pela atuações Patterson e Lissing.\nVale apena assistir? Sim com certeza. \nNota: 8,5",
    "date": "2024-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Very light movie with a somewhat cozy vibe. Characters are like a walking wax museum. Feels like a movie made for dogs.",
    "date": "2024-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Felt like it was all stock footage, worked great as background noise while I wrote",
    "date": "2024-01-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "worst movie ever.................",
    "date": "2023-12-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Terrible. Clunky dialogue. Awful acting. The lead actress comes across as smug. The supposedly benevolent aunt is unpleasant. Avoid.",
    "date": "2023-12-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Much more substance than I was expecting. We're on a Christmas movie binge, and this was a gem! Much better than many in the genre. Chemistry between the lead characters, an interesting story, and of course good holiday vibes.",
    "date": "2023-12-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I thought they did a good job on this. Young actors getting an opportunity to be leads in a movie, with kind of a simple script took this opportunity and did their best. Not-so-famous actors Merritt Patterson and Dan Lissing, who have shown their skills in quite a few movies and TV shows, make this a fun and easy-to-watch movie. The script curves of ups and downs were very easy, and overall, the camera and lighting were top quality. If you want to watch a movie that is simple and enjoyable, this is a good one.",
    "date": "2023-12-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "typical, cheesy xmas movie",
    "date": "2023-12-04"
  }
]