[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Saw the big names and thought it must be good. HOW WRONG WAS I. this movie is absolutely truly undoubtedly one of the most awful christmas movies ive seen. It was like its written and produced by a child there's no storyline it jumps from scene to scene with some weird sound effects on certain places like its a cartoon.. then out of no where theres kelsey grammar proposal lol. Its not funny either. Just a jumble of weirdness. How did all these big names agree to making this movie lol",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I have been avoiding this movie for a couple of years now because of all the bad reviews, but I was pleasantly surprised.  This movie was really endearing and it is now one of my favorites.  I highly recommend it.",
    "date": "2024-12-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Long covid was more fun than this debacle",
    "date": "2024-12-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A complete mess. Looks like it was made by someone who does movies as a side hustle and has no idea what he's doing. How the big name actors agreed to this is beyond me.",
    "date": "2024-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Disingenuious.  Watch 12 Days of Christmas Eve with Kelsey Grammer  (2022) instead.",
    "date": "2024-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It is sentimental, it is funny. Not recommended if you are not in the Christmas mood.",
    "date": "2024-01-20"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I have created an account simply to warn anyone planning on watching this movie. It is simply put the single worst Christmas movie I have ever watched Falling for Christmas.",
    "date": "2024-01-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Absolute rubbish. Terrible acting. Terrible script.",
    "date": "2024-01-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Utterly disappointing. The script for this film was so utterly bad, that even the crew of veteran actors couldn't save it. It was such a complete bore that we stopped watching it twenty minutes in.",
    "date": "2023-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I know it was cliche but there were some laughs. The writing was fair and the acting was B grade. I would say that it's nice to see just plain old family squabbling at Christmas. I would watch it again.",
    "date": "2023-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Truly woeful in every respect",
    "date": "2023-12-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "It was ok. Nowhere near as good as the one with Billy Ray Cirus (he's such a legend).. wasn't worth the watch",
    "date": "2023-12-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Wow there is time I'll never get back.  Even John Clease couldn't save this one.  What the hell happened with this ship wreak!!",
    "date": "2023-12-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It's bad.... so so bad. That's all there is to say. Avoid at all costs. Did I mention its really bad?!",
    "date": "2023-12-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I hate to say it, but this was by far the worst movie I've ever seen! I kept  thinking it would get better, but if anything, it got worse.  Terrible story, terrible acting.   And it's a Christmas miracle! Kelsey Grammer plays Elizabeth Hurley's father, yet she's only 10 years younger....\n\nDon't waste your time, you'd have more fun climbing a barbed wire fence...",
    "date": "2023-12-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Very corny and painful at times, but this is a great cast and there were enough laughs to make it a decent guilty pleasure holiday movie.",
    "date": "2023-12-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "little messy xmas movie. nice to see Kelsey again :)",
    "date": "2023-12-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This was legitimately the worst movie I've ever seen, non holiday movies included. I am sick to my stomach, do not watch this movie.",
    "date": "2023-12-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Terrible acting, storyline and no heart at all.. shame",
    "date": "2023-12-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "BRILLIANT worth watching it's funny silly and a real family life",
    "date": "2023-11-27"
  }
]