[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I would rather saw my head off with a rusty spoon than watch this movie ever again. The fake feminism, the overdone fourth wall breaks, the predictable plot, the shallow characters, the nonsensical fight scenes. This movie has not only ruined the characterization of Sherlock Holmes, but has reduced him to a bumbling, emotional idiot that is outdone by a sixteen-year-old girl that is barely able to solve a simple anagram. The fight scenes are simply unrealistic, with many of the weapons and choreography being so obviously not possible within the given parameters. Helena Bonham Carter has once again taken on a fake feminist role that barely benefits the people around her, and the minimum amount of effort was put into her being a suffregette. It is an unsympathetic role that abandons her child for a riot that never happens and is easily taken apart by the young girl. Millie Bobby Brown’s acting is frigid and painful to watch, which is only compounded by the over-dramatized and rushed script. The fact that she is supposed to represent a bright young girl of that caliber is . . . sad.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A good mix of drama, action, and humor. The acting was good. It was an interesting storyfrom beginning to end. It's definitely worth a watch.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very fun movie, Millie Bobby Brown was great as Holmes, the 4th wall breaks and \"Jimming the camera\" is definitely a choice, but I didn't mind it. The action scenes were thrilling and well choreographed, very Guy Richie Sherlock like. What I didn't like was Henry Cavil as Sherlock, just wasn't the most believable portrayal I've seen, but he did alright.  8/10",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "love this movie but i will never fully believe that’s sam claflin behind the mycroft mustache",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Great script, well directed. Good acting  Entertaining to watch",
    "date": "2025-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Clever and charming!",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Enola Holmes, adapted from Nancy Springer's novel, offers a refreshing twist on the detective genre by spotlighting Sherlock's lesser-known sister. While not as intellectually intense as classic mysteries, the film shines with engaging storytelling, emotional depth, and important themes like feminism and self-discovery. Millie Bobby Brown’s charismatic performance and the film’s unique fourth-wall narration keep viewers involved. Though it may not fully satisfy mystery purists, it delivers a light yet meaningful experience filled with action, heart, and purpose.\n\nRead the full review here: (Indonesian version : alunauwie.com) and  (English version : uwiepuspita.com)",
    "date": "2025-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Honestly, one of the best films I’ve ever watched",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 2 hours and 3 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated PG-13 for Some Violence!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Good acting and plot! Would recommend and might rewatch. Second one is a must",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "“Enola Holmes” is an exhilarating and well-acted adventure film that delivers a fresh, spirited take on the Sherlock Holmes universe. While slightly predictable at times, its charm and energetic pacing make it an undeniably fun watch.",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Nice , good story writing and how this was potrayed.",
    "date": "2025-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A charming little film. Loved it!",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I liked it a lot because it’s genius and adventurous",
    "date": "2025-05-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Movie that understands direction of play perfectly. If you're interested in younger sister of sherlock holmes solving crimes, I bet you'd love to see her eccentric mother helping her pursuit her passions as a kid, no metter how unwomenly they are in eyes of socaity, and you'd prabobly hate her brother, mincroft, who's trying to send her to bording school and merry her off against her wil, and you'll love her running off from all this to find her mother, and in doing some helping women gain right to vote (wich mincroft was against, and sherlock did not care for) It has fun moments, and you won't even notice when 2 hours past. My only complain is romance on top of that. I'd cut it. Fortunetly, with how little scenes they got, I think writters didn't want it there either. 8.5/10",
    "date": "2025-04-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "So overrated and boring. I watched it with great difficulty.",
    "date": "2025-03-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The ubiquitous Millie Bobby Brown routinely breaks the 4th wall as Sherlock Holmes kid sister, whom it turns out is no slouch as a sleuth herself.  Henry Cavill (Man of Steel, Man from UNCLE) plays Sherlock in a supporting role, and women's suffrage in England is the backdrop here (circa 1895).  The film was heartfelt and delightful, and I fully expect a sequel.",
    "date": "2025-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I can say that it's a very good movie! Let's say that the movie has some holes, but I think it's great.\n\nEnola is a girl, who from a very young age was taught by her mother, a very peculiar chores for a modest and respectable girl of the nineteenth century. In a way Enola Holmes learned activities, judged by masculine society, rather than more feminine activities.\n\nIn the XIX century, women were mostly important for household chores, being submissive to their husbands, and how to have children, clean, iron, tidy up and others. But the film brings a very different perspective than usual, of a woman who wanted to change the world for her daughter, Enola Holmes, she raised her to be strong, and fearless. Enola goes through many adventures in search of finding her mother.\n\nThe movie is of great quality, because the script is very good, the setting perfect, the costumes, the effects, the soundtracks, and the plot.",
    "date": "2025-03-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Overall a good movie and I really enjoyed the plot, however, it kind of annoyed me on how much she broke the fourth wall, it makes it seem… I don’t know, almost cringey? Not hating, just a little odd to me. But definitely worth a watch! I’m currently rewatching it as I type this!",
    "date": "2025-03-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is one of the worst films I gave ever seen.\n\nUnbelievably patronising to women, working class people, non white people, it is a farrago of abysmal story telling and right-on tropes.\n\nAvoid at all costs, If you have a brain.",
    "date": "2025-03-06"
  }
]