[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Thee!! Worst screenplay. Terrible jokes,cgi, even the extras in cars were terrible. Don’t waste your time!!!",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "One major aspect of making a movie is casting. This movie failed on all accounts. Mason Gooding is not a good villain he just looks like a kid model who was thrown into a role that he doesn't believe in. Dylan Sprouse is like a young Paul Walker, but he's got no charisma. This should have been a Tubi or Freevee movie.",
    "date": "2025-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Great acting by Dylan Sprouse and Dichen Lachman, in a movie whos plot is understandable, yet somewhat predictable. I feel there better choices could have been better for the rogue captain. The one positive from this movie is that Dylan Sprouse deserves a lot of credit as well as future rolls within the action movie genre.",
    "date": "2025-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This could have been a good movie. But the actor portraying the Rouge Captain is a terrible bad guy. I’m laid up in bed and have pretty much watched everything else. Why a bridge? Nobody would ever do that.",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It wasn’t bad action movie. I know it was a low budget one but for what it use it wasn’t to bad.",
    "date": "2025-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is truly the worst action film I've ever watched.",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "***Misunderstood Villain, Misjudged Film***\n\n(Potential spoilers – character detail discussed, not plot twists)\n\nMost of the criticism I’m seeing around Aftermath focuses on the villain being “overacted,” but I genuinely think people are missing the deeper character construction. This isn’t a sleek, calculated action villain—it’s a man who is dying, traumatised, and mentally unraveling. That’s intentional.\n\nThe antagonist openly says he has a golf-ball-sized brain tumour and is on anticancer medication—known to affect cognition, mood, and behaviour. He’s not chaotic for shock value; he’s terminal, heavily medicated, and dealing with long-term trauma. His emotional outbursts and erratic behaviour reflect that. It’s not bad acting—it’s one of the most grounded portrayals of a man with nothing left to lose that I’ve seen in recent action thrillers.\n\nMany viewers seem to expect a “Marvel-style” villain—cool, composed, and quippy. That’s not who this character is. He’s dangerous because he’s unpredictable, emotionally raw, and mentally unstable. That’s what makes him compelling—and terrifying.\n\nDylan Sprouse delivers a solid performance as the lead, and while the plot has a few clunky moments, the film holds real tension and an emotional throughline that sets it apart. If you actually engage with the character motivations, Aftermath becomes a lot more meaningful than most reviews suggest.",
    "date": "2025-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "How could a bridge be so blown up and not fall into the river? There were too many plot holes to count.",
    "date": "2025-06-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Aftermath (2024)\nGood Action Movie, but with Awful Storyline, Screenplay, Dialogs and Villain\n(11,780 – 22 Jun 2025 – by Claudio Carvalho)\nIn Boston, the former Army Ranger Eric Matthews Daniels (Dylan Sprouse) is giving driving lesson to his sixteen-year-old Madeline “Maddie” Daniels (Megan Stott) in his truck. While crossing the Tobin Memorial Bridge, the police is transporting the prisoner Samantha “Doc” Brown in an armored truck to testify against her former Retcon Squad for killing several civilians in Afghanistan. Out of the blue, a group of terrorists led by Jimmy 'Romeo' Roken (Mason Gooding), blow up the bridge in two halves. The he uses the hostages to force the government to release the \"Shattered Dove initiative\", where the squad was authorized to kill civilians in certain circumstances and release the Retcon soldiers. But Eric, who suffers from PTSD, wants to save Maddie from the terrorists, begins a resistance on the bridge killing terrorists. When Doc flees from the armored truck, they team up to save the hostages.\n“Aftermath” (2024) is a good action movie directed by Patrick Lussier. However, the awful storyline, screenplay and dialogs by Nathan Graham Davis and the villain Jimmy 'Romeo' Roken destroy the movie. Mason Gooding has one of the worst performances ever seen. The rest of the cast is very reasonable, the special effects are good, but the senseless situation associated with the performance of Mason Gooding makes the film almost unbearable. My vote is five.\nTitle (Brazil): “Reféns na Ponte” (“hostages on the Bridge”)\nMy Blog: https://maniacosporfilme.wordpress.com/",
    "date": "2025-06-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Es entretenida y va al punto, no profundiza sus personajes y ya se a visto el argumento , no es John wick pero e visto peores peliculas con un mayor presupuesto y en verdad que son aburridas, es buena si uno quiere ver disparos y el tipo \"Duro\" que nunca muere",
    "date": "2025-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Well, what can I say?!! It's the typical one hero against a bunch of terrorists story. This time on a bridge. It's B-Movie material, but not all too bad. There are a few good moments, but mainly it's all too predictable. The main good scene is the final rescue idea! One can while away those 90 minutes if one has nothing else to do. 4/10 points.",
    "date": "2025-06-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It had so much more potential but I don’t know if it was the script or the actors, but it fell flat. The plot had the makings of being a really good action movie but we were left not “feeling it”. Honestly I think Sprouse did well his script could’ve been better in spots but overall he made the movie not a complete flop. I’m kind of thinking the main villain his acting felt too forced and the script didn’t do him any justice.",
    "date": "2025-05-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "L'acting: acceptable. Le plot: pas terrible. Un bon divertissement pour passer le temps.",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved Dylan Sprouse as an action hero!! Made me think of Bruce Willis in Die Hard.",
    "date": "2025-05-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A great movie. Good action, good acting & a good plot.",
    "date": "2025-04-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I feel almost guilty admitting that I did enjoy this (but yeah, sure, the plot is ridiculous).",
    "date": "2025-03-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie was so bad. Between the corny and unrealistic special effects, and the subpar acting, I wouldn't be surprised if whatever studio made this get shut down. It would have been a more enjoyable evening playing 5 finger fillet and intentionally missing the gaps between my fingers. Please for the love of all things holy, do not watch this movie.",
    "date": "2025-03-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Mason Gooding may have overdone his part, but this sequentially fresh action thriller is well driven by Dylan Sprouse’s heightened caliber, with moral ponder underlying its core. (B)",
    "date": "2025-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Me for a dutch person this movie is a must to watch.",
    "date": "2025-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Please, I’m begging you- get an unnecessary root canal. Volunteer to dance in a lion’s cage wearing a meat suit. Dive onto the deep end of an empty pool. Any of these experiences will be infinitely more pleasurable than watching this total failure of a movie. Those who have commented that the script must have been written by an 8-year old just deeply insulted 8-year olds all over the world. Startlingly bad writing, direction and acting. The special effects were the most competently done aspect of this flick, and even they were cheesy. Did I mention that sitting on a railroad spike would be more fun…",
    "date": "2025-03-12"
  }
]