[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A cool movie, althoufh i never went to a criminal lifestyle it is relatable. Aubrey plaza is so cool.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Plaza projects her character’s apprehension and channels it into moral outrage directed at her attackers as well as her physical and societal limitations.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing!! Aubrey Plaza...wow",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was so goood! The story , The acting ! Really engaging. Recommended 100%",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Emily who's having a hard time finding a decent job, due to her criminal charges, to pay off her loan finally seemed to get an opportunity to make big bucks, but unfortunately it's a credit card fraud. Aubrey was so great for this role. The movie is very straightforward maybe that's the reason why it felt short... I accidentally discovered this movie scrolling through instagram reels and I'm glad I did because I enjoyed it. Spoiler alert! The ending kinda threw me off a little bit. I mean I didn't expect the happy love story but still.....\nThe way she leit Youcel in that car...\nI guess she did what she had to do.",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of my favorite movies. it paces like the social network and youre bummed it couldnt last longer.",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I think about this movie often.",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This was a decent movie with an economic justice message.  It’s ok to watch but a little boring",
    "date": "2025-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Paying my son’s international school tuition was supposed to be a routine process yet it turned into one of the most distressing situations I’ve ever faced. I had carefully set aside the funds knowing how important this payment was for his education. Then unexpectedly I received what appeared to be an official update from the school’s finance department. The email included new payment details styled with the school’s logo, professional language and even a familiar footer that mirrored their usual correspondence. Convinced it was authentic, I followed the instructions. The message asked that the tuition be sent in cryptocurrency, which at first seemed unusual, but because international schools sometimes use different methods for cross-border payments, I did not question it. Without hesitation, I transferred $15,800 to the wallet address provided. I believed the matter was handled and felt relieved to have completed the payment on time.My relief did not last. When I reached out to the school to confirm receipt they told me no such payment instructions had been issued. Their bank details had not changed nor did they accept tuition in cryptocurrency. At that moment the truth sank in: I had been deceived. The money had gone directly to fraudsters. The shock was overwhelming $15,800 gone in an instant and with it the security of my son’s education felt suddenly at risk.Desperate for a solution I began researching recovery services and discovered DIGITAL LIGHT SOLUTION . From the very first consultation they were steady, transparent and professional. They gathered every piece of evidence I had: transaction IDs, wallet addresses and the fraudulent email itself. Their investigators immediately began tracing the stolen funds across the blockchain.Within days they identified the stolen tuition sitting in a wallet on a major cryptocurrency exchange. That discovery was critical. By working directly with the exchange DIGITAL LIGHT SOLUTION  ensured the wallet was frozen before the scammers could move the money further. They also provided all necessary documentation to prove that the funds were obtained through fraud.The process wasn’t instant it stretched over three weeks of careful coordination compliance and updates. Yet the outcome exceeded my expectations: the full $15,800 was successfully recovered and returned to me.I can say without hesitation that DIGITAL LIGHT SOLUTION  saved me from a devastating loss. Their persistence and expertise make them a service I would wholeheartedly recommend to anyone facing crypt Fraud \n\nContact Service \nWebsite  https://digitallightsolution.com‬\nsupport @ digitallightsolution.c o m\nTelegram, digitallightsolution\nWhatsApp : ‪‪+1 (954) 856‑8045‬‬",
    "date": "2025-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Such an amazing movie. Aubrey KILLED this role. One of my favorite movies she’s ever starred in. I was SHOOK when I seen she produced it at the end. 200/10. Must see. 10/10 would recommend #obsessed",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing performance by Aubrey Plaza! Loved the movie",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Good performances by Plaza and her fellow actors, for the most part, does not save the terrible ending of this would be thriller. I don't buy that terrible decision after terrible decision can build to ultimate success... I get the idea that toughness is a choice, but ultimately I did not get behind the protagonist, and the ending is almost silly.\n\nI found the logic flimsy. The 'plan' to gain revenge, played out over and over, is missing depth and feels rushed. I get the idea, but was unconvinced by the plot as written.",
    "date": "2025-06-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Trama lineal y oscura, básicamente un conjunto consecutivo sin parar de malas decisiones. Mucho ritmo lento, cámara en mano y espíritu de película independiente, no creo que sea para todo el mundo.",
    "date": "2025-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Very good movie. Held my interest all the way through. Aubrey Plaza is a gem.",
    "date": "2025-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Points for being very down to earth, and having some redeeming character arcs. I wanted to like this movie but it is far too formulaic and familiar script wise to be outstanding. This type of movie has been made a thousand times before.",
    "date": "2025-04-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "wawwww filmnya bags banget meskipun ada tegangnya dikit",
    "date": "2025-03-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Aubrey Plaza rises through this crime thriller whereas the brewing tension attributes to her sharp performance, but her dealing with problematic aspects, such as stereotypical confrontations and trying to address class conflict only for the screenplay to have unfulfilling, contradicting degrees, leads this to be found as a mere showcase that narratively dimmers from the start except for the nuanced decision(s) at the end. (B-)",
    "date": "2025-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Like witnessing a bad car accident that you can’t look away from. Not a feel good movie. More like a omg-put-that-girl-in-jail-already-what-is-she-thinking-is-she-a-stupid-spoiled-entitled-person (substitute b-word) movie.",
    "date": "2025-03-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Emily the Criminal left me with a lot to think about. It’s a sharp, tense thriller with a biting commentary on financial struggles and systemic inequalities, which really hit close to home. Aubrey Plaza absolutely owns this movie—her performance is raw and layered, and she pulls off this mix of vulnerability and determination that kept me glued to her every move. I don’t usually associate her with such serious roles, but she nailed it, and I’m glad to see her breaking out into new territory.\n\nThe storyline itself is gripping. Watching Emily navigate the criminal underworld while trying to claw her way out of a desperate situation felt real and unsettling. It’s not a flashy crime movie—it’s grounded, gritty, and unsettlingly relatable, especially in how it paints the picture of someone stuck in a system where the odds are always stacked against them.\n\nThat said, there were moments where the pacing slowed or the plot dipped into familiar territory, but the tension always managed to pull me back in. I also found the romantic subplot a bit forced—it didn’t add much for me. Still, it’s hard to ignore the overall impact of the film, especially the way it made me think about the choices people are pushed to make when backed into a corner.\n\nIf you like character-driven stories with a mix of social critique and suspense, I’d say give this one a try. It’s not perfect, but it’s bold, and Plaza’s performance alone makes it worth watching.\n\nMy Rating: ⭐⭐⭐⭐ (4/5)",
    "date": "2025-03-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Well, Aubrey Plaza is always worth watching in anything, and she is good here in this modern neo-noir.\nStuck with a criminal record, student debt without having finished school, and only some minor artistic talent but not enough, she stumbles into a illicit way out, which may not last, but there is a faint hope to kickstart her career.\nGreat film that seems like a throughback to indy films of the 1990s. Mostly a cast of people unknown to me except brief appearances by John Billingsley (Dr. Phlox on ST Enterprise) and Gina Gershon.\nThe title is certainly apt.",
    "date": "2025-02-16"
  }
]