[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "1 hour and 37 minutes of drama. Rated R for Some Domestic Violence and Language!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-05-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A highly watchable film for the most part. The domestic violence is absolutely understandable, the broken eye I have had too so it's horribly real.\n\nBuilding a house because the council can't is a bit ridiculous isn't it. Not feasible usually, she could because she picked up her cleaning client off the floor? The older lady didn't even give a reason why she gave all the money, some backstory is missing/cut from the film.\n\nThe court scenes were silly because nobody shouts out like that, they don't. It's daft to do so, I wish films would be more real about that.\n\nAnyway, I liked it in the first half, it gripped me. The rest is meh but overall I did sort of like it.\n\nNo idea of the main actresses' name, but she portrayed an abused woman very well. The way she was almost scared to talk to anyone is very real. Plus, I know the injury isn't real but mine is better now.\n\nIn summary, good depiction of DV, nonsense of house building.",
    "date": "2025-05-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's a very engaging movie. It shows what can happen if people don't just judge.",
    "date": "2023-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Outstanding performances keep \"Herself\" from being just another formulaic movie about a mother trying to establish a home for her and her children after leaving an abusive lowlife husband. Claire Dunne is especially impressive as the abused wife who had the strength to leave. The girls who play her daughters were also great, seemingly actual sisters in real life by their interaction and natural chemistry with one another. 3 stars",
    "date": "2022-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Astonishingly good. Terrific acting by Clare Dunne, the abused single mom, as well as by the very young girls playing her two daughters. The story unfolds with so much hope and determination with a believable but tragic finale. I highly recommend this one!",
    "date": "2022-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What an amazing film...just brilliant 👏 👌 😀 👍",
    "date": "2022-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A nice story about the journey of a mother and the various battles she has to fight for her kids. I personally felt it started off slowly but the more it progressed, the more satisfying it felt.",
    "date": "2022-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A very powerful display of resilience.",
    "date": "2022-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This film is good because it distance itself from the typical Irish ending movie. It's tragic, sad but unexpected which saves this film from an average film to a good one.",
    "date": "2022-03-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I have to admit that I'm a sucker for 'small movies'. No explosions, no villains. no hunky men or sultry women. This movie is simple, straightforward in its message: we all struggle just to get by in a world that can be unforgiving and heartless and yet heroes do appear when least expected",
    "date": "2022-01-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It takes a lot for me to like feel-good, inspirational, people-pleasing movies. It might have to do with me, but often, I find such movies overly simple, cheesy, sappy, and/or too inoffensive. But, I saw the decent scores and saw the trailer and decided it should be one of the many movies I see in a year. And...\n\nI liked it.\n\nMost of the acting is good. I really didn't find anyone in it that I felt did a bad performance. However, I felt the stand outs were Clare Dunne as our leading lady and even the child actresses playing her children (Molly McCann and Ruby Rose O'Hara). Often times, child actors can be a hit or miss and more often than not, they are just there to be cute in these types of films. I was pleasantly surprised with the young actresses. Hell, one of the moments that struck me on a personal note was the youngest daughter not wanting to visit her father when he had visiting rights. While the film makes it out to be a twist, it was very obvious to me that the youngest daughter witness her father brutally beat her mother. Haunted by that horror, she's too scared to visit her father, even though he honestly might not harm her, as abusive to his wife as he is. While my situation was not like the little girl's, let's just say something similar enough to it happened that made me feel for this girl in a way that reminded me of myself. I never thought this film would strike me in such a way.\n\nI enjoyed the aspect of our main character building a home and rebuilding her life. The soundtrack using popular music for these building montages could have been very sappy, but it never annoyed me the way other films have done. I also liked that this film was willing to go to dark places and ballsy enough to have an ending I didn't see coming. I can see people being pissed off by the ending.\n\nIt really does have the clichés and tropes of inoffensive, crowd-pleasing, feel-good films, but it never felt as bad as the generic ones that are often too happy and simplistic for my taste. Honestly, Herself is more deserving of 3 stars as it is a film I liked, but was never really in love with it. It is simply the good version of a feel-good movie. However, because there was a few things that impressed me more than the average film of its genre, I'm willing to bump my rating up to 3.5.",
    "date": "2022-01-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Herself is a restrained, intelligent and highly impactful drama about domestic violence, perseverance and community. It has a certain grace about it, a definite care involved for all the characters. Clare Dunne is truly wonderful as Sandra, a mother of two young girls in Ireland. She is the victim of repeated domestic abuse. Finally she escapes and finds temporary accomodation whilst trying to restablish a new life. She takes odd jobs to survive. One is caring for an elderly doctor who has suffered a broken hip. When the doctor, Peggy, offers Clare part of her land to build a house on she takes it up as a way to start over again. Through perseverance she manages to enlist help from the local community to build the house. It's a great story of inner strength and the bonds of friendship, whilst shining an important light on the plague of domestic violence. The film has a natural grace with strong characters throgh out. As mentioned Dunne, who also co wrote the script, is wonderful. As is the great Harriet Walter as Peggy. A film of many qualities, a film of humour and resolve.",
    "date": "2021-12-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "While the fundamental story is sad.  Any sort of bullying situations make me really angry, but especially domestic violence. The response to it was overall heartwarming.",
    "date": "2021-12-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Well acted and probably fairly accurate depiction of a woman's struggle to leave an abusive relationship. Good cast.   I saw this film at an independent art space, why do the big multiplexes ignore the unusual films in lieu of wall-to-wall blockbusters?  It deserved a bigger audience.",
    "date": "2021-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent film. It stayed with me awhile after viewing it. I thought the script was very well done, as was the acting. A story very well told. Hats off to everyone involved.",
    "date": "2021-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "FARFETCHED.  Although the acting was alright, the whole plot was completely far fetched  and not plausible.  Waste of my time.",
    "date": "2021-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "There is a balance of sweet, inspirational moments with dramatic, downright heartbreaking moments to match this perspective all too much with reality and a glimmer of hope.",
    "date": "2021-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fabulous film. Well acted and an important story",
    "date": "2021-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "HERSELF is brilliant. Rather than focusing on the physical and emotional violence perpetrated against Sandra, the movie explores the incredible challenges faced by a mum with two children who, after escaping from her abusive husband, has to navigate a bureaucracy that does little to really support her. But with the help of friends and others who genuinely care, she is able to rebuild her life and become herself.\nClare Dunn (who also co-wrote the screenplay) is stunning as the mother and Molly McCann and Ruby Rose O'Hara are totally convincing as her two kids. This story, while harrowing, is such a refreshing change to the typical Hollywood take on domestic violence. It's a relatively slowly told story but it is riveting as it digs deep into the emotional and social toll that survivors of abusive relationships experience.\nThe story is told with incredible sensitivity, empathy, and without exploitation. I can't recommend this one highly enough.",
    "date": "2021-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "As a child who grew up in a home with domestic abuse, I have to admit that Dunne's Sandra is the mother I've always dreamed of having. How she can continue to push even after all she's been through wouldn't even be humanly possible for someone like me. The extensive physical and emotional abuse that she suffered, only to surpass, and be hit with even more battles is honestly tiring. Tiring, but in a good way. It takes a toll on the viewer thanks to Lloyd's directing skills, and makes whoever is watching glad that they aren't in Sandra's shoes. It's exhausting watching her go through all of that hurt, so we can only imagine how exhausting it is actually living through it. That is the best way I can sum up this move— tiring, but in a good way.",
    "date": "2021-07-02"
  }
]