[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Yeah!  Kill them commies!",
    "date": "2024-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The best Korean movie.",
    "date": "2021-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazingly powerful war movie.",
    "date": "2017-06-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "One of the most well made Asian / Korean war films ever. I've seen Tai Guk Ki, Frontline and My Way, but this one stands out. Not just a war epic, but it has a very good story. A story of 71 teenagers, who is assigned to hold out against the advancing North Korean army. They are inexperienced, but armed. And it turns out to be one of the most heroic films ever. It's like that film \"home alone\" combine it with a war epic film. I said that cause they have no combat experiences at all, and they make strategies to set up traps against a battalion of North Korean armies. I was excited bout the climax, about how they end up battling these soldiers. And that villain commander, that dude is bad ass. And to think, this is a true story, a story of young heroes that will be remembered for a long time. A must watch war epic. 4.5/5",
    "date": "2015-06-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "One of the most well made Asian / Korean war films ever. I've seen Tai Guk Ki, Frontline and My Way, but this one stands out. Not just a war epic, but it has a very good story. A story of 71 teenagers, who is assigned to hold out against the advancing North Korean army. They are inexperienced, but armed. And it turns out to be one of the most heroic films ever. It's like that film \"home alone\" combine it with a war epic film. I said that cause they have no combat experiences at all, and they make strategies to set up traps against a battalion of North Korean armies. I was excited bout the climax, about how they end up battling these soldiers. And that villain commander, that dude is bad ass. And to think, this is a true story, a story of young heroes that will be remembered for a long time. A must watch war epic. 4.5/5",
    "date": "2015-02-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I hate war films but I gave this a chance because of Cha Seung Won and Choi Seung Hyun and I don´t regret it. I like that althought there is action and a lot of blood it is more focused on the human side, on the students and their strugles of being just kids that can´t be kids, they have to mature quickly and force themselves to face their fears and get involve in a war. Great actings from all of the cast specially Seung Hyun.",
    "date": "2014-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is interesting.Great adventure and great war student soldiers.This movie filled with staged battle sequences.I love it because is based on the true story and I also aspire to be a soldier. And I would be like Oh Jung-Bum and Kwon Sang-Woo.They are both very strong and smart guys.",
    "date": "2014-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "As a fan of the south korean boy band Bigbang, i was really excited to see this movie because of the main actor, Choi Seunghyun/TOP, and i was not dissapointed at all. The flawless storytelling and character developement and to the amazingness and suspense. This is a movie that will make you laugh, smile and cry. 71:into the fire is the first south korean movie I've seen and probably the best I ever will. A must watch for all.",
    "date": "2014-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is the best Korean War movie out there to date.  It takes off to a good start, and has some amazingly well done but breif action sequences in the first half.  I was interested in how it would compare to The Brotherhood of War, another Korean movie about that war.  It seemed to have less of the swearing and brutal gore of The Brotherhood of War, and but as a whole turned out to be a better movie.  It has a good plot, and is interesting and exciting throughout, but what really got me was the amazing final battle in the school house.  It had a obvious Saving Private Ryan idea to it, a small band of soldiers fighting a far bigger one, who even have tanks.  The defenders use what resources they can find to make a well orginase a defense, despite their lack of training and skill.  So it was like Saving Private Ryan for that part, and instantly I knew I would have to put this movie at the top of my list, although the rest of the movie is great to of course.  Solidifies my belief that the Koreans are amazing at making the best war movies out there.  Number eight on my top 15 favorite war movie list.",
    "date": "2014-05-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I don't normally watch war films, but I  thought it was a very moving film. It 's not an all action, shoot' em up type film but instead, we see very real effects of war, both physically and mentally. It was not glossed over or glamorised , but also not made unbearable to watch, though some parts maybe are not for the squeamish. We saw good and bad in the characters and in particular I liked the way the relationship between the student leader and the convict developed, especially the scene when they are talking together for a few moments  near to the end of the film. At times I felt frustrated with the behaviour of Oh-Jang Beom, wanting him to be the perfect leader straight away but his reactions are very believable as someone who is traumatised and has been forced into a role he does' t think he is right for.  The film made me go and research the Korean war, and it's heartbreaking to think a country is turned against itself like this and it still continues today.",
    "date": "2013-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Choi Seung Hyun, otherwise known as TOP from BIG BANG played the main character...and he did amazing...",
    "date": "2013-02-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Pohwasogeuro (71: Into the Fire in English) is an under-seen and relatively unknown South Korean war movie that deserves a bigger audience to view it. It not only paints a picture on the horror of war, deliver on huge set-pieces, but above all makes you feel patriotic. \n\nPohwasogeuro (71: Into the Fire) tells the true story story of student-soldiers trying to protect a middle school during the early days of the Korean War. As far as historical accuracy goes I can't say much for this was the first time I ever seen anything based on this event. The story is well written with a huge portion of the movie itself is actually dedicated to developing the characters. There's also a sense of urgency for the heroes we follow. Whereas a majority of war films would have us follow a trained soldier, in this film we don't follow to many which brings a sense of urgency often missing from this genre. It's because of this we care about our students soldiers for they are not the best trained, not the most professional, or even the most intelligence. They are, however, cooperative putting aside their differences to fight together for a common cause. Some area of the plot do go underdeveloped, like the protagonist relationship with his mother, but the aspects that are developed do help this film. This war film doesn't focus on the war itself, but instead on the people who fought in them and giving us soldiers we could relate too.\n\nNo war movie (at least from the one I've seen) is without big battle set-pieces. This certainly delivers on that with plenty blood, explosions, and destruction for anyone who watches war movies just for the spectacles. Some will be disappointing they is not a whole of allot fighting til the final act, but it's the lack of fighting that help the film focus on it story. The production design is top notch. Clothing and locations all look like from the era it takes place it in. It contains good acting, especially from the cast that portrays the students soldiers. The direction for the most part is good. Some area could have improved from a better direction; like a scene when a soldier kills a child is not talked about much and is a key moment that is brush aside. \n\nPohwasogeuro (71: Into the Fire) is a South Korean war movie that has quality drama and big battle scenes that be compared to Hollywood war films. If you're fan of war films you should this check this out.",
    "date": "2013-01-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Underrated foreign movie based on a real-life event that happened during the Korean war. It takes some time to start liking the characters, but once you do, you never stop caring about them, and to know that they really exited adds to that sentiment.",
    "date": "2013-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Tremenda película de guerra basada en hechos reales...",
    "date": "2012-12-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I do not usually write film reviews so this might not be done very well..but I loved this movie so much that I feel compelled to do so.\n\nWhat I like about this movie is that it doesn't make the enemy troops into monsters. The viewer watches the movie from the perspective of the south korean soldiers, but knows that both sides are human and they are just fighting a war that needs to be fought. the dialogue in this movie is memorable as well. there are many lines that hit home for me.\n\nYou grow to know and love the characters in a very deep way. I myself became attached to most of them...even those with very few lines. This movie impacted me so hard that every time I watch it (now 6 times) I am left pondering it for days. It really leaves its mark.\n\nPlus, the cinematography of this movie is absolutely stunning. If you are a fan of movies that are ART-this is a movie to watch.\n\nThe explosions are not over the top and you are left feeling like you experienced the war for yourself.\n\nI am not a war movie fan at all-this is my favorite movie.\n\nAnd as for the lead being played by Big Bang's TOP? Yeah-that was the main reason I watched it-but his acting was so extraoridnary that I forgot he was even in it half way through. It was just Oh Jang Beom....in  war...and I was there with him.\n\n\nPlease-do yourself a favor and watch this movie. You will be touched.",
    "date": "2012-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "walau tokoh utamanya terkesan \"rambo\" banget dan gaya tentara korea utara yang mirip tentara romawi ,tapi untuk keseluruhan bagus !",
    "date": "2012-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "best war movie made yet",
    "date": "2012-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A beautifully heartbreaking and moving film about 71 extremely brave boys (as that is ultimately what they were) who fought against the odds stacked against them. More than just a war movie Into the Fire is full of courage, bravery, comradeship and dedication to a cause. There is no happy ending to this story, but it certainly touched my heart.",
    "date": "2012-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A simple yet driven True story about 71 young student learning and struggling in the real war!!",
    "date": "2012-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A little bit lacking when it comes to the storyline but the battle scenes are amazing.",
    "date": "2012-07-17"
  }
]