[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "0 stars! This movie was hot buns, they should have ejected Beck into the core, she squad wiped the entire cast making the movie unwatchable. Zimsky was a bum. They had a discord mod giving them comms. The cgi was better in 1273BCE. This made my WWII grandpa traumatized. Watching paint dry would have been better than this. This made me want to get a job. If I had the option between going to Afghanistan and watching this a second time, I would go to Afghanistan in a heartbeat. Originally my fantasy football league punishment was a buzz cut, now I think we might change it to watching this movie.",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Ahead of it’s time.",
    "date": "2025-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This movie is fantastic. That is what it is. In the original sense of the word. Fantastic. The director, gaffers , actors , etc. they knew what this movie was: a Clichè disaster movie. But by god does it strike a chord within myself that every time I see it streaming that I buy a crate of 5% beer and just tune in to this film. The acting is top. It is believable. The physics of the film is only bad as they get through the mantle. I can understand that the rest of the film is all speculation, as if it was made of cheese! What does it matter !?!?!? It’s a film. 2001: A Space Odyssey has a massive baby? As much as it is an amazing film, sometimes I like just dirt disaster. 80IQ and sitting in front of the television with large amounts of alcohol, my girlfriend sitting besides me equally as drunk. Probably shouting ‘why has Hilary Swank got such lovely incisors?’ Or ‘what is Unobtanium?’ \nI would recommend this film on the grounds of: \nA: are you a fan of SCI- FI?\nB: Are you high?\nThis film deserves the credit it tried to bring itself, it knew what it was. Where do you turn left at England? ITS WALES!! WALES!!",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I dunno.. it's actually a good movie. Grab your popcorn and check it out.",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is great.\nI have seen alot of action thrillers.\nBut this is different this has way more action and a good cast.\nThe story is bad but that doesnt matter.\nThe cast and some of the atmosphere was amazing for its time.\nAnd the movie is filled with action no boring dramatic scènes all the time.\nIts perfect for a drink night to watch a b movie.",
    "date": "2025-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Ridiculous, stupid, bogus!",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Truly woeful movie. The cast is wasted on this piece of rubbish. It is almost a cartoon. An interesting premise, but ruined by the worst Hollywood 'science' imaginable. Radio communication to the surface from the bottom of the Marianas trench and then from several thousand feet below that into the centre of the Earth? Which supposedly has a molten metal core that can be forced to start spinning again by detonating nuclear bombs? I didn't pay anything to see it, but I want my money back anyway.",
    "date": "2025-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I'm not normally a fan of natural disaster movies but I really liked this one. I think because this was really well cast and the actors created interesting and lovable characters. Very long but well worth a watch,",
    "date": "2025-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Esse filme é muito bom\nEu não sei porque tem 39% no rotten tomatoes",
    "date": "2025-06-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The Core might not win any awards for scientific accuracy, and sure, the premise alone invites every kind of eye-roll, but what it does deliver is something we’ve been losing fast in today’s cinematic landscape: original storytelling that doesn't try to go viral or squeeze itself into a franchise mold. It’s from that 2000 to 2010 cultural crossroads, before everything became about metrics and trend-chasing. This was when movies still dared to be weird, flawed, ambitious, and most importantly, human. It has all the hallmarks of that era where studios were still funding original scripts, even if they were risky. And yeah, it paid the price at the box office, but I’d argue it aged better than a lot of so-called “hits” from its time.\n\nDirecting-wise, Jon Amiel keeps things grounded even when the plot is anything but. He never tries to oversell the drama or throw in unnecessary flash. Instead, he lets the characters carry it. And that’s where The Core shines. The script is quietly brilliant. It doesn’t scream its cleverness, it just talks like people talk. You’ve got emotionally loaded one-liners, smooth transitions, and character-defining dialogue that lands in seconds and moves on. There’s no pandering, no exposition dumps. You either keep up, or you miss it. That kind of confidence in the audience is rare now, especially when studios are so obsessed with clarity over character.\n\nOne thing that stands out even more today is how unfairly movies like The Core have been treated just because their science wasn’t explained in a way that “felt” believable. The truth is, there are tons of movies with equally ridiculous science that were accepted just because the script guided the audience more carefully. If a movie gives you a decent explanation, even a weak one, it becomes forgivable. But when it doesn’t handhold, even if the logic is the same, it gets slammed. And that’s a problem. The Core didn’t flop because it was more far-fetched than others. It flopped because it didn’t explain its madness in a way that made audiences feel safe. But honestly, once you get past that, what you find underneath is a character-driven, surprisingly well-written story with actual heart.\n\nWatching this in 2025 hits different. You realize just how rare it is now to get a non-franchise, non-remake, non-based-on-existing-IP kind of film. Out of the top 66 movies to earn over $100 million in recent years, around 70% were franchise flicks. That tells you everything. Studios are scared to invest in originality, so they don’t. And we as an audience? We’ve gotten used to that. But The Core, for all its plot holes, reminds you what it's like when a movie just wants to tell a story, not trend. It's a reminder that when you kill risk, you kill magic. So if you want to rewatch something that speaks to the lost art of character-driven, original cinema, give this one another look. You might be surprised at how much it says when it’s not trying to go viral.",
    "date": "2025-04-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It was just bad.  😅",
    "date": "2025-04-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A completely stupid popcorn flick, but one that nevertheless still holds some interest.",
    "date": "2025-03-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Strangely, one of my very favorite popcorn disaster films of all time. The effects and action are very good, even if the drama seems to be formula. Every so often, I need to rewatch and enjoy this one. I didn't understand when Roger Ebert was thumbs down on what I consider a worthy 134minutes of great entertainment. This film is no throwaway.",
    "date": "2025-02-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "yea I get it but this is one of my comfort movies and makes my adhd anxiety ridden brain calm. don't ask why",
    "date": "2024-12-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I don't get the hate or the complaints. I thought this was  fun popcorn jaunt in the spirit of the old 60's Jules Verne adaptations. Everyone moaning about it really need to get that pickle out of there ass.🙄",
    "date": "2024-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "i can respect my wildest dreams., so i can respect and enjoy this movie. it's entertaining and thought provoking on a few *~new millennium~* levels. future future future. i only half paid attention and rewound a few time so it could be back ground noise and i could catch the scenes at my own multitasking pace.",
    "date": "2024-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best movies ever made!",
    "date": "2024-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "this having score below 4/10 is a crime. i get the acting is goofy sometimes but seriously?",
    "date": "2024-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "While the whole idea of a mechanism for dissolving rock in front of a burrowing earthship fast enough for the earthship to fall rapidly toward this planet's core takes a bit of swallowing, the acting is superb and the geophysical science seems pretty reasonable.  \n\nWe see a lot of comments about how this picture is so terrible but no explanation of why this is thought to be so.  I thoroughly enjoyed it and may have learned a thing or two.  For example, pre-movie I was not aware that the rotation of the liquid iron core of our planet provides the geomagnetic flux referred to and essential to our protection from cosmic radiation.",
    "date": "2024-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "IT WAS AMAZING ABSOLUTELY AMAZING I LOVED IT SO MUCH I DON'T KNOW WHAT ANYBODY MEANS  HOW THIS IS A TERRIBLE MOVIE IT'S AMAZING!!!!!!!;",
    "date": "2024-07-11"
  }
]