[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Boring as hell, luckily it’s not too long… but basically 50 minutes of an improv sketch with wasted comedians having no idea what they’re doing there. \nWho thought an hour of Improv was what anyone wanted for Christmas ?",
    "date": "2024-12-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I am a big fan of improv humor, when done correctly it can be some of the funniest reactions, because it is coming across 100% genuine. The guys from \"Whose Line is it Anyway?\" are the gold standard of improv comedy. Comedy is always a very subjective thing, and improv comedy is very hit or miss, but when it hits, it is hilarious. This movie had me howling in laughter several times throughout the film.\n\nThe actors in \"Whose Line\" are definitely more talented in improv, but the actors in Murderville's inability to do improv is part of the charm. There is an actor playing a dead body, and he can not keep a straight face while playing dead.\n\nAlong with being funny, the show is also a solid mystery. The audience gets all the necessary clues to solve the mystery in the show.\n\nI had a ton of fun with this movie, and if you are a fan of mysteries, comedies, Christmas and of course improv, I highly recommend this movie. Santa may have been killed, but I still had a very merry Christmas.",
    "date": "2024-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely hilarious!! Love love love Armett, Bateman & Hayes trio! Maya Rudolph was also hilarious. Love the  improv of it , definitely kept Bateman and Rudolph on their toes.  Bateman and the milk bowl hahahahahahahaha",
    "date": "2024-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Quite simply hilarious! A Christmas treat.",
    "date": "2023-12-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Pretty funny, Will Arnett is awesome. Adding in Pete Davidson was a fail, he literally only broke character and ruined scenes but besides that it was awesome. Jason Bateman killed it too",
    "date": "2023-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The premise and structure of \"Murderville\" may not be for everyone, but, if you're on board, \"Who Killed Santa?\" is particularly delightful.  Making the show \"smaller,\" with all of the action taking place essentially in one locale, helps focus the show, and the undeniable rapport between Arnett and Bateman is absolutely fantastic.  Maya Rudolph is also a lot of fun, as are a couple of other surprises that I won't spoil here.",
    "date": "2023-01-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Funny! Good acting. Not brilliant by any means but worth watching",
    "date": "2023-01-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Silly Fun \nOff script\n✨✨✨✨✨",
    "date": "2023-01-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Granted, the movie loses some of its steam in the second half, but for the most part it's an enjoyable ride as long as you accept it for what it is. Jason Bateman in particular shines in this 50 minute unscripted comedy skit.",
    "date": "2022-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Rating: 6/10. 65/100",
    "date": "2022-12-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "There’s a lot of good laughs. Especially when a dead body breaks character and starts laughing as well.",
    "date": "2022-12-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A nice laughfest for hubby and wife date night.  It certainly doesn't overstay its welcome and Maya Rudplph and Jason Bateman have a good time.  Will Arnett is awesome in everything.  Empty calories around Christmas works for us!  Hubby 8/Wife 8.8 Average 8.4/10",
    "date": "2022-12-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Love it, I'm going to watch this every Christmas",
    "date": "2022-12-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "My whole family liked it!  Was quick witted and actually very well done!",
    "date": "2022-12-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Not as good as the series, but just enough fun to carry",
    "date": "2022-12-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Extremely goofy and not funny!",
    "date": "2022-12-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "OMG one of the funnyiest comedy shows ever. what an amazing idea and they pulled it off so good. watching them try to keep in character was epic.",
    "date": "2022-12-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A smooth and hilarious combination of improv and scripted comedy. The guests flying blind do a great job of staying quick on their feet through the ridiculous antics of the story. Definitely funnier than I expected it to be, would recommend.",
    "date": "2022-12-16"
  }
]