[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Terrible start to finish.",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I can't understand the bad reviews. Great acting, suspenseful,  and an easy to understand ending. So much better and more authentic than so many Hollywood disaster movies. Thought it was great and would highly recommend if you like the genre",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Just watched after seeing the first third years ago & rediscovering with a morbid sense of \"what ever happened in that movie\"?  Finished it and still asking, but remembering why I forgot.\n\nHad real potential, and the one good concept was the eerie feeling of not knowing what was up and that the world / nature / situations were largely beyond one's control and even understanding.  Turns out it was a movie of disconnected & causeless occurrences, typically just repeat run-ins with evil people with guns setting traps to take people's supplies/lives and apparently hanging out 24/7 stationed at literal (pointless) roadblocks.  \n\nSeveral plot holes illuminated how bad the writers were... waterpark stop was clearly abandoned for YEARS, but there was a half-eaten sandwich in the diner and snacks in a vending machine?  That's a very tiny hole compared to many others...\n\nPlane crash didn't make much sense, but there wouldn't sensibly be any large planes in the air AT ALL esp after day 2, unless military, but that looked commercial and recent smoke billowing.\n\nMilitary train crash also seemed WTH, except maybe in connection with the sudden prevalence of bad guy gangs setting traps. They could've messed with the tracks to cause crash to steal supplies & (laughably) somehow killed the few soldiers on board, who were seen laying at the wreck site.  Also, why didn't he take some AK47s and handguns from said soldier bodies / train cars?  Ammo is a prime commodity in any lawless apocalypse. \n\nZero explanation for the HUGE FIRE somewhere in Montana? Causing a long chain of people to march away, except the gas thief trap gang in the smoke that they had to run down.  (You'd think he'd learn to stop approaching people who seem shady...yet he STILL went in the woods with neighbor knowing the guy was off - IDK, maybe with the intent to kill him instead?)\n\nAlso, didn't he clearly see volcanic smoke clouds past Seattle before going into the city (which would've taken an entire day in/out), and everybody knows about Mt. St. Helens, but he thinks nothing of the increasing earth tremors and ash, until an apparent epiphany immediately after taking out wife-creeping neighbor. \n\nThere were some other actions that made a ton of sense, which was nice to see.  Forrest Whit was awesome at the beginning in taking on the 1st car thief  gang @ gas station, and the convict fake cap without any hesitation.  Covering the brake lights (usually easy to remove the bulbs, but okay).  Avoiding other people mostly (other times blindly entering traps tho).\n\nI like how they left the girl (I'm terrible with character names), when she disappeared on them, I mean...went a little crazy & \"off the reservation\".  Weird why she did that in the middle of nowhere without a plan, or that she was surprised by the guys fighting for survival, but apparently she had \"survived on her own since birth\", so I guess that makes sense to her somehow in an unknown field with insane storms crashing through? \n\nYeah, this was dumb overall, but could've/should've been much better.  Another film full of non-sensical unrealistic conflict for the sake of conflict (as if the world ending wasn't enough), but at least it wasn't MOSTLY annoying just because of characters making unbelievably terrible & uncharacteristic emotional decisions, like is the case with even worse movies.  \n\nThe irony is literally in the title.",
    "date": "2025-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It seemed promising in the beginning and during the course , but it ends up disappointing. I wish I had seen some reviews before watching it cause I feel like I just wasted my time. We never got to know what is going on, why this thing started or what it is, we didn’t even understand if they survived. Deeply dissatisfied on how it ends… probably they knew and that’s why they named it that way? Idk,but it’s a no from me too.",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "let me start off by saying, not AWFUL. But then again i feel like the plot or whatever they were going for making this movie went all into the middle of it, they put a lot of thought and suspense/excitement into it, then completely said screw it with the ending. maybe in fear of making it an unbearably long movie but after the time i put into watching it, i wouldn’t have minded. that’s all you had to come up with? come on.",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It could have been good. One of those movies that had me going... \"oh come on\" with disgust and disbelief. \n'How it ends'\nIt ends dumb af. \nI wont spoil anything but ill say if it ended the opposite of how it did i probably would have given it 3 stars.",
    "date": "2025-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Was it a movie, was there a plot? What did I just watch, elevator music version of a movie, or was it some form of money laundering?",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "1hour and 58 minutes I’ll never get back. I HATE the ending dude this movie edged me so much bro the black guy dying pmo bro he was my favorite I forgot his name tho but he looked like terry cruise or sum not really but they both a 🥷 that’s not the point tho cuz the other girl ran away once again I forgot their name but don’t waste your time your gonna be upset with the ending just watch a diffrent movie",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "With two headliners like Forest Whitaker and Theo James, your expectations for a good movie seems reasonable. The movie starts out fine based on an undefined apocalyptic event, and the rising action  of dramatic occurrences and some visual landscape scenery keeps audiences interested enough to continue watching, but then in the last 20-30 minutes the writing and story line gets convoluted and weak with the entire movie running out of steam as if the writer experienced writer’s block and just couldn’t figure out a logical plausible way to end the film. The audience is left with no idea what caused the apocalypse or even the fate of the main characters and wishing they could get their two hours back.",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I had more entertainment watching paint dry. Tom and Jerry from Cartoon Network could have directed a better film than this. I don’t understand how Netflix even allowed this to be a film on their site. Will never watch a Netflix made film ever again.",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "For me this is a good, realistic movie. We don't get an explanation for everything. What if communications just stop? Well, that's what happen, no google, no fb to know, to ask. You just do what you think, no rights or wrongs, just decisions.",
    "date": "2025-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie kept seeming like it was going somewhere and then somehow managed to go nowhere. No resolutions or explanations. The only time in my life I hated a show as much as this is when I saw the series finale of Lost. At least I only lost two hours of my life with this movie instead of 6 years.",
    "date": "2025-05-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Ironically, for a movie titled “How it Ends” it is the only movie I’ve ever watched that I have no idea how it ends.",
    "date": "2025-05-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Will not recommend, not even a bit if beging honest.  The storyline is below average and the ending is just okay-ish. The whole movie is just a bug Question where we dont have any answers.",
    "date": "2025-04-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The entire time I had no clue what was going on. Not because I can't comprehend storylines- but because this movie didn't have one. There were so many questions that arose that were never answered, many setups that just were solved too easily, and the ending literally seemed like the director didn't yell \"cut\" soon enough.",
    "date": "2025-03-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This Aussie enjoyed the mystery and the road trip in \"How It Ends\". It's been almost 7 years and no sequel imminent - shame.",
    "date": "2025-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The movie is the real disaster here",
    "date": "2025-03-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Is it a disaster movie, is it a post apocalyptic film? Is  it alien invasion? Maybe it is  a film with no answers a film that really does not say anything.  Y the end you say “really this is how it ends?”  Who cares.  A film that will bore the snot out of you.",
    "date": "2025-02-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Do NOT put yourself through this movie! Please.\n\nThe story feels like an unfinished jumble of ideas that were mashed together and then released too early. There are characters that are there for a handful of scenes and then are never seen or mentioned again, and whose existence wasn't even that important or relevant to the story to begin with. There's the occasional moment of 'telling' instead of 'showing' that was only put in there to make a single, throwaway line later on make sense. \n\nI will admit, I like the idea of some kind of disaster happening on the other side of the country and no-one knowing what it was or why it happened. Certain disasters can be like that in real life, especially if communications go down. However, that alone is no where near enough to save this movie. And there have been dozens of other movies and tv shows that have done this a million times better.\n\nThe characters feel very... flat, for the lack of a better word. There's not really any dimension to them, even Theo James' character feels unfinished. The only thing we really know about him (and the only thing that I remember about him despite only just finishing this movie less than an hour ago), is that he wants to get to his girlfriend and make sure that she's okay. It's the exact same motivation for Forest Whittaker's character. 13 year olds on Wattpad can write more fleshed out characters than this. And despite the fact that these two characters, who'd known each other for at least 7 years, apparently get along very poorly (which is only shown in one scene) they seem to get along just fine over the course of the movie. Game/Season 1 Ellie and Joel from The Last of Us have a worse relationship than these two and they'd only just met!\n\nMoving on to the action. It feels forced and completely random and only serves as a minor obstacle to offer a bit of tension to the audience, or simply as a reason to hurt the characters so that another plot point can happen later on for no good reason, even though there'd be many much better ways of getting that plot point to occur. It doesn't feel fluid like a movie should be and instead comes across like the writers were desperately trying to connect a single line between each idea that they had.\n\nAnd my final talking point, and arguably the most annoying part of this film, the disaster itself. The fact that the movie gives you no explanation what-so-ever as to what the disaster was or even how it affected Seattle in the slightest is beyond infuriating! About 30 minutes before the final scene I'd said to myself \"If this movie doesn't tell me what happened, I'm going to lose my mind.\" (To put it lightly). And now here I am, writing my first ever review. I'd have been more fulfilled stopping halfway through and never touching this movie again. But instead, I watched a terrible, bland and just disappointing movie that left me angry and with more questions than answers. \n\nDo not waste your time watching this movie.",
    "date": "2025-02-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "When a title is as didactic as, \"How It Ends\", it's reasonable to expect the movie to deliver on its straight-forward promise: a story about how our world ends. However, reason, or at least a reason, never made it into this script. The cause of the sudden widespread calamities that sweep America is never revealed and it sure ain't climate change because at one point a character says Canada isn't really being affected because of the air \"or something\" (huh?). So, we are left to wonder what is the point of this movie. There's no great theme and the plot, while there is tension and action along the way, is pretty thin gruel. It's a road movie that doesn't even deliver what a good road movie should: a relationship that evolves and resolves (like Planes, Trains and Automobiles). The shriveled cherry on top of this sugarless sundae is that the movie's ending is even worse than the planet's! One of those ambiguous endings meant not so much to cleverly tantalize the viewer's thoughts (Lost in Translation) but more likely to provide a hasty, easy exit. Like ghosting the audience. The whole experience leaves the viewer feeling horribly cheated and used. The question you should ask yourself about this movie is not, How It Ends? but rather, Why Would I Even Start?",
    "date": "2025-02-16"
  }
]