[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Not a bad movie 21 years of scene where regina hits by a bus",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it loved it loved it.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Mean Girls is a movie that conveys a message and prompts reflection on female rivalry. \nIt tells the story of a girl who lived in Africa and was homeschooled, then moved to Canada and started attending a school with a very strong social hierarchy. The leader? Regina George, who has her trio and is very conceited. The main character, played by Lindsay Lohan, becomes obsessed with popularity. The film features various back-and-forth conflicts that culminate in the two fighting and being looked down upon by their classmates.\nMean Girls is a classic of American cinema, and although it is very entertaining and maximalist, it says a lot about how our society works",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of my all time favourites! Well paced, sharply written and brilliantly delivered by a perfect cast. Have rewatched this hundreds of times over the years - it never gets old and never fails to make me laugh. Perfect in every way, with an absolutely cracking soundtrack!",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I’m sorry THIS is an all times iconic teen girls movie!?",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "For a raunchy teen comedy, it's well-written, in-depth, and actually wholesome. Mean Girls is a gem for its genre!",
    "date": "2025-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love Mean Girls and its original and amazing acting. I definitely recommend watching! 😊",
    "date": "2025-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This is the only teen movie that isn’t too cheesy to watch. I love the exaggerated Teen girlhood.",
    "date": "2025-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I Love Mean Girls!!!",
    "date": "2025-09-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This defined a generation of media and humor, making it easily one of the most iconic modern films.",
    "date": "2025-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Terrible because this new girl called Cady Heron and she lived in Africa for a long time until moving to America and she is going to a American high school  and then we get introduced to the mean girls the leader of the mean girls is Regina George and I think more girls might relate to this movie but I don’t and there are kissing scenes and bad words and it was stupid when Regina George got ran over by a bus  terrible movie never watching this movie again 1/10 and Cady and Regina are rivals  and the mean girls are also known as the Plastics",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Quite a funny film with a lot of really good passing comedic moments that might not always be intrinsic to the plot but enhance the viewing experience a great deal. Unfortunately, it can't resist the easy way out, i.e. the resolution of the conflicts between the characters is rather lacking in its brevity and simplicity, thus letting down the rest of the movie. But other than that, it's an enjoyable, vivacious and consistent depiction of character dynamics, and its confidence is captivating.",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Never seen it before but I loved the musical 2024 version and I LOVED it, and I LOVED the og version as well!!! And yk what else I realized… I learned SOO much more about the characters and story watching this version!",
    "date": "2025-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A girly 2000 classic",
    "date": "2025-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This movie is so fetch.",
    "date": "2025-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 37 minutes!!!!!!!!!!!!!!!!! Rated PG-13 for Sexual Content, Some Teen Partying and Language!!!!!!!!!!!!!!!!!!!!! The USA grossed over $86,100,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Have you ever seen one of those movies where it’s unbelievably bad but you can’t stop watching it? This is the first and hopefully last movie like that I’ve ever seen.",
    "date": "2025-06-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Definitely a good movie full of sense of humor and critical analysis of the society",
    "date": "2025-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Had a good laugh. Represented how girls in school act in real life. Definitely keeps up with the times 20 years later.",
    "date": "2025-05-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I've been on a bit of a romcom streak lately. As I've watched them, I've noticed that there are some teen romcoms that are quotable (\"She's the Man\"), some that are classics (\"Clueless\") and some that have a ridiculous premise that kind of works (\"She's All That\"). In each of these cases, there are pieces of greatness but all of them are lacking in one area: a strong screenplay. Tina Fey's script for \"Mean Girls\" is one of the best comedy scripts that I've ever read and it has an instantly recognizable tone from the first scene.\n\nThis movie delivers on many different levels, from the iconic characters to the witty cutaways. With a strong premise at the forefront and great performances all around, I honestly believe that \"Mean Girls\" is the best teen romcom of the last 30 years and one of the best of all time.\n\nBest Character: Regina George\nBest Quote: \"She doesn't even go here!\" - Damian\nBest Scene: The Trust Falls",
    "date": "2025-05-21"
  }
]