[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Horrible acting and bad script. I wouldn't waste your time watching this, they're are better movies with revenge plots. This honestly feels like a movie that a school drama class made.",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Well, it's a revenge movie ... No real thread in the story. Just violence and not much else. Cast would have been more effective in character if it was better written perhaps. Difficult to follow and make sense of it, which is a bit frustrating.",
    "date": "2025-04-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I love revenge movies, but I feel sorry for all the people who worked hard to make this film and the money they spent doing so. It's horrible. Terrible script. So bad, it's laughable. We literally laughed at parts that were supposed to be deadly serious because it was absurd and ridiculous.",
    "date": "2025-03-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "There's nothing wrong with a good 'revenge movie.' They've been around longer than I have and I'm guessing one of the first that brought the genre into the mainstream was 'Death Wish' in the seventies.  There, a man lost his family to thugs and - you guessed it - took revenge (the fatal kind).\n\nHere we have a man and a woman fall foul of some local hillbillies in the middle of nowhere.  Let's just say the husband doesn't last long and his wife is left for dead - big mistake.  For what the locals don't realise is that she's a trained soldier who has the skills to make their lives a lot shorter.\n\nNow, I know that to enjoy most movies you have to 'suspend your disbelief.' No one really believes aliens exist or superheroes are really flying about the place.  For reasons that I guess are my own, I can enjoy superheroes and aliens without any bother, but the sight of a very slim young woman maiming her way through a small army of giant bodybuilders is a step too far.\n\nThe bad guys - well, they're just bad.  You've never seen a more one-dimensional bunch of nondescript flesh-bags than this lot.  If you've killed a bad guy during a video game, he was probably more 'fleshed-out' than any of this lot.' And they're dumb.  And by dumb I mean painfully dumb.  They have a hundred and one times to get rid of this - seemingly indestructible - woman and don't, only to give her back the upper hand a scene or two later.\n\nIt just gets worse.  Or better - if you look at it in terms of how much fun you can take out of its absurdity.  The skinny little woman/hero puts grown me in 'sleeper' holds and then takes out two at a time.  And so on.  If she had superpowers (ala Wonder Woman or Trinity) it wouldn't be a problem 'in universe,' but she just looks so out of her depth when the stunt men have to throw themselves about the set to try and maintain the illusion that they're getting beaten up.  \n\nThis could have worked - as a parody (or just give her superpowers), but the fact that the film-makers try and pass this off as 'realistic' is too much for me to actually believe.  It becomes so stupid it's laughable.",
    "date": "2025-03-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A woman who is an ex-ranger and her police officer husband decide to take a camping and hiking vacation. They camp outside a small backwards Southern town. The small southern town is run by an Evangelical Christian lady who despite her gentle demeanor is an evil leader of a organized human trafficking and drug dealing gang.\n\nAnyway the ranger woman's husband is killed by the gang members and the woman takes revenge on the criminal gang.\n\nWhile the plot of this movie is implausible at times, it's rather satisfying to see the ranger woman taking out the garbage by eliminating these nasty pieces of white trash one by one.",
    "date": "2025-02-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is one of the worst movies I've seen. The acting is horrible and the fight scenes are absurd.",
    "date": "2025-02-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I highly regret wasting my time watching this horribly written movie.  Acting was horrible.  Fight scenes were absurd and ridiculously bad.  Definitely one of the worse I've seen in many years.",
    "date": "2024-12-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It's a shallow, mindless revenge movie where the lady kills everyone involved with the death of her husband. That's as deep as the plot goes. I actually like revenge movies which is why I watched it, but this one somehow manages to be boring at the same time.",
    "date": "2024-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Holy cow.  \n\nI’m with one other reviewer who joined just to put this on blast.  Shallow characters, a plot that has been done a million times and every time better, cheesy “special effects” that use dimness to hide how bad it is. \n\nI’m reminded of an old Bloom County strip where Opus is reviewing a movie except I don’t need the final panel: http://platypuscomix.com/otherpeople/blmd820908.gif",
    "date": "2024-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This film is like John wick if everyone drank copious amounts of lead tainted water",
    "date": "2024-05-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I give this movie 2 moons because it doesn't deserve any stars.  Horrible acting and the seemed to have left most of the plot in the editing room.",
    "date": "2024-05-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Not only was the sheriff's female aide a traitor but the feral cats and squirrels too. A little known fact is when the director of this rubbish walks his knuckles scrape the ground.",
    "date": "2024-02-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Cliche, woeful and uneventful story line. Some of the most terrible acting I've seen. What's two below a B grade movie?\nWhat I would call a bad attempt at an action porno. All action, no story. \nGive it a miss. It's 1 hour 20 you'll never get back!",
    "date": "2024-01-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie, it was fun to make and even more fun to watch.",
    "date": "2023-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Good, till a few minutes to the end. \nWhy waiting 3 months; what's happening with the girlstransports;\n\nWhen you in an enemy home, you walk carefull, not careless.\n\nGood film, but the end disappointed me.",
    "date": "2023-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Trama già vista, sequenze di azione improponibili e assolutamente senza senso.\nUna donna che con movenze discutibili abbatte decine di uomini, senza sfruttare il fattore sorpresa e combattendo per lo più a mani nude.\nDegli antagonisti che sembrano appena usciti da un cartone animato e in cima alle orripilanti idee, un colpo sparato da pochi centimetri che nemmeno ferisce la protagonista con ben 3 persone che non si accorgono della situazione.\nNo comment.",
    "date": "2023-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "shallow script, weak dialogues... bad movie.\nRoteiro Raso, diálogos fracos .... filme ruim.",
    "date": "2023-02-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved it.  Ellen H. is awesome.",
    "date": "2022-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie is so bad I made an account just to leave negative feedback. I figured it my duty to my fellow movie watchers to warn you not to watch this movie. My girlfriend said she liked it but I think that's just because she picked it and doesn't want to admit she made a mistake. If she was being honest I think she would tell you to run from this movie as fast as possible. I would give this movie .0000018 out of 10.",
    "date": "2022-04-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Can I give negative ratings? As I watched, I began to yearn for the classically trained acting skills of Steven Segal and Chuck Norris. I craved the authentic fight choreography of Van Damme and shed a tear for the lost bushcraft & camouflage talents of Rambo. Penny Hofstadter's performance in Serial Apist left this girl's for dead. OMG!",
    "date": "2022-01-20"
  }
]