[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "You have seen this movie \"before\". Happy, light, feelgood, and that is ok. The music is very familiar, but as I said, you have seen this movie before. An easy movie, and fairly easily forgotten.",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutly amazing, humor is on point!!!",
    "date": "2025-01-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Is it completely original? No. But it does keep you guessing whether they will be caught or not to the very last minute.",
    "date": "2024-12-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Going in style was exactly what you’d expect from a bank heist - gone geriatric. It was very fun to watch and was light hearted, I would recommend to anyone. The banker is quite funny and the film even comes full circle as the young saves the old by the end. This isn’t a complex or difficult storyline, and I definitely laughed a few times. Very remniscent of “last vegas” and “the bucket list”. Some buddies trying to have fun with nothing left to lose as the end of life comes near. The main investigator did a great job, and so did the girl at the end. What a fun way to end a tale like this and bring everything together.",
    "date": "2024-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I watched this on DVD recently.  There's nothing particularly innovative about this film, but it's well put together, has a decent enough story and benefits hugely from a great cast.  The result is entertaining and enjoyable to watch, with a few points about getting older incorporated to make the viewer think about where they are heading.  The crime capers are sanitised for a general audience, and the movie even has a happy ending to make you feel good when it's over.  Overall, it's a pleasant film that I am happy to recommend.",
    "date": "2024-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The film isn't good but it's a fun time, it's a comedy movie you can watch with your family and even though they're old the acting from Morgan Freeman, Michael Caine and Alan Arkin is amazing",
    "date": "2024-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Promissed a lot at the beginning but descended into a soft, far fetched, meaningless and predictable mishmash.",
    "date": "2024-03-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Yeah it passed the time watched a tik tok highlight seemed interesting but when watching a movie it didn't really have my full attention",
    "date": "2023-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "'Going in Style' is a fun one!\n\nI got more entertainment than I was expecting, given I had anticipated a somewhat half-arsed 90 minute comedy with potentially half-arsed showings from stars of yesteryear. Pleasantly, I was wrong. The more it went on, the move I enjoyed it. The one lame scene comes at the supermarket, but even that saves itself really with the addition of Kenan Thompson.\n\nIt made me laugh at a few moments, namely with the 'E.T. the Extra-Terrestrial' 'homage' and when Josh Pais' character does the cat thing the second time (it's barely visible, just about in shot) - both funny! The masks were a nice touch, too. And that last scene with Annabelle Chow & Nancy Sun is so dumb but I'm totally here for it.\n\nIt's paced well, has a strong second half and, also, features a well done bit with John Ortiz's character in there too. A swell surprise, all in all. I would happily rewatch it. Michael Caine, Morgan Freeman and Alan Arkin make for a great trio!",
    "date": "2023-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Similar to last Vegas. Old guys fun comedy",
    "date": "2022-12-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What's not to like? Great cast, lots of laughs, and some jabs at bad aspects of capitalism.",
    "date": "2022-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Good characters, good plot. Simple humour complemented by good thoughts on age and ageing. Some slapstick moments are perhaps not top quality but never mind.\nIt's an excellent film because of the plot, characters, and actors who are legends for a good reason.\nEasily deserving of four stars.",
    "date": "2022-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "great movie with incredible acting",
    "date": "2022-06-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "funny and heartwarming remake of the 1979 George Burns film.",
    "date": "2022-06-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Fun movie!! Its our culture duty to take care of our elderly. A saying that most wont care to take seriously.",
    "date": "2022-02-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It was okay.........",
    "date": "2021-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "pretty good.  don't anticipate a comedy.  trying not to give any spoilers, but i appreciate that they didn't become james bonds.",
    "date": "2021-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Perfectly good movie for good feels and a couple of chuckles.",
    "date": "2021-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was hilarious.",
    "date": "2021-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This is a great feel-good comedy with a terrific cast showing how to beat \"the man\" when you get taken advantage of!",
    "date": "2021-10-18"
  }
]