[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Liam Neeson shines as the hard boiled detective here. I love these types of movies and I think A Walk Among The Tombstones is one of the better additions. Its much more of a slow burn thriller as opposed to some of Neeson's more action-packed films. The story does drag at times and there were a few choices at the end that I felt held it back. But overall, this was a solid little detective story.",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Liam Nelson hunts down a couple sadistic serial killers in a film noir action movie. I would've preferred they made it more of a mystery than action movie, but it was entertaining.",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "[SPOILERS WARNING!]\nFirst of all, I think that Liam is one of the worst actors of his generation. Somehow it worked for him in Schindler's list, and in Taken, maybe he was well cast in something else that I didn't watch, but per se he just can NOT act.\nHis facial paralysis might be even worse than Keanu's.\n\nNow the movie.\nWannabe-stylistic but ultimately just presumptuous.\nA very useless, tired, old, incapable ex police turned cop because of some vendetta he went on while drunk.\nNow got hired as private detective to find who killed his client's wife.\nSome wannabe-clever subplots just to make it look like the writer actually made some effort, but they are dumb attempts which have no substance and leads nowhere.\nThe killers kill again. Then kidnap a girl. He gets hired via recommendation from his previous client to negotiate.\nThings go awry, they escape, they had cut the 14 y/o fingers without any reason, now they shoot dead his previous client's brother, he shoots one of them, they still escape, a kid from one of the two useless subplots irresponsibly hid in their truck and almost got discovered, but so can tell them where their base is.\nThe one who got shot gets killed by the other one just like that, no other reason.\nThey arrive. He handcuff the dude to a metal pipe. The previous client stays to kill the dude although he, as ex cop, disagrees and leaves.\nBut then he comes back and for some demented reason the client has uncuffed the criminal and he's dead.\nHe gets plummeted badly because he's useless.\nBut he has a taser and stuns the dude and shoots him the head.\nIn other words, not only the two bastardy killed 2 women, cut the fingers of a girl, and this last dude killed his victim's husband now, but they both went out easily, just one bullet. The last one in the head, no pain.\n\nWhat I hate the most in a movie centered on revenge, is when the revenge doesn't arrive.\nThere's no reason for this movie to exist.\nIt's a mistake.\nLike the fact that Liam still acts.",
    "date": "2025-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Why is hollywood so determined to push the envelope of disgusting graphic sadism? Are they trying to convince us that normal people actually behave this way? Or do they just want to discredit, degrade and destroy our moral sensibilities?",
    "date": "2025-05-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "One of Liam Neeson's best.",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I have to admit, some of the choices Neeson had made around this time were questionable, so I didn't know what to expect. But boy was this one different. Make no mistake, dark as hell. This movie is not for the squeamish, many scenes are disturbing. But the direction is excellent and Neeson is on top of his game. Moreover, the two bad guys personify evil like few others in recent memory.",
    "date": "2025-04-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A Walk Among the Tombstones (2014) is better than I remembered. One of the strongest Liam Neeson films and performances from him in the past decade. Dan Stevens, Boyd Holbrook, and David Harbour are excellent in their supporting roles. Scott Frank's dark neo-noir direction is ruthless with a truly bleak worldview. The detailed and nihilistic writing makes for an engaging mystery. Fair warning, the serial killers are very disturbing to watch.\n\nIt holds up nicely.",
    "date": "2025-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Superior Neeson fare.",
    "date": "2025-01-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Not too much action. A thriller. Not too sophisticated. I think you will like it, without getting too exited.",
    "date": "2024-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Liam Neeson has enjoyed a renaissance lately, reinventing himself as an ‘elder statesman’ of action movies, what with the ‘Taken’ trilogy and ‘Non Stop.’ Therefore, I couldn’t help but go into ‘A Walk Among the Tombstones’ thinking that it was going to be another ‘blast-a-thon’ of gunplay and high-octane action.  It wasn’t.\n\nI even – briefly – read a post on the internet concerning the film.  It simply read ‘Totally dull.’ To be fair, I can see where they’re coming from.  If you go into this film expecting something like Taken then you’re going to be left sorely disappointed.  Luckily, when I watched it, I was obviously okay with something a little slower.\n\nLiam Neeson plays... well, basically the same badass character he keeps playing lately – you don’t really need to know his name.  He could almost be the same guy in Taken.  But, anyway, he’s an ex cop turned private detective who’s hired to investigate the kidnap and murder of a drug dealer’s wife.  First of all there’s comparatively little action, despite quite an intense opening shootout, there’s not that much else to follow (besides the odd ‘roughing up’ of a few shady characters here and there.  The story is mainly about Neeson’s investigation, which he does with hunches and leads, rather than guns and fists. \n\nNormally, I say that characters work best when they interact with others around them.  Liam Neeson is definitely a ‘lone wolf’ here and I actually preferred him that way.  However, the film-makers decided to make him ‘play off’ a young homeless kid he sort of befriends along the way.  I felt that this was the one down point in the film.  It wasn’t the young actor’s fault.  He could definitely act, I just didn’t really believe a young homeless boy would be so into the things he was, i.e. health conscious and water-drinking to ‘flush out his system’ etc.  But he’s comparatively a minor part of the two-hour film.\n\nSo, if you’re in the mood for something a little slower than Neeson’s recent offerings then give it ago.  Just think ‘cops and robbers’ rather than all out action.",
    "date": "2024-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Decent movie, but it wasn't as satisfying as I would have liked. It was alright.",
    "date": "2024-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A grim, slow-burning thriller that showcases a great Liam Nelson, A Walk Among the Tombstones is gnarly and vicious in ways that evoke David Fincher & Martin Scorsese. Also, Dan Stevens, Boys Holbrook and David Harbour in solid supporting roles.",
    "date": "2024-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie is disgusting and those professional critics don't tell you that if you want to see a woman get her breast cut off then this movie is for you!!\nIt's a scum product and can't believe Liam would be a player",
    "date": "2024-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This may be the most confused I’ve ever been about an audience rating before. This was a very unique story, and you could tell it was adapted from a book, but I mean that in the best way! Everything was very well thought out, especially the music and camera directing. I was thoroughly entertained the entire time. A few scenes actually got my heart racing really fast!",
    "date": "2024-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I don't know what movie people were watching, but this is a great movie. The suspense is good and the acting is good. It has a great ploy and kept my interest. I thought it was awesome!! What's wrong with people. If you like Liam you will love this movie.",
    "date": "2024-05-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Better than some of Liam's recent flicks, and definitely had that gritty city cop vibe with the string music to ramp up the intensity.  On the down side, there are these side plots that are meaningless to the story - like the teenager he... uh.. 'mentors', although maybe the better term is 'endangers', to the druggie brother and the sobriety circle.",
    "date": "2024-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Neeson and his younger sidekick TJ played by Astro are great. However, the movie is too brutal and senseless for my liking.",
    "date": "2024-02-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "An under rated Liam Neeson kidnap thriller. Very engaging and Worth a watch",
    "date": "2024-02-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "typical film of what Liam Neeson has been doing for several years but this time a little darker. Good thriller although the scenario is not very surprising",
    "date": "2023-12-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It was watchable but the ending let it down. No real closure or what happens next",
    "date": "2023-12-08"
  }
]