[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Peter Rabbit 2: The Runaway is a fun and lively family movie that builds nicely on the first film. The animation looks great, the humor is cheeky and self-aware, and James Corden brings lots of energy to Peter. While the story is a bit predictable, it’s still heartwarming and full of laughs. Perfect for kids and enjoyable enough for parents.",
    "date": "2025-10-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "10 times worse than the OG. Not funny and just not good. But the acting barely saves it. 3.5\\10",
    "date": "2025-06-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "All I can say is alright, now we're getting somewhere!",
    "date": "2025-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "LOL, 1 hour and 33 minutes of humor. Rated PG for Some Rude Humor and Action!!!!!!!!!! Returning is James Corden as the voice of Peter Rabbit!!!!!!!!!!!!!!!!!!",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "So you may like this film, even lrefer it to the first one. Thats okay. \n\nI hated it. It was rubbush. It served as an alright film on its own, but it does no justice to the original story, in a way the first one does. I hate it.",
    "date": "2025-04-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Better Than The First Movie.",
    "date": "2025-03-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "As much as the sequel to Peter Rabbit attempts to recreate the fun and entertainment that its first entry had and unfortunately it just did not quite excel in which the film suffers from a rushed plot and pacing issues.",
    "date": "2024-12-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Worthy successor to first movie. Good actors. Great animation. Cute movie.",
    "date": "2024-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "So violent. Not cute.",
    "date": "2024-06-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The first one was far better.",
    "date": "2024-04-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "fun sequel to the first one.",
    "date": "2024-02-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Mas grande y compleja que su predecesora, divertida, graciosa, con un hermoso mensaje final y con un toque meta que juega con el espectador. Así y todo no logra estar a la altura de la primera parte, cosa que no habla mal de esta película sino de lo buena que estuvo la anterior.",
    "date": "2024-01-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Another restless monetisation of the Peter Rabbit books which does not bother to attempt any real homage to the gentle spirit of the original books - the jokes are not as funny as the Paddington films, the interaction between the animals and humans is awkward and unconvincing and why oh why do all the characters from Gloucester speak with East London accents?",
    "date": "2023-12-31"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "One of the worst or maybe the worst movie I have ever seen on this planet.\n                                                    -My dad",
    "date": "2023-12-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "In an effort to level up Peter's character depth, the second Peter Rabbit sacrifices fun and heart to create a childlike, moral driven film.",
    "date": "2023-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This is WAY better than the first one! I love it very cute and funny!",
    "date": "2023-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Whoever cast James f*cking Corden as Peter Rabbit should be forced to watch this rubbish movie on repeat until they die.",
    "date": "2023-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Better than the first loved it❤️",
    "date": "2023-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very heart gripping film\nA Quiet Place Part Two was one of my most anticipated movies of this year, and for good reason. A Quiet Place was one of my favourite films of 2018. That movie is basically proof that John Krasinski can direct well. This movie just emphasizes that.\n\nPerformances- Emily Blunt is fascinating in this film. She is one of the best aspects of this entire movie. Millicent Simmons who plays Emily Blunt's daughter has also given off a really good performance. Cillian Murphy was also really good.\n\nTENSION- Like the first film, this one too knows how to keep the viewers on the edge of their seats. The tension is present in this movie, from start to end. John Krasinski knows what to do with the tension in his films, and he knows what conflicts portrayed in his movies are most effective, and he utilizes them to the maximum. That's what makes him such a good director.\n\nA WORTHY SEQUEL- This is a damn good sequel. One appreciable thing worth mentioning is that- it feels as though they pay more attention to the human characters in this movie. A bit more than the first one. Another reason why this is such a good sequel is- it doesn't just try to be bigger than the first one. As a matter of fact, it 'is' bigger than the first movie, but it doesn't put too much emphasiz on being bigger. It feels just about as real and simple as the first one. This movie also takes the first ten minutes or so- to tell us where these creatures come from. A lot of sequels don't necessarily give us that-origin story, but this one does. That's great.\n\nWe want more, John Krasinski- Yes! He has proven his talent as a director with two very intense, amazing horror films. I'm really looking forward to seeing more of his work. Not just in the 'Quiet Place' franchise, but in other stuff as well. The man clearly knows what he's doing- and he's good in it. So, yes. We want more, John Krasinski!\n\nSo, A Quiet Place Part Two is an amazing movie. It's fresh, intense and is a worthy sequel almost as good as the first one. Although the ending seemed a bit rushed up for me, I don't really have that many flaws with this movie. I highly recommend this film to you",
    "date": "2022-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I think by going off the farm into the city, and placing more action in the human world, where one character opens a toy store and another writes a book, you get a different type of movie then the first Peter Rabbit. It's still funny and cute but unfortunately not as.",
    "date": "2022-11-12"
  }
]