[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Cox is so good, yet again.  What a treasure he is.   This film is so simple but slowly nestled itself a place in my heart.  I will likely introduce this movie to some family members who appreciate a soothing movie that moves along just as smoothly as the river that is fished upon, instead of one that hits you like a monsoon with non-stop action and special effects.",
    "date": "2025-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "We loved this movie!  It was perfect really... Beautiful scenery and great acting.  The storyline was worthy of a tender film this.  It was moving yet not heavy-handed.",
    "date": "2025-06-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "2 hours and 2 minutes of drama!!!!!!!!!!!!!!! Rated R for Some Violent Images and Language.",
    "date": "2025-05-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Now and then, there comes a movie that perfectly reflects the choices and plans we make in life, only to have them disrupted by unexpected events. It can feel impossible to break free from the circumstances we face, and it's extraordinarily difficult to find the elusive tools and methods to do so. We find ourselves hoping the dim light of hope won't disappear during the dark times, and temporary solutions that ultimately make everything worse. Absolute must see :) God bless our mess.",
    "date": "2024-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A fine story about the effects of useless war and redemption thru the magic of fly fishing. Sit back and drink it in",
    "date": "2024-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Bad dialog, cliches, overacting, heavy-handed direction, this movie had it all. I wanted to like it, but it made me laugh, and the jokes were not intended. The first fishing scene between the two main characters starts out mundane until they arrive at the river on foot, then stand still as the camera pans to sweeping long-range scenes of Montana mountains, and the music is a Lawrence of Arabia-style parody. Like they have never seen Montana before, when they live there. Then one turns to the other and says, \"wanna fish?\"",
    "date": "2024-05-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Genuine and heart-warming: there was a lot of thought put into this gem.",
    "date": "2024-04-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Just an amazing story of pain, struggle, redemption and healing.  The cast is unbelievably talented and well cast.  Recommend for all but especially those with a military connection.",
    "date": "2024-04-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This is a good movie about rede.ption and the real effect of PTSD. The movie handles it well. It takes us on a journey that helps one understand the frailties of the human soul. I enjoyed it immensely.",
    "date": "2024-04-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "An old soul teaching a new soul. Such great meaning to this movie.",
    "date": "2024-04-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's slow in parts...not unlike a day of fly fishing I presume. Perhaps a little too long, but the performances, especially Brian Cox elevate this one from a \"meh\" to \"good\". The message of redemption and healing along with the beautiful Montana landscape is worth the time commitment.",
    "date": "2024-04-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The movie is amazing. There is a program for Veterans called Project Healing Waters. It uses Fly Fishing and fellowship to help Veterans cope with the traumas of being a War Fighter. This movie exemplifies the healing power of fishing and the mission of the program.",
    "date": "2024-04-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is an exceptional movie with Brian Cox and Wes Studi as stellar veteran actors who fit so easily into any storyline that they chose to perform in. Sinqua Walls, is a new actor to me and did a wonderful job as a marine with PTSD and all that the syndrome entails. Perry Mattefeld, who looks a bit like Jennifer Aniston, gives a sensitive, compelling performance in her role as well.\n\nThe storyline's pacing moved along well as the characters of Brian, Sinqua and Perry were explored more in-depth. The Montana skies and river scenes were beautiful and dynamic with the fishing lines floating through the air. I really appreciated the \"catch and release\" habit that this group of fly fishing people took to heart. \n\nThe musical score was brilliant and all encompassing. My Mom and I both thought we were listening to Alan Silvestri's magic and genius. We are now new and very admiring fans of Bill Brown's amazing musical composition talent and artistry. \n\n\"Mending the Line\" is a movie that will touch your heart and stay with you for a long time. The director, Joshua Caldwell, did not try to solve the key characters life issues but instead left them open to evolve and grow. The viewer is left with a sense of hope which is an excellent choice and movie ending. 5 Stars!",
    "date": "2024-04-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I wanted to like this but it was way too slow and the music was overwrought. Good cast.",
    "date": "2024-03-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Predictable from the first scene.  The cast couldn't fix this bad script. It tries to be sappy but is just lame. How does every character look like they just had hair and makeup done, and all clothes ironed in EVERY scene. Looks like a movie that even Lifetime rejected. It needs (and has) flute and violin music to raise any emotion.  Was it directed by a grade school girl?",
    "date": "2024-03-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is worth the watch. Watch till the end in the beginning it does have some stigmas play out but the ending helps to bring better meaning to help those who may have experienced such things.",
    "date": "2024-03-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Very sweet and sentimental. But one thing that began to annoy me more than more is that for all the violence of war scenes there's not a single trout that ever has a hook in its mouth.",
    "date": "2024-03-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I'm all in on Mend the Line. Incredible acting and stunning Montana vistas and river scenes. Damaged veterans finding their way back through nature and companionship…strong message here.",
    "date": "2024-03-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A very heartfelt movie that illustrates what it means to leave the military with invisible wounds. As a vet myself, I really appreciated the way this movie captured the unspeakable parts of service and living afterwards.",
    "date": "2024-03-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was a wonderful film about veterans, fly fishing, poetry, and forgiveness. We are all wounded warriors in some fashion. I wish there were more films like this.",
    "date": "2024-03-24"
  }
]