[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved this movie. I thought it was really heartwarming and heartbreaking at the same time. I thought it was really well written and preformed.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Fatherhood is a heartfelt drama-comedy based on Matthew Logelin’s real-life memoir, portraying his journey as a single father after losing his wife shortly after childbirth. While the film takes creative liberties—like altering family dynamics and character meetings—to heighten emotional tension, it stays true to the core story and emotional depth. Kevin Hart’s compelling performance brings humor and sincerity to the role, making the film a touching and relatable tribute to love, grief, and fatherhood.\n\nRead the full review here: (Indonesian version : alunauwie.com)",
    "date": "2025-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I laughed out loud a lot and it was quite compelling",
    "date": "2025-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This was a sweet film. I was impressed by the cast as they’re usually known for their comedic roles. I enjoyed the father/daughter relationship between Mike and Maddy. I recommend it.",
    "date": "2025-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "it’s completely generic, ordinary, uninteresting, boring and almost unwatchable. i quit after halfway because i wanted to spend my time doing something more important then watching a kevin hart (a great actor) perform as a character who is as interesting as a medieval pink pine cone. i hated all the characters and i ended up cheering when the lady dies. \n\n\nDO NOT watch unless you want lose 2 hours of your precious life.   \n\n\nPS. i love kevin hart but jesus christ i wanted to hurl a chair at my screen.",
    "date": "2025-03-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Fatherhood - 8/10. Paul Weitz directs this sweet and honest film about single parenthood based on a memoir by Matthew Logelin. With an incredibly honest performance from Kevin Hart, this film does an amazing job of showcasing the comedian in a different type of way, outside of his usual goofiness. The story follows his character as he deals with the loss of his wife after giving birth, and how he raises his daughter through many of the trials and tribulations that any single parent would face. A simple, yet engaging story thanks to the performances of the cast, Fatherhood is a perfect example of creating a beautiful film out of something predictable and familiar. Though the film feels familiar, it feels very down to earth thanks to the performance of Hart. He plays the character with this earnest quality, and his energy is played at the right level throughout the film. His trademark humour is there, but at the same time he also gives the character a depth that many seasoned actors are not able to give. Its wonderful to see him act like this, as this film and The Upside show that he is well capable of making good films with good performances. For director Weitz, this feels like a nice throwback to another amazing film that he had earlier directed (the wonderful About A Boy). He gives the film a nice pace and does a great great job of showcasing all of the performances and framing scenes with a nice mix of comedy and drama. A nice film, though familiar, Fatherhood is a good dramedy that will lift your heart and also makes you appreciate all that parents go through.",
    "date": "2024-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Lo siento, pero Ser padre ha sido una experiencia decepcionante. La película, protagonizada por Kevin Hart en el papel principal, intenta tocar el corazón del espectador con una historia emotiva sobre la paternidad, pero se queda atrapada en un guion plano y predecible que no logra profundizar en las emociones que promete. Aunque el tema tiene potencial, el enfoque es tan formulaico que las escenas clave parecen diseñadas únicamente para buscar la lágrima fácil, sin realmente ganársela.\n\nKevin Hart, conocido por su destreza en la comedia, demuestra carisma en ciertos momentos, pero no consigue convencer en las partes dramáticas. Su interpretación carece de la autenticidad y vulnerabilidad necesarias para transmitir el peso emocional de la historia, haciendo que muchas escenas se sientan forzadas o poco creíbles. La química con Melody Hurd, quien interpreta a su hija, tiene destellos de ternura, pero no logra sostener la trama debido a la superficialidad del guion. Alfre Woodard, en el rol de la suegra, aporta una actuación sólida, pero su presencia se siente subutilizada en un guion que no le da mucho con qué trabajar.\n\nEn términos técnicos, la película no presenta nada particularmente destacable, ni en su dirección a cargo de Paul Weitz, ni en su banda sonora, que parecen más preocupadas por seguir el manual del género que por aportar algo único. La relación padre-hija tiene momentos genuinos, pero incluso estos destellos se ven opacados por el ritmo pesado de la narrativa.\n\nSer padre podría haber sido una exploración sincera y conmovedora de la paternidad y el duelo, pero se conforma con ser un drama tibio que no arriesga ni sorprende. En lugar de emocionarte, te deja con la sensación de haber visto algo más enfocado en cumplir con los clichés que en contar una historia que realmente importe.",
    "date": "2024-12-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thought this was by far Kevin’s best movie I don’t think Kevin could play a serious role but man bro actually made me cry u could genuinely feel his pain awesome movie",
    "date": "2024-12-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "the first half of the movie is where i honestly felt it shined the most it started to fade a little in the second half but it overall was a great movie and worth watching for sure",
    "date": "2024-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I see people saying it's formulaic.  I think that is if you look at the overview and categorize it, ok.  Put it in a box. For a moment take it out of this box,  if you look at the minutia, there is charm, relatability, humanity.  The reason it is possibly perceived as  formulaic is because people have these things happen to them irl over and over. Struggle in real life is real.  We sure do need stories of love and the complexity of love. Seeing others experience and cope through storytelling can offer hope irl. I'll be redundant, unexpected loss and how to cope are REAL relatable, vulnerable issues. And in a culture that does not date talk about grief and death a movie can offer catharsis.  Hope and humor is powerful. Do not underplay hope and humor.   It can sometimes be the only fuel that keeps someone going through the darkest of times.   The acting is hands down genuine and believable.  I was immersed.",
    "date": "2024-03-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie...heart warming and funny at times",
    "date": "2024-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This was really great movie to watch... Really emotional never seen kavin Hart take such a role. Really recommend.",
    "date": "2023-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's the first movie I really enjoyed that had Kevin Hart as a lead role, I didn't think he was a strong actor, but he proved me wrong",
    "date": "2023-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Heartfelt. Amazing movie from start to finish",
    "date": "2023-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Tenderly directed, as recognized, and acted with earnest, turning out to be one of the most resonating pictures regarding single parenting captured by Hart's dedicated performance in exceptionally connecting with the subject, dynamically and thoughtfully bringing out the heart that may have been laced formulaically with bits of sentimental cheese. (B+)",
    "date": "2023-02-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Easily one of Kevin Hart's best performances so far. A heartfelt movie that feels just right, this is an emotional film with a hint of humor.",
    "date": "2022-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Thought it was a comedy, but it made me cry like a baby. Worth a watch, especially as a parent.",
    "date": "2022-05-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I just couldn't stand to watch any longer than 20 minutes. Dialogs are ''ordinary'' as the top critics say. I just couldn't get rid of the image that Kevin Hart is a stand-up comedian 'rather than an actor.",
    "date": "2022-02-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very well done with a lot of heart, and including a good Kevin Hart and the young Maddy. Sad topic but well done all around. Good humour mixed it",
    "date": "2021-12-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fatherhood is a heartwarming story. It tells a believable story of the challenges of single-parenting in the midst of deep grief, and of the love and support of a family. The acting is fantastic. This is a must-see!!!",
    "date": "2021-12-31"
  }
]