[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It's Too Weird.......",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Its 2025 and Im watching these with my son. Ive never seen the third because of the second one and here we are both crying at the end. Characters are given more depth again, and the baddie was genuinely enjoyable. Effects were a bit wonky but fits this series playful theme.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Somewhere in between the blockmaster masterpiece of the first movie and the embaressing failure of the second movie.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This is so very similar to the previous film. I didn’t like the time travel and the story was stupid. It held my attention though and the jokes are less repetitive. The effects and production in general looked a lot better. I thought the villain was cool. And the alien character Griffin reminded me of Mantis from Guardians of the Galaxy and was a great addition to the film. Overall only worth watching if you liked the first two.",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The best movie of the triology.",
    "date": "2025-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Well I think this one surpasses the predecessors. Grown in intensity and storyline more complex and sharp. Lots of action, naturally, plenty twists, witty and funny at times. Amazing cinematography and effects. Very well written and brought to screen. Whole cast excels in character very convincingly. Highly entertaining and gripping",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A sequel and a trilogy were no needed for this franchise.",
    "date": "2025-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "While never reaching the heights of the original classic, it’s a vast improvement over MIB2. The time travel is fun & Josh Brolin is indistinguishable from Tommy Lee Jones as the young Agent Kay!",
    "date": "2025-07-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Definitely the best one outta the 3 its always been my favorite, plus the back in time song by Pittbull is a banger",
    "date": "2025-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Amazing movie, way better than expected. BY FAR the best Men In Black!",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A sequel that actually works",
    "date": "2025-04-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "É o melhor homens de preto,a história é muito boa, é bem engraçado, e simplesmente é um filme de comédia com alien, que os outros já eram ,adicionando viagem no tempo",
    "date": "2025-02-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I actually like this one far more than the first one, had a lot of laughts and the ending brought a tear to my eye.",
    "date": "2025-02-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "LOL!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2024-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I have LITERALLY nothing to say",
    "date": "2024-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Always loved it.\nTons of great jokes; it looks good, the caracters are good, the story is good, the pace is good.\nAnd some great acting too.",
    "date": "2024-12-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "3rd best... international is 🗿!!",
    "date": "2024-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is honestly my favorite MIB movie because the villain, Boris is faster, and more powerful than the other villains due to his killing people in one second with porcupine quills. Not only that, to me, Jemaine Clement did an amazing job playing an antagonist, and I appreciate the makeup that the crew did for him, and that’s a 5-star review right there!",
    "date": "2024-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It's one of the best, But I still prefer the first one",
    "date": "2024-06-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "noah:says not my favourite movie!",
    "date": "2024-06-02"
  }
]