[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "James Cameron and Bill Paxton, director and actor of the 1997 film Titanic, travel to the final undersea resting place of the ill-fated ship of dreams and reconstructs life aboard in the shape of living tableaux of passengers and crew, seen in spectral mode, eating, drinking, dancing or promenading among the watery remnants of their vessel. Very touching.",
    "date": "2021-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Ghosts of the Abyss is an amazing documentary. It is about James Cameron and Bill Paxton who travel to the final undersea resting place of the ill-fated ship of dreams, the Titanic. Bill Paxton did an awesome job narrating the film. James Cameron also did a great job directing the movie. I enjoyed it because of my interest in this magnificent ship.",
    "date": "2017-04-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Brilliantly made film with some excellent footage and great technology in use.",
    "date": "2016-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Really pointless didn't see or hear anything new complete waste of time easily could of been made and show at the end of the titanic movie in a 3 minute segment really was not needed",
    "date": "2015-03-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Ghosts of The Abyss is an interesting continuation of James Cameron's exploration of the Titanic wreckage. Complete with Bill Paxton, this documentary feels like it would have been better suited as a special feature to compliment the 1997 movie. Although it's a bit lackluster for a feature film, it is a fascinating viewing experience. Many of the shots are breathtaking, especially when superimposed with CGI images of the original ship and passengers. There's a surreal feeling to this film, as the dates of this exploration overlapped with the events of September 11th, 2001. As the crew was focused on this historic tragedy, another one was taking place. I enjoyed this for what it is, but I can't give it a very high rating. Sadly, there's just not a whole lot to it.",
    "date": "2015-03-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Definitely Worth The 3D Experience. It Is A Good Trip Deep Into The Atlantic Ocean & Resting Place Of This Ship, Which Never Completed It's Maiden Voyage.",
    "date": "2014-04-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "one of my favorite movie",
    "date": "2014-01-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The emotional effects of the tragedy still remains like the wreck, but Cameron's journey to the real setting of his so-called masterpiece managed to be better than \"Titanic\" (as I expected it to be) because of the amazing (and sometimes somewhat creepy) underwater visuals and adding scenes of the ship's old days, serving as a prequel, sequel and remake. (B)\n\n(Full review coming soon)",
    "date": "2013-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very interesting film to watch. It's cool and amazing to view the Titanic like that.",
    "date": "2013-05-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Valla estos críticos si son imbéciles, es un documental, no una pelicula ¬¬ no sean pendejos. MEH! Es interesante la verdad, pero en ciertas partes llega aburrir, ya que aveces en vez de enfocarse en el barco, se pierde el tiempo en otra cosa. Pero es, o bueno fue un buen documental ya que Cameron lo hizo con \"Titanic: Los Últimos Misterios\"- Discovery Channel (2005) y \"Titanic: la Ultima Palabra\"- NATGEO (2012). Aun así, la forma en como Bill Paxton y el resto del equipo narran la historia del barco, compensan ciertos fallos. Aunque claro, con los nuevos descubrimientos, el documental ya no estas exacto en la forma de como se muestra el hundimiento del Titanic.",
    "date": "2013-04-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "(***): [img]http://images.rottentomatoes.com/images/user/icons/icon14.gif[/img]\n\nInteresting throughout.",
    "date": "2013-02-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A good documentary, certainly for the big screen but not very informative. In IMAX 3D it was quite a sight and though it still packs a punch in 2D it loses something.\n\nI find that on repeat viewings it still carries an emotional edge, if only slight but still something to note. It's certainly worth a watch if only to make up your mind.",
    "date": "2012-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Bastante interesante, me gusto :)",
    "date": "2012-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Very cool documentary about James Cameron's further exploration of the Titanic wreck. I would've liked it to be a little longer. But, the discoveries, and even the drama of failing equipment keeps it fresh. I recommend it, especially if you like \"Titanic\".",
    "date": "2012-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "a good tribute to a beautiful ship, the visuals were amazing, i think it could of been better, i wish it lasted longer, i also think it would of been good if they played more music as your seeing imagery of the ship like at the end.\ni didn't like parts where it went on about the history because as a person really interested in the titanic, i was being given alot of information i already knew, i can't complain too much but as they have so much more footage they should release more.",
    "date": "2012-06-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Really enjoyed watching this. Decided to watch it after seeing Titanic 3D in the cinema.",
    "date": "2012-05-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A great Titanic documentary.",
    "date": "2012-05-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "\"Ghosts of the Abyss\" is a sci-fi type documentary.  James Cameron and Bill Paxton along with a group of scientists, historians, and deep sea explorers head down to explore the remains of Titanic.  It's visually stunning to see the ship at the ocean floor.  The way it has deteriorated, yet parts like stain glass windows remain beautiful and intact.  Runs only at 64 minutes, which is a good run time as the movie does become a little boring mid way through.  This was designed for 3D Imax, so watching it on DVD on a 55 inch tv, really doesn't seem to do it the justice is deserves.  At home it's kind of just a boring exploration of a fascinating subject.  But, I'm sure on a 3D Imax screen this is a real experience.",
    "date": "2012-05-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Cameron is forever associated with the fateful ship, and it was high time he moved on.",
    "date": "2012-04-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Decent enough.  James Cameron isn't the most engaging, Bill Paxton is Bill Paxton, and the ghost footage is lacking.  I don't understand why they had to go ahead an create new documentary-style scenes when it would have been better to just use scenes from the movie.  What I liked the most was probably the underwater footage of the actual wreck.",
    "date": "2012-04-15"
  }
]