[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "One word...Horrible with unrealistic bad character acting and a story that lacks completion and growth. Sad this was even made.",
    "date": "2025-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This is a very unique take on the haunted house motif. I found this to an entertaining slow-burn horror film. If you like watching Youtubers make terrible decisions in order to get content for their channel, especially of the abandoned places or ghost-hunter-type variety, then you will likely enjoy this film. It's not too complicated of a plot. But it was fun to watch.",
    "date": "2025-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I thought it was glacial in its arc, and ridiculous in its story line. In my opinion, they substituted very dark lighting and extreme closeness for tension. The only bright spot was Camille Rowe, who really should be more famous.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Sabe aquele filme que vc dorme, dai volta de onde se lembra que estava acordado, e dai dorme no mesmo lugar? Este aqui me fez dormir 4 vezes. O que tem de bom, é a casa ser debaixo dagua. Mas o resto é bem previsível.",
    "date": "2025-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Boring ..........!\nEssentially a cam corder film with an annoying male voice that leads a couple further into bad decisions.",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I can't believe how critics are nice to this movie. It's so slow that it rapidily gets boring!\nSure it's scary, but it's just your brain trying to fill in the gaps of the script.\n\nAn underwater house is a cool idea, but the second half of the movie is just awful and made me feel stupid having expectations.",
    "date": "2025-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie, well made and plenty of scares",
    "date": "2025-03-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It wasn't bad.....kept me interested",
    "date": "2024-12-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "to be honest i enjoyed the setting of the movie but i got scared when the fish jumped out of nowhere more then when they found the undead family",
    "date": "2024-12-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Very original idea, excellent cinematography and a very strange movie. You might recognize a young Mick Jagger as one of the two stars of this very unique film that certainly does a superb job setting an atmosphere of unexpected surrealism... About halfway through the movie is when it becomes apparent the movie is a horror movie.... The back story could have emphasized more about the origin and history of the house but like the ending, it's left up to the audience to form their own conclusions.... I don't like that tactic with a good movie and a very good original plot but such is life .....\n\n4 1/2 stars 🤩 🤩 🤩 🤩 🤩",
    "date": "2024-12-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The atmosphere of this movie was really good and very suspenseful. But once you figure out what’s going on it gets incredibly boring. I will say props to whoever filmed it because the cinematography was great.",
    "date": "2024-12-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The atmosphere is fantastic. Creepy factor is a 10/10. Unfortunately, the acting/dialogue is crap, but to be expected of low budget films. Despite that, I found this to be unique and scary. Definitely worth that watch!!",
    "date": "2024-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Con esta película sentía que estaba atrapado en una caja, es desesperante y misteriosa. Recomendada.",
    "date": "2024-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Awful film, badly written and acted, the dialogue between the two divers is God awful. Cool underwater shots but that's about it.",
    "date": "2024-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The plot was average haunted movie but underwater. Love it!!",
    "date": "2024-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The movie was okay the end what’s absolutely terrible makes no bloody sense.",
    "date": "2024-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I found the critics of this film to be pretty accurate on the dialogue and some questionable acting / actions by the cast.  While the film obviously had a limited budget , it did NOT lack in quality atmosphere !!   I am one of those few folks that love the horror genre - even tho it is ubiquitous with terrible films , terrible acting and well...terrible effects.  I always lower my standards for low-budget horror and sign on just to enjoy the ride.  This film really sets itself apart from other low-budget horror and truly shines in its creepy atmosphere , subtle visual clues and impending sense of dread.  The way some of things that are wrong in the scenes shows some serious directing talent...everything is not just handed to you.  You have to pay attention to the details in the scenes building up to the reveal to get a true sense of this movie's worth-a-watch quality.  Sure , like almost all horror movies , this one will not win any Hollywood awards or recognition...but if a creep-building and attention-rewarding movie is your style - you can not go wrong with this one.  It is just different and well-done enough to have bothered my peaceful sleep for several weeks after watching it...in a good way !!",
    "date": "2024-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Who wants a film about an underwater haunted house? If the answer is yes then 2021's 'The Deep House' is the film for you.\n\nSYNOPSIS: 'While diving in a remote French lake, a couple who specialize in urban exploration videos discover a house submerged in deep waters. Their dive turns into a nightmare when they discover the house was the scene of atrocious crimes.'\n\nThis is certainly one way to take a different stab at the old haunted house horror story. A film which will leave you quite literally breathless.\n\nThe underwater settings play at my anxieties already and once you add in some terrifying horror sequences this film was definitely onto a winner.\n\nUnfortunately the performances of the limited cast  and narrative intentions really let this film down. The film needed more, it deserved more.\n\nThe ending hints at a sequel, a sequel I hope we don't ever see. This is better as a one off.\n\nLots of potential which ends up being a soggy disappointment.\n\n6/10",
    "date": "2024-06-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "All in all I think it's worth giving a try, not exceptional but I still liked it. The vibe of the movie reminded me a bit of Blair Witch with it's creative use of cameras, cinematography and explorative premise. The acting, characters, and plot was all middle of the road. The story felt a little rushed and the acting towards the end fell off a little. \n\nWhat really saved it for me was the setting, the movie did a great job making a spooky atmosphere and I really enjoyed how much tension it created with closed in rooms and the suspense of waiting to see what was next through the drone's lense. The sprinkled in jumpscares worked, if you've got some fear of things lurking in murky water like me you'll definitely have chills. The shots of the antagonists swimming around were really interesting, not super scary but satisfying enough for it to still be a good horror movie. Lack luster ending, but the creativity of it's setting and general premise slightly makes up for the meh everything else.",
    "date": "2024-06-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Impressive that they shot it under water, but very boring.",
    "date": "2024-04-20"
  }
]