[
  {
    "user": "Adam Olinger",
    "rating": null,
    "text": "It's too serious to be fun. It's too stupid to be smart. It's too long to be watched. Primitive War is a primitive chore to get through but I did get a few laughs along the way. Just not for the reasons it probably wanted.",
    "date": null
  },
  {
    "user": "Abhishek Srivastava",
    "rating": 3.0,
    "text": "‘Primitive War’ easily fits into the category of a cheesy war film, but it also delivers plenty of ridiculous fun.",
    "date": null
  },
  {
    "user": "Kim Newman",
    "rating": null,
    "text": "An unashamed exploitation movie with teeth, this has all the dinosaur devilry and gung-ho soldiering you could want. There’s even a sweet Tyrannosaur love story in the mix.",
    "date": null
  },
  {
    "user": "Karina Adelgaard",
    "rating": null,
    "text": "I was happy to see that this wasn’t made as a kitsch B-movie. I mean, when you describe the plot, it’s too easy to think a filmmaker would go the route of 'Sharknado' or something similar. This is not that kind of story, and...",
    "date": null
  },
  {
    "user": "Leslie Felperin",
    "rating": null,
    "text": "There’s a cheerful cheesy gleefulness that motors the movie along.",
    "date": null
  },
  {
    "user": "Martin Unsworth",
    "rating": null,
    "text": "Sparke’s film manages to surpass expectations with what he delivers on screen.",
    "date": null
  },
  {
    "user": "Keith Garlington",
    "rating": null,
    "text": "Sure, you can pick apart certain things...But those issues are trivial in a movie that succeeds in being exactly what it wants to be – two fun-filled hours of pure genre entertainment.",
    "date": null
  },
  {
    "user": "John Kirk",
    "rating": null,
    "text": "It’s guns versus dinosaurs and while I respect the bellowing roar of a T-Rex, a la Jurassic Park, it’s nothing that impresses me. Well, that’s not entirely true. The foley artist did impress. It was cool to hear the snapping of the T-Rex’s jaws.",
    "date": null
  },
  {
    "user": "David Griffiths",
    "rating": null,
    "text": "Further proof that Luke Sparke is one of the best Australian directors going around at the moment.\n\nThis film shouldn't work - its premise is crazy - yet somehow it does. It becomes an enjoyable action-horror that is filled with creativity.",
    "date": null
  },
  {
    "user": "Alan Ng",
    "rating": null,
    "text": "Bottom line—this is the dinosaur movie fans have been waiting for, and it doesn’t pull any punches.",
    "date": null
  },
  {
    "user": "Nicholas Brooks",
    "rating": null,
    "text": "Primitive War isn't perfect, but it's exactly what audiences need to scratch the dino itch.",
    "date": null
  },
  {
    "user": "Jana Monji",
    "rating": null,
    "text": "In 2025, is it really okay to make a film like this in terms of diversity? Ignoring that, it is still hard to ignore the bad dialogue. What's wonderful though, the dinosaurs done on a budget.",
    "date": null
  },
  {
    "user": "Cris Parker",
    "rating": null,
    "text": "While I admire and respect how much dinosaur mayhem was delivered given the film’s budget, the writing and characters leave a lot to be desired—problems a bloody T-Rex bite can’t fix.",
    "date": null
  },
  {
    "user": "Jeffrey M. Anderson",
    "rating": null,
    "text": "It might have been a great five-second elevator pitch—\"soldiers vs. dinosaurs in Vietnam\"—but this bloody sci-fi-war movie goes on far too long and takes itself far too seriously to be much fun.",
    "date": null
  },
  {
    "user": "Sebastian Zavala Kahn",
    "rating": null,
    "text": "It works well as a tense, bloody, action-packed experience with surprisingly good visuals. But the best part is that it works even when compared to the “Jurassic World” franchise, which should leave Sparke more than satisfied. [Full review in Spanish].",
    "date": null
  },
  {
    "user": "Jesse Hassenger",
    "rating": null,
    "text": "“Primitive War” is a “Jurassic Park”-meets-Vietnam War mash-up—and is as ridiculous as that sounds.",
    "date": null
  },
  {
    "user": "Meagan Navarro",
    "rating": null,
    "text": "Despite the constant of the soldiers running and gunning their way through war terrain while dodging prehistoric attacks, Primitive War is surprisingly inert.",
    "date": null
  },
  {
    "user": "Simon Foster",
    "rating": null,
    "text": "[Luke Sparke] understands what makes for a rattlin’ good B-movie romp, including a game cast (Ryan Kwanten and Jeremy Piven, most notably) and effects that deliver bang/roar for your buck.",
    "date": null
  },
  {
    "user": "Avi Offer",
    "rating": null,
    "text": "A thrilling, action-packed B-movie movie that blows Jurassic World Rebirth out of the water.",
    "date": null
  },
  {
    "user": "Jim Schembri",
    "rating": null,
    "text": "If Platoon and Jurassic Park had a love-child Primitive War is what it would look like. Plenty of chomptastic fun here with this big fat serving of masterfully made B-movie mayhem.",
    "date": null
  }
]