[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Molly and her father are psychopaths and planned this murder, set Jason up. She just wanted the kids, she made up stories about giving birth to them. She brainwashed his children. Molly is delusional and she was raised by a controlling father and a submissive mother. Why is Molly's mother not making any interviews? Why would he bring a bat to calm them down? Why would she have a brick in the bedroom, is that where the children were going to paint it? Why did they not have any injuries? Why beat him so badly that he couldn't defend himself; two on one? Jason was never going to have her have custody, no way!!! Why didn't she get pregnant and have her own child with Jason? I don't believe she can have children, she miscarried one, maybe more than one! Two murderers killed an innocent man, he lost the love of his life and then they took his life from his children!!! Their attorneys are doing their jobs, that why they are called defense attorneys, the justice system in this country is so screwed up, this whole country is screwed up! No surprises here, just another injustice ... I hope the children have happy successful lives, they deserve it!!!",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Pretty good. It's in interesting, though horrifying, story without a clear answer. Often documentary makers reach a conclusion then push it hard. This one just lets you consider a lot of evidence on both sides, adding to each side of the scale step by step back and forth, as to where this really was on the spectrum from self defense to premeditated murder. I see other reviewers have strong opinions, but the documentary doesn't push one and that's a big plus. Personally if the retrial had gone to a jury I was on, I'd have voted to acquit: state didn't have evidence beyond a reasonable doubt of even manslaughter IMO. OTOH if the Irish family had sued (maybe they did, it wasn't mentioned) for wrongful death I'd have voted Molly, at least, civilly liable. I believe it's likely she acted wrongly and perhaps her father too, just not beyond reasonable doubt. The victim had anger/control issues, evidence of that wasn't refuted IMO by family and friends insisting he was a 'nice guy' or saying the secret recordings were 'taken out of context'.",
    "date": "2025-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Molly and her father cannot act innocent to save their lives.  Such psychopaths.  You can easily tell they’re the kind of people who aren’t invested in other people, they’re only living for themselves.  Terrible people.  Terrible liars.  Terrible actors.",
    "date": "2025-09-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I definitely do not think the mom and her father did this to the father. \nShe obviously did not plant those cameras around her house for no reason, if you would open your ears and listen to the way he was talking to her he was obviously rude and trying to gaslight her and make her feel bad..",
    "date": "2025-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is one of the few ive watched and at the end still unsure............its horrible how this guy died beaten to a pulp.......I have some disbelief of the dad and wife about that night however if they are lying they are damned good at it\n............you have to feel bad for those poor kids...........glad I watched this, very interesting.",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A “honest gentleman” beat his wife and she stood up. Her Papa, came to help her.",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "76%. 7/7/25. Weird set of circumstances with a deranged step-mom and her dad killing her husband. The husband also had a weird background with a somewhat suspicious death to his prior wife and questions around his abuse to this lady. It seemed like he probably was abusive but the wife went too far and killed him. But leaves you with a lot of questions. Feel terrible for the kids. Solid watch, but no reason to rewatch. 2/5 rewatch.",
    "date": "2025-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was a very well-done documentary about a travesty of justice. It's about a lying, (proven by investigators) manipulative woman and her enabling father, who claimed that a very drunk (another lie - Jason was  legally sober enough to drive) jason attacked them and was so wild, the two of them had to beat him to death in self defense. Molly and Tom had not a mark on them, yet Jason was a gruesome mess. There was blood on Jasons' pillow. Had he been sleeping during the first blow? Very likely, in my opinion. I used to be an avid reader of true crime and have watched many trials. I don't remember ever seeing a pair of killers recieve 6 years for what so clearly looked like a pre-meditated slaughter. What has become of our justice system?",
    "date": "2025-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Another true crime documentary that follows Netflix's trite formula. It started strong but fell apart in the third act.",
    "date": "2025-05-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great documentary! I'm beyond mad that Molly and her dad got away with murder! She purposely set up recording devices and then acted like she was the victim! Funny how everyone that knows Molly says she's a psycho! MY FAMILY DOESN'T BELIEVE A WORD SHES SAYS! THEY BOTH BELONG BEHIND BARS FOR MURDER.",
    "date": "2025-05-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "One of the better documentaries on Netflix recently. Really well paced and interesting story. Just feel so sorry for the family and as always hate the defense lawyers.",
    "date": "2025-05-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A Confounding And Compelling Netflix True Crime Documentary. If you’re riveted by true crime reporting, make your way over to Netflix and check out ‘A Deadly American Marriage.’",
    "date": "2025-05-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Netflix has really figured out the formula to make these a thrill ride.",
    "date": "2025-05-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Above average true crime documentary about a very suspicious death.",
    "date": "2025-05-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "An interesting documentary. My heart broke for them children. I am utterly disgusting that vile woman and her father got away with it.  Absolute disgrace. I had to fast forward their talks in the end.‘I couldn’t bear to listen to them anymore. Another example of a shocking justice system",
    "date": "2025-05-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "**Review: A Deadly American Marriage (3 stars)**\n\nAlways a sucker for a true crime doc, and *A Deadly American Marriage* is exactly what you'd expect—nothing groundbreaking, but still totally watchable. The case itself? Heartbreaking. You can’t help but feel for those poor kids caught in the middle of such a twisted mess. Honestly, their strength shows, and I’m sure their real parents would be beyond proud. As for the stepmom and her creepy dad? Zero remorse, zero humanity... they deserved way more time behind bars. If you're into crime docs and want something that’ll keep you shaking your head, this one's a decent pick.",
    "date": "2025-05-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very good documentary and tragic story. It was evident that Molly had a little bit mental issue with become a mother, when she lied to her neigborns you know that she has this problem. Umm sometimes details speak a thousands words. I'm feel so sad for the children, God bless them🙏🏼",
    "date": "2025-05-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A well balanced documentary, with both sides given the opportunity to present their cases.  However, I came away with the view that no matter how you cut it, Molly Martens and her father look completely culpable. They played dirty and shamelessly lied so many times. And in the end they attacked the characters of everyone in the Corbett family including his kids!",
    "date": "2025-05-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The documentary meticulously details the events surrounding Jayson's death. Both parties were given the opportunity to present their accounts of that day; however, Molly and Tom's narratives contain significant inconsistencies. The crime scene itself raises serious questions, and the physical evidence does not convincingly support the claim of self-defense—the self-defense claim appears excessive. While I'm glad they were both convicted, I'm disappointed the sentences weren't life imprisonment. This is solely my opinion.",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Interesting tragic documentary. It shows both sides almost equally. However, it is hard to forget the scene of the crime; it doesn’t add up with self- defense.",
    "date": "2025-05-13"
  }
]