[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Predictable love study. It follows very familiar trips. Christina Milian is great though and I enjoyed her musical performances. Although it’s a cheesy story, it’s a good comfort watch.",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A beautiful love story in a gorgeous setting. The story explores the idea of needing closure and second chances and recognizing one's priorities in life. The movie is emotionally moving with lovely musical performances. Not the usual predictable rom-com, but something a little more thoughtful and mature with lots of funny notes.",
    "date": "2024-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Okay so let me start by saying I love a Christina Milian rom-com. I've seen this 3 times, same with Falling Inn Love (that one is easily a 5 star for me).\n\n***Spoiler alert- even though you've had 3 years to see it***\n\nHowever, Resort To Love kinda irked me this 3rd time because it's just so unrealistic. Like it bothers me that she dated Jason for 4 years, was ENGAGED to him, but never met his brother, let alone saw a picture of him. She knew their parents, but never even saw a picture of this man who was his mom's golden child??? She was also still crying about Jason a year after he left her, but she never stalked him on social to see that he was in a relationship/engaged again? We know he had social media as it was pointed out because of her best friends algorithm with the ads thing. Then there's the fact that she most definitely was not a girls girl as she was sneaking around meeting Jason. And his wishy washy feelings, then acting like he married his true love pissed me tf off. He def settled. And her singing their song at his wedding was like a \"you've gotta be kidding me\" moment. There's no way that wouldn't have hurt either of them. Then she jumps off the stage to kiss his brother? Omggggg. It was only the night before that Jason was trying to meet with her, if this was a true story, he probably would have lost his mind seeing that. \nAnyways, it's a cute rom-com if you take it with an absolute tiny grain of salt.",
    "date": "2024-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Horrible acting,lame story,not even funny",
    "date": "2022-05-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It is what it is: a lovely, fun light-hearted and silly rom-com :-)",
    "date": "2022-03-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Go and watch a documentary or do something useful with your time, don't be like me wasting hours of your life watching a predictable script, pathetic acting, zero comedy 😑.  It was so predictable it's embarrassing do writers just not try anymore? Shout out to Jay Pharoah for some of the worst acting I've seen . So cringey, no genuine connections. Absolute smut and a disgrace to cinema. Not romantic nor is it a comedy",
    "date": "2022-02-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Funny as all get out!  Predictable ending, but that's to be expected for a romance movie.  Solid acting.",
    "date": "2021-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved the movie it was fun and refreshing to watch a clean movie.  No language, sex.  Great job!",
    "date": "2021-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Well-written with a lot of heart and surprisingly fresh jokes, we enjoyed this romantic comedy. It was sweet but not sugary, clean but not uptight. It's a great pick for all ages. Highly recommend!",
    "date": "2021-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Beautiful black people, a beautiful resort and Roscommon hijinks.  What's not to like?",
    "date": "2021-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I thought it was a good chick flick with romance and comedy. I liked the fact that Cristina Milian's quality acting skills kept it from seeming like a low budget, corny film. You would think the storyline was predictable, but it had many twists and turns. It was funny too, I lol a few times. Really enjoyed it!",
    "date": "2021-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Just awful. How did this even make it into Netflix!",
    "date": "2021-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Typical story saved by good nostalgic songs.",
    "date": "2021-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A fun Rom Com. Easy breazy, fun and enjoyable.",
    "date": "2021-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "When you watch the movie you think that it's going to be typical and predictable. However it ended up being a wonderful love story",
    "date": "2021-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The storyline is basic, nothing intriguing about it.",
    "date": "2021-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Nothing unexpected, but still an enjoyable film.",
    "date": "2021-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Pretty well done. Nothing too unexpected. A worthy movie if you want to just relax.",
    "date": "2021-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Awkward. Tedious. Extremely hard to watch",
    "date": "2021-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Nothing original about this movie. Bad script, bad acting, just a bad movie. Don't waste your time.",
    "date": "2021-08-01"
  }
]