[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Not a great movie, by any stretch and when you mention Ryan Reynolds this is the movie he probably wishes was wiped from his IMDB page. With that being said I enjoyed this movie.",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Amusing, but not more than that. When you've got absolutely noting better to watch. Kevin Bacon plays his classic bad guy, he can do it, we saw that before.\nJeff Bridges is upping this from 1,5 to 2 stars.",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Men in Black meets Ghost Busters.  Nothing really great about this movie.  Tons of CGI nonsense.  Wasn't a total waste of a couple of hours of my life, but it's not a very good movie.  \n\nStar studded....  Great actors in the movie acted well, but the story and all of the CGI just kind of kept it from being more than moderately enjoyable.\n\nA swing and a miss.",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This really didn't work. Solid premise, but the execution was not there. Pretty bland, predictable, and not even that funny. The jokes felt so forced and I didn't get it. I love Ryan Reynolds, but he wasn't even that great here. Plus the theming and tone was so inconsistent. Also, did not care for the CGI work at all. It was so bad it was kinda funny.",
    "date": "2025-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "An okay action film with a somewhat decent concept. It has some REALLY TERRIBLE CGI but I guess the action was kinda fun. You might like it for you action fans out there but this one ain’t for me but again, it’s not too bad",
    "date": "2025-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Movie got too much hate. Unjustly in my opinion. If you want a funny immature good time it’s a must watch. Is it predictable yup, sappy love story yup. Still liked it way more than I thought I would.",
    "date": "2025-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie was of course silly and probably most suitable for the 10 to 25 crowd but the special effects were decent, the plot was cliche but humorous, Ryan Reynolds was good as the straight man and Jeff Bridges' over the top Wild West character leveled the whole thing up a notch. I would recommend it as a light and silly choice for family night or a safe bet for your sixth graders slumber party",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I’m no official critic, but I would definitely say that this movie is good. I like the plot, the movie is pretty funny, I laughed most times, it was nice. Overall I would say it’s just a good movie to watch if you’re bored",
    "date": "2025-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I liked the two actors they are good, but other than that a silly plot and bad direction. Some action scenes were ok. Didn't even expect much but that movie managed to disappoint me.",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 38 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated PG-13 for Sci-Fi/Fantasy Action, Language, Sex References, Some Sensuality and Violence!!!!!!!!!!!!!!!! The USA grossed over $33,600,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A movie to have on in the background or to mindlessly watch after a long day. You will probably forget you watched this movie within hours of viewing.",
    "date": "2025-06-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Apparently this is one of those love it or hate it movies.  I just finished watching it for the third time and still got a big kick out of the slap stick and silliness.  Mary-Louise Parker has a fun supporting role that deserves more credit and of course Jeff Bridges shines as always.",
    "date": "2025-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Idk what everyone is saying i legit loved this movie so different and unique fun movie",
    "date": "2025-05-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Got a kick out of this flick.  Mash-up of buddy comedy action with fantasy.  Jeff Bridges is really fun and the special effects are pretty good.  I've seen this twice & will watch it again.",
    "date": "2025-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A mi si me gustó, es divertidisima y el personaje de Roy es demaciado ambiente un 1000 de 10 sin duda!!!",
    "date": "2025-03-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "What an absolute waste of time. With such a cast i half expected a good movie but ot is nonsense utter tripe.",
    "date": "2025-02-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "forgettable kids movie.",
    "date": "2025-02-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's hilarious. It's a slapstick type humor,and worth your time",
    "date": "2025-01-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is Another one that almost killed Ryan Reynolds’ career. Seen it a few times and not convinced. It’s a bad movie, skip R. I. P. D. \nIt’s certainly not worth the time at all, action is silly and ok, humor is hit and Miss! \nIntroduction is where this movie is going good and it falls off of a cliff from those scenes forward.",
    "date": "2024-12-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Gotta to be honest, I do not know what the fuss is about. Yeah, the action itself is quite corny in general. Then the acting at the end wasn’t too good, but the comedy remained quite amazing just like the rest of the movie. Not poorly done, the comedy is odd but they don’t overdo it, got some legendary actors, I suppose the music could be better, but at least in my POV, this is the best Ryan Reynolds movie I’ve ever seen. And I even liked the movie Life so much that I watched it about 20 times already on Netflix. And that’s how good this and that movie is. Definitely a must see if you can. Just don’t watch the sequel because absolutely nothing about it is good or fits.",
    "date": "2024-11-24"
  }
]