[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Si te gusta el futbol y las peliculas que dejan mensajes buenos definitivamente tienes que ver esta pelicula no le hagan mucho caso a los haters recalco que esta pelicula se disfruta mas si te gusta mucho el futbol porque todos los paises nos une eso el futbol en esta peli no tanto con palabras.",
    "date": "2025-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Absolutely a thrill to watch it actually had me so impressed that Netflix can produce such a masterpiece i know im not a critic or a movie watcher but when I see this movie I cant help myself but to put a review excellent work !",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A humbling picture compositing stories to become its own respectfully giving this phenomenon wider recognition to those who favor a supposedly uplifting sports story. It actually ditches the formulaic tendency of predictability, despite the element getting forgone amid captivation, and focuses on the meaningful, humane impact between unsung skills and demonstrates how the physically strategic outlet not only inspires but also unites, alongside the sense of hope. It may not score as high, even when such is irrelevant, it’s a feel-good film that minimally cheers. (B)",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "What's not to like? Oh, well it is missing drugs, sex and rock n' roll. Otherwise it has it all.",
    "date": "2025-05-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Released on March 29th 2024, Thea Sharrock’s “The Beautiful Game” is\ncertainly a beautiful film. It has a heart-warming story with a great plot.\nStarring actors like Bill Nighy and Michael Ward, The Beautiful Game is\ninspired by the real Homeless World Cup, played annually.\nOne of the main ideas for creating this film was to bring awareness to people\nabout the hard work people put in to organise events like this.\nPlot Summary and Film Effects\nThe film is about an ex-football player who couldn’t fulfil his dreams called Vinny. Vinny is a\nhomeless man that lives in his car. One day, he walks by a team’s football training and starts to play\nvery well after stealing the ball. Mal, who is the coach of the English homeless World Cup team\nnotices him and invites him to play with his team in Rome. At first Vinny refuses to go after seeing\nhow bad the others are. But in the end, after thinking it through he decides to go.\nThe first few days of the tournament he is not having a nice time and starts to get flashbacks of his\nyounger self playing. These flashbacks create an intense and suspenseful effect by flipping between\npast and present.\nOne of the clear cinematic aspects that you can\nsee is the high key lighting and eye level focus on\nthe actors. This makes it look and feel very\nrealistic and reminds viewers that this is inspired\nby the real homeless World Cup. This is balanced\nwith the quick shots of the football game time.\nThroughout the tournament, Vinny goes on a\nrollercoaster of emotions, struggling to interact\nwith his teammates and find his spot in the team.\nConclusion\nThe Beautiful Game is a great family movie. It’s a heart-warming story about second chances and\nunknown heroes. It reminds us of the power of perseverance and teamwork. Plus, it has some\namazing goals in it!",
    "date": "2024-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "What a wonderful movie, conflict is there and there’s definitely some sad points, they make good points about how some people do need harm reduction measures in order to function, while also pointing out others do not but instead need mental health help. Unfortunately, in real life the NHS wait time for mental health help is very long. The actual story is fascinating and the acting done by the managers of each team is immaculate and emotional. Just because someone looks put together on the outside, does not mean they are on the inside and we all need a helping hand. I love football and this is a story of how sport and a team can help people become more than themselves. Wonderful, watch it!",
    "date": "2024-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Maybe some of the plot was a bit far-fetched but I didn't care. I thoroughly enjoyed it.",
    "date": "2024-09-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Achei que seria apenas um passatempo leve, uma comédia bobinha, mas já estou aqui chorando com menso de 20 minutos de filme, pensando e lamentando os problemas de uma sociedade injusta, aiaiai, (olhos marejados). É baseado na notável história real da Homeless World Cup, torneio de 21 anos une moradores de rua de mais de 80 países… Já tenho meus queridinhos, o time da freira, da África do Sul… Que filme lindo, super delicia de assistir, me emocionei em tantos momentos. Esperançoso e Maravilhoso...",
    "date": "2024-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I agree with the critics; a lot of warmth in this one. I'm a huge Bill Nighy fan; I doubt he's ever made a bad movie. But it's unusual to see him a little less acerbic than his usual self. And it's a rare role in which he doesn't wear a tie (even for a scene or two).\nCould have been a bit shorter and a few developments were fairly predictable but all in all I definitely enjoyed it.",
    "date": "2024-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved this film greatly.",
    "date": "2024-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Though the story is fictional, the Homeless World Cup is a transformative, inspiring, real event, didn't even know it existed. How can you not be moved by the story of the cup and how it has changed the lives of millions of homeless people? Sometimes we need to look past people's situations and see the value of each individual. Loved the movie .",
    "date": "2024-06-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The boring game......",
    "date": "2024-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A bit choppy at times but the message gets through: there is always the possibility of human 'redemption'!",
    "date": "2024-05-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The movie was enjoyable without all the boring special effects so often seen on other movies.  Also absent were guns, weapons and violence.  The story was uplifting.",
    "date": "2024-05-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This movie is beautiful! Not a sports fan, but the plot, actors and fact that this is based on a real organization that has helped 1,000,000 homeless people through a yearly football tournament is phenomenal. Love Bill Nighy. Love this movie. If you want a lift, this is a movie for you",
    "date": "2024-05-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The most pointless plot ever",
    "date": "2024-05-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Really good enjoyable movie. Has made me want to watch the homeless World Cup.",
    "date": "2024-04-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Very interesting and well done inspirational sports movie.\nIt is a dramedy story, which gives you a good feeling after watching it.",
    "date": "2024-04-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The plot and direction look very simple at first, but when we think of the characters, their struggles and idiosyncrasies we can see a beautiful story. It’s not about football, but about human beings and their struggles and interactions. The movie tackles self awareness and the lack of it, jealousy, fear, courage, friendship, hope, amendments, and so on. I also liked very much to learn about this annual football tournament which I had never heard about.",
    "date": "2024-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Well made and enjoyable, but about thirty minutes too long. It would have been easy to tighten it up.",
    "date": "2024-04-10"
  }
]