[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 01 hour, 31 minutes, and 42 seconds!!!!!!!!!!!!!!! Rated R for Violence and Language!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Starring Antonio Banderas!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It is fun, nice, short and entertaining. Great movie!",
    "date": "2024-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Half the cast have been in much better movies, but I felt like watching some dumb action and this delivered.",
    "date": "2024-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "B movie that Ben Kingsley is known for these days. Home alone like action . Ridiculous  but entertaining.",
    "date": "2024-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "If you're looking for a good action movie, this is for you! There's lot of action and lots of violence. Antonio is an amazing actor and was probably the best part about this.\n\nStory wise, it was far too generic and wasn't even done that well. For one, magically all communication, reception, etc gets cut when these guys are around. No real explanation, just \"giggle giggle we can't reach anyone!\"\n\nSecond, I appreciate attempts at humor, but in a way, it felt very forced. Like when the \"head\" security guard is making jokes and being stupid. Granted, I could see a security guard being like that irl, but it was such a boring, overdone cliche.\n\nThird, there's all this gun fire, even explosions, yet no one around seems to notice. What's the excuse for this? \"dis mall is in middle of nowhere!\"? In almost every city where there is a mall, that mall is either in the center of everything, or close enough that there is always traffic/people around.\n\nFourth, so this girl is a witness, yet the Marshals have very basic security for her. Really? And it takes them ages to even find out something is wrong?\n\nAgain, action wise it's a great movie, but the story is meh.",
    "date": "2024-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "An entertaining little action romp; I don’t understand the picky reviews. I enjoyed it and thought it had a good balance overall.",
    "date": "2024-06-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "BORING. Truly and completely BORING. There is not a single  redeemable quality about this movie. Don't waste your time. There is not even a spark of excitement in this movie. It's a paper copy of a paper copy of an older paper copy.",
    "date": "2024-05-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Decent action movie to watch in the background",
    "date": "2024-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Another \"Die Hard\" copy. It's ok, I guess...",
    "date": "2023-12-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "A bland and mediocre action film which could have done with being a lot more fun and over the top.  Slow to start and with a weak premise, the cast of cliché support characters and incompetent mercenaries only stand out due to the lead actors and even then, their performances aren't great.  It's got elements of Die Hard or Home Alone but with twenty-somethings, set in a mall and severely lacking in humour, gore, suspense, or thrilling action scenes.  There's a few good moments towards the end but nothing truly exciting or engaging.",
    "date": "2023-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "No. Don't. Just no. Don't",
    "date": "2023-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Banderas lower and lower. A lot of exaggerated fighting scenes. Weak plot.",
    "date": "2023-03-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Antonio Banderas is one of my favorite actors. His acting is great in this movie. That said, the action scenes in this movie are just average. Overall, the plot, acting, and script are below average. Despite that, it is still entertaining and watchable, only because Banderas is the lead actor. He singlehandedly carries the whole movie.",
    "date": "2023-02-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Honestly its a lot better than I thought it would be.",
    "date": "2022-01-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Awful fight choreography. Bad dialogue. And the camera moves...don't. Banderas under a wasp's nest beard stares downward to the hell he's trapped in. Only Liam McIntyre shines as a security guard introducing Banderas around the mall.",
    "date": "2021-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved this movie bags of action all the way through really recommend this movie.",
    "date": "2021-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I was drawn in to it for sure. Had all of the elements of an action movie that tap in to my emotional brain.",
    "date": "2021-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Explain how Antonio Banderas is so great in this movie without sounding so obvious. This movie even made me a psychic because, within the first 15 mins, I already knew the ending.",
    "date": "2021-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I find it was quite confusing at the beginning; but the ending was good and told the whole story for all the characters to realize What actually happened.  I think I enjoyed the last six or seven minutes more than the entire film.",
    "date": "2021-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Not quite ridiculous enough. The script plot holes are endless and bottomless so why not commit a lot more craziness to the set pieces? And I like Antonio but with his heavy duty accent why force him to endlessly whisper into a pink plastic walkie-talkie? Could have been a hoot rather than a DOA stink bomb...maybe, but probably no way to salvage a mess like this.",
    "date": "2021-02-06"
  }
]