[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This movie was better than I thought it would be. The story lines had decent connectivity. It was a bit implausible how the world was too polluted for the rich but the poor could work and access space flight with relative ease. The \"evil\" rich people had generic motivations against the poor people who just want to get medical care. The fight scenes were good and Matt Damon can make almost any character likable without being too corny.",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Neil Blomkamp brings his signature visual flair and innovative storytelling to Elysium, but the movie's sluggish pace causes the film to lose its momentum.\n\nGrading: C",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie with great action and visuals. Not understanding some of the dislike. Watching in late 2025 it hits to close to home with the trajectory of society",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It has been done and better. See Aleita.",
    "date": "2025-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Found it an engaging and simple enough to understand sci fi film. Nothing complex, just action and good v bad dystopia future at play. Made for a good film. Watched on DVD.",
    "date": "2025-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A visually striking and thematically bold sci-fi film that delivers thrills and ideas, even if it lacks the finesse of Blomkamp’s District 9.",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Tras debutar con District 9, Neill Blomkamp produjo otra interesante obra de ciencia ficción que plantea bastantes cuestiones sobre el futuro de la humanidad. Se ha dicho bastante que con los avances tecnológicos, la vida humana puede mejorar. Pero analizándolo bien, parece que los avances tecnológicos son más bien para beneficiar a aquellos que ocupan un puesto alto en la sociedad. Elysum empieza con algo bastante fuerte y es el extremo al que ha llegado la segregación social. En este futuro las personas de clase alta han dejado La Tierra y se han instalado en una estación espacial repleta de los mejores lujos. La estación Elysium es un paraíso donde todos tienen la mejor vida, la mejor comida, la mejor tecnología y la mejor salud médica. El planeta Tierra está ahora habitado por la gente de clase más baja. Aún existen las fábricas, las escuelas y los hospitales, pero la población terráquea carece de los recursos necesarios para subsistir. Se nota incluso que hay delincuencia, pero está controlada por los robots patrulleros. Todo lo que se muestra en la película habla por sí mismo. El prólogo menciona dos elementos claves presentes en la película que son la sobrepoblación y la contaminación como consecuencia del deterioro de La Tierra. La sobrepoblación es un fenómeno común en las clases bajas dado que los seres humanos tienden a reproducirse por naturaleza como las ratas. Si los individuos son de clase baja, es evidente que no tendrán los recursos necesarios para una prevención. La contaminación siempre ha sido un tema de discusión que con el tiempo ha perdido fuerza y suele ser una de las consecuencias de un sistema que sobreexplota los recursos naturales. Este factor clave como motivo de que los más ricos emigren a Elysium remonta a los visto en Wall-E. La película animada de Pixar daba a entender que la humanidad había abandonado La Tierra por la excesiva contaminación. Lo que Elysium plantea es quienes podrían ser los únicos humanos en dejar La Tierra, dado que el número de los habitantes terrestres es vasto. Lo que Elysium plantea no es una locura si se lo piensa bien y tomando en cuenta como son las personas de clase alta que manejan las empresas, no sería raro que la alta sociedad haga una cosa similar si la existencia entrara en crisis. Este es un futuro donde los únicos dignos de sobrevivir son aquellos que tienen un estatus social alto y el resto es dejado atrás, abandonado a su suerte. Este sería uno de los peores futuros que le puede deparar a la humanidad y tiene muchísima semejanza con la realidad. Lo que nos muestra es también una representación sobre la gruesa barrera entre el primer mundo y el tercero. Elysium sería Estados Unidos y La Tierra sería Latinoamérica. Eso se nota por el uso del español en los diálogos de los personajes terrestres, la situación social en La Tierra es muy similar al de los sectores bajos de los países latinoamericanos y también existen inmigraciones ilegales a Elysium. Esto último es también bastante fuerte porque muestra gente que solo busca ir a un lugar donde pueden obtener acceso a una vida más saludable, pero son envidiados de regreso a La Tierra. En el peor de los casos, Jessica Delacourt recurre a Kruger para que elimine a los inmigrantes a costa de vidas inocentes. Esto es un reflejo de la situación de los inmigrantes que cruzan la frontera de Estados Unidos y algunos pierden la vida por mano de algún individuo armado que dice estar protegiendo al país de invasores ilegales. Elysium invita a reflexionar sobre el nivel de deshumanización que aquellos que están en una mejor posición pueden tener hacia alguien que no está a su altura.  Eso es algo que también se contempla cuando Max es expuesto a la radiación por negligencia laboral y Carlyle nada más se deshace de él. Por medio de Carlyle vemos que la clase alta solamente va a La Tierra porque hay tienen trabajadores que trabajan para sus empresas y no les dan un cierto reconocimiento. Esto es una referencia a la explotación laboral, donde los trabajadores no tienen acceso a un buen salario, un buen cuidado laboral o algún seguro en caso de que haya algún incidente. Nada más son vistos como bestias de carga que se pueden usar y luego desechar. Es en este breve momento donde la película hace referencia a la desigualdad social nada más por la diferencia de clases. Es aquí donde Max se cansa de su estado actual y preocupado por su vida, decide unirse a Spider para infiltrarse ilegalmente a Elysium y salvar su vida. Max se vuelve una fascinante representación del inmigrante que está cansado de su situación y está dispuesto a ingresar a territorio extranjero por su bienestar, aun si tiene que recurrir a lo ilegal. Pero Max no solo se preocupa por sí mismo, después empieza a ver por Frey y su moribunda hija Matilda. Lo que sucede a final es algo que a muchos en un estatus social bajo les gustaría que suceda en la vida real. Que todos sean tratados por igual ante la ley con los mismos derechos y tengan los mismos beneficios que tienen las personas de clase alta. Al final, todos son seres humanos y no tendrían por qué estar divididos en clases sociales. Sin embargo, termina siendo imposible debido a que la estratificación social ha existido desde el nacimiento de la sociedad y los que están en lo más alto prefieren ver por sus propios intereses que por el resto de la humanidad. Lo que Elysium hace es invitar a una reflexión sobre la desigualdad social y a lo que conlleva en los años venideros. Eso hace que sea más que una película hollywoodense con estupendas secuencias de acción y efectos digitales asombrosos. Desde luego es una película muy satisfactoria para aquellos que buscan algo con bastante acción y estimulantes efectos digitales. Su trama es bastante efectiva y tiene personajes muy bien adaptados a lo que la película quiere transmitir. Elysium podría haberse quedado solo en otra película más de acción y ciencia ficción, si no fuera por su mensaje social. Aunque quedo algo olvidada, es otra película de los años 2010 que quedo bastante infravalorada y debe ser revisitada. Elysium es otra gran obra de ciencia ficción con la interrogante de qué pasaría con la sociedad cuando la sobrepoblación o la contaminación lleguen a su punto máximo. Lo más probable sería una división social mucho más extrema donde solo importa sobrevivir según la clase social a la que pertenezcas. Mi calificación final para esta película es un 9/10.",
    "date": "2025-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The movie looks awesome – the Elysium space station is stunning, while Earth is shown as a dirty, ruined wasteland, just like a grim future. The action is top-notch: fights, shootouts, explosions – you won’t get bored. The theme of inequality is interesting too: the rich live in paradise, while the poor suffer on Earth, and the main hero tries to change that.  \nThe plot is a bit too simple, and you can guess most twists early on. The villains are just evil for no real reason, and some moments are predictable. I wish they had explored the world and characters more, but the film rushes through and focuses on action.  \nMatt Damon did a great job – you can see his character is worn out by life but keeps fighting. Jodie Foster plays a cold, power-hungry official, but she doesn’t get enough screen time. Sharlto Copley as the crazy mercenary Kruger overacts, but he’s definitely memorable.  \n\nIn the end I really like the movie despite the shortcomings of the script, so I think the movie deserves a rating of 4/5",
    "date": "2025-05-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Although Elysium may not quite match the excitement level of District 9, it remains an adequately entertaining film. The visuals are stunning, with a stark contrast between the dystopian conditions on Earth and the utopian atmosphere of Elysium. One of the standout elements is Sharlto Copley's unhinged performance, which adds a layer of unpredictability to the story. While it may not be as impactful as its predecessor, Elysium is still a visually impressive and engaging sci-fi thriller.",
    "date": "2025-04-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The visuals in the film are breathtaking, the entire setting and world created are very interesting and the script is well written, but on the other hand the direction fails in the shaky and frenetic action scenes but in the sense that you don't know what's happening, the slow motions work, but we can't say much about the rest.",
    "date": "2025-04-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Elysium stands as 2013's cinematic pinnacle. Neill Blomkamp crafts a seamless narrative, blending high stakes with profound themes. The film's CGI and depiction of futuristic technology are impeccable. Matt Damon delivers an outstanding performance, especially in scenes highlighting the dehumanizing effects of automation. Jodie Foster's portrayal of Secretary Delacourt is compelling, adding depth to the story. The integration of humanity and robotics is masterfully explored, culminating in a profoundly moving conclusion.​",
    "date": "2025-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This is one of the best dystopian-type sci-fi movies I have ever seen. Some of the dialogue between the characters could have been better, but it was not enough for me to dislike the film. I highly recommend it for sci-fi fans!",
    "date": "2025-03-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Elysium is a surprisingly decent movie with a predictable story, but great visual effects and cinematography.\n\nThe writing is flawed. The dialogues sometimes feel unnatural and there are no outstanding ones. The characters are not layered, but still enjoyable. The story is predictable and cliched, but the plot never felt flat.\n\nThe visuals were that surprised me. The cinematography was engaging. There were tons of shaky, hand held closeups and I loved them. There were only a few fight scenes where I was frustrated with the way they shot and edited it, because I couldn't see anything. The visual effects looked unexpectedly great.\n\nElysium is the kind of movie I went in thinking it was bad, but it actually turned out to be a decent movie.",
    "date": "2024-12-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very underrated, Matt and Alice perform rally well and one of my favs about this post tecno apocalipse movie",
    "date": "2024-12-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best scifi movies. Same quality as district 9 this director is one of my favorites.",
    "date": "2024-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Un film imbarazzante, per niente credibile, sia dal punto di vista della sceneggiatura che dal punto di vista della recitazione. Tempo perso, così perso da spingermi a registrarmi su rottentomatoes e scrivere questa recensione.",
    "date": "2024-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This should really be called District 9 - The Bourne Hybrid because that's basically what this is. It's ok all around but has quite a few issues. First off Max is an interesting character but they don't give him any interesting supporting cast. Everyone else is very one dimensional and gets forgotten about for long stretches so there really isn't any investment in anyone for sustained periods. The villians aren't that good especially Foster with the weird accent and honestly her character felt completely pointless in a sense because her & Damon don't even meet once in the film. You could've just had one scene with her killed and that's it. Her whole sideplot of wanting a coup feels unneeded and you could've found a much less complicated way to set up the data McGuffin. Second, and arguably the biggest problem is there is not enough substance and too much action. This is filled in the middle and end especialy with action scenes that are fast edited with shaky cam that feels like I'm watching a Borune movie. There isn't any substance and we really never explore Elysium on a deep level like seeing regular people or the way of life on there for more than a second really and is a huge letdown. It's arguably the most interesting part and really is never explored. What is explored is a earth that is almost an EXACT copy of District 9 so much so that if you told me this was a sequel to it, I'd 100% believe it. And the problem is the Borune style fights, and the district 9 asetics never really meld into anything unique or solid. This can get boring to look at points despite looking pretty cool in the first third. But the shaky cam, fast editing, dull lifeless lighting at points just doesn't work at points. Sometimes the action is cool but it just either drags on or becomes inconsistent to look at. This really is a Action Movie first and a Sci-Fi movie second it feels like. But it follows the core setup of District 9 almost to a tee so much so it's almost impossible not to compare the two and wonder why am I not watching that one instead. This needed to be it's own thing without copying District 9 too much, have more interesting side characters, and have a lot more slow moments to explore the world of Elysium and not the slums. After all Elysium is the main draw here and what sets this apart. Unless your a big Matt Damon fan who is alright here and doesn't have much character development in the second half, I can't recommend this to many. Just watch District 9 instead or a better Sci-Fi action flick like Edge of Tomorrow.",
    "date": "2024-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "When I first saw it, I really did not understand or appreciate what the movie was going for. After watching it again, I think this will go down in history as the most misunderstood and undervalued sci-fi epic since the OG Blade Runner. Blomkamp is a visionary and the production value + story is insanely good once you get on its wavelength. An all-time classic for me.",
    "date": "2024-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Not godawful, but nothing great. District 9 was better, maybe even Chappie. It’s script is cheesy and predictable as if written as a straight to Sci-Fi channel movie (with a Large budget.) It’s a passable watch with decent special effects.",
    "date": "2024-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Finally someone did the unthinkable and cast Matt Damon in a roll that required him to pretend to be fluent in spanish",
    "date": "2024-07-08"
  }
]