[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Well, here's another, \"Why is this getting so much hate?\" movie. No, it's not an Oscar winnder. It's your average popcorn movie. Watch it when you just want to chill or have it on in the background while you work, like I did. I especially liked the Crane Corps. I was going to use that in my next book but after researching, I found out it was an original idea from director Yimou Zhang and the production crew. Oh well. Although I'm not wild about the European saves the day trope, Matt Damon's character was well acted, which is no surprise. And I'll be looking up more movies by the director and actress Jing Tian.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very entertaining and worth the time to watch.  Crazy story and good CGI.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This is a cool action film about good vs evil and the consequences of greed and I throughly enjoyed it.",
    "date": "2025-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "What a waste of talent and money. Maybe a tax scam for the studio.",
    "date": "2025-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Una película que hace todo el intento por sorprender, pero se queda corta debido a ciertas ejecuciones. Tenía potencial pero se desperdició en el camino.\n\n\"The Great Wall\" es una entrega basada en la fantasía, la ficción y un poco de drama forzado, pero que tiene algunos puntos rescatables a pesar de las diferentes barreras negativas presentes en su recorrido. Es una película que puede tener diversos criterios según la expectativa del consumidor, todo ello radica porque es de esas cintas controversiales que fomentan la frase de \"desconectar el cerebro\".\n\nLa película que te lleva por un recorrido donde te cambia el panorama en cuestiones de segundos, agregando ficción en una trama que intenta ser creativa para impactar al espectador, sin embargo, es aquí donde recae en lo convencional, forzado y poco creíble, estableciendo así un círculo vicioso de una cinta palomera con detalles muy cuestionables. No obstante, te puede regalar momentos entretenidos e imágenes que pueden resultarte llamativas, siempre que seas fanático de la aventura o fantasía. \n\nDentro de sus puntos positivos, puedo mencionar muchos de los enfoques del director Zhang Yimou, donde hace juego con la cámara y te aporta pequeñas secuencias sin establecer un corte, esos pocos segundos son entretenidos y para una producción como esta, cumplen. Aunado a ello, el cómo trata de enfatizar los entornos, las localidades, y esos detalles que pueden sumar a la experiencia. \n\nPor otro lado, se debe rescatar el uso de los efectos especiales, que tienen buen desempeño aunque tenga sus ligeras recaídas en escenas donde se encuentran saturadas de tantos elementos o principalmente en el contacto directo con humanos. No creo que sean excelentes, pero sí están decentes a pesar de su sencillez. Es un apartado clave para esta película por su premisa y forma de contar una historia con mucha ficción por delante. También se puede sumar el aspecto de la fotografía, el vestuario o el montaje, los cuales están allí, no sorprenden, pero tiene una pequeña relevancia dentro de muchas escenas claves. \n\nAhora bien, \"The Great Wall\" posee aspectos cinematográficos que disminuyen su potencial inicial, empezando por su guion, el cual agrega giros de tramas innecesarios, sin dejar de recordar la falta de profundidad o desarrollo en sus personajes, los cuales te pueden parecer muy mediocres, sin objetivos sustentables o con argumentos tan pírricos que no te lo puedes creer. Por otra parte la musicalización, el sonido, los errores de continuidad, los agujeros de guion, los momentos convencionales, el maquillaje, una parte del CGI y el desperdicio del reparto es cuestionable, debatible y muy mediocre. Son esos apartados que le restan considerablemente la calidad a toda la película. \n\nLo de Matt Damon, Willem Dafoe y Pedro Pascal es controversial, aunque puede ser entendible debido al mismo guion que tienen sus personajes. Sin embargo, la falta de conexión, las expresiones, el desenvolvimiento, y la carencia de su alto nivel actoral brillan por su ausencia. La película tiene un desperdicio total en cuanto a este punto, incluso cuando estos actores deberían elevar a la misma por si solos, pero el resultado ya fue evidente. Creo que Jing Tian está mejor que ellos o si vamos por personajes secundarios, Lu Han es el mejor de todos. Simple. Es el personaje con mejor desarrollo de la cinta y ya eso deja mucho de qué hablar. \n\nEn otro sentido, la película abarca temas reflexivos como la unidad, el trabajo en equipo, la confianza, el respeto, la redención, el legado, el liderazgo, el sacrificio, el beneficio propio, el engaño, los ideales personales, la doble moralidad, y la supervivencia. También se establece una metáfora en referencia a la muralla, significando el sentido de pertenencia de la nación china, donde la unión, la disciplina, el legado, la justicia, y la voluntad del pueblo están presentes ante los enemigos, y reflejando que sus tradiciones son una característica fundamental. \n\n\"The Great Wall\" no es una mala película en su totalidad. Es una entrega palomera para pasar el rato, y tampoco fue hecha para revolucionar el cine, aunque tenga gran presupuesto pienso que no era su objetivo principal. Tiene sus incongruencias, pero dependiendo del público está bien de forma sencilla. Sin duda alguna pudo ser mejor, pero sus ejecuciones en el camino disminuyeron ese potencial y afectaron su resultado final. A pesar de ello, la apruebo en lo justo por detalles cinematográficos que no están del todo mal.",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is extremely over hated, its full of action and thrilling moments and has amazing production value. Many reviews say it doesn't make sense however the plot and development are perfectly cohesive.",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "what in the world is going on in this movie!?",
    "date": "2025-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1 hour and 44 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated PG-13 for Fantasy Action Violence!!!!!!!!!!!! In Mandarin and American English audio versions with American English subtitles!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $45,100,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A valiant effort I supposed but it just doesn’t land for me.  Everything just feels a little too forced and inauthentic for it to come off as believable.  It’s a shiny new toy that came without batteries or a coherent instruction manual!",
    "date": "2025-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Movie didn't stand out to me, But the leading lady and leading man didn't kiss in the end. Couldn't be happier.",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great movie and awesome visual effects!",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Underrated and entertaining.",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "2nd worst movie I’ve ever seen",
    "date": "2025-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It’s a really entertaining movie for a Friday night — don’t listen to the posh critics. Sure, the script isn’t Oscar-worthy, but you get exactly what you expect: a fun, PG-13 ride with Matt Damon. Perfect if you just want to lay back, relax, and enjoy a bucket of buttery popcorn while watching thousand of Chinese Shi warriors kick ass…",
    "date": "2025-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not a bad movie, but as pedestrian as they come in regards to plot and script. \nThe world and visuals were cool though",
    "date": "2025-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I enjoyed this movie, I thought it should have better reviews.  I knew nothing about it before watching and having no preconceived ideas probably helped.\n\nI liked the premises that the Great Wall was built to keep the Monsters out - why else?",
    "date": "2025-06-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Filme facilmente esquecível, porém tem cenas que salva",
    "date": "2025-05-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The Action was Awesome but the story and the dialogues were really Corny. Watched it yesterday with my wife we enjoyed the action.",
    "date": "2025-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This is a movie I could sit nd watch with my parents, in-laws, children, co-workers, and neighbors.  \n\nThe great Wall takes me back to a time before the viewing public became jaded by personal idiosyncrasy and quibble.  A time when a story could be presented for the purpose of telling an entertaining story. Its story is one of the struggle to balance good from bad, right from wrong, good vanquishing bad.\n\nThe only thing The Great Wall is missing is maybe another 30 minutes in runtime.  Certain sections could have taken a little longer to unfold. Will keep a look out for a directors cut version.\n\nThere is nothing wrong with this movie. The visual imagery presented was outstanding.",
    "date": "2024-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "No idea why these types of movies get such bad reviews. I thought this was brilliant. Somthing completely different to what we're used to.  A nice mix of action and dramas with good casting and writing with a fantasy feel. This was great fun.",
    "date": "2024-12-23"
  }
]