[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Least interesting zombie movie I’ve seen.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Fabulous ensemble of talent, but noticeable unidimensional character development and absent a plot. I felt an uneasy anticipation of a story to unfold throughout the whole movie. Its borderline worth watching for Tilda Swinton as an Scottish Undertaker Ninja. Awesome.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I wish I could un-watch this movie. It was beyond horrible from the acting to the plot that doesn’t make sense. They have a bunch of celebrities in here for a wow value? Weird and didn’t contribute to the storyline. Zombies didn’t appear until about an hour in and even then it was idiotic. I would give 0 stars if I could",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is such a quirky fun filled take on the Zombie genre. Loads of fun, things that don't make sense, excitement, and lots of laughs! Bring your sense of humor and enjoy the ride!! I loved it!",
    "date": "2025-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I have never written a review on anything before but I made an account just to say this was the worst movie ive ever watched in my entire life. I absolutely cannot recommend it. Dry, unfunny, boring I just wasted my night off on this horrible movie. Plot had so much potential too. Do not waste your time.",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Uhhh not really sure why this is rated so low...this is one of my favorites for Halloween! 🎃",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Something isn't right in the small town of Centerville.  And it's not just the zombies...\n\nFeatures Jim Jarmusch's dry humor as well as a stacked cast including Bill Murray, Adam Driver, Tilda Swinton, and others.   The pacing is slow but that's intentional.  There will be things that make you say, \"huh?\" but they will be answered by film's end.  Also some subtle Easter eggs.   I'm fairly sure Driver channels Christopher Walken in one scene.  Not a horror film for those looking for only that.",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I can't begin to acknowledge how bad that was. If that's what a absurdist film is, mannnnnnnnnnnn that's bad. I thought high school students made this. Bill Murray didn't seem like he gave a damn about this. The writing was atrocious. And I swear the actors were reading cue cards instead of actually studying a script. At least \"The Dead Don't Die\" song was catchy.",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "So much fun! Hilarious",
    "date": "2025-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "An absolutely amazing film, continuing in the grand tradition of George Romero. It has an all-star cast, in-depth and stunningly insightful dialogue, scorching political and social commentary, edge of your seat story line, and an astounding musical score.  I wept, laughed, and hugged my family throughout. Bravo, Jim Jarmusch. Bravo.",
    "date": "2025-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Complete garbage. So boring and stupid. Not funny or interesting at all. Fell asleep. Ended up ejecting the disc from my Blu-ray player and tossing it into the trash.",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This was a really dry movie... I don't mind the dry and deadpan exchanges between pretty much all the cast, that can be fun. But you know it's going to be the best when the opening joke is pointing out that they are aware it's a movie...\n\nI think it could have been good if it had ever picked up any kind of momentum, not Resident Evil \"kill-everything-you-see\", but something... But regardless of how bad things got, it just didn't pick up any speed.\n\nIt didn't have a lot of anything going on, a lot of started ideas, but nothing that got followed through... It was just easier to kill of all plot hooks.\n\nIt was fun to see Steve Buscemi in a (not-)MAGA hat though",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Acting was okay, plot had no direction. Understandably satire but could have just went without watching. Again, only positive was the big names.",
    "date": "2025-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Not the worst movie out there. Adam and Bill are quite amusing. Tilda Swinton with a weird unnecesary accent, weird acting. Extremly weak Zombies win at the end? Because of human craziness in tech? Ok. Aliens? In one scenentgey keep talking in the talk, in the next scene they are surrounded bs zombies and cant flee? In one scene they kill zombies with no problems, than they loose just like that? No it is bad. It could be a good one, but this is really really bad directed and the cuts are aweful. Shame. I really wanted to like it. I mean c'mon. Adam Driver (a wonderful actor) and bill (fing) murray..... Damn.",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This movie was shockingly boring. I didn't even end up finishing because I was an hour in and still nothing barely happened. I rate it 1 star and a half because of Adam Driver. Don't recommend watching this movie",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I'm sure the director is making some grand statement with this film. I just wish it had made it to the screen. The social commentary hits with all the subtlety of a sledgehammer, and the satire has about as much bite as a toothless zombie. Thankfully, the cast manages to wring a few laughs out of the material they were handed.",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Really really bad. Tried to do something different with this movie but it didn’t work. Huge waste of time",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "If you didn’t find this satire funny, you’re probably one of the zombies in the film.\nNo, you are not Driver’s character—who breaks the fourth wall with omniscient, deadpan wit.\nNot Murray’s principled sheriff—trying to make sense of it all as the world crumbles around him.\nIf this film didn’t land with you, even a little, you’re closer to Iggy Pop’s coffee-craving zombie—wandering through diners in search of your next dopamine hit.\n\nYou don’t get it. That’s the point. You're what this is about.",
    "date": "2025-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Great cast. Wasted potential.",
    "date": "2025-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Don't waste your time watching it. There's nothing really interesting. Or funny. Sometimes there's a glimpse of an analogy about our modern society, but even that idea is poorly explored. The original \"Night of the Living Dead\", from what I remember, was better.",
    "date": "2025-07-06"
  }
]