[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This movie is so depressing I felt like I needed a hug, a drink, and maybe a therapist by the halfway mark. By the end, I was cheering for the credits like they were the hero.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Barely could pay attention to it and honestly I probably like the book better. But I kept falling asleep so if you do need a movie to fall asleep to then this is the one.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Uncomfortable to watch.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's not a perfect film and I think it steals a lot from Good Time but there's a lot here especially if you've been to these neighborhoods in Portland. Worth seeing for sure and it should have better reviews.",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Vanessa delivers an excellent performance ..The movie is catchy intense sad and enjoyable overall.",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Whole movie contains chasing sudpense and action. Nice story, awesome acting   i like the movie",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Found this movie an Adventure that kept giving and can put you in the drivers seat with the main character’s frustrating twists and turns on her adventure to do what it takes to get what you need no matter how deep the trouble becomes.\nShe learnt to stand up for herself and get the shitty tasks done. Love this 4 stars and great fighting fun along the way. Worth the watch",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Performances overcome script potholes enough to make this watchable.  Another script edit, particularly last act, would have boosted the film significantly - potential wasted.",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "How does a whole production crew get together and not realize you can’t use unverified cash as a down payment on a mortgage?",
    "date": "2025-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Kirby plays desperate Lynette who is trying to gather $25k in order to save her home. Her brother has downs and her mom is Jennifer Jason Leigh (who is insufferable).",
    "date": "2025-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Vanessa Kirby is striking. She always is. To see her in such a desperate role, and that she does it so well, is incredible. Se plays such strong, feminine roles, like in Mission Impossible, where she is so empowered. She is a disempowered character here, but still so intense and strong. \n\nIf I had a sister as stupid as the role Jennifer Jason Leigh plays, I would have shot her. These stupid, mindless, entitled people. \n\nI would not normally watch a movie ir like this, but Vanessa Kirby actors the whole movie. Incredible, tight, acting. So impressive. She always amazes me.",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Not sure why the reviews aren't great. I liked it. If you don't like gritty movies, this isn't for you",
    "date": "2025-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Anchored by Vanessa Kirby’s raw, magnetic performance, Night Always Comes is a tense, atmospheric plunge into Portland’s underbelly. While its script stumbles with thin character logic and underdeveloped themes, the film sustains a gripping urgency through stark visuals and relentless pacing. It may not fully land its emotional punches, but Kirby ensures it remains a bleak, memorable ride.",
    "date": "2025-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A thill ride fom start to finish and Vanessa Kirby is brilliant",
    "date": "2025-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Filme: A Noite Sempre Chega\t\t\t\tAssistido: 1-9-25\nElenco: @vanessa_kirby @therealzackg @juliafox @tdotsteph @thejenniferjasonleigh @realeliroth @randallparkmovie @realmichaelkelly \nModelo: #suspense #drama\nDuração: 1h 48m \tAno: 2025\nMinha opinião: Vanessa Kirby é um nome que esta em grandes produções de Hollywood, Missão Impossível, John Wick, Velozes e Furiosos,...... E aqui esta como a protagonista, como sempre estamos acostumados em filmes de ação, aqui achei meio estranho, em um drama. Em que ela faz várias loucuras pelo irmão, pela mãe e pela casa, que esta prestes a perder se não levantar o dinheiro. E para isso ela é capaz de fazer de tudo, prostituir, roubar um carro, roubar da sua amiga o cofre do amante, enganar, mentir e colocar a vida do seu irmão em risco de vida. Para no final perceber que por tudo que ela lutou, não valeu de nada, pois não era o mesmo proposito de sua mãe e de seu irmão, que pensou em leva-lo, por causa da mãe. MAs descobre que ela é irmã e quem é a mãe? É a mãe e não ela, que estava querendo assumir este lugar. E que seu irmão tem esta consciência, mesmo tendo down. No final não consegue comprar a casa, seu irmão fica com a mãe que vai viver sua vida, simples assim, e ela esta livre. E mãe deu todos os sinais, quando comprou seu carro novo e foi embora com seu filho.\nVale apena assistir? Você ficou curioso? Então assista.\nNota: 5",
    "date": "2025-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Kirby is a delight to watch. She is the queen of hollywood now.",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Kirby is superb but the movie does not rise to the occasion.",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "If you grew up blue collar or lower class, this film will be tedious, insipid, and full of the cliches you've probably spent your life trying to escape - provided you have a remote iota of self-awareness, which none of the characters in this film possess. \n\nOne stupid choice after another, with moral fables in between. \n\nOn the other hand, if you come from money this could be a \"fascinating look at the life of the downtrodden...blah blah blah\" - insert my massively sarcastic eye roll here. \n\nThe characters are grating at the start, idiotic throughout, and finally so reprehensible they may make one grateful for estranged family and friends.",
    "date": "2025-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It took itself wayyyy too seriously without any substance to back it up. It's just this woman going to different people and proving to herself she's had a hard life. The film really wants to matter but it just doesn't. It wanted to be Good Time but it's just not at that level.",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "'Night Always Comes' delivered a good flick. I do tend to like these gritty crime dramas, so I'm pleased to say that I can list this one in that bracket. Vanessa Kirby comes in with a strong performance, I'm happy to belatedly see her act as the front and centre of a film.\n\nThere is plenty of action across the 108mins, atmospherically the movie is spot on. It can get quite frustrating but seemingly by design, Doreen is particuarly infuriating - gaslighter of the century, that one! Bar Kirby, this also minimally has Randall Park, Julia Fox, Michael Kelly and Eli Roth.\n\nI will say some of the dialogue didn't quite do it for me, mainly for Kirby in fact. It just felt unnatural/ill-fitting to me here and there, but in fairness Kirby's acting prowess and the dramatic events are sturdy enough that I quickly forgot any issues I had with that. Worth noting, still.",
    "date": "2025-09-08"
  }
]