[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fantastic! Really enjoyed it. Shailenne Woodley is excellent.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I couldn't get past the terrible CGI in the opening scenes.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The movie aims to be a gripping thriller but ends up dull and predictable. The plot drags, the story feels silly at times, and the characters lack depth. Instead of suspense, it delivers boredom and disappointment.",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it! Great story with great acting. I also loved the setting. It was a great vibe.",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great thriller! Don’t know how I missed this in 2023.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best movies my husband and I have seen in a long time. Shailene was fantastic! It was excellent!",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Shailene Woodley is captivating and precise in this gritty search for a mass shooter.\n\nArgentine director Damián Szifron’s crime mystery thriller To Catch a Killer (2023) is very enthralling. Szifron’s direction is quite stylish and serious. There’s a creepy atmosphere as mass shootings happen, the police gather evidence, and then the FBI seek out the killer. I kept trying to guess who the killer was and how they’d figure him out. It’s cool that Shailene Woodley got a producer credit here. She’s absolutely fantastic and enthralling as the young detective, hopeful to get into the FBI.\n\nWriters Jonathan Wakeham and Damián Szifron do a great job of building suspense, creating chaotic shootings, crafting complex characters for both the police and the suspect, and providing tons of grim details. I was very impressed with how much detail there was to how police and detectives talk, agencies co-operate and impede investigations, and how the authorities attempt to narrow down their search. It’s a very cool, realistic, and brutal movie with a clear vision. The acting is actually the standout with excellent performances from Shailene Woodley, Ben Mendelsohn, and Ralph Ineson.\n\nShailene Woodley is striking and compelling as beat cop Eleanor Falco, who has keen senses of observation. Woodley feels mature, serious, and concerned as the clever cop, who figures out the mass shooter by his psyche and clues. To Catch a Killer is some of Woodley’s finest acting up there with The Fault in Our Stars, Big Little Lies, and The Descendents. She should lean into these great dramatic roles instead of her usual supporting roles.\n\nBen Mendelsohn is brilliant as the stern and guiding hand of the FBI lead agent Geoffrey Lammark. He’s very coldhearted and clinical, but also manages to warm up to Woodley. Mendelsohn is very precise and detail oriented like Woodley’s performance for real conversations and investigative tactics. Jovan Adepo is very good too as the other agent Jack Mackenzie.\n\nRalph Ineson is horrifying and poignant as the sorrowful mass shooter Dean Possey. He’s very chilling, but you also understand why this guy’s mindset fell so hard and how he became disillusioned with reality. Rosemary Dunsmore is unsettling as Mrs. Posse.\n\nEditor Damián Szifron’s slow cuts and cinematographer Javier Julia’s sleek visuals make for a crime thriller that lets the mystery gain tension. The lighting by Bruno Ferland and Andrei Cirnat looks sinister and stylish. I like the worn sets by production designer Jason Kisvarday. Composer Carter Burwell’s score is full of menace, isolation, and anticipation. He knows how to write scary music that is still subtle. Félix Larivière and Mathieu Latour’s hairstyling for Shailene Woodley looks super cute.\n\nIn all, To Catch a Killer is unnerving and well crafted. We’re given standout lead acting from actress Shailene Woodley and supporting players Ben Mendelsohn and Ralph Ineson.",
    "date": "2025-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Confusing movie with many loopholes.",
    "date": "2025-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "To Catch a Killer introduces the theme that anyone can be pushed to the limits of mental breakdown. Unfortunately it fails to deliver on this promise, with an unrelatable antagonist, and a hero whose afflictions aren't properly explored. Worth a watch, just don't expect another Silence of the Lambs type of flick.",
    "date": "2025-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It was a pretty good movie, not great. Absolutely nothing that we haven't seen before, over and over again.\nThe acting is pretty solid, but the script is pretty terrible.\nPlus, whoever advised the director on operation tactics was pretty clueless. That and the ending could have so much better.",
    "date": "2025-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "turn it AWF😍\nthere is absolutely nothing  “thrilling” about it. \none of the worst movie I have ever watched for sure. \nridiculously messy and not the good kind. it’s awful. yall wanna talk about how she bit him?! WHAT WAS THAT. the dumbest thing I have ever seen.",
    "date": "2025-04-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This was a really good psychological thriller about a mass murderer being chased by a female cop with issues of her own.",
    "date": "2025-04-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Good actors, a good story, but a sloppy screenplay and characters that just skim the surface.",
    "date": "2025-04-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The story is great but some of the characters weren't. The chief agent in charge was annoying and whiny at times. I would've preferred woodleys character be solo in this case. Tim Treakle",
    "date": "2025-03-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's a good production, lots of small details, and there are exciting scenes. The plot, the actors, emotionally touching, the overall atmosphere of the film; it turned out to be a good drama",
    "date": "2025-03-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is truly one of the worst movies I’ve seen in a long time. The acting isn’t bad - the actors are good. The script and story are god awful. Ruined the movie. I knew within 10 minutes and watched the rest as a joke.",
    "date": "2025-03-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I'm very surprised at the low rating for this movie. I guess this is a very niche type of movie, not everyone's gonna love it. What I found most interesting is it it's almost like a documentary in sense that it's very Realistic. The movie  makes you think\nHow does the killer think? What is there true motive? The movie showcase corrupted power Dynamic/ The incompetence of people. I mean, if you like things like Hannibal or criminal minds I think you might like it though it's less intense Then Hannibal Still an amazing movie if you like problem-solving Or thinking about Society issues it's a good watch.",
    "date": "2025-03-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I thoroughly enjoyed this movie it had lots of twists and turns.",
    "date": "2025-03-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "An okay movie that seemed it could have been so much more. Worth watching though if you are looking for something to watch. Will keep your attention.",
    "date": "2025-03-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I really liked it. It wasn't edge of your seat thrilling but it did keep me interested from start to finish. \nI think the ending was the best part. \nIt's worth the watch when youre on a solo movie binge.\nBut not something worthy of a movie night with friends or your partner.",
    "date": "2025-03-13"
  }
]