[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "What surprised me was just how touching this was.",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Viewers might be wanting more after it’s over, but this documentary is nevertheless entertaining.",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Another solid musical biopic. This one about Wham! It doesn’t bother dwelling on what came after and just celebrates the unlikely story of two childhood friends conquering the pop world. I actually never knew they were this globally successful.",
    "date": "2025-04-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "If you were a child of the 80s and ever wondered what happened to Wham! - this is a great docu. Fairly represented in the words of George and Andrew, it's a good drop into the pop world.",
    "date": "2024-06-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Genuinely lovely and heartwarming.",
    "date": "2024-04-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The best documentary I've ever seen! It kept me very entertained and interested. It's so good it makes me want to see it again!",
    "date": "2024-02-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "O documentário conta a trajetória do duo pop dos anos 80, o Wham!, desde o início da amizade na infância entre George Michael e Andrew Ridgeley até o show final e dissolução do grupo, com a carreira solo de Michael. Um ponto importante desse documentário que o tema mais importante é a amizade entre George e Andrew. Como cada um se beneficiou dela e como isso mudou com o transcorrer dos anos. Se na infância, era Andrew que movia a dupla, por George ser mais tímido, com a criação do grupo e o desenvolvimento de Michael como cantor, compositor e ídolo pop, Andrew acabou por se tornar secundário. E é interessante escutar os depoimentos de Andrew ser a testemunha principal da evolução do seu amigo, ao mesmo tempo que via os demônios internos dele o consumindo, por causa da sua orientação sexual, do ego dele querer ser visto como um artista e não apenas um ídolo teen. E isso nos leva a pensar a falta que fez a Michael do apoio que ele tinha com Andrew. Não é somente um filme sobre um grupo pop de sucesso dos anos 80, mas principalmente de uma amizade e do nascimento de um artista com talento reconhecido, famoso, mas consumido por questões internas.",
    "date": "2024-02-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Though a child of the 80s, Wham! was never my thing. I knew a couple of their songs, but other than that, I was clueless about their early years and the formation of the group. And, to be quite frank, my knowledge is not necessarily that much greater after watching this documentary. If Wikipedia ever started its own movie studio, this is the kind of film that might be produced. It hits the bullet points, but never goes much deeper. It's also simultaneously refreshing but somewhat anticlimactic that there were no huge dramas behind the scenes, other than Michael struggling how to address his sexuality. If the filmmakers are accurate, they remained good friends throughout the relatively short span of the group, even at its demise. I can't say there's a lot here that warrants a feature-length documentary, but I was quite entertained and came away with a new appreciation of their music. I even wouldn't mind a follow-up talking about Michael's and Ridgeley's lives after the end of their collaboration.",
    "date": "2024-01-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I never realized how well the other guy stepped away with such grace. In the end it was a pretty good story about friendship.",
    "date": "2023-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "if you are from that time period and you lived through the hype then this is a must watch, if your parents where from that time, then this is a must watch so you can understand why your parents are who they are today if it wasn't for pop formations like WHAM :)",
    "date": "2023-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I really enjoyed seeing this documentary-style film about these two amazing young men. Thanks to Andrew Ridgeley's mother making scrapbooks of their path to stardom, we are treated to an accurate relaying of those early years.\n\nWhat an amazing friend Andrew was to George!  He was willing to be supportive right up until G Michael wanted to go solo.  It explains that there had to be a break; that it would have been impossible to pursue a solo career while keeping close to Andrew.\n\nIt was great hearing all the old favourites again.  Such a surprise to see it fresh on Netflix.  7/10",
    "date": "2023-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Refreshing documentary that captures the protective and honest friendship btw Andrew and George. Funny and endearing, loved it",
    "date": "2023-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This doc follows the proven Netflix recipe. It is very easy to watch, and there is never a moment that drags or is unpleasant to watch. It lacks however an interesting story and the narrating style is a bit jumpy. It was unfortunate that Wham! does not delve in deeper in themes about homosexuality.",
    "date": "2023-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Nice historical perspective on the guys. Lots I didn't know until I watched. They were far more successful overseas, before the US knew them, than I realized.",
    "date": "2023-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I REALLY LIKE THIS THANK YOU",
    "date": "2023-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was so educational to see how they started. Most of the documentaries that I have watched don't show andrew as the contributor and awesome friend that he was.",
    "date": "2023-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Adapting a cute scrapbook approach to chronicle the 4 year period in which two great childhood friends become one of the biggest band on the planet, Netflix's documentary Wham! won't tell you much you don't already know if, like me, you've grown up with them in the 80s, but it's still enjoyable strolling down memory lane with them bad boys. Fun and frothy but occasionally, and unexpectedly, insightful when the film addresses their struggle with fame, record companies and of course, George's sexuality, this is a bittersweet film with a lightness in touch that can sometimes feel a bit too polite. Though the manner, not to mention the incredible efforts, director Chris Smith has put in to stitch pieces of audio interviews and archives together to make it sounds like George and Andrew are actually commentating along the visuals, is truly impressive. The end point is abrupt but understandable and I think a sequel might be warranted.",
    "date": "2023-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One word.. BRAVO!  It was so nice to see their friendship from beginning to the end.  My respect grew for Andrew.  RIP George, you are missed.",
    "date": "2023-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I was a young lad when Wham went global and I thought I knew their story. I was wrong.",
    "date": "2023-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Wham! the documentary is made for Wham! fans and people unfamiliar with the great duo. There is a ton to learn about the friendship of George Michael and Andrew Ridgeley. The two became fast friends for life and the backstory is wonderful. So many hits in four years and this doc is trippy! Spliced with audio from interviews with Ridgeley and archived audio from Michael there aren't a lot of talking except for Michael's father. So 80's and entertaining as hell! Final Score: 8.7/10",
    "date": "2023-07-16"
  }
]