[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A big letdown, too slow, parts that were not explained...",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I usually really like mysteries and murder mysteries and Malik and Denzel Washington. But this was the most pathetic and a waste of time movie I have seen in this genre. This movie is so poorly written, the dialogue, the premise, etc., an absolute waste of time! Stupid. The premise and the storyline they’re both so convoluted and unbelievable. So difficult to follow. Don’t watch this and waste your time!",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Filme:\tOs Pequenos Vestígios\t\t\tAssistido: 16-11-25\nElenco: @denzelwashington.official @ramiimalek @jaredleto @nataliemoralesloves @oliviasarafina \nModelo: #policial #drama\nDuração: 2h 8m\tAno: 2021\nMinha opinião: Um filme ao estilo de Denzel e aqui ainda temos Malek e Leto. Nesta estória para descobrir um serial killer de mulheres. Denzel um ex-detetive que agora trabalha no interior como policial. Vai até a capital e lá se depara com Malek investigando uma série de crimes e acabam formando uma dupla para descobrir, pois este mesmo serial pode ser o de 5 anos atrás que Denzel estava investigando. E o suspeito é Leto, porém ele é perspicaz e não deixa vestígio. Mesmo tentando descobrir de toda a verdade. Leto acaba levando Malek até um terreno baldio, e Malek acaba matando Leto, sem saber se realmente ele é o serial killer. Nisso Denzel ajuda a encobrir as pistas e manda para Malek uma falsa evidência de que LEto era o assassino. Assim o filme termina. Lembrando que a 5 anos atrás Denzel havia matado uma inocente por engano e por isso ele deixou a corporação e tudo foi encoberto também.\nVale apena assistir?: Um mediano para este artistas. Uma pena.\nNota: 5",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Loved the music, had a feeling it was from someone I had heard before (Thomas Newman).\n\nI was waiting for more climactic moments that never happened, but definitely enjoyed the suspense of waiting for one. Was a bit let down with Denzel’s performance, but loved Rami’s.",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The Little Things that stay with you.  The emotional depth and solid story telling linger long after the credits roll.  Smart dialogue and amazing cast of characters give this crime story enough weight to sustain its somber subject matter.  Its the pacing, the feeling of guilt, the pain of loss, the little things that reveal themselves and expose both characteristics of strength and weakness.  The acting, in my opinion is near perfect.  I thoroughly enjoyed this movie.",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Pretty horrible. Hard to imagine that being the case considering the cast.  It's lacking a whole lot.",
    "date": "2025-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The plot is implausible and the ending absurd.",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Has the right acting talent and some amount of suspense but overall falls flat and lacks any good twists or turns. Easy to forget movie",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Very slow movie, waste of time. No clear ending and extremely confusing. I would rather watch paint dry",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Entertaining and a bit of a brain scratcher with solid performances. Trailer showed way too much surprisingly.",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A smartly done game of cat and mouse.",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A slow burn but easy to watch story with great performances. Jared Leto in particular was amazing as the weirdo suspect. Didn't like the ending however. Too many questions and leaves you feeling underwhelmed.",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "How is this movie not rated higher? Excellent all round.",
    "date": "2025-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Different, but worth a watch.",
    "date": "2025-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I really enjoyed the extraordinary story line, the police from Deke's past who obviously despise him....for what you don't really know, but it comes out. And although most people seem to want a storybook ending where the good guys \"catch\" the bad guy and bring him to justice, it was written more in depth, focusing on the bond and mutual psychosis of Deke and Jimmy....with Deke sending the red barrette to Jimmy so that he wouldn't suffer like \"he\" continues to do. The unanswered little things seem just as important as the little things that led them to Sparma who I believe WAS the guy. Although the red barrette wasn't in Sparma's \"souvenir hiding spot\" in his apartment floor, there was a red rabbits foot and red watch that suggested fairly conclusively that it was him. Also the \"Mile Marker 467\" non-coincidence. I think the unanswered things perhaps left an opening for a sequel....but I've read there isn't one in the making.",
    "date": "2025-03-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Solid and mesmerising performances by Denzil, Malik and Leto , makes this an enthralling film",
    "date": "2025-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Slow burn, strong cast. I just felt that the characters lacked depth and that the ending was a total mess.",
    "date": "2025-01-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Pequeños detalles, dirigida por John Lee Hancock, busca ser un thriller psicológico al estilo de los clásicos de los años 90, pero no alcanza a estar a la altura de las expectativas. La película cuenta con un trío de grandes estrellas: Denzel Washington, Rami Malek y Jared Leto. Aunque sus actuaciones son lo mejor de la película, el guion y la narrativa no consiguen ofrecer una experiencia memorable ni el impacto necesario en un género que ha dado grandes obras maestras.\n\nLa historia gira en torno a un caso criminal que persigue a un detective veterano mientras colabora con un joven policía. La ambientación, oscura y melancólica, intenta crear un clima opresivo que acompañe la investigación, pero la trama se desarrolla de manera demasiado predecible y termina diluyéndose en un sinfín de clichés. La idea inicial es intrigante, pero a medida que avanza, pierde fuerza y no logra sorprender. Hancock trata de construir una narrativa que explora los dilemas morales de los personajes, pero el ritmo lento y la falta de giros inesperados afectan el interés del espectador.\n\nDenzel Washington es el gran atractivo del filme. Su presencia en pantalla sigue siendo magnética, y aporta a su personaje la humanidad y profundidad emocional necesarias. Sin embargo, su actuación no está respaldada por un guion que aproveche plenamente su talento. Washington hace lo mejor que puede con el material que tiene, pero el personaje carece de un desarrollo sólido que lo haga realmente memorable. Rami Malek, por su parte, interpreta a un joven detective cuya ambición lo lleva a involucrarse en la investigación. Aunque Malek es un actor con una gran capacidad para transmitir emociones, su personaje no tiene suficiente peso dramático ni evolución a lo largo de la historia.\n\nLa interpretación más destacada es la de Jared Leto, quien da vida a un sospechoso enigmático y perturbador. Leto logra crear un personaje inquietante que genera incomodidad en cada escena, aportando un toque de misterio y tensión a la trama. Sin embargo, su actuación, aunque efectiva, a veces roza la exageración y no siempre encaja bien con el tono general de la película.\n\nUno de los principales problemas de Pequeños detalles es su falta de originalidad. Muchas de las situaciones que plantea ya se han visto antes en thrillers mucho más logrados. La película parece una mezcla de elementos de Seven y Zodiac, pero sin la profundidad ni la intensidad de estas. Las comparaciones son inevitables, y Hancock no logra aportar nada nuevo ni innovador al género. El resultado es un filme que se siente como un ejercicio de nostalgia por el cine de los 90, pero sin la chispa ni la audacia necesarias para destacar.\n\nEl guion de Hancock intenta equilibrar el suspense con la exploración psicológica de los personajes, pero el ritmo desigual y la falta de tensión constante hacen que la película se sienta más larga de lo que realmente es. Aunque hay algunos momentos de tensión bien logrados, la narrativa se pierde en tramos tediosos que no aportan mucho a la trama principal. La construcción de la historia no consigue mantener el interés del espectador, y el desenlace, lejos de ser impactante, resulta anticlimático.\n\nLa dirección de Hancock es correcta, pero carece de dinamismo. Visualmente, la película tiene una estética cuidada, con una fotografía que refuerza el tono oscuro y melancólico de la historia. Los tonos apagados y la iluminación tenue crean una atmósfera adecuada para un thriller de este tipo, pero la puesta en escena no logra destacar ni ofrecer algo realmente memorable. La dirección es demasiado convencional, y la falta de riesgos creativos limita el impacto de la película.\n\nLa banda sonora acompaña de manera efectiva la narrativa, pero tampoco es especialmente destacable. Funciona bien para crear un clima de tensión y misterio, pero no es un elemento que quede grabado en la memoria del espectador. Al igual que el resto de los aspectos técnicos, es funcional pero no sobresaliente.\n\nEl ritmo es uno de los puntos más débiles de la película. La historia avanza de manera pausada, lo cual podría funcionar si hubiera suficientes giros o revelaciones que mantuvieran la atención del espectador. Sin embargo, la falta de sorpresas y la previsibilidad de la trama hacen que algunas escenas se sientan innecesarias. La película intenta construir un clímax que nunca llega del todo, dejando una sensación de incompletitud.\n\nUno de los aspectos más frustrantes de Pequeños detalles es que parece estar constantemente al borde de convertirse en algo más interesante, pero nunca lo consigue. Hay momentos en los que parece que la tensión va a explotar, pero la narrativa se queda a medio camino, sin arriesgarse a dar el salto necesario. Esto hace que el filme sea una experiencia algo frustrante, ya que tiene los elementos para ser un thriller efectivo, pero no los aprovecha del todo.\n\nEl desenlace de la película es uno de los aspectos más discutidos. Sin revelar detalles, el final no ofrece las respuestas claras que muchos espectadores pueden esperar de un thriller de este tipo. En lugar de un cierre contundente, la película opta por un desenlace más ambiguo y reflexivo, que puede dejar insatisfechos a quienes buscan una resolución más tradicional. Aunque algunos apreciarán esta elección, para muchos resultará anticlimática y carente de impacto.\n\nComparada con otras películas del género, Pequeños detalles queda por debajo de títulos como Seven o El silencio de los corderos. Estas cintas lograron explorar de manera efectiva los horrores de la mente humana y las complejidades del crimen, mientras que Pequeños detalles se queda en la superficie. La película intenta ofrecer un enfoque más psicológico, pero no profundiza lo suficiente en los dilemas morales de sus personajes ni en las motivaciones del asesino.\n\nEn definitiva, Pequeños detalles es un thriller que intenta revivir la esencia de los grandes clásicos de los 90, pero termina siendo una propuesta convencional y predecible. Aunque cuenta con un reparto de primer nivel y algunos momentos de tensión bien logrados, no logra destacarse en un género que ha dado algunas de las mejores películas de las últimas décadas.\n\nDenzel Washington, Rami Malek y Jared Leto hacen un buen trabajo con sus personajes, pero sus actuaciones no son suficientes para salvar una película que carece de originalidad y dinamismo. La dirección de John Lee Hancock es correcta, pero demasiado conservadora, y el guion no logra mantener la tensión ni ofrecer giros sorprendentes. A pesar de sus defectos, Pequeños detalles puede resultar entretenida para los aficionados al género, pero no es una película que deje una impresión duradera ni que aporte algo nuevo al mundo de los thrillers psicológicos.\n\nEn conclusión, Pequeños detalles es un filme que tenía el potencial de ser mucho más, pero se queda corto en varios aspectos. La falta de originalidad, el ritmo lento y un desenlace poco satisfactorio hacen que la película no alcance las expectativas que genera su elenco y su premisa inicial. Aunque tiene momentos interesantes y actuaciones destacadas, no logra consolidarse como un thriller memorable ni como una de las mejores obras del género.",
    "date": "2025-01-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "All I can say: Don't waste your time! \n\nA very good cast (Leto & Washington) wasted in a slow moving story. \n\nIt is much more exciting to watch paint dry!",
    "date": "2024-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "worth the watch. nothing wildly unpredictable, but washington and malek have good chemistry. ending was interesting, leaving a few things unanswered . . . but that's the fun of movies, eh  ;)",
    "date": "2024-11-24"
  }
]