[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Love that movie so much such a great message & amazing songs too!!!!",
    "date": "2025-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wonderful moving, great for the whole family!",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I do like kpop demon hunter I do have a crush on Zoey I liked her so much and pls keep going making those movies from tayvon anderson",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The songs are very catchy and love the movie overall! I just wished that Rumi and Jinu could have ended up together!",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I definitely did not expect to like this movie but it was surprisingly good!!",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "this movie was so good, the animation was great and the songs are amazing. I can’t wait for the sequel.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A movie for people with horrible taste in music. And it's not even funny or catchy in the meantime.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Watched this film reluctantly the first time, but happily the second and third times.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Loved the animation and the songs! The story was really good-- was wishing for more at the end.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great movie with beautiful animation. The plot is simplistic but the music soundtrack is amazing and it raises everything to another level. I'm not really a k-pop fan but I'm totally in love with the voice of Ejae, the singing voice of Rumi. I think the last time I was this entranced by a female voice was when I heard Adele for the 1st time.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Loved the soundtrack, just wish it had a better storyline",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "the movie was good but why tf did they kill jinu you freaking poopy heads i hate the writers for this",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "If people understood the demonic they wouldn’t make programmes like this. Sorry, but please avoid, THIS IS NO GAME.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This movie was near perfection due to good story, great character, and great animation. The songs are the biggest highlights. These songs where you can hear the songs over and over due to high energy and catchiness. The best song is Golden. While movie first released on Netflix, this theater is worthy for experience as the song along event. The only issue is the last act feel bit rushed they could make it a bit long to show how the main character can change of heart and reconcile.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely loved this film! I came to the party late, but thank goodness the kids and media refused to let this one pass by without a viewing. Now that we have memorized the soundtrack and rewatched it a few times, I can attest that it is joyful, witty, entertaining, wholesome, and amazingly well done. Kudos to all involved!!!",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I had to watch it to see what all the buzz was about. I mean, it was definitely a good and unique experience, but it didn't blow me away. I can see why it's so popular though. It wasn't as cringy as I thought it would be which was good. 99% is insane.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The movie falls short in its execution. The plot is very simple and doesn’t develop enough, which makes several parts feel empty or poorly explained. On top of that, the ending is too rushed, as if everything wraps up suddenly without giving the audience time to process it.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "KPop Demon Hunters: Beauty in Broken Glass\nby Maria Elena Gutierrez\n\nIn \"KPop Demon Hunters,\" the smash hit musical animated feature from Netflix and Sony Pictures Animation directed by Maggie Kang and Chris Appelhans, a trio of young women battle against a band of demons intent on taking over the world. Their weapons of choice are nothing less than their own singing voices.\n\nThe three women in question are Rumi (Arden Cho), Mira (May Hong) and Zoey (Ji-young Yoo). Together they form a girl band called Huntrix. When they are in the limelight they command the attention of millions of adoring fans. Secretly they draw swords to defend the \"Honmoon\" – a magical shield that protects the world against relentless demon attack.\n\nBut Rumi, the lead singer of Huntrix, has a dark secret – she is half-demon. Ashamed of her hidden heritage, Rumi tries to hide the tattoo-like markings known as ‘patterns’ which set her apart. But when her patterns reach her throat, Rumi’s singing voice suffers. Only when she falls in love with the beautiful demon boy Ji-noo (Ahn Hyo-seop) does she start singing sweetly again.\n\nRumi’s struggle with shame, and her confusion about what path to take, reflects deep and universal human concerns. We live in a society where young people experience tremendous pressure to conform to arbitrary ideas of perfection. This is especially true for women. Rumi’s conflicted feelings about her patterns are mirrored in any young girl’s anxiety about her body image. \"KPop Demon Hunters\" may be a fantasy, but the desperation Rumi feels is drawn directly from a world that is instantly recognizable to every young soul in the film’s target audience.\n\nDespite the film’s fantasy vibe, \"KPop Demon Hunters\" succeeds by making Rumi’s struggle profoundly relatable. By the end of the movie, having learned to accept her flaws, she leads Huntrix in a rousing rendition of the redemptive ballad \"What it Sounds Like,\" singing lyrics that promise to show us \"nothing but the truth now, nothing but the proof of what I am.\" Now she understands there is no such thing as perfection. She is who she is and that is something to be celebrated. She is indeed \"seeing all the beauty in the broken glass.\"\n\nWhat a powerful contemporary message this is for young people everywhere, made even stronger by being transmitted through the singing voices of three newly-empowered young women. By speaking the truth they spread light through the darkness, generating the supercharged \"Golden Honmoon\" and thus protecting the world from the evil that threatens to consume it. What a beacon of hope this is for all those women around the world whose voices have been silenced.\n\nThe legendary status of the Golden Honmoon – not to mention the elemental evil of the demon sovereign Gwi-ma (Lee Byung-hun) – remind us that, at its heart, \"KPop Demon Hunters\" is a fable embedded in deep tradition. \n\nThe iconography of Korean folklore spills out of every frame, notably with the appearance of Ji-noo’s messengers from the demon world – a psychedelic tiger and a suave six-eyed magpie drawn straight from the Korean art movement known as Minhwa. The filmmakers further embrace the movie’s cultural roots by weaving snippets of Korean language into the song lyrics.\n\nOn other occasions, \"KPop Demon Hunters\" takes tradition and subverts it. Western mythology is filled with female trios, however they are generally associated with darker forces – think the Fates and Harpies of Ancient Greece, not to mention the three witches from Shakespeare’s \"Macbeth.\" With Huntrix, the filmmakers have created a modern-day trio of women who fight exclusively for the forces of good. Classical references underpin the film’s narrative too, with the forbidden romance of Rumi and Ji-noo carrying clear echoes of \"Romeo and Juliet.\"\n\nAll these themes speak of deep waters lying beneath the surface of the global sensation that is \"KPop Demon Hunters.\" Yet that frothy top layer is undoubtedly essential to its success. Tapping directly into the zeitgeist, the movie positively explodes with high fashion, humor, and clever color statements, such as when the sleek sophisticated costumes of Huntrix are vividly contrasted with the sugary pink outfits of the Saja Boys. The eye candy pours out of the screen, accompanied by countless witty nods to anime that see popcorn pouring excitedly from the girls’ eyes when they first meet their demonic rivals.\n\nThis frothiness enables \"KPop Demon Hunters\" to achieve its goals with a light touch. It presents big ideas through the smallest things. Deceptively simple, it nevertheless has profound hidden depths. With its gorgeously accessible imagery and brisk toe-tapping pace, the entire movie is as catchy as the lyrics of its songs.\n\nFinally, it is worth noting that this is a story in which a singing group makes a meaningful connection with millions of fans. To achieve this they must face the truths that lie inside their souls. In the same way, \"KPop Demon Hunters\" has created an entire community of people around the globe who are eager to celebrate the values they all share. This is nowhere more evident than in the special \"sing-along\" screenings that have spread like wildfire through theaters worldwide, in which strangers come together with their voices united to sing: \"Fearless and , this is what it sounds like, truth after all this time, our voices all combined.\"",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Never watched the movie but movie status was too awesome btw",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wow the best Korean anima movie I've watched. LOVED IT!!!!",
    "date": "2025-11-26"
  }
]