[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This film should have been titled “Lifestyles of the Rich and Boring “\nAn endless parade of heavily made up mature women displaying bizarre fashions with handsome men surprisingly interested in them, it reminds me of the love comics that my mother read in the 1950’s and 60’s.\nThe script is trite and banal and the screenplay doesn’t fulfill the plot.\nHowever, menopausal women with neutered husbands will probably find it lovely.",
    "date": "2025-03-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Stuurman and supporting cast deliver good performances, but the storyline seems lazy and cliched. While this latest film in the series does not really offer anything new, it still makes for a worthwhile pass time thanks to some of its colourful characters and interesting filming locations.",
    "date": "2024-12-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I wanted to like this movie. Of the three this one is the weakest overall...the storyline didn't really work, I felt like it was beneath the actors abilities. Disappointed",
    "date": "2024-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Cute movie. Lighthearted. Easy watch.",
    "date": "2024-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "It’s a light hearted romantic comedy. It’s nice to see movies about middle aged women and their dating/love lives.",
    "date": "2024-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I watched this movie with anticipation, expecting a compelling narrative. Regrettably, it lacked clear direction, leaving me unimpressed. Despite a talented cast – boasting impressive past performances – the film failed to deliver.\n\nThe actors showcased their expertise, but their collective effort couldn't overcome the story's shortcomings. A meandering plot and lack of focus squandered the movie's potential.\n\nWith a tighter script and clearer vision, this film could have excelled. Unfortunately, I wouldn't recommend it. As it stands, it's a missed opportunity.",
    "date": "2024-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Worst. 'movie'. Ever.",
    "date": "2024-10-26"
  }
]