[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fantastic movie. Had a lot of fun watching, very funny and action at the same time! I would recommend for a movie night!",
    "date": "2025-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Cruise has the same persona here as in Top Gun. I would think Seal had more of a poker face and was a lot more savvy than the always grinning Cruise character.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A great summer film that deserves to be the 2017 effort from Tom Cruise that everyone remembers, for all the right reasons.",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I had no idea this was based on a true story so that ending kinda shocked me, don't look up anything before watching this movie and you'll honestly probably have a better experience.",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I highly recommend. Tom Cruise's charisma makes Barry Seal a captivating character, presenting in his story the most brazen side of the American dream.",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Can’t go wrong with Tom Cruise, but the movie is pretty flat. It’s fun, but forgettable",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Tom Cruise's charisma makes Barry Seal a captivating character, presenting in his story the most brazen side of the American dream.",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "American Made might push Cruise further along his evolution to more interesting, character-based roles. One doesn’t expect an immediate return to iconic roles like Vincent Lauria or T.J. Mackey, but hopefully Barry Seal is just the start.",
    "date": "2025-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "one of the best kinds of biopics: A tale that makes me want to explore the story further and find out more about its subject. Even if only half of this film is true to life, it's still 100% crazy",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Classic Cruise Banger",
    "date": "2025-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Hilarious and well paced. \n\nTom Cruise killed it.\n\nMinor complaint, is that they changed/added a few things that didn't happen in the real story. I didn't really like one of those changes/additions, but it didn't kill my enjoyment of the movie.\n \n\nBig recommendation from me.",
    "date": "2025-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "American Made might push Cruise further along his evolution to more interesting, character-based roles. One doesn’t expect an immediate return to iconic roles like Vincent Lauria or T.J. Mackey, but hopefully Barry Seal is just the start.",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Couldn’t love this film more!",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Tom Cruise's charisma makes Barry Seal a captivating character, presenting in his story the most brazen side of the American dream.",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie surpasses both Tom Cruise’s (Top Gun) movies IMO. I enjoyed both the Top Gun films however, this was more entertaining because it’s based on a true story from the Cold War. To add on from my perspective, it doesn’t always take crazy stunts to make a better movie. If that’s all I want, I’ll just pop in the movie “Jackass” lol.",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "American Made is one of the best kinds of biopics: A tale that makes me want to explore the story further and find out more about its subject.",
    "date": "2025-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A real-life event, adapted with a comedic tone. Somehow it was how this film arouses interest, so much so that the viewer decides to investigate more about the characters. To watch on a weekend afternoon.",
    "date": "2025-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "If you like geo political true stories about cartels, politics and the 80´s well that movie is a thumbs up.",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The interesting thing about its volatile proposal is this impassable commitment to humor.",
    "date": "2025-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A classic 90s style Tom Cruise movie of fun adventures in the drug smuggling world.",
    "date": "2025-07-08"
  }
]