[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Was actually kinda cool.",
    "date": "2025-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie actually made me sob no joke😭. Highly recommended😁.",
    "date": "2025-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This third Fear Street movie was really good. Kiana Madeira, Ashley Zukerman, Gillian Jacobs, Benjamin Flores Jr., Mike Winfield, and the rest of the cast did an excellent job in this movie. The plot of the movie was intense and thrilling. It's about how it all started and who is responsible. If you haven't seen this movie yet, check it out sometime, but watch the first two movies before this one. It'll explain everything and blow your mind.",
    "date": "2025-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This one I like the least of the trilogy. But overall a good end to the trilogy.",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I don't particularly like the prequel part of this film I did think the ending of the film was a great way to conclude the trilogy.",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "No horror fan should miss this trilogy at any cost. Keep in mind that none of the three films can or should be watched as a standalone story. Consider the films as individual episodes of a miniseries.",
    "date": "2025-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "They take things slow but it still packs a punch with plenty of intense moments.-💀💩L",
    "date": "2025-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Somebody need they ass wooped….",
    "date": "2025-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "my least favorite of the four, I didn't liked the part of the past, maybe with a different actress as Sarah would've be better. The end part was good though",
    "date": "2025-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A bad ending can ruin a good story, good thing this period piece knocks out a home run, by taking us from where the legend started, to its finish, wrapping things up pretty well. There are more tales to tell, however, so see y'all down the street!",
    "date": "2025-06-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Pretty good.",
    "date": "2025-06-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This felt like a lackluster end to a thrilling series.  The characters felt off in this iteration but the final twist was compelling.",
    "date": "2025-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best movie I love it",
    "date": "2025-05-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Well explored universe and very well conducted ending.",
    "date": "2025-05-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "27-5-2025\nI personally felt that the storyline in the latter part of the film was a bit underwhelming.",
    "date": "2025-05-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "(May contain spoilers.)\n\nI liked when she went back to the future to make the Blade runes disappear, but given the number of killers this isn't over yet, again, unless they all got Green Miled, including that throbbing mass. Ah, it's just the evil book and its admirer(s), like in Evil Dead. 5/10 - I wonder when the Stranger Things finale drops.",
    "date": "2025-05-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "o melhor, não tenho a minima duvida❤️",
    "date": "2025-05-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Fear street: part three was good. I love the conclusion to the trilogy of movies. Although, I wish there was more gore like the other ones the conclusion finished it off perfectly. Well done with the writing.I would recommend this watch.",
    "date": "2025-05-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A good ending to this trilogy",
    "date": "2025-03-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Esta película vendría a ser el cierre de la trilogía. Vaya desarrollo de historia y personajes. Ir a 1666 a través de los ojos de la protagonista me gustó y no me espere ese giro que hay.",
    "date": "2025-02-28"
  }
]