[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Good movie don't worry about these other critics. Their expectations are insane. Not a super deep storyline but still good. Awesome graphics. I imagine the next movie will be a little bit longer and have a little more detail into the story. Definitely looking forward to a second one",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The movie is bad on all levels.\nWriting is the absolute worst part but I would save nothing out of this mess.\nDon't waste your time watching it.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Damsel è un fantasy sorprendentemente bello: visivamente affascinante, con un drago realizzato benissimo e una storia che ribalta il cliché della principessa da salvare. Millie Bobby Brown è intensa e convincente, e il film scorre senza mai annoiare. Il finale è soddisfacente e chiude davvero la storia. Un ottimo fantasy, emozionante e ben fatto.",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Damsel” is an amazing movie — I’ve watched it more than 3 times, and it never gets old! Millie Bobby Brown gives such a powerful and emotional performance as Princess Elodie. I love how the story turns the classic fairy-tale idea upside down — instead of being rescued, she becomes her own hero. The action scenes are exciting, the dragon looks incredible,It’s definitely one of my favorite movies, and I’d recommend it to anyone who loves fantasy, adventure.",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It's good, certainly better than the reviews.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Wow. I am quite impressed with this movie. It was supposed to be a fairytale about a girl from the poor family that all of the sudden becomes a princess. But unfortunately the royal family has a different plan. It turnes out that she is about to be a meal for a cave monster as an offering from the king and the queen which is a main part of agreement between them and a dragon.\nThis movie is about lies, betrayal and survival. I loved Millie Bobby Brown as a leading character. I am not sure that I ever saw a movie with her before (not as a main character at least).\nGreat visual effects! The dragon looks exactly like if the Basilisk from Harry Potter had wings lol. It was interesting to watch and I surprised myself with how much I enjoyed it.",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "⭐️⭐️⭐️⭐️⭐️ 5 Stars for sure! I loved it and I can't express that enough.\n\nAs someone living with severe C-PTSD, triggered by s-xual content, it’s nearly impossible for me to find fantasy stories/media I can actually enjoy. Amazing dragon or fantasy movies get weighed down by scenes that make them unsafe for people like me way too much and it ruins potentially great content. \n\nDamsel is perfect for me. It means so much to me. It’s dark, thrilling, emotional, and the dragon is everything I could hope for: powerful, intelligent, terrifying, and heartbreakingly beautiful. I actually really didn't like the design before watching the movie, but that has changed. I actually really love her. The fact that it delivers such an intense and gorgeous story without any s-xual content makes it a rare treasure. It gave me the ability to actually fully sink into the fantasy I love—dragons, danger, and a heroine’s strength—without fear of being blindsided by something that would trigger a panic attack.\n\nIf you’re someone who adores dragons or dark fantasy but also needs a safe space away from s-xual content, this movie is a gift. For me, it wasn’t just entertainment—it was healing and a beacon of hope. I really hope they build more to this and a 2nd movie or a show comes out (without the s-xual content, I hope). Even if it isn't in this same universe or story, I would love to see more like this. I really needed this. Thank you to everyone involved in creating this. I appreciate you all so much! 🩵🩷",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it! Finally a kick ass action movie with a strong female lead. Millie was awesome.",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I really enjoyed this movie. Great special effects and I loved the ending.",
    "date": "2025-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Looking past the CGI the movie was great. I also love the movie more after reading the book, which explains a lot more of the backstory of the kingdom.",
    "date": "2025-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Absolutely terrible. \nA joke. \nFast forward to the end. \nBetter yet, skip altogether. \n\nRidiculous acting, too much makeup, laughable scenes & characters.",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "No entiendo porque tanto hate a esta pelicula si es de las mejores que ha hecho millie bobby brown a la altura de enola holmes y aparte representa lo fuerte y capaz que puede ser una mujer esta pelicula sin duda la recomiendo no le doy 5 estrellas porque no es para todos hay gente que no les gusta las protagonistas de este estilo.",
    "date": "2025-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A good overall movie, I loved the dragon and the voice, I liked the dark tone and the special effects.\n\nThe story was average but better than a lot, it has great potential for further movies and expansion,\n\nEasy fantasy watching, that I enjoyed so much i have watched it more than once",
    "date": "2025-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I have seen this movie a year 1 ½ ago and I love this masterpiece of a movie",
    "date": "2025-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Got tove having a strong female lead who saves herself!",
    "date": "2025-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I watched Damsel without big expectations, and it surprised me in the best way.\n\nThe film gives us a fantasy story that feels fresh, with a young woman who doesn't wait to be saved – she saves herself. Millie Bobby Brown delivers a strong performance as Elodie, combining vulnerability with courage.\n\nThe world-building is dark and beautiful, and the scenes inside the dragon’s lair are truly captivating. The visual effects were better than I expected, and the pacing kept me interested from start to finish.\n\nI loved the message – that strength doesn’t come from status or magic, but from within. I would absolutely love to see a second part, especially if it explores more of this world and Elodie’s journey.\n\nPlease, Netflix – give us Damsel 2!\n\nHighly recommend this film for fans of fantasy with strong female leads.",
    "date": "2025-06-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great movie! I don't know why some people don't like this movie. It's full of action. Has great graphics. Great storyline, and lots more. I highly recommend that you watch this movie. You won't be sorry. 👍😊",
    "date": "2025-05-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Good movie, definitely worth a watch. The dragon itself was very well done but I did find the story a bit boring and also wanted more revenge 😂",
    "date": "2025-04-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "SPOILER WARNING: Great movie. Did not do the annoying “hoorah woman power” crap and have a 5 foot lady going blade to blade with a 6’4 soldier, she was cunning, enduring, and intelligent, and saved herself and her sister. The dragon was amazingly done, awesome voice acting and animations. The plot was really solid, and the acting was good.",
    "date": "2025-04-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Refreshing twist to the usual fairytale story",
    "date": "2025-04-20"
  }
]