[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It is a crime that this movie is rated so low by many!",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "A slapstick and horribly written movie, Ride Along 2 does not meet the standards for a sequel that it should. In addition to the film’s atrocious storyline, Kevin Hart plays a terrible role in this movie, continuing to be as pathetic as he was in the first movie, along with Ken Jeong who makes the film worse with his overly eccentric character. The script was not well executed, it was not well written, and it, like the mighty Titanic, was doomed for failure. In conclusion, this movie deserves the low ratings that it has, and I do not recommend this for any person.",
    "date": "2025-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "An absolutely HORRIBLE comedy to a sequel that should have never been made.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 41 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated PG-13 for Sequences of Violence, Language, Sexual Content and Some Drug Material!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $90,800,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Ice Cube and Kevin Hart are back!!!!!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I think it's a very good movie to watch. I recommend it because it's very funny and has an excellent police plot and humor. Highly recommended I also like that you don't have to watch the first movie to understand it.\nJuan Mosucha",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Will packer movies need to be stop or he needs to stop having Kevin hart in all of em which ever one comes first",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Easy laughs, fun entertainment.",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "pure entertainment and was really funny...",
    "date": "2025-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "its not really bad as people say, its just that they didnt give allot of action for catching the bad guys",
    "date": "2025-01-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "LOL!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2024-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A “meh” entry to a good possible franchise.",
    "date": "2024-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "noah:says this is so bad.",
    "date": "2024-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "If the first one was so bad why did anyone think the second would be any better?",
    "date": "2024-03-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "barely good enough for me",
    "date": "2023-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It had some funny scenes but the first one was better I still dont think that it deserved that bad of ranking because I think that Kevin hart and ice cube did a great job but I didn't like the whole idea and script of the 2nd movie",
    "date": "2023-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Kevin Hart e Ice Cube juntos, não tem muito com dar errado, amo, adicionando Ken Jeong, com aquela carinha engraçadinha, carisma e ingenuidade, bem divertido, leve, completamente bobinho, e que me fez rir, o tipo de humor infantil e despretensioso que amo… Com cenas de ação absurdas, em analogia aos Games do personagem... E a trama também é boa, muito envolvente, e ficamos na expectativa pelo desfecho... Excelente produção, Cômica e agradável...",
    "date": "2023-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Funny like the first one but not for me",
    "date": "2022-12-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "LOL, the funniest 01 hour: and 41 minutes ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2022-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I liked both the first and second Ride Along. Ice Cube and Kevin Hart should work together more often. They're really a great duo! So fun!",
    "date": "2022-07-17"
  }
]