[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1 hour and 38 minutes!!!!!!!!!!!!!!!!!!!!! Rated PG-13 for Thematic Material, Some Racial Slurs and Smoking!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely genius work of the director. I love Nella Larsen books, the director knew how to capture the essence, also the cast was wonderful. So many layers and depth to the characters of Irene and Claire. Read the books,watch this movie and to understand the tragedy of those years .",
    "date": "2025-06-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Thompson and Negga give sublime performances. Most interesting though is how unafraid Hall is from keeping the older literary style of the language intact.",
    "date": "2024-01-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Passing feels artful and shows each scene with purpose. Tessa Thompson is engrossing as the refrained script and acting screams much louder than what we see on screen. The depth of the situation is communicated where you both understand and question each side. It's an intelligent, moving watch.",
    "date": "2023-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "\"Passing,\" based on a 1929 novel by Nella Larsen is stylish, nuanced, and refreshingly smart. Unlike most films that spell everything out for you, \"Passing\" requires more of an audience. It allows you the freedom to interpret things in your own way. As a result, the film offers an experience unique to the individual viewer.\n\nIt essentially tells the story of two light-skinned African American women, Irene (Tessa Thompson) and Clare (Ruth Negga), childhood friends who meet by chance as adults. Clare is passing for White while Irene lives mostly as a Black person in Harlem (but passes when it is convenient). Clare, who yearns to reconnect with Irene, threatens Irene's carefully controlled life.\n\nBesides the obvious issue of passing for White, the film deals with questions about sexuality, how context plays into our perceptions of people, and how to discuss race with our children.\n\nBeautifully shot by. Eduard Grau in black & white in a traditional 1.33:1 ratio, it almost looks like we're watching a vintage film. The gifted actor Rebecca Hall, whose African American maternal grandfather, Norman Isaac Ewing actually passed for White (and Native American) in the early to mid-20th century, directs her feature film debut with a sure hand.\n\nA subtle film with an unhurried pace requires your full attention to fully appreciate.",
    "date": "2023-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Rebecca Hall's directorial debut is a powerful drama that brings Nella Larsen's 1929 novel of the same name to the screen. The film features Tessa Thompson and Ruth Negga who star as two women in prohibition-era America who live vastly different lives and share a secret that could destroy everything. The movie title, ‘Passing', refers to the practice in which members of oppressed races with skin colours that could be considered white, would ‘pass' as the unoppressed race.\n\n‘Passing' follows two women, Irene Redfield (Tessa Thompson), and Clare Kendry (Ruth Negga), two old high school friends, who happen to run into each other at a hotel during a hot summer day in New York City. As they slowly begin to rekindle their past friendship, a shared obsession threatens both women and their delicately constructed lives.\n\nFor the most part, Rebecca Hall's directorial debut is a triumph, however, some unusual focus choices and abnormal shot compositions can't help draw the viewer out of the black and white world on screen. ‘The Way Back' cinematographer Eduard Grau provides ‘Passing' with stylish cinematography that complements the boxy, 4:3 aspect ratio. The returning image size works well to capture the New York landscape and focus on brilliant performances. ‘Thor: Ragnarok' star Tessa Thompson gives a mesmerising performance as she brings the character of Irene Redfield to life, her intoxicating on-screen presence serves to keep viewers invested across the entire 98-minute run-time. Opposite Thompson is Academy Award nominee Ruth Negga. The ‘Loving' star gives a brilliant performance alongside Thompson, but her portrayal falls short of matching Thompson's powerhouse performance.\n\n‘Passing' also features superb performances from ‘Moonlight's André Holland and Emmy nominee Bill Camp. ‘Mainstream' composer Devonté Hynes provides ‘Passing' with a light, melodic score that feels like it was plucked out of the 1920s. The twinkly notes accompany the other music featured in the film including Tsegué-Maryam Guébrou's ‘The Homeless Wanderer'. Despite being a film whose primary theme is comprised of the racism and discrimination African Americans faced, ‘Passing' also manages to encompass themes of jealousy and identity. As the film progresses, Hall manages to show how as Clare and Irene's friendship progresses, cracks begin to form in both women's lives. Hall also decides to show these cracks literally by repeatedly focusing on a crack on the ceiling of Irene's bedroom.\n\nCostume designer Marci Rodgers (BlacKkKlansman, No Sudden Move) furnishes the cast of ‘Passing' with elegant costumes that fit hand in hand with the film's black and white visuals. Netflix's purchase of the film during the Sundance Film Festival earlier this year, adds ‘Passing' to the list of the streamers 2022 awards contenders. The film joins a line-up that includes films like Jane Campion's ‘The Power of the Dog', Adam McKay's disaster-comedy ‘Don't Look Up' and Paolo Sorrentino's ‘The Hand of God' which happened to be selected as Italy's submission for Best International Feature at the 94th Academy Awards.\n\nRebecca Hall's turn as director adds the BAFTA winner to this year's list of actors-turned-directors that includes Maggie Gyllenhaal, Halle Berry and Lin-Manuel Miranda. ‘Passing' is a powerful, yet intricate film that features stunning performances from both leads, stylish cinematography, and an unexpected ending.",
    "date": "2023-02-14"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The acting almost saves it, but the story is too melodramatic to tackle a really powerful premise.",
    "date": "2022-12-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A little confusing to follow but great acting and a great black-and-white vibe that's kind of poetic in a way \n8/10",
    "date": "2022-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Weird movie.  Was Irene gay and in love with her old school friend Clare? or did she just admire her bubbly personality and free spirit? Was Brian having an affair with Clare? Where did the maid go, and why did she seem to dislike and disrespect Irene so much? Was the director trying to give us her idea of a Fillini film here? Plant pot falling reference, oh boy. Who knows. I found the whole thing left far too many questions for my liking.  I was also surprised that Clare passed for white and even more surprised that John and others couldn't see that Irene was black - it was obvious to me.",
    "date": "2022-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "2 out of 5 stars. Great talent with Tessa Thompson but the script and direction is boring and dull. The film drags on and the story is okay. Just. Forgettable film.",
    "date": "2022-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The material is fascinating - but the treatment of the storyline dulls the drama of it all.  Clare is a black woman passing for a white woman in the 20s in NYC. Her reintroduction to an old friend causes all kinds of problems, but the director muffles the blows.",
    "date": "2022-06-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wowzers!! Ruth Nega,and Tessa Thompson are just FANTASTIC!! I rarely find a Date Night  Movie that we both agree on,but this was just great from start to finish!",
    "date": "2022-04-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "No story line. It was slow and meandered from one thing to another... disappointing.",
    "date": "2022-04-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I knew Rebecca Hall was an out of this world actress when I saw her in 'Christine'. But she's also a class A director. Beautiful film, I can't say otherwise. Beautifully directed, beautifully acted by all the actors involved and gorgeously photographed and edited. Plus a lovely musical score. She has to direct (and write) more! She's up there with the likes of Woody Allen. Beautiful.",
    "date": "2022-04-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The multi-level plot is often difficult to watch.  The acting is as good as the plot.",
    "date": "2022-04-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The title referring to racial passing and lensed attentively in black and white, Rebecca Hall's penetratingly mournful adaptation of Nella Larsen's 1929 novel of the same name is a haunting musing about a crisis of race identities and hypocrisy of social constructs in a friendship story of two light-skinned women in segregated 1920s New York.",
    "date": "2022-04-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Absolutely my favourite movie of 2021.",
    "date": "2022-03-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This was a good idea for a movie, but the director's decision to have the actors deliver their lines in such a formal and stilted way sucked the life out of it.",
    "date": "2022-02-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I really didn't care for this. I didn't hate it, but it just wasn't good. I didn't even like the acting. Maybe if the tension had been drawn out... some better acting... a less abrupt conclusion... Maybe this could have been a decent movie. My grandfather was white passing, so I actually would like a well-done movie on the subject matter. It is a matter of real importance to African Americans.",
    "date": "2022-02-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What was this movie? Just wow. It's such an introverted and yet expressive piece of art. The b/w movie changes the shades of grey (metaphorically) with every line of any character making it hard to even think about black and white anymore. You will find yourself tending between characters while seeing injustice in a lot of different forms and against different people. It's one of those incredible movies that shows that injustice is not a problem of a few people that you can point out and say \"let it go\", it's  a part of everyone. The performance of both leading women are incredible. A real gem!",
    "date": "2022-02-13"
  }
]