[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I'm NOT an Action movie fan:  I often FF thru the car chases (except Bullitt & French Connection) and pretty much quit watching if they show the SAME EXPLOSION more than twice (and then different angles > pa-lease).  So:  I LOVED THIS FLICK, a little heavy on the testosterone but I was ready for that:  the film grabbed my attention and didn't let go.  Lotsa dead guys and some blood if that turns ya off, but WHATTA PLOT >> that NEVER QUIT.",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The film's idea of revenge, forgiveness, and how far you have to go to get revenge is well developed (okay). For a film where I wasn't expecting anything more than just an action flick, I thought this development was good, and The Rock's gruff style suited the role well. The twist is predictable, but okay. The hired killer could have been better developed and had a better motivation. The direction of the action could also be much better, but I think it's at least acceptable. But overall, the film doesn't aim for anything too grandiose, and what it does aim for, I think it manages to satisfy. I'm surprised by the negative reviews. There are much worse films with higher ratings than this one. Anyway, for me, it's a 7.8 🍅÷",
    "date": "2025-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This is my first time watching Faster in YouTube...and to me it's with good scripts...",
    "date": "2025-06-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was so much better than The Dead Don't Die movie that was terrible you have to admit.",
    "date": "2025-04-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A thoroughly entertaining neo-western with a solid performance from Dwayne Johnson, stylish direction and a stellar soundtrack.",
    "date": "2025-02-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Storyline is a bit of a cliche one, but the individual acting performances in this movie is fantastic \n\nEasily Dwayne Johnson’s best acting skills on display in this movie. Love his intensity.",
    "date": "2025-01-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Good movie, plot, acting we are glad we watched this one.  Kept our interest start to finish.",
    "date": "2024-12-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Forced my way through feigned high,  no build, quick emotions, the speaking lines were rough and didn't flow,the bad guys were kept trying to be humanized, awful....I'll keep watching the last half of the movie now...",
    "date": "2024-12-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This is a very non thought out plot, just a quick money grab with mediocre acting and misleading title.",
    "date": "2024-12-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A wanna-be Jason Statham movie.  It provides an interesting outlook on a character deadest on revenge but lacks any real character development and The Rock fails to provide real emotion.  An action film to watch but don't expect to be watching it multiple times.",
    "date": "2024-12-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It was pretty entertaining with plenty of action. It's worth the watch.",
    "date": "2024-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It’s an okay movie to watch in the background or if you’re bored, quite predictable and a bit daft at times. Premise is good but just not told well enough and overall there’s little to no depth in the movie. I don’t regret watching it but I’ll never watch it again.",
    "date": "2024-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A very entertaining simple revenge flick of one of the better Dwanye Johnson action movies.",
    "date": "2024-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fantastic movie, love everything about it. NRJ.",
    "date": "2024-05-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Não é o melhor filme de ação de todos os tempos, mas aqui, Dwayne entrega uma das melhores atuações da sua carreira, num filme competente, que vale à pena cada minuto!",
    "date": "2023-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Wow wow wow! Big surprise! Way above average cop movie, if it's not a masterpiece well it is very close to it.  The plot looks very much like the kind you would find in 40s 50s 60s noir movies, very dense and dark. Acting is 1st class, with Billy Bob, the Rock and Carla perfectly fitting their characters. Photography is beautiful etc etc Lots to say about many things in this film Loved the Chevelle, spot on!",
    "date": "2023-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Easy enough to watch if you're bored. Just a numbskull movie really as it's pretty much just a numbskull movie really as it just uses violence to salvage itself from any real plot depth and its ridiculously stupid and pointless sub plot about a the hit man who is after him getting married to some random woman or something.",
    "date": "2023-03-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The ending was ridiculous like it shift from bad ass revenge to a mediocre fantasy film.",
    "date": "2023-01-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "So fast they forgot to give the characters personalities.",
    "date": "2022-12-07"
  }
]