[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The highs and lows of a soap film . Nothing really to see here.",
    "date": "2025-03-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The best think about this movie is getting to see Travante Rhodes. He's very sexy and delivers his part. Too bad the writing wasn't better because Travante and Kelly had the right chemistry.",
    "date": "2025-01-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Hang up the acting towel Kelly and stick to enjoying your career’s earnings. Retirement should be in her near future. Redo with better acting.",
    "date": "2024-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Just when you think Tyler Perry can not possibly make a dumber movie, he works assiduously to prove you wrong!  He has done it once again.\nTyler Perry has been making movies for 30 years and is a Billionaire.  He could clearly make better movies if he so desired.  Sadly, he knows there is a certain audience that will turn out for this detritus so he does not have to improve his craft to make tons of money.\nTrevante Rhodes looks/sounds like he is about to fall asleep in every scene.  He has been accused of murdering his girlfriend and is faced with the possibility of life in prison but, he shows exactly ZERO emotion/feeling when he is discussing his case.\nKelly Rowland's character is a high-powered attorney in a white shoe firm yet, her character does some of the dumbest things in cinema history.\nFor an affair to take place, especially one fraught with so much risk and danger, you have to feel at least a modicum of heat between the parties.  Here, there is zero chemistry/heat between these two characters.\nAnd, Perry has proven he can not create characters with a modicum of nuance.  The bad characters are all way over the top.  The mother is completely repulsive and her boys are one-dimensional.\nThe first 90 minutes are fairly boring with \"tension\" supposedly building as to whether Zyair actually murdered his girlfriend or not.  But, he does not seem to really care so it's hard for the audience to get to invested in the outcome.\nAnd, then the completely insane final 25 minutes of the movie that is so far afield from everything that has proceeded it, you are like, \"Is this a different movie from what I just watched??\"  It's like someone wrote the final 25 minutes who had only some vague awareness of the first 90 minutes.  It creates a real feeling of whiplash it is so extreme, unbelievable and just incredibly stupid!  Dear Tyler Perry - Please do better!  You consistently turn out projects that insult your audiences.  After 30 years and with an unlimited budget, you could actually make movies that make sense, have believable characters and intellectually challenge your audiences.  Please, for the love of God, do better!!",
    "date": "2024-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I saw several reviews and yet I watched it. Huge mistake. Terrible movie with a stilted script.",
    "date": "2024-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The whole plot is so unbelievable. Why would a respectful lawyer allow her client to control her like that, and having an affair with him should get her disbarred. The acting was pretty bad, especially by Zyair; he hardly had any emotion in his flat tone.",
    "date": "2024-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Found myself at least entertained by this trashy and over the top romantic thriller schlock. The romantic chemistry between the 2 leads is as bad as i have ever seen. The dialogue is so awful its no surprise how stiff the delivery is.\n\nI did not even realize it was Kelly Rowland until after the movie when i was trying to figure out how the actress got the role.",
    "date": "2024-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Everyone was frustrating in this movie. I couldn't relate to anyone. Between the stupid FL (and when i say stupid, shes the-first-one-to-die-in-a-horror-movie dumb), the dumb ass mama boy husband, the private investigator who does half of the job, the wacko brother- and mother-in-law. It's just so not realistic that I have nothing to say but that this movie is extremely bad. But truck-kun helped us in the end.",
    "date": "2024-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "For every low review, I am absolutely shocked. This movie was beautiful. The approach Tyler Perry took with this movie is very different from the past when it comes to the color scheme, and artistic visuals. This was BEAUTIFULLY written, amazingly produced and shot. 10/10 absolutely amazing actors and props to Kelly Rowland and Trevante Rhodes",
    "date": "2024-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It's ok, great acting, But it wasn't all that, But Kelly Rowland is amazing in this movie, Close to the ending got really intense😮, And the movie is too long, 2.5/5",
    "date": "2024-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Kelly’s character is unbelievably gaslit this whole movie so much so that i made an account just to thumbs down this movie i wanted to scream",
    "date": "2024-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Ridiculous!! Poor plot, poor acting; highly disappointing!!",
    "date": "2024-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Really bad movie, bad acting all round supporting a really vacuous script and plot. Tyler Perry's characters are nothing more than caricatures. If the big plot twist at the end and the circumstance leading to it dont make you roll your eyes, your constitution is stronger than mine.",
    "date": "2024-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This was a similar format to his earlier movie Temptation.",
    "date": "2024-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Worse than mexican soap opera lol",
    "date": "2024-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is a wave of emotions and not only because it’s a thriller .You can FEEL their emotions, their experiences.In the beginning you think you know what it  will happen, but in the end everything will change.I would love a sequel for the movie, maybe Zyair will be Mea stalker (like the producer said). IT TOTALLY WORTH IT WATCHING .Everytime you will rewatch this movie you will find SOMETHING NEW. It is a masterpiece, COMPLEX.",
    "date": "2024-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I thoroughly enjoyed this meeting... I took me a while to watch because of all the negative reviews, but the twist and turns in this movie, you just never see the ending coming....  Don't believe the negative hype... watch for yourself....I will watch again!!!",
    "date": "2024-06-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Definition of Mea Culpa is an acknowledgment of one's fault or error. My error was watching the entire movie hoping for justification in spending 2 hours of my life on this horrible film. The storyline was confusing and unrealistic. I love Kelly Rowland, but she should’ve taken the pass on this one!! 🤯",
    "date": "2024-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I actually enjoyed the movie. I’ve watched multiple times.",
    "date": "2024-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Bad acting, artificial dialogues and no chemistry between the two mains.",
    "date": "2024-05-29"
  }
]