[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Good Movie!!! Recommended!!! A+ 🍿🎥🍿",
    "date": "2025-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A great movie. The difference is the Culture relation to the movie you have that determines how good your gonna think the movie is.",
    "date": "2025-03-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Despite a talented cast, the storyline was more than a tad trite and predictable.  Moments of humor are overshadowed by hackneyed humor.",
    "date": "2024-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The Jenkins family goes through a chaotic and funny evolution so that in the end it conveys warmth and love without losing humor.",
    "date": "2022-04-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "A modern day minstrel show, with all the classic tropes on display.",
    "date": "2020-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Story/Screenplay: (3.5/5) A comedy about a successful guy who goes back home and finds out his extended family still sees him as the kid who couldn't win at anything.  I've seen this story line before.  Not original.  However, it could still be really funny at times.\n\nDuration/Tempo: (3/5) At 1 hour and 54 minutes, it's a longer than average movie that felt about the same.  Might have benefited from less content to shorten it up a bit.\n\nCast & Crew: (3.5/5) Decent cast.  Martin Lawrence and Nicole Ari Parker stood out, but Michael Clarke Duncan was fun to watch as well.\n\nSummary: (3/5) The story was OK as was the cast.  I could go up or down with this film, but in the end, a thumbs down.",
    "date": "2020-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie was underrated.  A lot of funny comedy in it.  Martin wasn't at his best but it was still a good movie if you like comedy.",
    "date": "2020-03-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie,  with lots of laughs.",
    "date": "2020-01-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Perfect slapstick comedy with fantastic soundtrack",
    "date": "2018-05-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I think the movie was good coming from a huge black family i could relate to these things",
    "date": "2017-01-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Self help guru Roscoe Jenkins (Martin Lawrence) returns home to Georgia for a family reunion. This comedy is your basic man comes home and finds himself again movie, nothing special.",
    "date": "2016-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Undeniably funny and touching to boot, Welcome Home Roscoe Jenkins is an inspirational lighthearted comedy that delivers a solid narrative and one of Martin Lawrence's better performances.",
    "date": "2016-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Martin Lawrence returns home to confront his overbearing family members. Forgettable romp.",
    "date": "2016-04-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Welcome Home, Roscoe Jenkins is a decent film. It is RJ Stevens who is a talk show host that visits his family in the deep south. Martin Lawrence and James Earl Jones give good performances. The script has some funny moments but has a little slow in some moments. Malcolm D. Lee did an alright job directing this movie. I liked this motion picture because of the humor and romance.",
    "date": "2015-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "While not quite four star material, Welcome Home Roscoe Jenkins is genuinely funny film, The plot is Doc Hollywood meets Sweet Home Alabama with a bit of Just Friends in their measure.\n\nMartin Lawrence's Roscoe Jenkins leaves his Southern country upbringing behind and becomes too big for his bridges after becoming  success, but a long weekend home bring him crashing down to earth and realising what is truly important life.\n\nThe film while has been done before mainly in a white setting is done to solid effect in an all African American setting. The cast is a joy and are clearly having fun and the cast include James Earl Jones and Michael Clarke Duncan are unfortunately wasted with limited screen time. Jones being the typical disapproving father, while Duncan is solid enough in the role of big brother. Joy Bryant as self-centred  fiancee is also solid, while Nicole Ari Parker is just the right side of pretty and fun as the one Lawrence's Jenkins is meant to be with.\n\nIn fact the best laugh comes from when Cedric the Entertainer comes on screen as he and Lawrence bring the best out of each other whether it's gambling on dice which ensues in a brawl or the final race where they out do each other in the screen mugging to enjoyable effect. The two on screen were clearly having fun.\n\nLuckily this film hits enough laugh out loud moments amongst the cringeworthy moments to give it passing marks a hugely enjoyable film.",
    "date": "2015-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Martin Lawrence, Cedric the Entertainer, Mike Epps. 15 years ago, these would have been three major incentives to place a movie on the must-watch list. Now, these names are just another reminder of how the quality of black comedies have declined since the 90s. Gone are the days of 'Friday' or even 'Big Momma's House'.\n\n'Welcome Home Roscoe Jenkins' is a mess of clichés, stereotypes and poor slapstick humour, with even the dreaded fart jokes making an appearance. Lawrence & co put minimal effort into pulling off the same shocked facial expressions and over-the-top reactions over and over again, expecting to eventually force a laugh. Mo'Nique's loud and inconsiderate comments are the only occasional source of decent comedy, but it is not good enough to overshadow the severe lack of it everywhere else. \n\nDon't come here looking for a good comedy cause you won't find one. Admittedly, it is easy on the brain and so conveniently serves as something to have on in the background at a family/friend gathering. In truth though, this is probably because no one is really watching the TV at these events and therefore it doesn't matter what is on.",
    "date": "2014-06-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Loved Nicole Parker and Jones/Duncan's presence but still just too many stupid jokes.",
    "date": "2014-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was so gud bc martin lawrenance was in it",
    "date": "2013-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Another one of those \"my family is totally annoying and I have to go home and spend time with them.\"  It was really irritating how they could dish it out but couldn't take it.  Martin Lawrence is funny, but Michael Clarke Duncan steals the show.  He's awesome.  Neither one of the women Roscoe liked were that interesting.  An okay little comedy.",
    "date": "2013-05-23"
  }
]