[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Army of Thieves (2021) The film has its ups and downs, but what is truly positive is the protagonist, who manages to deliver a good performance and great humor.",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It’s a fun movie. People who are acting like it’s bad are ridiculous. It’s worth the watch and it should be enjoyed and was from this viewer.",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Buena peli, entretenida, historia medio quemada ya pero un final un poco interesante, abierto a una tercera parte quizas.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It was fun at times, the cast was cute and the starting was intriguing however I got bored in the second half and I didn't find it was funny as intended.",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Super weird. Keeps getting weirder. Enjoyable!!",
    "date": "2025-02-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "this film was a stright BLAST",
    "date": "2025-01-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great movie. A bit systematic and potentially boring if I were to be in the mood for a dynamic action movie, but I guess I watched it at the right time.",
    "date": "2025-01-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This is a funny and wild children's movie with several interesting twists.",
    "date": "2024-12-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "it was on the whole a quirky little piece.  The plot was ludicrous, but undertaken with enough whimsy and sincerity to pull it off.\nThe action sequences were well done and well paced, and, I will admit it, the two leads had enough spark to make me wish the movie could have stayed with the suspension of disbelief a scene or two longer and given me a bit of a happier ending.",
    "date": "2024-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I didn't find out this was a prequel to Army of the Dead until after watching, so I can't speak to its continuity, BUT as a stand alone film it's pretty good! \nSebastian is so cutely awkward that it's a joy to see him bumble through crimes just for the excitement of lockpicking. The film doesn't take itself TOO seriously which plays well with the visuals and dynamics of the entire cast. \nIf you like heist style films and enjoy a bit of comedy, 100% recommend giving this one a try",
    "date": "2024-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Such a stupid film. Waste of time. Don't watch.",
    "date": "2024-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "a very enjoyable to watch heist movie with fast pacing and engaging storytelling. really like the main character—guess i just have a thing for aloof nerdy people. would love to see more of Dieter and how he fits into the franchise",
    "date": "2024-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Fun and exciting. A bit too sappy at times, but overall an exciting adventure with one of the most enticing characters from the Army of the Dead.",
    "date": "2024-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Army of Thieves does the usual quick paced, multi character kind of thing. It's a decent watch - and the spinning locks are kinda satisfying.",
    "date": "2024-03-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's not bad I suppose bit of an odd plot for a heist movie running alongside with army of the dead",
    "date": "2024-01-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Easy to follow, humorous, great acting and some great plot twists make this a entertaining, satisfying addition to the heist genre.",
    "date": "2024-01-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I really enjoyed watching this movie and I put my family on and we are waiting for the sequel to come out and  I've watched this TWICE!! And I'll probably watch it again highly recommend!!!",
    "date": "2024-01-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Liked this take on a heist-movie. The lead character and actor really steal the show… loved how this was a prequel tied to Zach Snyder's Army of the Dead, very clever. Witty dialogue, great sets/costuming and the action-scenes work. Heck, I'd watch a sequel/prequel of just these safe-crackers.",
    "date": "2023-12-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Was an enjoyable movie for the most part. Nathalie is gorgeous. Overall, a good movie to watch.",
    "date": "2023-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Amusing movie, but the idea of just robbing a bank and walking away is easier to believe than someone not smacking him in the head when he stands still, when time is of the essence. I can mention many unbelievable circumstances, but they would contain spoilers, and if you're desperate for a good movie, this one will do.",
    "date": "2023-09-28"
  }
]