[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Completely stupid. Don’t waste your time.",
    "date": "2025-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1 hour and 27 minutes!!!!!!!!!!!!!!!!!!!!!!!! Filmed on location off the coast of United Kingdom and dubbed and subtitled in a studio in the United States of America!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Para um filme de tubarão, ele é um coadjuvante de tão pouco que aparece. O elenco é uma reunião de ex BBBs, ninguém com capacidade de fazer a gente torcer que fique vivo. Detalhe do galãzinho tóxico que ao invés de ser o salvador da pátria, deixa as decisões e os riscos para as mulheres fazerem. Nada se aproveita.",
    "date": "2025-03-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "After 5 minutes, I only waited for the shark to show up. For a shark movie, I always expect to feel some empathy with the characters... but I didn't with those idiots right there.",
    "date": "2024-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Who wrote this? Lmao",
    "date": "2024-03-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This isn't Jaws, or Piranha, or 47 Meters Down, or The Shallows, or even Sharknado... so it's got some knocks against it from the start and is going to have a hard time winning over audiences with cgi sharks.  Five people stuck on a jet-ski in shark infested waters, it's basically the plot of Jaws II, minus Chief Brody and a bigger boat, and the shark is more successful here... so that's a plus.  Shark horror is intense... but there are some believability issues here, or lack thereof, and the acting is... not good.  This couldn't even get the title right, also known as Shark Bay.",
    "date": "2023-06-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I fell asleep multiple times and I somehow didn't miss anything at all. No wonder if your film consists of 75% drone shots. Now I'm drunk and unhappy. Thanks, movie..",
    "date": "2023-01-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The film's plot has you rooting for the shark to kill off the entire cast as quickly as possible.  A film that suffers in every scene, which crudely uses the idea of ​​​​a killer shark that is already saturated in cinema.",
    "date": "2022-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Drama in the swimming pool on a floating tube will bore you big time... nothing makes any sense here, just empty scares and poor CGIs...",
    "date": "2022-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Relatively well made compared to most other recent additions to the killer shark movies.",
    "date": "2022-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Characters so pathetically cliche and unlikable, I was rooting for the shark the entire time.   So many things wrong here.   It's a laughable movie but passed the time.",
    "date": "2022-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "IN A NUTSHELL:\n\nA group of friends enjoying their Spring Break in some Spanish-speaking country, steal a couple of jet skis and race them out to sea while drunk.  Yeah, good plan, knuckleheads!  The result is a horrific head-on collision. They struggle to find a way home with a badly injured friend while sharks lurk in the waters below.\n\nRequirements for a goofy shark movie:\nGood-looking young adults in bathing suits\nLots of jump scares\nPeople get chomped by sharks\nThe characters make a lot of dumb decisions\nIf that's what you want, you'll be satisfied enough with this action flick.\nThe film was directed by James Nun and written by Nick Saltrese.\n\nTHINGS I LIKED:\nThe action starts happening quickly at about 15 minutes into the movie.  Yay.  The first 15 minutes are spent watching the group of idiot partiers get so drunk that they're sure to make really stupid decisions during the rest of the movie.  And they do.\nThe cast includes Holly Earl, Jack Trueman, Catherine Hannay, Malachi Pullar-Latchman, and Thomas Flynn.\nThe original title of the movie was \"Jetski\".\nThere is a scene that is an homage (or steal) from the movie JAWS, when someone is being eaten by a shark from the waist down.\nThe movie was actually shot in Malta, not Mexico.\nI liked the drone shots from up above to get perspective on where the characters were and to visually see how truly far away they were from help.\nThe title gets its name from a line that one of the characters says. \n\nTHINGS I DIDN'T LIKE:\nThere are so many bad acting moments that this movie will be watched just to laugh and have fun with it, but that's a fun time too.\nIt's filled with shark-movie tropes, but what did you expect?  It's a dumb shark movie!\nAll of the characters are jerks, except one, so we really don't care too much whether they live or die.\nThe movie poster shows a brunette in a little red bikini, but we never see that in the actual movie.\nThe dialogue is pretty lame with sentences like, \"Why?\"\nThe screaming should have been more intense to be believable.\nI could tell from the very beginning which characters would last longer than the others.\nI thought the shark and wounds looked totally fake. \n\nTIPS FOR PARENTS:    \nThe movie starts with a slut twerking in front of a bunch of guys and lifting her shirt up.  (We don't actually see the nudity.)\n Everyone boozes it up non-stop during their evening of fun, which extends into more booze for breakfast.\nGuys steal some jet skis\nA guy flips the bird.\nSome Spanish is spoken at the beginning of the movie without subtitles.  A man tells one of the girls in Spanish that a shark bit his legs off, so she needs to be careful and listen to his advice.  A beach worker walks by where the partiers were the night before and, in Spanish, he says, \"Animals.\"\nA good tip viewers learn is to not drink ocean water.\nCleavage and girls in bikinis\nPeople die bloody deaths.  We see bloody, dismembered bodies.\n\nTHEMES:\nStupidity\nInfidelity\nHope\nTenacity\n\nYou can see the full review on the Movie Review Mom YouTube channel.",
    "date": "2022-06-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "In general, these types of films must be relatively inexpensive to produce, but this one has better acting and special effects than most. Actress Holly Earl does a convincing  job, in her portrayal as the main character. I would have ended the story differently.",
    "date": "2022-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I think this movie is nice. I really excited and also miss Tom T–T",
    "date": "2022-06-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Just another bad movie",
    "date": "2022-05-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "We almost made it to the great of greats with B movie shark film but this sadly fell short of that line. Better than Great White though.",
    "date": "2022-05-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "cool sfx makeup! cgi a bit dodgy..",
    "date": "2022-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "somber start and becomes quite gruesome. perfect to watch with friends!",
    "date": "2022-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I feel sorry for all these sharks that get described as 'killers' when all they are doing is serving out justice on these irritating adolescents",
    "date": "2022-05-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "What a wild ride! The performances were breathtaking, the CGI rivaled End Game and this underrated gem had me on the edge of my seat for a solid hour and a half! Not really of course, but you already knew that when you made the questionable life-choice of clicking on Shark Bait. This movie is obviously terrible and even with its shameless padding it only stumbled over the line at 87 minutes. I really hoped it would be bad enough to enjoy and I got a few laughs but sadly its not quite there. The most fun you're going to get is from pre-game predictions. Mine were: six production company credits, 'shark infested waters' infested by precisely one shark, an abjectly nauseating musical montage with a slow-motion shot of a bikini-clad behind and at least one guy called Mike. So I lowballed the credits and my Mike turned out to be a Steve.. or was it Ryan...?",
    "date": "2022-05-16"
  }
]