[
  {
    "user": "David Bax",
    "rating": null,
    "text": "The Starling Girl‘s most direct criticism of these fundamentalists is that they are far less concerned with living according to Christian teaching and philosophy than with appearing to do so in a kind of ongoing intracommunity competition.",
    "date": "2024-10-02"
  },
  {
    "user": "Sarah Vincent",
    "rating": null,
    "text": "Watching “The Starling Girl” is scarier than watching any horror movie.",
    "date": "2024-05-24"
  },
  {
    "user": "Kristian M. Lin",
    "rating": null,
    "text": "Laurel Parmet’s low-budget drama features yet another terrific performance from Eliza Scanlen...",
    "date": "2024-03-18"
  },
  {
    "user": "James Croot",
    "rating": null,
    "text": "Parmet’s conceit is naturally a little disturbing and no doubt considered controversial by some, but she juggles it well, never becoming too prurient or sensationalist, but also not condoning...",
    "date": null
  },
  {
    "user": "Jenny Nulf",
    "rating": null,
    "text": "The Starling Girl’s thoughtfulness and lingering optimism toward a story that is predictably sorrowful is a necessary balance.",
    "date": null
  },
  {
    "user": "Nuha Hassan",
    "rating": null,
    "text": "The Starling Girl is a coming-of-age movie that doesn’t explore the teenager’s journey of adolescence; instead, it is a disturbing portrait of women who have internalised misogyny and the many ways in which women are conditioned to behave a certain way.",
    "date": null
  },
  {
    "user": "Nadine Whitney",
    "rating": null,
    "text": "Few coming-of-age stories are without some form conflict defining the protagonist; but Parmet’s film allows Jem to reach a state of grace of which she was always deserving – of which so many young women are deserving.",
    "date": null
  },
  {
    "user": "Farah Cheded",
    "rating": null,
    "text": "A piercing story of religious trauma told with expert nuance by a one-to-watch director and a tour-de-force lead... Yet more compelling evidence — as if we needed it — that you should never bet against an Eliza Scanlen performance.",
    "date": null
  },
  {
    "user": "Tina Kakadelis",
    "rating": null,
    "text": "By no means is The Starling Girl an enjoyable watch, in the sense that its subject matter is difficult to witness. In terms of filmmaking prowess, it’s shocking that this is writer/director Parmet’s feature-length debut.",
    "date": null
  },
  {
    "user": "Filipe Freitas",
    "rating": null,
    "text": "The themes, emphasizing the clash between feelings and values, will resonate with free spirited individuals as much as it will upset fanatical religious devotees.",
    "date": null
  },
  {
    "user": "Jackie K. Cooper",
    "rating": null,
    "text": "An inventive plot plus a star making turn by Eliza Scanlon makes this solid entertainment.",
    "date": null
  },
  {
    "user": "Jeanine T. Abraham",
    "rating": null,
    "text": "The Starling Girl explores the dichotomy of sinner and saint and the entanglements that occur when intense love takes hold.",
    "date": null
  },
  {
    "user": "Kenneth R. Morefield",
    "rating": null,
    "text": "In this day, one almost hates to saddle a feature-film debut with too-effusive praise because it is the nature of the Internet to push back on anything enthusiastic. But, hey, bravas to Parmet and star Eliza Scanlen.",
    "date": null
  },
  {
    "user": "Al Alexander",
    "rating": null,
    "text": "The bizarre love triangle is a bit pat and convenient, a case of a writer being too cute. But it’s one of the few flaws in a film unafraid to stretch the parameters of the trite coming-of-age formula.",
    "date": null
  },
  {
    "user": "Joe Friar",
    "rating": null,
    "text": "Eliza Scanlen is superb in a moving performance that lingers long after leaving the theater. Betrayal and liberation appear in the final act which feels a bit rushed and sensational, but it left me longing for more.",
    "date": null
  },
  {
    "user": "D. Patrick Rodgers",
    "rating": null,
    "text": "The Starling Girl is not a fun film. And Parmet’s exploration of the movie’s central theme isn’t necessarily groundbreaking. But it is a rich film, and a dark one, and one that makes a point worth making.",
    "date": null
  },
  {
    "user": "Dennis Harvey",
    "rating": null,
    "text": "Offering perhaps the most applicable commentary on where we seem to be headed...",
    "date": null
  },
  {
    "user": "Erik Childress",
    "rating": null,
    "text": "Every film festival has a description featuring burgeoning sexuality and/or the perils of religion. The Starling Girl is just another film meeting that quota but, ironically, offers its characters nothing new to experience.",
    "date": null
  },
  {
    "user": "Mike McGranaghan",
    "rating": null,
    "text": "It’s a sensitive, observant film – a coming-of-age story told from a fresh perspective.",
    "date": null
  },
  {
    "user": "Kevin Carr",
    "rating": null,
    "text": "A low-key slow burn, but filled with a distressing amount of truth.",
    "date": null
  }
]