[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "When is a boxing movie not a boxing movie?\nWhen it's Real Steel.\nBeyond the surface of a underdog boxing story is one about a man losing his dreams and a boy needing connection and how they find it in each other. It's about redemption, family and finding new purpose. \nFrankly this movie makes me feel more than a movie like this has any right to and it's earned every last star.",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "When it opened with an Alexia Murdoch song, I was ready to love this movie, but I just cannot. It is bad. I cannot stress how much of this movie is delivered with a character yelling into a camera less than a foot from their face. Hugh Jackman yells 80%+ of his lines, and the kid isn't far behind. It begins to grind on the ears and eyes. Pass.",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Amazing concept to bring rock em sock ems to the big screen, with good story, cgi, practical effects and actors. Wish there was a sequel to this. Could've been bigger",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie will be heartwarming & emotional, that I used to be watched this real steel movie as a kid before, such a good movie",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Watched it 10 times, never gets old. Must see!!!!!!!",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is one of top 3 movies on my list, very entertaining and fun to watch! Highly recommend",
    "date": "2025-09-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I think it was great because it was made before 2015, the fall of all movies. \nGreat movie for a father and son.",
    "date": "2025-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best boxing movie I’ve seen, extremely realistic and amazing to watch",
    "date": "2025-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Una joyita de película sin lugar a dudas",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "GOAT Movie of all time",
    "date": "2025-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love it can’t wait till they come out with the second one",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absoluto cine\nEl boxeo artificial nunca superará al real y eso se vio en la última pelea (pelea robada)",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A favorite childhood movie of mine. Rewatchable and lovable every time I revisit. An unforgettable underdog story about robots going at it. Not everyone's favorite, but will forever be mine. Five-stars for the heart and soul this movie displayed.",
    "date": "2025-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "There were some holes in the story and it was a little predictable, but overall this movie was incredible. The animation for the robots was amazing, and it was so much fun to watch. This is definitely one of my favorite underdog stories. I definitely recommend it for action and boxing fans!",
    "date": "2025-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The plot is very good, you can see how it reflects friendship and the value of family, the process that the movie has is too good, although in some parts it becomes very boring since it has no dialogue or anything.\nJuan Torres.",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Filme mais ou menos, o roteiro é fraco, as cenas são mais ou menos, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Simple but compelling script. Exciting film and Hugh Jackman played the role very well.",
    "date": "2025-05-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The first movie i ever actually fell in love with, it truly is a master piece. Great action and calm parts, a great balance. Loved it!! 1000% recommend",
    "date": "2025-05-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A Hidden Gem Classic. This is not what you expect it to be. Some sort of Pacific Rim/Transformers knockoff. It's actually a sport movie (Rocky) mixed with some Sci-Fi (Transformers) and a family movie. any movie you've ever seen with a father/son on the road bonding from Chef to Over the Top, you'd get this. I can't say I've ever seen something like it. The editing is really well done and everything else is suprisngly solid about it. Lilly is really good, the special effects are really well done on the bots, and it weaves between the robot fighting and father/son drama perfectly. If anything the father/son drama is the most interesting parts. the characters are all likeable, it's super heart warming also. If there is one big flaw here is if you've ever seen any sports movie or any father/son movie you know exactly how this is going to go. The world outside of the robot fighting also is kind of forgettable as well. Also some of the \"villians\" like Zeus's owners, the loan shark, and the other oppenents are all kind of forgettable. The plot line of the robot having self awareness feels super underdevloped and kind of pointless. And the robot fights can get a little loud and screaming chaotic. They can be a little simliar and mindless at times too but they work just well enough. And yet despite all that...I really liked it. It's a heartwarming type of film you would never expect it to be. This is something to defintely put on for the family, a sports movie, Sci-Fi, or fans of the direcotr or actors in it. Great suprise and defintely would watch again.",
    "date": "2025-04-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Rising of the Robo-Rocky",
    "date": "2025-04-09"
  }
]