[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Really enjoyed this animated movie!",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A Flashy but Hollow Witcher Origin.\n\nThe Witcher: Nightmare of the Wolf is a visually striking prequel that dazzles with animation but falters with a rushed, superficial narrative that skimps on lore's depth, turning a promising origin into flashy filler. Theo James’s Vesemir has potential, but the script hurries his arc through repetitive monster hunts, leaving Lara Pulver’s Tetra underdeveloped and the Conjunction a missed opportunity for cosmic wonder. What could have been a rich expansion of Witcher mythology devolves into a slog of generic fights and lore dumps, the 2021 style's fluid 2D action unable to mask the emotional flatness. The games' aesthetic nods please fans, but the pacing races past character beats, and the ending teases stakes without payoff, squandering a chance to forge a compelling bridge to the series.",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This is the best work of this show runner.",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I think it's a wonderful cartoon it's very exciting",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It is the best animated movie I've ever seen. Incredible! Must see!",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A well put together prequel of The Witcher with a twist and a tease of Geralt’s character.",
    "date": "2025-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excelente animación, buena historia, buen ritmo, buenos giros, buenos personajes, música acorde, sorprendentemente sangrienta, lo suficiente independiente como para ser considerado un film aparte por si mismo pero a la vez conectado con el universo Witcher de Netflix. Creo que, de lo que vi al menos hasta ahora, de lo mejorcito que hicieron con la licencia.",
    "date": "2025-03-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "É um filme excelente. Se a série fosse animada e não live action, com certeza eu teria acompanhado.",
    "date": "2025-02-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's an enjoyable watch. While the connection to the Witcher lore might not satisfy every fan, it does enough to fit within the universe. The animation is spot-on, though the voice acting can be a bit hit & miss.",
    "date": "2025-02-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "You can tell this was written by someone who doesn't understand the original Witcher intent.  While the movie is a fine stand alone story, I just don't like Witcher adaptation.",
    "date": "2024-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "good anime , very good",
    "date": "2024-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Interesting story and cool animation. Witcher rules!",
    "date": "2024-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I have no idea why everyone is giving this 5/5 stars. The action scenes sure were great and I like how gory it was. But the pacing and the general story made no sense! Each scene jumped around, providing little context. So you didn't feel connected to any of the characters, 90% of the time you're just confused on what's even happening. Like who wrote this? Honestly this was just a money grab. It's like watching a shitty action movie with the rock but in animation.  Definitely don't waste your time, all the reviews are scams. Just watch the fight scenes on YouTube. Rest of the film is straight trash.",
    "date": "2024-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "If you're a fan of The Witcher series, this film is a great addition to that storyline. It takes place some years before the events of the live action series and has a direct tie-in (which I won't mention here, to avoid spoilers). This film is animated, and it is just as graphic and exciting as The Witcher. More than monsters and magic—it also wrestles with the ethics of the Witchers' very existence.",
    "date": "2023-12-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Animation is really well done and it also fits the world of Sapkowski's writing really well. The best Witcher thing that Netflix has done, much better than the series under the direction of Lauren Hissrich.",
    "date": "2023-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Totally surprised. Impeccable animation quality, it's amazing how the Japanese traits give such a sophisticated aesthetic to the productions. The story has significant changes, but what was told told well. As much as events occur quickly, the script is well written. The text is very serious and brutal from start to finish, but it also has its moments of humor, which by the way are well placed. The characters are interesting and their motivations understandable within that universe. Highlight for Vesemir, the key turn of his mentality is very well crafted and he has enormous charisma. I really like this difference in personality between him and Geralt in \"youth\". The brutality and gore of the animation, in addition to being necessary, perfectly matches the essence of the work, making it even more reliable. The fights are spectacular and dynamic and the carnage is visceral. It is a canonical production with references and Easter eggs that complement the series and make the new viewer even more curious and enchanted by this rich universe.",
    "date": "2023-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "In three words. I loved it, but it is not for kids",
    "date": "2023-09-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "When I played the game I always saw how the castle of the witchers was destroyed, and how in some of the characters dialogue there was mention of an attack on the castle . With this I'm able to get a backstory of the Witcher's, geralt & ofc the goated vesemir.",
    "date": "2023-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Good story, no identity politics.\nWhat more do you need?",
    "date": "2023-07-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Not up to my expectation, but still worth watching",
    "date": "2023-04-26"
  }
]