[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Baseado no romance fantástico The Enemy's Cosmetique, transformado quase em um terror psicológico, principalmente no terceiro e derradeiro ato, o que nos leva aos êxtase da insanidade, bem como de seus protagonistas, produzido a trés mãos hispano-alemã-francesa, com uma fotografia alegre e colorida entrecortados com um drama relatado sombrio, roteiro ágil e inteligente, vai nos envolvendo e cativando como a jovem amalucada e conflituosa de cabelos loiros e meias listradas, excelente...",
    "date": "2025-02-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I thought the acting was great. The storyline needed some work though IMO.",
    "date": "2024-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Didn't make sense until the end. I really didn't see it coming. I had guesses, but I was off. Good way to pass a lazy afternoon.",
    "date": "2024-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Perfect Enemy dives bravely into the abyss of it's subject passing the shallows known before and emerge victorious with a satisfactory but unsettling revelation. Flawless realistic performance by cast the entire time nails it at manifesting the perfect beast in holy robes.",
    "date": "2022-06-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A tense, if predictable, thriller with compelling direction and visuals.",
    "date": "2022-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "no me termino de convencer 4/10",
    "date": "2022-01-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It was not good.  To mental and crazy",
    "date": "2021-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I am not sure what the ending meant but this is not a movie I figured out before it was over.",
    "date": "2021-12-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Did you ever meet a creepy stranger in a public place who insisted on talking to you? That's what happens to Jeremiasz Angust (Tomasz Kot) in \"A Perfect Enemy.\" Angust is a renowned architect, lecturing in Paris. After the lecture, his driver is hurrying to get him to the airport, and a blonde girl in her 20's comes up to the car window and begs for a ride to the airport because she can't get a cab. She is Texel Textor (Athena Strates), an extremely chatty young lady from Holland. A few blocks down the street, she realizes that she left her suitcase in a doorway, so the driver has to turn around to get it. As a result, Jeremiasz is late for his flight, so he goes to the VIP lounge to wait for the next one. Textor appears and begins chatting him up again. \nThis time, the chat is not small talk. She tells him her abbreviated life story in three parts, the second and third of which include two murders that she committed. Jeremiasz is dubious, but he listens anyway.\nAs Textor recites her tales, we see them in gruesome flashbacks. We're not sure if she's telling the truth or lying.\nI hesitate to reveal much more. Suffice it to say, things get weird. In the VIP lounge, a small-scale architectural model of the airport (which Jeremiasz designed) mysteriously has puddles of blood on its floor. Textor follows Jeremiasz into the men's room and scrapes the floor with a sinister looking knife. Jeremiasz is also in a couple of the flashbacks. \nMy instinct in such a situation would be to get away from this weird stranger, but Textor, attractive and pixie-like, with exaggerated eye makeup, has a way of holding Jeremiasz' (and our) attention. She's petulant, immature, annoying, and downright strange. We feel absolutely no sympathy for her, yet we somehow can't ignore her. \n\"You're insane,\" says Jeremiasz.\" You need a therapist.\"\nTextor replies, \"Why would I go to a therapist when airports exist?\nIf you're thinking that this film is bonkers, you are correct. The silliness of it, filmed and acted so seriously, is disconcerting. I couldn't stop watching in spite of my skepticism.\nThis is a dialogue-heavy film, and bits of the acting are unnatural and awkward. And the reveal two thirds of they way through will have viewers rolling their eyes in disbelief. The rest of the movie descends into \"throw your credulity out the window\" territory. Actually, that's an understatement. \nBut in spite of its absurdity, damned if it didn't keep me watching. Sometimes, the ridiculous can be entertaining.",
    "date": "2021-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Although it is clear from the start that this is a psychological drama that would pull some viewers into detective work, the movie was successful in drawing me into the mystery, first of nature of the relationship of the two characters, and then deciphering the actual events before the plotline's narrative revealed those events, although there was always the suspicion that memories presented were false memories or intentionally misrepresented memories. I thought the acting was solid, the plot flowed smoothly albeit slowly a few times, and enough questions remained unanswered to entice me to visit a few review sites for clarification or explanation.",
    "date": "2021-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie was so boring. I kept waiting for something compelling. But it never happened. This is a good example of why you can't trust critic scores.",
    "date": "2021-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Good acting and shot well on a low budget, but the ending...yuk! Calling it unsatisfying is being nice. And I usually like twist endings...\nWell, at least it was only 90 minutes.\nThese \"it was all in their head\" movies drive me crazy.\nAnd Texel Textor... Why oh why that name? And then keep repeating it as nauseum....",
    "date": "2021-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It is a psychological drama, a sexually frustrated, smart architect who killed his wife 20 years ago and dumped her body in construction site at the airport returns to Paris. Twenty years seem to have brought him fame and recognition ; however, his guilty conscience gives birth to a teenage girl, it is not clear whether she exists in his fantasy alone or is a real woman but her cryptic stories that start with a delayed flight pull him back to school days and thereafter of jealousy, greed and hunger to succeed.\n\nOur protagonist initially resists hearing the stories from his fantasy daughter that would have been a real 20 years youth had he not killed his wife; he eventually manages to dump her alive in the same material that was used to bury his wife's body.\n\nThose who understand the human psychology of murderers, white collar criminals shall find this movie based on a novel interesting; it is not perfect but successfully presents a limited picture of reality blurred into fantasy.\nAthena Strates  with the strange yet meaningful name of Texel Textor,  is perfect as a mysterious teen.",
    "date": "2021-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Horrible movie, save your money.  The commercial had more effort then the film and writing/development of the characters. Worst movie",
    "date": "2021-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "One of the better movies I’ve seen this year. Artistically illustrated and a few twists to boot. The only reason I didn’t give this five stars is because I was able to predict the outcome- but still happy with how it was done.",
    "date": "2021-06-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's well done all the way around, but I grow fatigued of the insane person hallucinating the whole thing. How many times do we have to see this device? A thousand?",
    "date": "2021-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "There were enough Easter eggs to indicate the ultimate exposure of the central character's state of mind and the closure of this very well structured psychological thriller. was well worth waiting for!\nQuote: \"Tell a lie enough times and it becomes the truth\" it seems to have worked well for Trump over the past 4 years!",
    "date": "2021-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I really enjoyed this movie! It kept me on my toes wondering what happened next! Absolutely recommend!!",
    "date": "2021-06-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Decent film, entertaining enough I suppose. I did feel like the female lead's acting was overdone and a bit cliche.",
    "date": "2021-06-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's a fun watch. It is  a bit of a psychological thriller.  I like the non-usual cast. I definitely recommend its viewing.",
    "date": "2021-06-16"
  }
]