[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Worst MOVIE EVER. This piece of trash is not worth your time. I watched this movie last night and it was the cringest thing i have ever seen. The girl is the most annoying pick me character in the history of cinema. Also why was his name AIDEN! Aiden is possibly the worst boy name i have ever heard. The only good thing about this movie was Scotty. He was so fine and actually funny.",
    "date": "2025-05-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very emotional. I teared up twice which is not normal for me. Both leads were incredible with an excellent supporting cast. A more fresh take on rom/coms that works.",
    "date": "2024-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This movie was not it. The sound track was very interesting to say the least. Chemistry was not great, really wasn't feeling a lot between the two main characters. Don't waste your time watching this movie.",
    "date": "2024-06-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I truly thought this would be an excellent movie. I was wrong, it was 90 minutes of nothing. Great potential, turned into a disaster of a movie. As it says, Meh, it passed the time, well almost I fast forwarded because I found it boring.",
    "date": "2024-01-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Not really for me but honestly not terrible 2.4",
    "date": "2023-02-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Want to watch and hour and a half of teen-soap flashbacks? I don't.",
    "date": "2023-01-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie's plot was very predictable from the first five minutes. We didn't really see their relationship develop outside of some B-Roll where they're having \"fun\". This movie also does not accurately depict high schoolers, which makes sense considering Jordan Fischer is almost 30 years old. The side characters had no real personality or purpose outside of talking to the two main leads about their relationship dilemma, which is a really dumb problem.",
    "date": "2022-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "No es la gran peli pero es entretenida",
    "date": "2022-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I just wasted an hour and a half of my life.",
    "date": "2022-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Another proof that some books are meant to stay as books.",
    "date": "2022-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This one would have worked better as a series than a movie.",
    "date": "2022-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent film!! Characters, music. The nostalgia and story elements are timeless.        Refreshing to say the least in these times where most content is void of authentic emotional arcs. Highly recc.",
    "date": "2022-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It is better than Love & Gelato.",
    "date": "2022-07-06"
  }
]