[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "10/10 they was freaky as hell, and scary at the same time, they need make more bangers like this.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "THE EXECUTION IS OKAY BUT THE IDEA IS VERY DATED.\nTHERE ARE A HANDFUL OF MOVIES WITH THE SAME PLOT.\nTHE FIRST THAT CAME TO MIND IS \"MEGAN\" (2022).\nAT THIS POINT ALL OF US KNOW THAT MACHINES/AI/ROBOTS ARE COMING FOR US HUMAS. NOTHING NEW WAS BROUGHT TO THE TABLE BY THIS MOVIE TO THE WHOLE IDEA. MEGAN FOX REALLY SEEM LIKE A ROBOT, SHE PLAYED HER ROLE VERY WELL",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great Movie 🍿🎥 Super Sexy 👏👏👏🤩💯",
    "date": "2025-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Terrible acting and terrible writing. Hard to find anything positive about this mess of a movie.",
    "date": "2025-09-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Cool take on AI as part of the daily life. Some ways of telling the story were unnecessary bizarre.\nIn a way reminded me of Detroit video game.",
    "date": "2025-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great horror and Megan Fox is amazing as always!!! Must be alot of Megan Fox haters in the audience and critics because this movie is great!!! The audience and critics love to hate on Megan Fox but I'm assuming it's only because they hate themselves!!! Megan Fox You ROCK!!! GREAT HORROR!!!",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Alors que dire… On commence à en avoir beaucoup de ce genre de film avec des intelligences artificielles qui parte en cacahuète. Certains classiques indémodables restent dans les hauts du podium comme certains Terminator, d'autres sont sympathiques comme les M3gan, et d'autres sont carrément nul comme Subservience.\n\nJe n'irais pas jusqu'à dire que c'est un navet, mais le film est franchement ennuyant, j'ai l'impression que le film a était créer juste pour justifier quelque pseudo scène érotique avec Megan Fox qui dans ce film était toute en beauté. Autant faire un film porno ça aurait mieux marché, je pense.",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "What a terrible movie with the worst acting I've seen for a very long time.\n\nKinda stylish and interesting but the whole script and acting is garbage, kinda hard to watch.",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Dear God is that lead actor horrible!  Megan was not bad!",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I enjoyed it and it made my question if there was an ai maid in my house and it made it a little bit frightening how much ai is getting so advanced",
    "date": "2025-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Dumbest movie I've seen in a while. Thanks for the braincells killed LOL",
    "date": "2025-06-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Megan Fox is good in this and fascinating to watch. This is ultra predictable, of course, but I watched it on a long coach journey and it passed the time well.",
    "date": "2025-06-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Waste of time. Bad acting, boring and predictable storyline.",
    "date": "2025-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Subservience (2024): A Glitch in the Matrix... and in Logic\n1.5/5 stars (generously)\n\n\"Subservience\" is what happens when you mix a GPS error with ChatGPT on a bender. It starts with stock footage of Anchorage, Alaska, tosses in a bunch of Colorado license plates, and films the whole mess in Sofia, Bulgaria—as if hoping no one would notice. Spoiler: we noticed.\n\nMegan Fox stars as a homicidal AI sexbot who’s somehow downloaded enough malware to wipe out humanity, yet can’t figure out how to shut a door without dramatic flair. She vamps her way through the movie planting computer viruses and spouting vaguely ominous tech jargon, all while surrounded by a cast of actors you’ve never seen before—and probably won’t see again.\n\nThe plot has less depth than a TikTok comment section, and the dialogue sounds like it was written by an algorithm trained on rejected Black Mirror scripts. It tries really hard to be edgy, but ends up about as threatening as a Roomba with a grudge.\n\nIn short: \"Subservience\" is the cinematic equivalent of asking Alexa to write a movie—and then regretting it immediately.",
    "date": "2025-05-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "An overused storyline, leading to incurable predictability and lifeless supporting characters still manage to reiterate the \"dangers of AI\" in rather shocking and unsettling fashion.",
    "date": "2025-05-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "La trama suena un poco trillada a esta altura pero la maneja muy bien y logra cumplir en mas de un sentido. Arranca bien pero uno puede ver como va cayendo a medida que avanza (y se vuelve en la predecible robot asesina que básicamente la mayoría vinimos a ver) pero logra disimular bien esas cosas con varias sub tramas de personajes secundarios como por ejemplo la enfermedad de la esposa o como los robots van robando todos los empleos, bastante inteligente y bien llevado. Otra cosa que a mi me gusto (por OBVIAS razones) pero que a alguno le puede llegar a molestar es la hiper sexualización de la robota antagonista principal pero con la presencia de Megan Fox como que eso era inevitable. Hay varios momentos donde se nota que es una cinta de presupuesto modesto pero en ningún momento llega a caer en lo bizarro. En fin, esperaba menos y sorprendió.",
    "date": "2025-05-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent film, enjoyed it very much 👍🏻",
    "date": "2025-05-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Better than Jennifer’s body",
    "date": "2025-05-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I really liked it I have to say!",
    "date": "2025-04-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Megan Fox did an amazing job. Serious acting. Might not appear at a first glance, but she excelled on her role  Really got my attention",
    "date": "2025-04-20"
  }
]