[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It has to be the best movie with a budget of $3 million when you consider that last John wick's movie budget was 100 million for what?\nThe movie presented a good question of did it all happen or not? The hardware STEM physical appearance was archaic but the idea, could exist by 2050 or 2100? Part of what gives away the budget is the cars which for what '70s to 2010s. The essence of the plot with a consideration of self-driving cars and the future according to Musk, who knows?",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Upgrade\" is absolutely phenomenal! Every scene left me inspired and engaged. Huge kudos to the entire cast and crew for crafting such a masterpiece. Thank you for giving us a film that was pure, blissful joy to watch",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Basically the entire movie is about the way how technology & robots will take over the world. Production & directory were decent but writing was poor. Movie shows us the future & how ppl will make huge steps into technology development. You can tell by watching that the movie wasn't filmed for breaking profit records in cinematography, so... I think it's fair to give em a 6.",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Fast paced and we'll written. HAL from 2001 in his head.",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent.  Well written with a few twists. Just like terminator its a view into the future",
    "date": "2025-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent film. A bit low budget but very well done.\n\nLike a modern more realistic Terminator movie",
    "date": "2025-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A really good film that not only surprises at the end, but also explains the story in a completely coherent way. I liked the world in which it is set and the action sequences. Such a good sci-fi film, a modern classic.",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Nice film! Enjoyed it!",
    "date": "2025-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was entertaining.",
    "date": "2025-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best movie I’ve seen in a very long time. Great pacing, no bring bits. \n\nAlmost the perfect Sci Fi/ action movie.",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Logan Marshall-Green does a nice job here. The acting chops are solid, even if the writing and directing seems a bit campy. For a movie that seems to immerse itself in cutting edge science, you would think that there'd be a better understanding of how bio-integration would actually work. The reason robots move like robots is because they're made of metal and plastic. There is just no believable way that human physiology would make the same movements simply from a computer implant. The human body would still move with fluidity, and would not be able to just \"plank\"-rise from a prone position on the ground! I chuckled at the car chase where the detective shouts, \"lights\" in her car, and the cruiser's lights and siren come on. Then, when STEM is asked if it can shut down the car it responds, \"I can't, her car is not electronic\". Hmmm. These are nit-picky criticisms, however, for a movie that is overall pretty decent with above-average acting. NBNMF",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It's a really generic action movie. If you're not a fan of action movies, don't watch it. I felt bored watching it. The only engaging element is the drama created by the main character's disability and partner's death in the first minutes",
    "date": "2025-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Upgrade is one of those movies that I think far too many people missed when it first came out. It was overshadowed by bigger blockbusters in its release year, and because of that, it slipped under the radar for a lot of viewers. But let me tell you—this is a film that deserves your attention.\n\nFrom start to finish, Upgrade feels fresh, creative, and unlike anything else in its lane. The direction is razor sharp, with camera movements and shot choices that almost become their own character. The way the film follows Logan Marshall-Green’s performance with such precision makes the action sequences feel both intimate and explosive at the same time. It’s the kind of technical filmmaking that sticks with you long after the credits roll.\n\nThe writing is another strength. The story is tight, engaging, and constantly pulls you forward. Even when you think you know where it’s headed, the twists catch you off guard. It balances sci-fi, action, and even some horror elements seamlessly, all while asking deeper questions about technology and control without ever slowing the pace.\n\nPerformance-wise, this isn’t a film filled with household-name actors, but don’t let that fool you. The cast delivers in every scene. Logan Marshall-Green in particular gives a standout performance that grounds the wild concept in genuine emotion, making you root for him even as the story takes darker turns.\n\nFor me, Upgrade is one of those rare films that rewards rewatching. I saw it in theaters when it first came out and was blown away, and every revisit has reminded me why I love it so much. It’s inventive, it’s gripping, and it feels like a once-in-a-lifetime kind of original story that Hollywood doesn’t often take risks on anymore.\n\nIf you’ve skipped over Upgrade in the past, do yourself a favor—watch it. This isn’t just another sci-fi thriller. It’s an experience, and I guarantee it’ll surprise you. Don’t be shocked if it becomes one of those films you keep in constant rotation.",
    "date": "2025-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "great story, solid performance, the attention to the small details it's great. absolute recommend this one.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This is a very entertaining suspenseful movie.  The premise is really dark but it will keep you entertained.  I saw it when it first came out at the movies and just watched it for the second time.  It was better the second time around.",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Fantastic and kept you asking yourself, what's next?",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "its one of those movies that does everything right but for some reason still isn't a hit the filming and directing is amazing, and the fight scenes could be compared to the best of cinema acting from non major roles is a bit weak",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Upgrade is an amazing, entertaining, and innovative movie. The action's choreography is noteworthy and leaves me baffled. The slight humor is excellent, too. Although the story is the simple \"I must find the man that killed my _____\", Upgrade does it very differently.",
    "date": "2025-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent, original movie. Great fun and very clever with great actors that aren't the usual faces.",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing movie nearly perfect, amazing action and acting. Plot twist is one of the bests",
    "date": "2025-07-16"
  }
]