[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Those Who Wish Me Dead offers a promising premise based on Michael Koryta’s novel, but suffers from underdeveloped plot points and character arcs. While the film delivers in visual spectacle—especially the wildfire effects—and offers standout performances from supporting characters like Medina Senghore, it falls short in narrative clarity and emotional depth. Still, it remains a watchable thriller for fans of action-packed survival stories.\n\nRead the full review here: (Indonesian version : alunauwie.com) and  (English version : uwiepuspita.com)",
    "date": "2025-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Those Who Wish Me Dead (2021) is an adrenaline-pumping adventure that makes you want to follow every minute until the final outcome.",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1 hour and 40 minutes!!!!!!!!!!!!!!!!! Rated R for Strong Violence and Language Throughout!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $7,300,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Starring Angelina Jolie as Hannah, a smoke jumper, a special firefighter!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Wow.....This movie was not good. There was a good movie in there somewhere. Choppy and disjointed edits.",
    "date": "2025-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Despite a predictable plot, Those Who Wish Me Dead is still worth a watch thanks to its two leads and some tense thrills.",
    "date": "2025-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Angelina Jolie, Tyler Perry, and Tory Kittles. All my favorite Stars. I didn't know Tyler Perry and Tory Kittles wasn't this movie together. I'm glad I watched it. Great will be great story and great action.",
    "date": "2025-04-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I have no idea why someone wanted \"them\" dead. Bunch of action for the sake of action alone. Naaaaahhhhh, you don't have to see this one.",
    "date": "2025-04-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Those Who Wish Me Dead - 8/10. Taylor Sheridan directs this awesome throwback 90s style action film. Starring a back to action mode Angelina Jolie, the film follows her as a smokejumper who is banished to a forrest outpost due to a failed rescue attempt. In a parallel storyline, a young boy and father are on the run from assassins who are trying to kill the father due to his knowledge of a sensitive issue. As the father gets killed, the boy ends up running into Jolie's character, and the two of them go on the run from the assassins as they also try to avoid the massive forrest fire that is caused by the assassin. The film is a relentless cat and mouse chase, and is full of tense and good action. Sheridan does a good job of making a simple but effective film. Its premise is straightforward, and is cutthroat in its approach. Realism is brought to the forefront, with pretty intense fight sequences and the intense situation of the forrest fire. Its also fun to see Jolie come back as an action star. She's always been believable as a kick ass action star, and this film shows the actress still showing what she is capable of in the genre after all these years. Its a nice detour from her more serious recent work as well. All in all, a great and fun action film to watch!",
    "date": "2024-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A good Taylor Sheridan movie but not quite as good as Sicario or Wind River.",
    "date": "2024-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Nice coloring and editing",
    "date": "2024-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Good work HBO 👏👏 Great cast, great movie",
    "date": "2024-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A very very basic plot and a disapointing ending can't be saved by a good cast. There's not much to eat here, except the excellent actuation from Connor Casserly.",
    "date": "2024-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Poor editing ruined the movie for me.",
    "date": "2024-05-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "So Predictable and weak",
    "date": "2024-04-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It was like watching a Lifetime movie. Nothing special.",
    "date": "2024-04-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Don't waste your time with this! So slow, bland, almost non-existent plot, scenes and characters.  The only thing unpredictable was how predictable it was... Not even the fight scenes are exciting.  It's a pity because the location and effects are really something, and with a selection of great actors, you'd think more could be done to amp it up, but no.",
    "date": "2024-04-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great movie. Good suspense and action. Angelina did a good job. It was entertaining and enjoyable. Critics are always looking for some deep meaning. This was a premise that has been done before, but it was still very enjoyable.",
    "date": "2024-02-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not a bad movie, but Allison was a much more pivotal and interesting character than Hannah. \n\nJolie (Hannah) seemed to have ZERO compassion, interest or bonding with the boy who witnessed his fathers murder.",
    "date": "2024-02-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Taylor Sheridan is a very reliable director and screenwriter, crafting projects that feel unique in terms of presentation. Those Who Wish Me Dead might be the most conventional story I've seen him helm, but he gets a lot out of it. Angelina Jolie has had a fairly sparse acting filmography over the last decade or so, mostly because she's been focusing on both family and directing. She doesn't have the action chops that she used to, but the film never pretends that she's still Lara Croft, with much more focus on her emotional range rather than her physicality. At its heart, it's a pretty simple story about someone ‘knowing too much' and an evil businessman in a suit wanting them eliminated as a result. The businessman in question is played, for no discernible reason, by Tyler Perry, who only appears in one scene and could have been played by literally anyone else, or cut out entirely. What I really liked about the film is that the main baddies, a couple of henchmen played by Nicholas Hoult and Aiden Gillen, are actually portrayed as very competent. Rather than just being dumb thugs who are easily dispatched, them being ruthless, efficient and driven makes them a palpable threat, and their defeat is all the more satisfying as a result. If you look past its well-worn, no surprises plot, TWWMD is a very entertaining thriller that adds just enough character and emotion to keep you engaged. Sometimes, that's all you need in a film.",
    "date": "2024-02-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Great cast, action-sequences, and sfx can not overcome a goofy story chock full of implausible coincidences and gaping plot holes.",
    "date": "2024-02-06"
  }
]