[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Such a beautifully shot and paced film, with one of the best performances by a introvert type character from Gosling, with powerful, satisfying action sequences when needed, a solid back story, and great score bringing the experience great all-together.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I wasn’t disappointed. After enjoying the original BLADE RUNNER, I was ready to be dissatisfied. Not the case.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Epic cinematography and a nuanced performance by Ryan Gosling — he is so subtle as an actor",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Some of the best cinematography I’ve ever seen. Haunting film score. Absolutely one of my favorite films.",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Boring and too long, easily could have been 1.5hr or 30 minutes 🤣",
    "date": "2025-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This film hits in all the right places, it’s not just a movie about a depressed man in a world that’s far gone, but a man that wants to live a life that’s worth it.",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of my favorite all time movies. Beautifully shot and an incredible storyline.",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fantastic visuals. A worthy follow up to the original.",
    "date": "2025-10-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Blade Runner 2049 is a visually stunning sequel that expertly builds upon the foundation laid by the original. The film's direction is impeccable, its visuals are breathtaking, and its futuristic world is meticulously crafted. While the pacing maybe slow, fans of the original and sci-fi aficionados will be thoroughly enthralled by this cinematic experience.\n\nGrading: A+",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 02 hours, 43 minutes, and 47 seconds!!!!!!!!!!!!!!!!!! Rated R for Nudity, Language, Some Sexuality and Violence!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $91,500,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I found the original great overall but often tedious, like this one. It is aided by a plot that makes sense and keeps on building. The setting and mood are marvelous, resembling 2001: A Space Odessy in their grandeur.",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I thought the movie was extremely dry, but that’s just my opinion",
    "date": "2025-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the few sequels that is as good as the original.",
    "date": "2025-10-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Some continuity with one of the first installments at least (watched only \"The Final Cut\"). But SO many questions left unanswered as a viewer and so much wasted film time that could've been spent answering them.  Instead this was all about CGI and set design display instead of plot or character development.  Gosling is beautiful as always and that was the only draw to invest the now wasted rental money and time.  Be wary of the tomato and popcorn meters in this case... or you, too, could be led astray!",
    "date": "2025-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I read through some other people's thoughts, and I don't know if they were watching the same agonizingly slow movie that i saw. I watched this bc I liked \"Her,\" and by contrast that movie was thought-provoking, interesting, fun. This one also deals with some of the same issues of what is real, what is human, and so on, but it just went on and on. So many choices were made that slowed things down to a snail's pace. By the end I wanted all of them to die, I didn't care who was whose son or daughter. And why does Harrison Ford keep hitting everyone to no good purpose? It was almost slapstick (like a goof on his career?), but hard to see that was intended. Also, Ryan Gosling is an attractive actor who seems to be able to act in some movies, but here, he is \"not\" acting for long sequences. This adds to the lack of emotional engagement. Anyway, the whole thing was a complete disaster, and how it gets 88% fresh is beyond me. Ugh.",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Great follow-up movie. What a cast, all excellent actors. Great story, plot.",
    "date": "2025-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Excellent movie and sequel but maybe not as impactful on a 2nd viewing.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Incredible sequel. Felt like a Ridley Scott film, almost as good as the masters science fiction.",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "this was a peak movie by far the prettiest ever",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A masterpiece in every sense of the word. The acting, the visuals, the story. It’s damn near perfect. I like the original blade runner but this is so, so much better in every way. (Except the score) Ana de Armas should’ve been given an Oscar for her performance as Joi. The peak of modern cinema. 98%",
    "date": "2025-08-13"
  }
]