[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Don't leave the room!!!. Pay attention!!! \nNever saw it coming. The last 45 minutes.....\nWOW .\nOne question, how did the police find the trailer in the woods??",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This movie is set up so clunkily, but that does make it feel somewhat unsettling.  If you stick with it, there are some great twists that make this dark tale come together.",
    "date": "2025-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Pretty good crime thriller, surprising twist ending as well is cool.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Really original story, very spooky and twisty.",
    "date": "2025-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Panalo. Di mo aakalain kung sino o anu ang kalaban. Sa una, manghuhula ka kung supernatural o tao ang gumagawa ng mga kababalaghan. Pero dahil sa magaling na pagtagpi tagpi ng kwento, magugulat ka sa big reveal ng twists. Kumpleto sana ang kwento kung sinabi ang dahilan kung bakit ginagawa yun ng culprit",
    "date": "2025-07-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The first half was slow and mysterious, and then the second half came like a roller coaster. Everything made sense and it was very clever storytelling. I definitely didn't see it coming and it was such a good surprise. I loved it. It's the perfect thriller!",
    "date": "2025-04-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A great surprise and big twist I didn't see coming",
    "date": "2025-02-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "They've got a huge house, an 'empty' bedroom...why is he sleeping on the couch?",
    "date": "2025-02-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "one of the worst ways i’ve seen a movie reframe itself. once the perspective changes halfway through, the filmmakers don’t trust the audience enough to interpret what is happening, so they literally show you everything again to make sure you understand. the ending spends so much time holding your hand on plot reveals that you already guessed 30 minutes prior.\n\nthis doesn’t even cover how convenient and contrived the narrative is. it’s a shame because there are some really unique concepts here that could have been interesting, if handled correctly. \n\nadditionally, this is one of the worst movie scores in recent memory. annoyingly repetitive, overly ominous and over dramatic.",
    "date": "2024-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Hard not to see Hunt's frozen face. Not good performance of her either. Script is sometimes silly. I wonder what did 75% of reviewers saw in this movie.",
    "date": "2024-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Scary and interesting. Made different wasn't gory.  It was suspenseful. Wait til the end please. It's a different scary.",
    "date": "2024-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best film I’ve ever watched you’ve got to make sure you watch till the end it was one of the best horrors I’ve watched if even watch it again love the storyline and the way it was played",
    "date": "2024-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Had several unexpected and unique twists only to end up becoming formulaic and obvious in the third act.",
    "date": "2024-04-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Starts out slow but the story gets better and better towards the end with really good twists and turns!",
    "date": "2024-03-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I See You presented a good but disjointed message.  Trying to do too much.",
    "date": "2024-03-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I recently watched \"anatomy of a fall\" because it was one of the 2024 nominees for \"best picture\" at the academy awards. \"I See You\" was ten times better. Both are crime movies. Loved this movie, especially the twist. I've always been proud of the fact that I can predict movie endings and was happily proved wrong (this time😉)",
    "date": "2024-03-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A very slow and very boring movie at first.  The second half was way more interesting with all of the twists and turns, I did like the whole revenge plot it had without actually  using it as the focal point of the movie.",
    "date": "2024-02-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This was surprising good. Not at all what i thought it was going to be, but I loved it. It's scary but not too scary, it's not at all predictable and it keeps a great pace. Helen Hunt is less than great but the rest of the cast does a great job. I highly recommend.",
    "date": "2024-02-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "a twist suspense history...well done",
    "date": "2024-02-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Solid...............!",
    "date": "2024-02-09"
  }
]