[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The film takes place entirely in a single environment, which creates a claustrophobic and distressing atmosphere. Joe is trapped in this space, limited to making calls while trying to solve a complex case: a woman was kidnapped by her husband, a man with a history of violent crimes. For much of the film, we are led to believe that Henry, the husband, is a maniac responsible for murdering his own son and kidnapping his wife during an outbreak. However, the script surprises us by revealing that, in fact, it was Emily, the wife, who committed the terrible act of taking her son's life. This movie brought me a frighteningly tense feeling.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Incredible. The twin brother of Enemy",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I slept during this movie.",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Ive signed up for RT to leave this review. Never heard of this film, but loved the filmmakers ability to create such a riveting film so minimally. Truly an inspiration. An anxiety overload but amazing film.",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Jake Gyllenhaal does an amazing performance throughout the entire film. Unexpected plot twist. Wasn't biggest fan of the ending and feel like the whole Jess and his child subplot could've been expanded on so we can have a lot more empathy for Joe and understand him deeper. 6.5/10",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "From the outset, The Guilty pulls you into a riveting and unusual storyline, with the spotlight fixed almost entirely on its protagonist, Joe. Midway through, it becomes clear that this is a character-driven piece, relying on a tense and mysterious phone call to keep you hooked. While the suspense dips slightly toward the final act, the plot ultimately unravels in a wholly unexpected way.\n\nThere’s no violence, no flashy action- just sharp dialogue, compelling performances, and a single, claustrophobic setting that heightens the drama. Jake Gyllenhaal delivers an exceptional performance, carrying the film almost entirely on his own while sparking the audience’s imagination.\n\nIf you appreciate films that keep you guessing and perched on the edge of your seat, this one is well worth your time.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The Guilty is basically a one-man show, and Jake Gyllenhaal is the reason to watch. The movie is set almost entirely in a call center, so the directing and cinematography are pretty much nonexistent, everything feels flat and uninspired, like they just turned the camera on and left it running. There's barely any visual tension, and it's obvious the production was working with a tight budget or just not trying.\n\nBut Jake delivers, and honestly, he carries the whole thing. His performance keeps you locked in, and he really makes you feel the stress and panic as things spiral out of control. The script itself isn't bad, and there are some decent moments, but without Jake, this would have been a forgettable experience. If you're a fan of strong acting and don't mind simple setups, it's worth a watch just for him. Otherwise, it's pretty average.",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Jake Gyllenhaal is solid, per usual, and since he’s basically the whole movie, it’s a good thing he is. It’s not quite as strong as the original, but most remakes aren’t. I’m not sure why the reviews are tepid, but I would wager it's because people preferred the original and weren't stoked to see a Gyllenhaal Hollywood rehash. But this version gets a lot right, and it sticks super close to the original.\n\nOne new element is that it roots itself in early 2020s Los Angeles, with fires in the air and protests on the ground. That backdrop adds some weight as backdrop to the intense character drama.\n\nWhat really makes this story succeed is that it centers on a character who seems like the protagonist -- albeit a flawed one -- but slowly reveals himself as the problem. The shift in perspective lands. It’s a tight, tense watch, and the character arc really works.",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie is pretty ok. What makes this movie a must watch is Jake Gyllenhaal. His performance is absolutely phenomenal from start to finish. The guy puts on a Master Class.",
    "date": "2025-06-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "{Gyllenhaal's} unhinged turn that you can practically see mentally come apart at the seams. It’s one of his best.",
    "date": "2025-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Heath gave a phenomenal performance in \"Brokeback,\" but Jake keeps bringing it role after role.  He never phones it in, and this is kind of a ridiculous movie.  But he keep it watchable.",
    "date": "2025-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Broken People would have made for a much better title. The entire movie is Jake Gyllenhaal working 911 calls with an attitude and some undisclosed baggage. His evolution from angry and unrepentant slowly transpires during the film as he finally discovers what it is to be a cop.",
    "date": "2025-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Jake sucks. Laughable when he tries to get emotional.  Fell asleep twice.  Forced to watch the ending because my husband has issues with closure.  Oh the fake cry at the end. 😂",
    "date": "2025-04-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The is the worst, most tilting movie I’ve ever watched in my life. The main character says the wrong thing every time he speaks. If you want to be annoyed for 1.5 hours then you’d love this movie!",
    "date": "2025-04-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Jake made this movie, completely sold me despite a thin plot. Could see what was coming which meant the last third started to lose it’s umph and the tension faded instead of building.",
    "date": "2025-03-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent thriller - I highly recommend everyone to see it.",
    "date": "2025-03-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "While there may be an ethical code that possibly wasn’t fully considered and without having seen the original, what really elevate this American remake to standout as top tier in its categorization isn’t just the thrillingly executed turns but Gyllenhaal’s raw resonance with quite an emotional weight that affectively reverberates. (B+)",
    "date": "2025-03-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "standout performances throughout the cast",
    "date": "2025-03-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Phobic film that is just one place with intense interaction with other characters. In the end, you find out why he is to blame.",
    "date": "2025-03-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I started watching this movie on Netflix.  I remembered it from ads for it a few years ago. I began watching it. I was confused at first because I didn't understand what the 911 operator Joe was going through. The movie did not make it clear in the beginning.  Only at the very end did I even put it together about Joe. However I was still in the dark about a lot of things. So I was confused about Joe's personal issues he was going through. The rest of the movie was interesting with the dialog between him and a woman and having to do with her baby. I don't want to give the ending away, but the movie is worth a watch if you have nothing better to do. But for me that is about it.l",
    "date": "2025-02-26"
  }
]