[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is garbage! Way too many cuts for the most basic 'action' moves, even running. This would/could have been better as a cartoon. That's how ridiculous it is",
    "date": "2025-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Least effort in any origin story. Its as if someone had an idea to use a flower as a female assasin's calling card & basically stopped there.   I will say the set pieces were nice.",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I actually liked it … strong female character !!! Good story",
    "date": "2025-06-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Sakto lang. Napaka common na kwento ng isang revenge movie. Parang di lang mag connect un mga naunang nyang pinatay sa pinaka mastermind na pumatay sa pamilya nya",
    "date": "2025-06-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Ridiculous, Cmon Man!",
    "date": "2025-03-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The need to suspend disbelief starts early in this one, and at some point it becomes ludicrous. But that's OK...the basic shoot em, get even with bad guys formula works for an OK diversion. And the end revenge scene is clever.",
    "date": "2025-01-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Decent action flick. Good watch as long as you're not expecting anything more.",
    "date": "2025-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A decent action film about a woman who plots to get revenge on the men who killed her parents in front of her when she was 9.  Saldana excels in the role managing to somehow seem stoic and vulnerable at the same time.  Worth a watch IMO.",
    "date": "2025-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I gave it a 2 and a half star (fairly good) rating till the last 10 minutes. You'll see. I decided 3 stars (good) were in order. She's excellent. The script? Besson could do better than this cliché-packed flick. \n\nStill, sit tight until those last few minutes. Then you can go, \"oooh yeah.\"",
    "date": "2024-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely love this movie. (PERIOD)",
    "date": "2024-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Intense and riveting. Once you start watching, you can’t stop. The second time I watched was just as highly enjoyable as the first. Every thing about this movie is just perfect, with an incredible performance from Zoe Saldana as a bonus.",
    "date": "2024-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Pure simple fun to watch with a great cast",
    "date": "2024-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Sometimes I wonder if I’m watching the same movie as the critics, I thought it was great! From start to finish awesome action and chase scenes, camera work, good story. Sure typical plot for a revenge story but I thought the cat-and-mouse action set pieces were above the average.",
    "date": "2024-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Boring and not well depiction of Colombia",
    "date": "2024-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Zoe Saldana's action/assassin scenes notwithstanding, this is a pretty dumb movie. It's like they didn't know which clichés to use, so they just sprinkled bits of them throughout the movie. Girl witnesses her parents murder? Check. Out for revenge? Check. Hired kills? Check. Tries to live a normal life with a love interest? Check. Cat-and-mouse with the feds? Check. None of them are developed. Threads are either dropped for no reason or quickly wrapped up. Zoe deserved better.",
    "date": "2024-06-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Although it's a good and exciting movie there's some very dubious elements going on. How precisely did the FBI link a photo of a quarter of her face to her. It's cheats like this this that reduce the quality of the film from a much higher grade.",
    "date": "2024-04-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "3 & 1/4 stars.  Nothing new in this revenge film except that the person seeking said revenge is a little girl.  Within 15 years she begins to live out that revenge and gets what she wants.",
    "date": "2023-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie is great. I'm surprised it's not getting the same accolades as the Equalizer, Jack Reacher, John Wick (although John Wick is much more violent). This shows a woman who has been traumatized and how she takes a trauma and decides not only an act revenge for her family, but also how she self destructs in the process. It has  a great storyline, great action, and good fight scenes.",
    "date": "2023-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A mind numbing revenge action movie that makes me cringe within the first 30 min of the films run time.",
    "date": "2023-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "La época de los 2010's fue una muy productiva para las películas de acción de bajo presupuesto con un prota medianamente reconocido, la época de los Jason Statham, Aaron Eckhart o la consolidación de una de las franquicias más importantes cómo Rápidos y Furiosos, y de esta oleada de películas de acción es de donde sale \"colombiana\" de Olivier Megaton, un director con una filmografía centrada únicamente en la acción, el director francés después de esta película tuvo grandes éxitos cómo al 2da y 3ra parte de \"Búsqueda Implacable\", pero lamentablemente su poca experiencia en este género se ve impregnada en la película.\n\nLa trama de esta película se centra en la venganza, es el hilo conductor que guía esta historia sin complejidad o momentos expositivos, la película en sus casi hora cincuenta de duración, es pura acción, que afronta el personaje de Cataleya tanto física como internamente. La película tal vez resulto ser un poco más pretenciosa de lo que el presupuesto podría dictar, ya que la cinta realmente cuenta con buenas ideas, pero parece que no supieron cómo técnicamente lograrlas de la mejor manera, siendo la más perjudicada la escena de apertura en Colombia. Es visualmente borrosa, parece que Amandla Stenberg no tiene gravedad, los cortes hacen que perdamos la espacialidad del escenario en sí; Y entiendo que así se pensara en un inicio, el desorientarnos a nosotros cómo lo están los personajes que persiguen a Cataleya, pero cómo escena individual es muy básica. El personaje de Cataleya es interesante aunque simple en su sub dialogo, es un personaje con un hambre de venganza imparable, pero con una debilidad muy plausible, \"El Rencor la ciega\", error que le hace perder todo, en estar obstinada con un objetivo hizo que no midiera las consecuencias de sus actos; dónde si, si la policía dio con ella fue por una pura casualidad en la que no tenía nada que ver, pero el que las cosas acabaran cómo acabaran fue su responsabilidad. La película cómo casi cualquier película de acción Bad-Ass tiene escenas sin mucho sentido o contexto, pero no me parecen lo suficientemente escandalosos para sacarnos de la película, la trama es simple y y siempre nos mueve de punto A a punto B, pero es disfrutable, realmente no se siente su duración, es muy dinámica y a pesar de no tener las mejores escenas de acción es entretenida. Que ahora podemos disfrutar más cómo una carta de amor a las películas de esa época, tanto en el diseño de producción cómo la iluminación y saturación del color en la imagen, esta película es una remembranza al tiempo en el que se grabó. En dónde si le rascamos más profundo a la trama podríamos encontrar una crítica hacia lo que obliga a las personas a la migración y cómo las personas que crecen en un entorno violento tienden a seguir los mismos pasos.\n\nEl montaje de Camille Delamarre en las pocas veces que se presenta el entorno antes de la acción son buenos, pero durante la acción son demasiado básicos, lo cual sorprende teniendo en su filmografía una película que lo hace muy bien en ese sentido y es el espíritu de la misma cómo lo es \"Fortaleza Prohibida\". Olivier Megaton tiene una dualidad en su trabajo por momentos es bueno y por otros peca de ser muy simplista, cómo ejemplo del talento de este director está la fabulosa escena en la que el FBI va al departamento de Cataleya, se crea un suspenso auténtico y la escena es muy dinámica, es una escena de acción realmente buena, o un poco debajo esta la escena de acción de la prisión, igual tiene todos los componentes y se culmina con un cierre favorable. Pero si se tiene que contrastar con la pelea del baño en el punto climático de la cinta, es una escena con una sobre saturación de cortes, en las que se pierde la intensidad que venía construyendo la narrativa. Pero a pesar de las limitaciones técnicas de la misma, si logra crear las emociones que una película de acción nescesita transmitir, que con una fantástica Zoe Saldaña es más fácil seguir interesado por el cómo se desarrollará la cinta; con un toque latino que la hace distinguir del resto de miles de películas de acción que se fabrican cada año. \n\nColombiana a pesar de sus limitantes es disfrutable, el personaje de Cataleya es empático y genuinamente te preocupas por lo que le pase, y que te interese el cómo va a salir del problemón en el que se metió. Esta cinta a pesar de ser una película de acción \"normal\", sabe cómo distinguirse.",
    "date": "2023-05-27"
  }
]