[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Cutesy… love the story of the grandson reconnecting with his family and their heritage.",
    "date": "2025-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Such a cute family film!",
    "date": "2024-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The movie passed the time on a stormy Saturday night so that was fine.\nMy main peev with it, beyond the poor animation quality, was that the young cub somehow survives the whole stint of protection in the family barn without a single meal.",
    "date": "2024-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "So cute! Solid family watch. Kids loved it.",
    "date": "2024-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "good flim, charming, lots of heart",
    "date": "2024-04-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Chupa is a perfectly fine film that will be sure to satisfy many with its simple but charming story.",
    "date": "2024-03-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Me: If I were having the same adventure as Alex then I would also would willing to go and will be very glad we did\nMy Rioul ( Taichi ): Chupa is honestly the most lighthearted and emotional experiences & one of our new favorite movies of our lives. It dose start a little slow with the slow opening & that farmers market is a little awkward but overall this still now one of the best movies of this year. When we continue the movie especially with it's beautiful world building, amazing visuals & some of the most memorable characters we ever see in in a while \nMy Pikachu: I wouldn't say the best movie of 2023 but it's definitely in the top 5. And it definitely worth checking out if you're able watch before the end of the year or not as well as especially if you really wanna goes the wonderful Mexico\nMe: And that would also get Animat seal of approval more then you'll even know just like Nimona, Trolls Band Together, Dungeon & Dragons The movie and so many more other surprises for all of this year as well especially Wonka 😸+🤩( 🍫Willy Wonka's origin story🍭). Not that Animat would have know back then before the backlash came to be on him😤\nMy Ribombee ( Tinkerbell. Jr ): And one more thing\n✨😻🌟HAPPY🤩NEW🤩YEAR🌟😻✨\nChupa's scores:\nStory: 9.5/10\nVisual: 11/10\nCharacters: 9/10\nOverall: 11/10",
    "date": "2024-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The best way do describe this move is one hour thirty of things that happened. It wasn't a good movie as such, the emotion was barely present, the plot often forgot itself with beats that were entirely pointless and child actors that put acted the adults. But would I recommend it, kind of. It's insane and good fun to watch with the family. If you're looking for this movie but better watch E.T. But if you want some absurd comedy and really pretty shots then give it a look.",
    "date": "2023-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Heartwarming story for the whole family. Cute 'monster' too :)",
    "date": "2023-12-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie was absolutely disgusting. It's full of cliches and cringy scenes. The characters are annoying and unlikable. Also portraits stereotypes of latinos. The acting skills are HORRIBLE. And it's easy to see that chupa is a 3d modeling.",
    "date": "2023-12-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "An instant classic. Such a well directed and produced film. The actors are fantastic in their roles and I left wanting to see more. Overall a great movie. 🍿",
    "date": "2023-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It was a fun movie for the family, try not to over think it and you'll enjoy the show.",
    "date": "2023-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This was a cute movie for the whole family. Chupa was adorable, and the kids were nice kids trying to do the right things.",
    "date": "2023-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Eu gostei da história, pois é familiar - pais, filhos, avós podem assistir juntos sem qualquer constrangimento.\nMeus poréns ficaram quanto à qualidade (resultado final) visual tecnológica dos animais (os Chupas) em determinadas cenas, e quanto à real função dos animaizinhos: eles mataram ou feriram as cabras em algum momento? Eles curavam as cabras feridas?\nMas gostei muito do filme e da positividade mostrada.\nMuito jóia e futuramente assistirei de novo.",
    "date": "2023-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "idk; i can't really pinpoint what i didn't like, but i just didn't think it was that good. it's a fine movie to watch with your family/kids, but a little cliche or something otherwise, idk.",
    "date": "2023-06-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Very campy movie, odd mythical creature",
    "date": "2023-05-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "cute story for family time. very good message about preserving one's own culture!",
    "date": "2023-05-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Chupa is a heartwarming tale of friendship and adventure that takes inspiration from the classic film E. T. It's refreshing to see Christian Slater back on the big screen. The movie follows the story of Alejandro, also known as Alex, played brilliantly by Evan Whitten, who is struggling to cope with the loss of his father to cancer. Living in Kansas City and attending Lakewood Middle School, Alex keeps to himself and is teased by his classmates for being different. But when his mother takes him on a trip to San Javier, Mexico, Alex discovers a new world of experiences and people, which helps him to overcome his grief and start afresh. In the film, Alex befriends a Chupa, a mythical creature known as the Chupacabra who has been separated from its family due to human intervention. The film is not only a moving story of Alex's journey to acceptance, but it also sheds light on how humans often assume things about unknown creatures and how that can lead to negativity and hatred. As per folklore, Chupacabras are believed to attack livestock and drink their blood, but in the film, Alex learns that they are misunderstood creatures. Chupa showcases the beauty of San Javier and the unique Mexican wrestling style of Lucha libre. It also highlights the importance of staying connected with our families and roots, wherever they may be, to maintain our cultural identity and pride. The film is accompanied by touching songs that blend perfectly with the story and serve as a reminder of the importance of cultural diversity and traditions. Every aspect of the film is thoughtfully crafted, making it an enjoyable watch for all ages.",
    "date": "2023-05-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "its good and great with Mexican culture and acting",
    "date": "2023-05-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This was a good attempt at a family movie. I would have preferred a little more plot and a faster pace but it was worth watching.",
    "date": "2023-05-04"
  }
]