[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is a perfect example why you should take reviews with a grain of salt, after all who are \"critics\" but people with their own personal likes, dislikes, opinions. This movie was an absolute delight from beginning to end it's not just a broke comedy or road movie but in an insightful movie about family relations as Missy as they can be it's a great movie I highly recommend",
    "date": "2025-03-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Baseado em fatos reais, por aí já sabemos que \"senta que lá vem história e muitas lágrimas\" e aqui é bem isso, as lágrimas eu guardei para o final, mas o aperto no peito a todo momento, ficamos a pensar nas pessoas que amamos, e isso dói... Um filme simples e lindinho, uma linda homenagem, um amor-perfeito, romance interrompido pelo trágico...",
    "date": "2024-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Sadly, it seems like someone had a good concept for a story but no real way to make it stick. Spoilers ahead... If the whole movie wasn't already spoiled, as in, rotten. Anyway, the son is left by his father tells him on his deathbed he has a really good reason for not coming back. But it wasn't a really good reason. Make the two sons solve a riddle to only see a video of the dead father giving an explanation... Couldn't he have just told them before he died versus make them traverse the US? Oh, and sure, the Mexican mom didn't want the father to come back because he cheated. But I'm sorry, the first son is 35 now andthe father obviously has the funds to travel, he did so to create a riddle just before he died. So what was the excuse for not returning to Mexico once the first son had aged out and the 17 years thereafter. Sorry, plot holes throughout pandering for heartfelt touches. None from me.",
    "date": "2024-01-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I needed a comedy and stumbled across this film on Amazon Freevee. Well, it's *billed* as a comedy, but it's really so much more than that. It's got serious emotional beats that offer surprising depth. It speaks volumes that critics didn't have much love for the film, but the audience score is pretty good. I ended up buying it on iTunes just so I could access the director's commentary. Luke Greenfield put a lot of thought into everything you see, and it starts with the cast, which is excellent. Worth a watch if you don't mind getting hit in the feels during a \"comedy film.\"",
    "date": "2024-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I really enjoy the movie in saturday morning",
    "date": "2023-06-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I mean it was better than I thought and def watchable but also 2.2",
    "date": "2023-03-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Driven by cliché to generate laughs through comedy and touch hearts as family drama unfolds while taking it further by providing social commentary with reality-based perspectives. Any of that should guarantee a successful formula stirring pure enjoyment, but it turns out it was ridiculously plotted whilst overrun by stereotypical cynicism that leant more unbalanced, despite actually aligning in agreement as reflection of yet being proven otherwise. That's mainly social underlining truth with zero hefty justification for the narrative structure, but addressing immigration seems to be the only relevant insight to absorb as more effective over the rest of the characterized plot's seeming excuse just to get on with an important subject in an aimless matter. The only successes amid the storyline are understanding and bit funny. (B-)",
    "date": "2022-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I thought it was a great movie. Not 5 star but def 4. Fresh take on a real subject. Pretty cool 😎",
    "date": "2022-06-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Meh.  Entertaining enough, but nothing to write home about.",
    "date": "2022-01-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The American poor acting just ruins the movie shame it had huge potential",
    "date": "2022-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A really good emotinal movie for Luis Gerardo Actor, maybe could be better but is a comedy 👍🏻",
    "date": "2021-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Es una película del tipo road trip en la que dos personajes completamente opuestos emprenden un viaje el que los hace sacar lo peor de ellos mismos pero al final terminan unidos.\n\nEs una buena comedia que no tiene que estar constantemente recurriendo al humor de pastelazo para hacer reír al espectador, lo cual es algo que se agradece mucho.",
    "date": "2021-12-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Good wholesome movie funny and sad at the same time",
    "date": "2021-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Oh my god...such bullsh*t. Just utter utter bullsh*t. It's so bad I have no more words.",
    "date": "2021-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The critics are harsh. Guess I'm not \"evolved\" because I really enjoyed the movie. Of course most movies nowadays are predictable so can that even be a critique anymore. The movie was heartwarming and I love the theme of forgiveness & understanding. I think it's always a reminder for me when I see it onscreen to be more open. Loved the backstory of a Mexican immigrants journey, made it a personal. I haven't seen this addressed in a lighthearted but still real way. If you are not anal, you should watch this. You will enjoy it",
    "date": "2021-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "A movie where a father makes lots of excuses for being a bad father and abandoning his family. Tries to take a simple story and make it sound complicated. Also, if Americans acted like this in another country they would be called ungrateful and rude.",
    "date": "2021-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved this movie.  I needed something to make me feel good and it fit the bill.  Nothing complicated about it.",
    "date": "2021-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "For a comedy and sappy movie I con say it's a movie all families should watch. To inspire those \"slacking\" out of shape families to become more united and bonded . And as far as all those poor critics out there that views this movie. Haha well let's just say your review isn't the only thing poor about you. #heartless #bestfamilymovieoftheyear",
    "date": "2021-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie was ridiculous. The father in the movie was awful to his two sons.",
    "date": "2021-08-27"
  }
]