[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Bad acting and just bad graphics everything looked faked like a cheap commercial.",
    "date": "2025-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It almost feels like this one should get an even higher rating, yet it was a bit on the slow side and there was a strange feeling of disconnect between the ending and the story afterwards of the protagonist raising 4 children - must have been foster children, but where how did they come into her life? The mountain scenery is always a winner for me and though understandable that there wasn't much talking - these are people who have suffered losses and live a lot within themselves, trying to make it one more day - the dialogue there was, was repetitive and mostly \"come on\" and cursing.",
    "date": "2025-04-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The film is so slow, love the visuals and admired her strenght but definnitely not rewatching",
    "date": "2025-03-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This was a surprisingly uplifting, beautiful movie...you never know how your kind gesture, whether big or small, can alter a person's life and affect their future. I'm happy I watched this.",
    "date": "2025-02-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It had its moments. There were a few scenes though that made you suspend logic. A lot of the backstory related to both characters could have been added for greater affect. Still, it was entertaining and relatively brisk.",
    "date": "2025-02-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Lifetime movie quality.  Movie would have been a lot better if Naomi Watts was solo.  Character \"John\" in the movie ruined it for me.",
    "date": "2025-01-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Thank you so much.^^! \n\n@}>--->>*",
    "date": "2024-12-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Its very fine movie for a rookie director",
    "date": "2024-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Really loved to see the survival movie. Very good movie 🍿",
    "date": "2024-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was a really good movie. Very instructive. I really liked it. I will watch it again later.Also, I really like the small details of the movie.",
    "date": "2024-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Being based on a true story I was expecting more. There were lots of drawn out boring bits & the dialogue between the characters was strange and not realistic in my opinion. I thought they could have done a better job with the special effects - the blizzard was pretty lame. Not a fan generally of Naomi Watts’s work & this movie was no exception.",
    "date": "2024-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Unbelievably slow! Well shot, the rest is terrible",
    "date": "2024-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This is a unrealistic, badly acted film.. Even the most basic scenes and the protagonists use of equipment is non sensical.. Those dam walking sticks not used... But why have them in a mountain accent? . Headwear, head cover, goggles, gloves, water in a bottle that is there and then it isn't.. Failure to use proper natural shelter..  cringe almost laughable.. and what's with the guy in shorts?",
    "date": "2024-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "If they'd stuck to the original story it may have been an interesting watch, they added so much that frankly did not happen, spoiler...he didn't drive off, he sat in her car warming up for a long period...they have also never met since....just boring",
    "date": "2024-05-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I love Naomi Watts mainly because of Mulholland Dr. Sadly everything else she’s done was never up to par for me. And as the years progressed it got even worse. This one is no exception. You could tell from the beginning it was going to be bad. The beautiful and grim natural setting couldn’t save it. I really tried to give it a chance but after 20 minutes I got tired.",
    "date": "2024-05-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love to hike and did that portion of the trail, so was drawn to it.  It was a taxing movie because all the particulars are unclear, but they come all together if you have patience.  Very believable and acting so good that there is a lot of frustration with the action. But well worth it.",
    "date": "2024-03-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Naomi Watts is fabulous in this harsh story of rescue and survival in the most harshest of weather conditions and environment. There were a few things in the story line that didn't make sense, but nevertheless I loved it! And glad I got a glimpse into such an amazing story.",
    "date": "2024-03-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I hate it when characters need to be dumb for the movie to happen.  It becomes both laughable and very frustrating to watch.",
    "date": "2024-03-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The storyline isn't to deep but it captures the character of the lead person. It is a remarkable story and well worth watching. It isn't a film about a dramatic escape, there is much more to the story.",
    "date": "2024-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Movie was slow and boring to watch. Couldn't understand the point of it all. Would not recommend",
    "date": "2024-03-10"
  }
]