[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 01 hour, 54 minutes, and 11 seconds!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated R for Language Throughout, Drug Use and Some Sexual References!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $43,000,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Brilliant iteration of real events, with some added Hollywood, naturally. Amazing exactly how the system works. Great story, well written and Todd Phillips did good bringing this to screen. Whole cast excels convincingly in character. Lots of wheeling and dealing, drama, dilemma, plot twists, suspense, action and it does have that \"real life\" feel to it. Very well done and very entertaining. Oh, and definitely not a comedy ...",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very good film.  I got the wrong impression of it; it was described as a Jonah Hill comedy.  It is not a comedy.  It is a serious movie about a serious subject; it presents information about arms procurement and war profits made from it how much it by whom.  Whoever wrote this movie knows the subject very well.",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Tthe whole thing has a breezy, surprisingly low-stakes \"isn't the system really at fault here?\" feel to it. Which makes War Dogs an enjoyably goofy, if rote, look at the banality of war profiteering.",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Eu fui assistir achando que era anjos da lei, e não gostei do começo e tirei.",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great movie, right up my alley. Has the vibe of American Made with some similarities to Catch Me If You Can and various Iraq war movies. Teller and Hill are really good together. It is quite funny and very interesting. Ana De Armas is really great in it. Solid movie.",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best movies of 2016.",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Big fat whale johnah",
    "date": "2025-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I liked it, but I got the sense, that it is trying so hard to be funny and just doesnt succed, because its too serious. For example, Jonahs laugh is hilarious, but seems a bit out of place, because the rest of the movie is not. In my opinion, either make it dead serious, or as ironic as possible. The mix doesnt work.",
    "date": "2025-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "There's something intriguing about average guys with desk jobs spontaneously transforming into literal gun runners through war-torn Iraq.",
    "date": "2025-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The story behind War Dogs is good, but the movie is not. The shady dealings part is downplayed in favor of the cheaper aspects that made up Wolf of Wall Street and Superbad.",
    "date": "2025-06-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very fast paced movie with excellent acting by Hill and Teller.  It comes across as a comedy at times and quite a brilliant one too but the dramatic twists bring you back to the serious material at the root of the movie.  Never a dull moment!!",
    "date": "2025-05-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing movie, damn J***...",
    "date": "2025-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "While the chemistry between its two leads is solid, it looks nice and has a couple of cool segments, War Dogs is a largely forgettable and uninteresting film that is further brought down by uneven pacing, some poor characterization and a lot of dialogue that could have been worked on more.",
    "date": "2025-05-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "There is loads of great albanian actors, don't need to hire romanian and french actors to play albanian guys",
    "date": "2025-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A Biopic comedy drama. Excellent editing and it's really well made all around. The structure is pretty much Goodfellas and Wolf of Wall Street mixed together. Todd Phillips is clearly a big fan of Scorese in general in his works. Hill is phenominal in this with great comedy and serving as the \"Tommy\"/\"Micky\" character in this Scorese style flick. He's funny, dangerously psychotic, and an idiot. This does a great job making the technical jargon of Arms Dealing and Govt Regs for dealers easy to understand. The plot expose is really sharp and the dialouge in general is really good the whole way. Plenty of dark comedy in this too. It's funny and fasinating. The one issue here is Miles Teller. He's good but his character is kind of on the boring side a bit. He doesn't become hooked on drugs, he isn't a psycho, or a criminal himself like how other Scorese style films main characters usually do. So when we do explore his life in between events it's a bit boring but it is important. His wife and all is the stereotypical wife who is left in the dark and eventually leaves and may or may not come back with the kid. But she is just alright and isn't really given any serious character and kind of an afterthought. But it's important to the plot and Hill does a great job making Teller''s character interesting he's given great dialouge for the narration to boot. Anyone who is a fan of Scorese pics, the director, the real events behind this, comedies, biopics or war dramas should check this out.",
    "date": "2025-05-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Film is great. One of my favorite stories told through a film. Always a go too watch when i cant find anything.",
    "date": "2025-03-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie , kept me entertained the whole 2 hours.",
    "date": "2025-02-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This film is class, humorous, aggressive and inspiring",
    "date": "2025-02-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A comedic touch on the other side of military conflicts.",
    "date": "2025-02-23"
  }
]