[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Utterly ridiculous story line with strong leads who just about carry it across the line. Overall, a pleasant and often charming film. 6.5/10",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "One burning question: Owen Wilson, why? I love him, but this is not the right project for him, IMO. The sript is flat and predictable with meh dialog; there is no room behind the subpar performances of his costars for him to shine. Not sure, but maybe better editing could have helped. Pacing was way off. The stage performance sequences were too long and interrupted the story development. Much of it should never have made final cut. The best thing about the movie is that it is streaming on Netflix so you can simply fast forward past the boring parts. However after a few times, even the most die-hard movie watcher like me finally had to click out way before the end. It just never got better. It lacked entertainment value and gave you no one to root for.",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Whilst it pains me to write negatively about our queen JLow...  I can't say watching this was a good choice for 2 hours of my life. I found it shallow and cheesy and I wouldn't even be able to categorise it in my favourite genre 'evening filler'...",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I was really taken back by the lued dance sincqunce with the girls dressed in nun type apparel was disgusting, disrespectful and I can't believe that any of the religious people didn't even say anything about. But it goes along with all the disgusting photos that have been posted by or about her lately stating she is showing off her figure which by the way isn't that great and doesn't  need to be  seen by everyone.  Your image is just flushed deeper down the toilet every time your do these immature things.  So sad.deeper",
    "date": "2025-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Ummm demonic... nuns half naked, sexualizing \"church\" as her performance on stage.how is that normal lol ... it's not just a movie it's stupid.",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Worst movie ever, she cannot sing or act , even no chemistry between them..just watch 10 minutes  and turned it off..she should  retire",
    "date": "2025-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The movie we need right now. Super cute, no crazy twists or turns, and a gentle pick up and warmth for the heart. Seeing these two also sparks good throwbacks to their other films and loved seeing them together! Cute little rom com to keep",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "All the characters really meld. It is a very good romcom.",
    "date": "2025-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie was very cringey. I don’t think anyone did a good job playing these roles and the acting wasn’t good. Felt like I was watching a sitcom, they don’t have any chemistry as a couple and it just throws off the movie. The plots also very silly.",
    "date": "2025-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Cute, catchy movie but predictable. Jennifer Lopez is a famous singer in this movie (as she is in real life). She plans to get married to her boyfriend, who is also a famous singer, during a concert after they sing their song \"marry me\" together. But right as she is going on stage, she notices that everyone around her is looking at their phone. She takes her manager's phone and reads the news: her singer bf is caught in a video cheating with her assistant. She doesn't marry him on stage anymore. Instead, she says she wants to do something different and points to a man in the audience who is holding a \"marry me\" sign that his friend gave to him. Jennifer Lopez said she will marry him. He is a math teacher who is divorced and has a daughter. He actually only came to the concert so that his daughter would think he is fun (as fun as her stepdad). He ends up saying yes to help the singer out. The singer extends their time together and they end up going on dates. And falling in love. And they stay together, even though they're very different people. She is surrounded by cameras always, which he has to get used to but she also turns away the cameras sometimes to get quality time with him. She supports him in his math classes and math-alon.",
    "date": "2025-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It’s a strange set up to start, but ends up being everything we LOVE about a JLO RomCom.",
    "date": "2025-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It was a sweet movie and Lopez did a great job poking fun at herself and Owen Wilson was his normal down to earth character.",
    "date": "2025-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The movie has a lot in common with the dog, they both tank. The movie has very little plot, mediocre acting, so much cheese it would make many people lactose intolerant. It’s slow pacing, the characters are poorly written. It feels like this movie was reviewed bombed with praises, but no one actually saw the movie.",
    "date": "2025-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Couldn't finish it, too corny even with a likable enough Owen Wilson and J Lo",
    "date": "2025-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best love stories I have seen",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It was a great movie.",
    "date": "2025-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I’m not a big fan of romcoms but for some reason I loved this movie. I think it was original and had a lot of heart. Check it out on peacock what do you have to lose?",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Marry Me It's a great romance and musical film, a beautiful story with lots of good and catchy music that involves its characters very well.",
    "date": "2025-04-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Love it need 2nd one best so cool best movie ever love it makes me smile everything I could watch all day and night amazing",
    "date": "2025-04-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "When I first watched the film, I thought it was another standard rom-com genre. Later on, I felt that the felt resonated with me, it was a movie made with a lot of depth and heart. The characters who were the leads had a lot of reasons to behave and talk in a certain way throughout the course of the film. Owen Wilson was really good though you felt maybe the director could have added some more depth to his character. It was slightly more real than most of the rom coms coming out of Hollywood.",
    "date": "2025-02-28"
  }
]