[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Orion e o Escuro logo se destaca de outras animações da DreamWorks, com um roteiro terapêutico, engraçado e criativo. Com certeza, mais uma obra de arte do estúdio. Um filme inovador, diferente e com animação linda e vibrante.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Hermosa visualmente, colorida, con buen ritmo y entrega un lindo mensaje. En la segunda mitad se vuelve complicada (por decirlo de una manera elegante) pero no la arruina del todo.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Tycho is here to help",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's not horrible, I actually enjoyed it, but it definitely gets confusing after a while",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A sweet idea wrapped in uneven execution. Heartfelt but not overly funny, the narrative is too muddled (in particular the time jumping component) to leave a lasting impression.",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Worst Netflix film ever!\nSeriously, the animation is terrible, the story is generic, the main character is unlikeable, the character designs look bad and the film kinda rips scenes from Monsters Inc.\nMaybe that's just me.",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I’m not saying this movie is terrible by any means but really? 91%? Really critics?? Besides that, this movie is just such a nothing movie. The things that happen are just so confusing and unpredictable. Sometimes unpredictable can be a good thing but not for this film. It’s so unpredictable that everything that happens in this movie just makes me go “What the hell is even happening??”. And the worst part, this movie tries to play it off as a good thing like oh having the movie make no sense is a good thing and makes it more interesting like no this is just bad writing. Could of been good but the execution is just bad.",
    "date": "2025-09-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was one of the cutest movie concepts I’ve ever heard of, so I had to watch it. WOW. That’s all I can say. Everything was on point. Such a powerful message! Have no idea why so many said bad things about this, this is an absolute must-watch for everyone, old and young!",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "What a sweet and inspiring story about overcoming your fears and how sometimes it's how you look at things.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It’s an emotional and fairly beautiful film, with an interesting concept and unique story, even though most of jokes don’t really land. It also has pretty clever writing.",
    "date": "2025-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Orion and the dark is hot garbage. This whole thing just feels like the Walmart version of inside out and fails to be this movie in every possible way with illumination style of animation. Don’t watch this movie! It’s a pretty basic dreamworks movie and could’ve been worse",
    "date": "2025-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Start nice but miss the storyline in middle and turn in a generic movie",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A playful deconstruction of the narrative format and existential constructs, Orion and the Dark finds Charlie Kaufman tapping into his charming family-friendly side.",
    "date": "2025-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "At first they were actually making a good impression on me but then they started to make the plot get messier and messier, this was so confusing",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "O filme passa uma mensagem linda, com bom roteiro e personagens bem desenvolvidos. O problema que da metade do filme para o final, o filme fica confuso, com várias cenas estranhas, acontecimentos inesperados e um grande caos. O filme se perde numa maluquice, e o final é muito mal explicado e sem graça. Pra que dar um salto gigantesco no tempo? Explicaram quase nada e ainda tem um monte de acontecimento sem explicação! O filme é bom, mas acaba sendo estragado, e os outros personagens? Foram descartados.",
    "date": "2025-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It’s a good movie that actually teaches a valuable life lesson.",
    "date": "2025-06-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A deeply cynical Kaufman script, a suicidal night-entity, a Werner Herzog cameo, and a scared little boy come together to create the most wistful kids movie since Where the Wild Things Are. The dark doesn’t seem so scary when you’re seeing it through tears.\n\n\nFull review on my Substack: https://benpatten.substack.com/",
    "date": "2025-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I'm glad DreamWorks is getting into the whole 3D watercolor look. It's colorful, creative, and showcases how both dark and light have a place in the world.",
    "date": "2025-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This was a nice movie and it started of great but about 20 minutes into the movie it changed with the appearance of a new character that from that point kept jumping in.",
    "date": "2025-05-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Orion and the Dark (2024) has a very nice and creative story, although it has some small mistakes it is a fun animation to watch.",
    "date": "2025-05-07"
  }
]