[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Trying to get past the first 5 minutes of this movie is a real chore for at least a couple of reasons. For starters, if you're on a motorized vehicle, like a motorcycle, a snowmobile, scooter, you crash and your helmet comes off, you'll most likely sustain a head injury. A properly secured helmet shouldn't come off... and if it does, so should your head. Second, even a half-a-moron is aware that you never remove an object with which you have been impaled for fear that one may bleed out. For the sake of realism, I'd have done just that and rolled the credits. This is just bad writing. 2 stars for the on-screen presence of Jean Reno.",
    "date": "2025-04-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Not understanding the hate this movie gets. It’s a fine film. Always have time for Jean Reno and the ensemble cast was fine.",
    "date": "2025-04-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Well, I am Ukrainian. So, I started watching it, not only because of Jean Reno, but, because in the titles they are thanking Ukrainian film board, Ukrainian smth else, so I was thinking it will be related to Ukraine in some way.\nWhen I saw the mountains, I told myself \"Well, Carpatians\". Not, they told it's Washington state.\nThe guy (Reno) has in his house UKRAINIAN wool cover, and UKRAINIAN rug.Why ? It stays a mistery, hero of Reno is not Ukrainian. Nor he tries to seem a Ukrainian. Nothing in the movie is related to Ukraine in any sense.\nThe story is waste of time, I agree with others.\nI put 1 star and half for beautiful views only.",
    "date": "2025-02-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Was an interesting movie at the start, there were just random twists that didn’t add up. Alright idea just a terrible delivery.",
    "date": "2025-02-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "My GOD, this movie was worse than watching paint dry. Literally every second of this movie was either predictable or just plain bad. I didnt expect much out of this but an hour into this film and nothing of note has occurred. Please, don’t waste your time.",
    "date": "2025-01-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Boooooooooring. I must get paid to see it to the end 😴",
    "date": "2025-01-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Time I'm never getting back",
    "date": "2024-12-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Sorry for the spoilers. I enjoyed the first part, until when the girl tries to shoot at Jean. After that, for one second it got very exciting, obviously it was the stepfather who wanted the girl dead, and the old friend of the girl was sent to \"end the job\".\nAfter that, nothing made sense. It became one of the worst movies I have seen.",
    "date": "2024-12-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Huge gaps in the storyline, inconsistent timelines, even the weather makes no sense from scene to scene - was this a poorly conceived school project?",
    "date": "2024-12-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Ukrainian actors trying to do American accent is just bizarre, and very distracting. Hot mess, couldn’t finish it.",
    "date": "2024-12-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "That was so trash, i regret spending even a second on this movie",
    "date": "2024-12-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The script makes no sense. But did anyone else notice Jean Reno pulling a shotgun out of his back pocket? Is this meant to be a joke, or is the movie trying to be as absurdly funny as a random Bugs Bunny cartoon?",
    "date": "2024-12-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Where to start? Ham acting, shoddy storyline, eclectic and inconsistent accents with no relevance or explanation, zero character development, and bizarrely suicidal approaches to assassination attempts. Jean Reno was the only saving grace - and that's perhaps because he'll always be the Professional.",
    "date": "2024-12-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "People get too involved in themselves when reviewing movies. It’s kind of like wine snobbery and it’s ultimately not particularly valuable to the general public. \nThis is not a great movie but if you like a little action/drama and winterscapes, it’s pretty legitimately entertaining. Remote location, captive, survival and the characters are believable and appealing. If you think too much, you won’t find anything entertaining. I explore many different types of wine and I watch many different types of movies, I think this one’s worth a visit.",
    "date": "2024-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's not as bad as the ratings say.  I enjoyed watching it.  Story was OK, acting was good.  Problems were that it seemed to have run out of budget and the film ended prematurely.  It leaves a portion of the story hanging that was set up for another act, but the film just ended.  It was a French-Ukraine film, and it was kind of odd with all the actors speaking English, trying to sound American (set in Washington state but think it was filmed in Ukraine?) but most supporting actors had a slight strange accent.  The plot involving the main character ended in a way that didn't make sense to the character.  So some writing and an abrupt premature ending... otherwise I enjoyed it.",
    "date": "2024-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "A new level of garbage. Every aspect a let down except for maybe the scenery. Zero investment created, dialogue worse than a robocall might offer, and a general hollowness suggesting the worst of made for tv. Jean Reno, you have the cash! Please walk away from the high school-level productions! \nGod this sucked.",
    "date": "2024-05-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This is a solidly filmed suspense movie shot in some stark winter weather under extreme conditions. Jean Reno is as good as ever, and the technical side of this film is quite good. The story is more jumbled than I'd like, but I enjoyed it. Anytime I can watch Jean Reno on screen I feel like it's a gift. He's just head and shoulders above most actors.  Sarah Lind does a good job as well.",
    "date": "2024-04-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I loved the scenery and Jean reno has always been one of my favorite actors the movie is still better than a lot of action movies produced these days although apparently the budget was low",
    "date": "2024-03-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Poor plotting, storyline incomplete, had potential just very poorly executed.",
    "date": "2024-01-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Avoid wasting your time on this boring, incomprehensible mess.  Awful film - less than one star is being generous.",
    "date": "2023-12-27"
  }
]