[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "My only regret is so few know about this movie. I loved it. We need more of these simple stories of life with humor, love, sadness and more. The acting is superb. See it!",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This was so wonderful and so modern! I love the relevance it has to modern romance films! Fantastic acting!",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Sabe el mensaje que quiere dar y como entregarlo de manera efectiva. Lamentablemente es de esas películas que a los 10 minutos ya sabes como termina así que uno ya la ve casi desde el principio con otros ojos. Excelentes actuaciones, lo que mas destaca de todo el film.",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Poorly constructed and not convincing. Abandoned at 12 minutes. In the opening scenes Pugh is a superwoman who early in the morning runs at a good pace in a forest, then collects some pieces of vegetation, runs back to her cottage, greets her chickens and prepares a delicacy for her partner who is still in bed. Then we see her in advanced pregnancy. Then we learn that she is a successful chef not pregnant anymore but she has recurrent cancer. There is a child somewhere, but not important enough to be brought to the screen. Then she is trying to decide what to do about the cancer without any data to consider. Take your Kleenex out! Did any adult read this scenario before starting shooting?",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's truly beautiful. Stellar acting (expected) great script writing (unexpected). It doesn't have that Hollywood ending but doesn't leave you sad or despondent either. Loved it a lot.",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "favorite movie. cried like a baby.",
    "date": "2025-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It’s the performances by Pugh and Garfield that push this into 4-star territory for me personally. I’m no longer a fan of tearjerkers (reality is upsetting enough), but this is a good one.",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Although it tackles worthwhile themes and the leads are believable in their roles, the writing is all over the place, extremely self indulgent and relying on facile sentimentality. Utterly boring.",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "We Live in Time é um filme que aborda uma doença forte e triste, o câncer, mas consegue fazer isso sem afundar o casal — nem o público — em pura melancolia. Pelo contrário: a forma como a história é contada equilibra dor e leveza, resultando em algo emocionante e, ao mesmo tempo, inspirador. A narrativa conecta passado, presente e futuro de forma muito boa. Isso é mérito tanto da direção quanto da edição, já que em muitas produções essa ida e volta no tempo pode ser cansativa — mas aqui funciona bem e mantém o ritmo.As atuações de Andrew Garfield e Florence Pugh são muito boas, trazendo verdade e química para o casal. O filme se sustenta muito nesse duo, e eles entregam de forma intensa e natural.Não é um filme apenas sobre doença, mas sobre o que se constrói com o tempo que temos. É um filme que fala de amor, escolhas e conexões. Pra mim, é especialmente marcante para assistir em casal — e, se tiver filho, ainda melhor, porque a mensagem bate ainda mais forte.We Live in Time é exclusivo para adultos, mas carrega uma sensibilidade que pode tocar muita gente. É emocionante, sem ser pesado demais.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "EINE WEIßWURST ALS AMUSE-BOUCHE\n\nAlmut und Tobias sitzen beim Arzt und erfahren eine schreckliche Neuigkeit. Almut hat Krebs und muss sich einer aggressiven Therapie unterziehen um sich überhaupt die Möglichkeit offen zu halten zu überleben. Doch ist dies wirklich die beste Möglichkeit für ihre Zukunft oder sollte man lieber die Zeit genießen die einem noch bleibt?\n\nWe Live in Time geht ca. 105 Minuten und ist ab 12 Jahren freigegeben. Wir haben hier ein Romantik-Drama mit Florence Pugh und Andrew Garfield in den Hauptrollen. Konzentrieren tut sich der Streifen jedoch eindeutig auf Pugh, ihren Kampf und Entscheidungen sind definitiv im Vordergrund. Garfield ist eher der der auf alles emotional reagieren darf, man erfährt zwar aber über beide recht wenig, aber die Screentime gehört Pugh.\nDie Story wird uns nicht linear erzählt sondern man springt zwischen Kennenlernen, Schwanger und Krebs hin und her. Das machte es für mich echt schwer mit den Figuren mit zu fühlen, da ich jedesmal raus gerissen wurde aus den Szenen weil plötzlich drehte es sich um etwas ganz anderes.\nSchauspielerisch ist das hier natürlich klasse bei diesem beiden Darstellern. Ebenso kann man sich auf den romantischen Teil sowie den Schicksalsschlag einlassen, für mich funktionierte dies leider nur Semi aufgrund der Erzählstruktur.\nBeim Finale kann ich die großen Emotionen nicht teilen, mir Taschentuch und Rotzblase ist da nichts, worüber auch?\nAm Ende bleibt dennoch ein Werk das mit guten Schauspielern, einer guten Story (nicht wie sie erzählt wurde) und interessanten Fragen überzeugen kann. Leider ist das nichtssagende Finale, die doch flachen Figuren und die Erzähstruktur ein Dorn im Auge.\n\nVon mir bekommt der Film 7/10 Punkten. Würdet ihr alles versuchen zu überleben oder eher alle Chancen verstreichen lassen und lieber die restliche Zeit genießen?",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Boring film and annoying storyline approach. Avoid at all costs unless you are entertained by a weak storyline, randomised so it is just plain annoying to follow and does little to engage its audience.",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Almut, uma chef de cozinha, e Tobias, um administrador de dados, se conhecem de uma maneira inusitada. Ambos estão saindo de relacionamentos recentes, mas acabam se apaixonando. Assim, eles passam a morar juntos, tem uma filha até que a notícia de um câncer em Almut os levam a avaliar o tempo juntos. Um  romance inusitado com pessoas de características diferentes que dá certo, ameaçado pela doença de um dos amantes já é uma história pra lá de batida na história do cinema. Love Story, Amor. São vários filmes com essa temática. Então o que torna este filme diferente? Primeiro, a química entre Andrew Garfield e Florence Pugh que torna este casal real, cuja história queremos acompanhar. Segundo, a maneira que a história é contada, Não é linear, mas se divide em três momentos diferentes, onde o que os diferencia é o corte de cabelo da personagem de Pugh. Isso pode levar à confusão, como nos primeiros momentos, quando vemos o personagem de Garfield prestes a assinar papéis de divórcio, logo depois que temos a cena onde o casal é informado da volta do câncer de Almut. O divórcio é do primeiro casamento de Tobias, antes dele conhecer Almut. E o terceiro é o roteiro conciso, com poucos personagens, apenas os necessários para a história e, mesmo que não sejam muito desenvolvidos, eles são capazes de gestos tocantes, como o relacionamento entre Tobias e o seu pai, principalmente na cena onde ele corta o cabelo de Tobias, e do gesto de apoio da chef Jade na luta de Almut contra o câncer. Além do mais, ele não investe no dramalhão, que seria fácil em uma história como essa. Há momentos que chegam perto mas o amor desses personagens é tão grande que passa. E para encerrar temos a direção que nos conduz por essa história de amor de maneira tão suave, sem grandes efeitos de câmera, mas com a emoção no ponto certo que quando termina o filme, você está de alma leve. Um trabalho menor mas tocante.",
    "date": "2025-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "i PAYED to watch this movie. I usually love Florence and she did a great job acting however that is the ONLY positive thing i have to say about this film. It was incredible boring and overall didn’t have a strong plot or good storytelling. The ending was incredible weak and frankly i would have had a better time watching paint dry. Only watch this movie if you hate yourself",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "You know the state of filmmaking is bad when a romantic movie ends up being gimmicky, and utterly depressing.",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The film has a good soundtrack and plot. However, the cuts made to the film end up leaving some scenes confusing.",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "We Live In Time is a sensation. A heartbreaking story told in a non-linear format that truly earns this storytelling method paired with an incredible performance from both Pugh and Garfield. It's as hopeful as is heartbreaking and it's final scenes are just breathtaking.",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It is just very confusing because of the time always jumping back and forth. It didn't need to do this and it adds nothing.",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "\"I'm worried that's there's a very distinct and real possibility that I am about to fall in love with you.\"\n\nThis movie fu**ing destroyed me.\n\nWe Live in Time is one of those stories that quietly breaks you, without big twists or exaggeration. It’s simple, honest, and deeply human. I loved how it tells a story about love and loss with so much delicacy, showing both the beauty and the pain of sharing your life with someone.\n\nThe performances are gorgeous, especially Florence Pugh, who conveys so much with just a glance. The film has a very special way of making you feel nostalgic for moments you never lived, and that makes it truly unique.\n\nIt’s not easy to watch if you’re sensitive to its themes, but that’s exactly why it’s worth it.",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Brilliant cinematography and choreography. I fell in love with each of the characters and their chemistry. I just didn’t like the nudity. Had there been a more creative way to display their raw emotions for one another then that’d’ve been fantastic. Sex is sacred to the human soul. Aside from that, the emotions in this movie were just so well acted and written.",
    "date": "2025-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Não é uma história linear mais é incrivelmente boa, chorei tanto com esse filme, me fez refletir muito.",
    "date": "2025-07-09"
  }
]