[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Beautiful message and view of divorce through a child’s eyes. She Ellian hugs her little self at the end it is very emotional. For any kids who are having to deal with complicated life the message of embracing change and moving forward is beautiful. Supporting characters were not great but for families who have experienced divorce I think this is really a beautiful film and a true fairy tale for how it could be done right.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I was going to put 4/5 because I enjoyed it enough but my 9yo shrieked that it was an AWESOME movie and should get 5/5. The graphics are great, theme, characters and their development, jokes, rythm, memorable moments, teachings and values, I have no criticism. Maybe the songs are not memorable enough for my taste, but my kid LOVED it!",
    "date": "2025-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Somehow feels like a rehash of a bunch of previous pixar/disney movies with very moralistic overtones and a 'divorced' parents agenda.\n\nThere are glimpses of greatness, but overall it lacks depth, the music isn't that great and the whole thing feels extremely derivative.\n\nThe first 30 minutes or so is really very boring.",
    "date": "2025-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Spellbound offers a visually charming and emotionally earnest exploration of family dynamics through the lens of magical fantasy. While the animation is rich and vibrant and the musical elements add flair, the film shines most in its intent to depict the emotional complexities children face during parental separation. Though it falters with a familiar plot and a resolution that feels overly simplistic, its message about communication, love, and emotional healing resonates. A tender, if uneven, family film that speaks to both children and parents alike.",
    "date": "2025-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "John Lassester returns again, and this time he has Rachel Zegler with him. Now if that is a duo that turns you away from the film, fair enough, but let's look at it on the merit of the movie itself. The animation looks very by the numbers, enough so that people have accused this of being made with A.I. But no, I don't think that's the case, it is just a lot of old hands in the animation studio that it seems familiar. Speaking of familiar this is a musical with songs composed by Alan Menken, the man behind \"Beauty and the Best' and \"Aladdin\". It’s a shame the songs here are not nearly as memorable. The whole movie is pretty forgettable. It follows all the usual story beats for an adventure like this. With the exception of the ending. I can actively feel my memory fading on the film, but the ending is what will stick with me. It is a theme that you don't see explored often in Family Animated Films, and I respect them for their effort. It is a shame that the rest of the film doesn't deliver as well.",
    "date": "2025-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I find it important for any animated feature to keep both adults and kids entertained, but this movie failed to do that. I'm 19 and watched this movie because I was bored and was very disappointed. I could see this being the favorite flick of anyone below elementary school age, but it did not even mildly engage me until at least halfway through the movie. The settings did not change until halfway through the film and the plot barely started moving until the sound cave, and even after that it still dragged a bit. All of the songs sounded mildly similar, were way too long, and nothing important happened onscreen during the duration of them. As a final blow to what the film could have been, I understand the movie was supposed to have a moral about divorce, but wouldn't it have been better to set a moral as having the parents start over, make up, and realize they can be with each other for their daughter (together) if they really try? Also divorce is not that easy and (usually) ends in making things harder for the child instead of better, and it's not like the child just gets to \"go from one castle to the other\" to visit their parents whenever they'd want. I watched Disney's \"Wish\" and enjoyed it more than this. That's how bad \"Spellbound\" was. To sum it up: while the animation was wonderful and the acting was good, the story was dull, unaccomplished, and vague.",
    "date": "2025-06-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Buena película maravillosa con una buena enseñanza",
    "date": "2025-06-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "terrible movie, divorce is terrifying and ugly, can be life threatening, making it look \"good\" is very disturbing, and not all children of divorce end up better off, terrible message, also this movie doesn't have a villain, the \"negative emotions storm\" is basically the villain, very disturbing, not for children",
    "date": "2025-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This movie isn't so bad, but is not a materpiece. The songs are ok, the plot is a bit banal, and I liked the final, but for the rest is a good movie to watch with the family.",
    "date": "2025-04-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This movie had a VERY good moral that I feel has never been explored in a kid's movie and should be. A movie about divorce and a child stuck in the middle is very engaging. The premise is good, but the execution falls flat. It feels as if your not watching a movie but watching a documentary or something, the movie is so TELL and not show. There's magical elements sure but they don't really need to be included in my opinion. The movies story is bland and the songs are extremely forgettable and most of the time just filler and go on to long \nOverall, I hope there are more movies that have this sort of premise as it isn't really explored very much, but this movie, just isn't it.",
    "date": "2025-04-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing flim great for the kids",
    "date": "2025-03-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "To be frank, there is too much singing--and that's coming from someone who adores musicals. There is also way too much telling and not enough showing in my honest opinion.\nIt did get better in the third act of the movie, but it's not my cup of tea.",
    "date": "2025-03-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The story was predictable but overall the film had great animations and was a good watch",
    "date": "2025-03-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The movie tries to normalize divorce (among other things) that children should not have to experience. It's one redeeming quality is that it does portray the struggles of children who are unwilling victims of divorce. There are a few mildly funny scenes but otherwise the movie falls flat.",
    "date": "2025-03-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "https://youtu.be/mAAbNRW_ZXU",
    "date": "2025-03-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The beginner was really clunky, none of the jokes were landing for me, my wife, or my 7 year old daughter.  It felt like there was a good idea for a film there, but the writing execution wasn't able to actualize it.  Thankfully, about a third of the way through the movie, I feel like it start to improve, and by the end my daughter voted it as Loved It on the netflix and wanted to watch it again, so it was worth pushing through.\n\nI appreciated that it had a message thats not common in children's movies, even if it didn't apply to our family, and that it was told in a subtle enough way to not be upsetting to a child not in that situation.  Visually it was stunning from beginning to end, and while there weren't really any stand out \"we'll be humming these for weeks\" songs, I thought they were all solid with good vocals.",
    "date": "2025-03-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Watched this with my two nieces. I can easily say that this is the worst movie I've ever seen. The songs were completely unnecessary, all sounded the same and were terrible. I'm a big fan of classic Disney movies and I can also easily determine when a movie doesn't click with me because it was intended for children. The script of this movie treats all its viewers as if they were idiots, and it's insulting. I'm mortified that John Lithgow volunteered his services for this burning piece of refuse. I'm now less of a movie fan in general knowing that this exists.",
    "date": "2025-02-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Disappointing. Hard to focus on the movie due to the disgust I felt every time I heard Rachel's voice. The storyline and animation were not enough to make up for her presence.  I would never give this a 5 star, but it could have been at least a 3 if they had not chosen her as a character.",
    "date": "2025-02-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "With forgettable music, Spellbound attempts to recapture the magic of 2010s Disney but only manages to get the spectacle right.",
    "date": "2025-02-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I'm a writer and a musician and this movie was very unsatisfying for both sides of me. The songs were lightweight and sappy as well as mostly in the same style and the same key, and there were too many of them.  I really think the script should have undergone a few more rewrites. A lot of wasted potential in this movie. And I wasted two hours of my life watching it.",
    "date": "2025-02-12"
  }
]