[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "great movie nice movie",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "They fixed his art style! It looks soooo good.",
    "date": "2025-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Never would've I had though that a sequel to a spin-off to an animated quadrilogy could go this HARD. This is a masterpiece, maybe even better than the first 2 Shrek movies. Amazing themes. Amazing characters. Amazing story. Amazing comedy. Surprisingly deep. There are even some horror elements, with the whole Death thing - just chills! The better Puss in Boots movie, you can even skip 1 if you want, it won't hurt your experience.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely in top animated movies of the decade so far. Spectacular animation, villains (Yes multiple) and story. Must see movie",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very entertaining and looks awesome",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Beautiful on every level: looks, characters, plot. A sequel better then the first in every way you can think of",
    "date": "2025-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "6.3/10 — \"Okay\"/\"Watchable\"\n\n-(Seen on 9/16/25)",
    "date": "2025-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The whole plot is fantastic the villain was bone chilling yet magnificent",
    "date": "2025-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Este filme é bem legal,um dos poucos filmes que a gente gostaria que fosse mais longo, todos os personagens são carismáticos a história dele também.",
    "date": "2025-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Ok ok, the animation is perfect, It has the right length, It has not One, not two, three perfect villain, one reedemable villain, one pure evil villain and one force of nature, this movie also has a depth message and fun humor, i think all the characters are likeable, i never got bored, on my opinion this is the best movie of all time, i Don't see a single flaw in It",
    "date": "2025-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Puss in boots the last wish is a sequel that nobody expected to be this good! visually stunning, wildly entertaining, and surprisingly profound. With Antonio Banderas back in top form, dazzling painterly animation, and a chilling villain in Death, the film mixes adventure and heart with rare finesse. Funny, moving, and gorgeous to look at, it’s one of DreamWorks’ very best.",
    "date": "2025-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Though he was very very funny I didn’t really care about Jack Horner being in the movie, but other than that this movie is perfection.It has, amazing animation, an amazing deep story, amazing characters and more.It manages to balance heart, comedy, a little action, the amazing plot, and the deep fear that puss has against the best dreamworks villain ever, Death. Awesome movie. Highly recommend!!!",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Must see incredible film",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "La película está muy bien echa tiene ese efecto como de cómic en la animación es muy buen y genial",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing movie Death is probably the best antagonist I have ever seen every time he was on screen I got chills every time. The message in the movie was good. I give it 10/10 I think it’s a must watch.",
    "date": "2025-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "best movie everrrrrrrrrr",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best animated movies of all time",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "An absolutely wonderful and hilarious movie",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolute perfection!",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing animation and comedy, plus Death, who might be the best villain i’ve ever seen in an animated movie, 5 stars.",
    "date": "2025-08-08"
  }
]