[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie made me want to go back to the diplomatic service. Outstanding performances",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "2 hours and 3 minutes based on a true story. Rated PG-13 for Some Strong Language, Smoking, Brief Violence and Thematic Elements!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A little too old-school in its approach and nowhere as cool as Fatherland but has some nice interludes",
    "date": "2024-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A near perfect ww2 thriller, though the great Jeremy Irons is probably miscast as Chamberlain who was weak when he needed to be strong.",
    "date": "2024-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "While the two main characters are fictional, their story is the narrative framework to discuss the real events surrounding 1938's notorious Munich Agreement. The film explores Neville Chamberline's hopes and intentions during the conference which gave rise to the agreement. The film is sort of a redeeming take on Chamberline who has been roundly dunked on by historians for decades since. The film paints Chamberline as knowing the agreement might not hold but feeling it was necessary to buy time for Britain to prepare for war. Certainly Britain was more prepared for war in 1939-1940 than they were in 1938, so it is an interesting take on Chamberline. Overall the acting was good. I think students of history will like this movie more than other people. Well done film.",
    "date": "2024-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A reassessment of sorts for Chamberlain isn't completely unreasonable (even if I don't totally buy it) but a lot of this is still pretty half baked, especially since the focus isn't really on Jeremy Irons (a real shame as he's great here) and I just don't understand why this has to be a spy thriller.",
    "date": "2024-02-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Ever heard of Chekhov's gun? Because the writers of this movie sure haven't. Set ups were not satisfying payed off, characters are under developed, and the climax ends with some out of left field deus ex machina nonsense.",
    "date": "2024-02-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Did Neville Chamberlain produced the movie?\nOtherwise, it was well acted and produced.",
    "date": "2023-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "While the two main characters are fictional, their story is the narrative framework to discuss the real events surrounding 1938's notorious Munich Agreement. The film explores Neville Chamberline's hopes and intentions during the conference which gave rise to the agreement. The film is sort of a redeeming take on Chamberline who has been roundly dunked on by historians for decades since. The film paints Chamberline as knowing the agreement might not hold but feeling it was necessary to buy time for Britain to prepare for war. Certainly Britain was more prepared for war in 1939-1940 than they were in 1938, so it is an interesting take on Chamberline. Overall the acting was good. I think students of history will like this movie more than other people. Well done film.",
    "date": "2023-02-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great movie, beautifully acted, directed and produced.",
    "date": "2022-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "München – Im Angesicht des Krieges ist ein Thriller von Christian Schwochow, der Film basiert auf dem Roman München von Robert Harris. Einige Figuren und Situationen mögen fiktiv sein, aber die Ramen Handlung zum Münchner Abkommen sind real. Trotz der starken fingierten Geschichte über Neville Chamberlains, ist er eine gediehene Literaturverfilmung, souverän und durchaus überzeugend und spannend erzählt. Die Hauptdarsteller George MacKay, Jannis Niewöhner, Jeremy Irons haben eine fantastische Arbeit geleistet.",
    "date": "2022-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A twist on a very important moment in history. But the twist is less meaningful when looking back on history. Still if you find this time period as important as I do, its worth a watch.",
    "date": "2022-09-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "So-so. The film features great actors but the plot and direction are quite flat. The dull version of Inglorious Bastards somehow.",
    "date": "2022-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A German-British period drama spy thriller based upon the 2017 novel Munich by Robert Harris. In this gripping story, a British diplomat travels to Munich in the run-up to World War II, where a former classmate of his from Oxford is also en route, but is working for the German government. Even though it might be obvious where it is headed, the storytelling still maintains a suspenseful and captivating structure that will keep you at the edge of your seat. Jeremy Irons is flawless as Prime Minister Neville Chamberlain and as a historical account of the events that preceded WWII, it is incredibly well-crafted.",
    "date": "2022-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I had just read Robert Harris' incredible novel, \"Munich\", and was eager to see the movie made from it - chiefly because Jeremy Irons is a great actor. I was very disappointed from the get-go. The opening scene has Legat, Hartmann, and Leyna at a night party in England. Wrong. Secondly, the effort to try to give an urgency to the situation through contrived cinematography immediately failed. Lastly, when Legat meets his wife on their anniversary, he receives a call from a member of Chamberlain's cabinet. It's a black guy. Whether you like it or not, that is historically incorrect and Harris had not gone down that road. So these first big departures told me immediately that my enthusiasm was for naught. The book was outstanding. This modern-day attempt at PC revisionism of the book and the actual time was the corker. I turned it off.",
    "date": "2022-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Good historical drama that if you dont know the full ins and outs of the start of World war two, strong acting.",
    "date": "2022-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Strong performances by the lead actors, compelling relationships and struggles that were engaging.",
    "date": "2022-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "We loved it! Actors were great, especially the lead, and intensity of James Niewohner, who has the ability to make you feel you're in his body/mind, actually experiencing it!  Seeing this little glimpse of history, how easy it was for a country's leader (Hitler) to lie to the rest of the world, brought some thought about how close we've come  to similar leadership here.  Hope more see this historical drama.  Super well done.",
    "date": "2022-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Not 3 Star \"Meh, it passed the time\" so I gave it 3.5 but I can't say I'd personally recommend it.  I enjoyed the great production values of a ww2 film. I did find some dialog contained sentiments a bit too modern for the time period.",
    "date": "2022-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Entertaining, if not altogether faithful to history.",
    "date": "2022-06-09"
  }
]