[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Una película divertida para apagar tu cerebro y disfrutar las batallas el drama los chistes y pasar un buen rato y ver una película clásica",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's a by the numbers adventure film but it was also better than I expected.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Loved this film as a child and its still great rewatching as an adult",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A great feel good movie, awesome cast and story. Very 90s Disney version of a beloved story with humor for all ages. It’s a flick I can watch multiple times.\n\nKids today will still enjoy it, that might be the biggest compliment I have for it.",
    "date": "2025-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The reviews on this movie seem to review other renditions of this story.\n\nThe 1993 classic, starring Charly Sheen, Chris O'Donnell, Oliver Platt etc is a fantastic action-comedy.\n\nThe characters are well rounded and the storyline is clear. The delivery is fantastic. The movie is family friendly and highly recommended.",
    "date": "2025-06-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Diznee ruins another classic. Ninjas in 17th century France? The 4 leads are terrible. Mugging for the  cameras as if this is some inside joke. Kids might like it but anybody who has read Dumas will hate what hokeywood did to this classic.",
    "date": "2025-02-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is the only musketeer movie that’s entertaining",
    "date": "2024-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What a great cast!! Great heroes, villians and soundtrack make this movie perfect. I loved the characters and story. This is the only musketeers movie to date that's worth watching. Tim Treakle",
    "date": "2024-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A nice approach, but a little bit naive, but is Disney so I think that we cannot expect much realism from them, although it's very entertaining, a great family movie.",
    "date": "2024-04-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This is a very fun little movie. It is a lighthearted adaptation of The Three Musketeers, intended principally for children/early teens. I loved it as a kid.",
    "date": "2024-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best movies from its time! Action and adventure",
    "date": "2024-02-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I have seen it twice, that's enough for this life.",
    "date": "2024-01-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Disney es conocida por haber adaptado muchos relatos clásicos y mayormente tiene la costumbre de hacer adaptaciones libres con nuevas reinterpretaciones. Curiosamente, por más que se tome muchas libertades creativas, sus películas tienen algo que hacen que obtengan un cierto cariño de la audiencia. En este caso, le toco adaptar la novela de Los Tres Mosqueteros en una versión libre que se distancia del relato original y cambia varias cosas. La película logra ser fiel a los personajes principales que son D'Artagnan y sus compañeros mosqueteros. Lo que sí se cambió bastante fue los roles de Milady y Richelieu. Milady no tiene mucha relevancia en la película y Richelieu ocupa su lugar como el antagonista principal. La verdad Tim Curry hace un muy buen trabajo en su papel. Constance tampoco tiene mucha relevancia como en la historia original y queda en segundo plano. Desde luego que la película altera gran parte de la historia original, pero como muchas adaptaciones libres de Disney, logra ser una película disfrutable y al menos mantiene un elemento esencial de la historia original que es el honor y la hermandad que hay entre los mosqueteros. En parte, sí respeta el espíritu de la obra de Dumas y hace que sea una adaptación aceptable por más que se haya tomado libertades creativas. Es una película que se puede disfrutar si se la ve como una película en solitario y si no se tiene mucho conocimiento de la novela original. Talvez si hubiera sido una película animada en vez de una acción viva, hubiera tenido más aceptación. Curioso que el método de Disney solo haya funcionado en sus clásicos animados. Mi calificación final para esta película es un 8/10.",
    "date": "2023-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "90s cheese, simple and entertaining. Tim Curry hams it up excellently as the villain. The lead heroes are all watchable, and there's plenty of eye candy.\nWould not be made today, as women are overly sexualised, the heroes are alcoholics and womanisers.\nStill a childhood guilty pleasure.",
    "date": "2023-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is my favorite version of the story.  I heard the books are light hearted adventure novels full of wit.  Something other versions who prefer to the \"Dark Knight trilogy\" of Musketeer movies forget.  Dark and gritty don't work with the Musketeers.  Thankfully this remembers that.  Tim Curry steals the movie as villain Cardinal Richelieu.  Everyone embraces the action and adventure of the world.  It's not realistic but it never was suppose to be.  The one perfect version I've seen at the time of writing this review.",
    "date": "2023-05-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Rating: 5/10. 54/100",
    "date": "2023-04-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "For a fun, humorous take on this classic sit back and enjoy this movie. Decent pace, reasonable dialogue and fun fights, total popcorn sit back and relax type of movie with personality",
    "date": "2022-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was a really fun and very swashbuckling Disney live-action family action comedy adventure. It had very well done cinematography, really splendid cast, really exciting action, really magnificent comedy, really thrilling adventure, really extraordinary characters, really terrific music, really well done costumes and a very incredible story. In my opinion, I think it’s one of my favorite Disney live-action movies I’ve ever watched in my whole life. I really recommend this movie to both kids and adults.",
    "date": "2022-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "All ages admitted!!!!!!!!!!!!!!!!! The greatest 01 hour: and 45 minutes ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2022-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Look, this movie is the definition of a hollywood blockbuster - so expect nothing in depth and you will come away having had a good laugh at some solid action and honestly very funny asides - with a surprisingly cohesive cast of famous faces. I mean, never would have thought Charlie Sheen would make a passable Aramis, but somehow it is a great time. Just...turn off your brain and enjoy the ride.",
    "date": "2022-01-13"
  }
]