[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "a brilliant buddy-rom-com. A great watch  - heart warming and really funny as well as tear jerking in parts. Great cast!",
    "date": "2025-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "What were they thinking. I tried because of Vitoria Justice, but could not continue to watch this disaster.",
    "date": "2025-05-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Heartwarming, fun and thoughtful. It brought a soothing tear to my eye on multiple occasions. The leads were lovely and it deserves a watch when wanting to explore your feels.",
    "date": "2025-01-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "MC didn't really grow and was given this second chance in which she gave peace to her mom and father but the one person she truly hurt right before dying she never apologizes to or gave peace to the trauma of loosing her friend and finding her dead? Seriously? Also, I'm a stickler for the rules, Lisa wasn't officially checked off her list.",
    "date": "2024-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very emotional. Great plot and acting and honestly feels nice to watch a refreshing movie like this where it all comes around",
    "date": "2024-02-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Really good film, easy watching and was sad at the end.  It gave ghost vibes",
    "date": "2023-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Netflix and director Stephen Herek presents a story of learning to love and live better even after we are gone Victoria Justice of 'Nickelodeon' plays Cassie A partier who only has 1 friend, Lisa who's more interested in being closed off than actually living her life and finding love Cassie feels like their friendship is out of habit and they barely have time for each other anymore So one night after coming home Cassie ends up passing out being knocked out in her bathroom Unfortunately she learns that she actually died and a guardian Angel appears She lets Cassie know that she only has 5 days to get her unfinished business all settled or she can't enter heaven Cassie has the chance to go back to the parts of her life she put away from her father's loneliness to her mother leaving to making sure Lisa lives the life she deserves Particularly with an attractive neighbor that Lisa hasn't had the courage to talk to; funny enough Lisa is the only one who can see or hear Cassie making for some wacky exchanges Friendships shouldn't be out of habit, there's more to life than just partying, we can all have a second chance to make things right, people can still come together in the midst of loss I love how Victoria Justice gets to show more of her acting talents particularly the drama department where she has to confront her own problems before ascending I was actually almost in tears at one point A very nice film of friendship, rekindling broken hearts, and learning to forgive in order to move on",
    "date": "2023-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I really liked the comedy that the film has and the plot is sentimental Victoria Justice did a good job as the protagonist",
    "date": "2023-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Gibt es ein Leben nach der Party? ist eine Filmkomödie von Stephen Herek (Regie) und Carrie Freedle (Drehbuch)... Eine gesellige Draufgängerin erlebt die ultimative Party-Enttäuschung, sie stirbt in ihrer Geburtstagswoche… Trotz der vorhersehbaren Geschichte erzählte sie eine gute Geschichte mit Tiefgang und Romantik… wirklich ein guter Familienfilm, mit guter schauspielerischer Leistung…",
    "date": "2023-06-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I enjoyed the movie overall and thought it was an interesting take on the after-life and some unfinished business before judgement day.",
    "date": "2023-04-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Cute, well-acted, easy watch, rom-com.",
    "date": "2023-03-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "great Film with great soundtrack",
    "date": "2023-02-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "So sweet… hit the spot for a feel good movie. Great storyline ^_^ I cried I laughed, so refreshing watching a sweet movie like this. Really enjoyed everyone's genuine characters 💕💕💕",
    "date": "2023-02-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Self-absorbed social media addict Cassie (Victoria Justice) dies during her birthday week but is given a second change to right her wrongs by reconnecting with loved ones. It is all pretty cliched without any surprises or stand-out performances.",
    "date": "2023-01-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "There are here main plot arcs going on I. The movie, and all of them are underbaked. I understand hat this is aimed at young adults. This is not the view of relationships that I would want my 13 year old to be fed.\n\nThere is drama for the sake of drama, and a focus on the ‘dream' of a relationship instead of the real thing. At first I though there might be something worthwhile going on. The ending is the worst, I can't understand why she would hank anyone in the moment, for being partnered up with someone she doesn't even know?\n\nAnyway, only one of the plot lines hits home at all in the end, and even if 30 minutes had been shaved off of this film it still would have been too long.",
    "date": "2022-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Una pelicula muy divertida, digna de ver para un fin de semana relajado. La quimica amistosa entre Victoria y Midoris se ve muy real, y la trama es bastante agradable",
    "date": "2022-05-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This film has potential, however it seems like it was rushed which makes it mediocre and as if there was something missing. At first Cassie appears to be struggling to right her wrongs and learn her lessons, but at the end everything comes to a conclusion so quickly that it makes the viewer almost insensitive to the most emotional scenes of the film which is a shame as it could've been a beautiful movie.",
    "date": "2022-04-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Classic Hollywood, a cute, fun experience at the movies right at home. Netflix Thanks.The two lead actors Victoria and Midori were fantastic actors and we're magic together. \nHey, I'm 79 and my wife and I both thought it\nwas what a good movie should be…enjoyable.\n The nominations for best pictures of year were all blah. Power of Dog (Yuck), King Richard (OK) average movie, but nothing \nspecial, and don't forget the ridiculous movie\nDon't Look up ( Big Yuck Yuck).\nJust my honest old man opinion. Have fun my\nfriends,❤️\n\nThank God it wasn't",
    "date": "2022-04-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved this movie!   It was sweet and funny and poignant.  Definitely we'll cast, especially Victoria, Midori, and Val (?actress name?)",
    "date": "2022-04-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I am ok with this premise...seen it before or a similar version where you die and get to go back and finish your unfinished business.  It's nothing new, though I am unsure of the target audience for this show, over half the show she wears this shiny form fitting dress that has a bottom end that is virtually at her crotch. I swear if she sits, the dress will curl up and she'd be pretty much half naked from the waist down. I will refer to her as the tempting crotch dress girl for the remainder of the review. I don't know why she has to find closure for things that are trivial and part of most people's lives, I guess so the show can happen and easily since they aren't really serious problems but to her and the audience complex problems will probably drag the show beyond their budget and some audience understanding.  Then again somethings just can't be fixed in life so I guess they just dumbed down the problems to easily bite size problems.  Its alright for a movie without any real substance, bonus that there is a pretty face to look at and a crotch to fantasize about, did pass the time if nothing else is on.",
    "date": "2022-03-29"
  }
]