[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie seemed like a delusional fever dream",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "If we can learn one thing from Noah Baumbach’s White Noise, it is the following: do not, under any circumstances, ever try to make a movie adaptation from any novel written by Don DeLillo.  Filled with complex themes (and DeLillo’s are packed with complex themes), a novel allows for ideas to gestate over a long period of time, unlike a film where everything is packed into a two-hour running time.  And this is the problem with the movie White Noise – there is just too much going on thematically in too short a period of time.  Yes, the production values are great.  Yes, there are some laughs that are generated from an interesting story.  Yes, the performances are generally solid.  And yes, it’s sort of admirable that Baumbach continues to try to spread his wings a little and come up with something other than New York mumblecore. Despite all of the positives, you might be left wondering what the point of it all was or, more specifically, why there were so many points trying to be made.  Read the book – it’s great.  The movie?  Meh.",
    "date": "2025-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Scary funny in 2 hours and 16 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "White Noise remains unadaptable.",
    "date": "2025-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Despite the timely release as its beneficial leverage, it’s clearly a disappointing step-back for Noah Baumbach’s faltered ambition towards a supposedly challenging material buoyed thematically on a simplistic note against the soulless, mostly unfunny absurdism that lost its mysterious edge besides Adam Driver’s actual efforts when seeking something reasonable amidst the senseless chaos. (C)",
    "date": "2025-06-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Só não é pior porque temos boas atuações, mas o roteiro é muito inconstante e não leva a lugar nenhum. Pensamos que é um drama familiar, pode até ser, pensamos que é uma crítica social e política, pode até ser, pensamos ser um filme de terror, pode até ser, e com isso, lá se foi 2h e não se chegou a nada.",
    "date": "2025-04-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The novel attempts to capture the banality of suburban life and, to a degree, succeeds. I don't think it's a great novel or a great film, but it's a decent novel and perhaps an even better film.\n\nWe enjoyed the music video in the grocery store at the end. That was a lot of fun.",
    "date": "2025-03-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It was enjoyable, even if the movie's deeper meaning gets lost in the quirkiness.",
    "date": "2025-02-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "...Its something. Has some very good humor and some really good plot points, but it can feel like a slog. Watch it on a 8 hour flight.",
    "date": "2025-02-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "White Noise: This is a bit of a weird film. It's part disaster movie, part period piece, with pseudo-academic overtones and yet it's got box office star Adam Driver. Driver looks somewhat like Alan Partridge, but is the best thing in the film. What didn't work was Greta Gerwig, who is a terrible actress and is acted off the screen by some of the supporting cast. The film looks horrible, at times dark and underlit, and at others displaying those sort of nonsense colours that the film and television people use when they are depicting the late 1960s. The disaster scenes are well-realised and edited, but they are only a small part of the whole.",
    "date": "2024-12-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Unfortunately, the skewed too far from the novels ending and several things throughout to be considered a great film. It was fun to watch. It had a nice budget, but Mr. Baumbach’s talents could be better served elsewhere",
    "date": "2024-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "What a boring boring movie with zero intrigue",
    "date": "2024-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It really bothers me how much hate this film has gotten. I don't think I'm smarter than anyone else; but I do think that our films have gotten so watered down that people aren't used to having to think or be provoked. \n\nThis film gets called \"absurdist\". It's not absurdist. It's real. It's about your life. It's about all of us. The major theme is that people build walls between what's real and their life. Families are little bubbles; people want their kids to be young forever. The film pokes fun of academics - they think they know everything, but they are good at talking about things but not experiencing it. The protagonist is a Hitler scholar, and yet he seems to not realize that Hitler is synonymous with death. He is very afraid of death, but he doesn't see that his academic work has to do with death.\n\nVirtually every scene displays this same phenomenon. People go to the supermarket to prolong their lives; they don't often think that butchers kill animals to give you their life. People get worried that they will die from crazy unlikely things, and yet, they act like they are invincible. They are bored with their lives, but they want to go on living forever. \n\nI'm not sure why people don't think there's a plot. The beginning sketches out this fear of death and the walls people build; the second act is when something terrifying happens that makes them feel death is close; the third act is the trauma from the fear of death. The main character received a diagnosis he will die from the gas, but he doesn't know when; so really, that's just like all of us. The wife is taking pills to get her mind off thinking about death. But when people leave the doctor's office, they stop thinking they're a patient.\n\nThe main character's best friend studies Elvis - and people always joke that Elvis never died. \n\nYou're free to hate the movie, but at least use your brain to realize that this movie is trying to tell you that you are like all the characters, building your walls and watching your Netflix so you can pretend you're not going to die.",
    "date": "2024-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "i genuinely can’t tell if i love this or hate this. i think it’s the former, but i don’t know.",
    "date": "2024-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The filmmakers aimed to make something hilarious and horrifying, but missed the mark in this adaptation of a postmodern novel about the fear of death. A simple google search about the source material reveals that for years many people felt the story of the novel would not translate to the screen. Those people were right. Credit to the filmmakers for trying, but simply trying does not make an enjoyable movie watching experience for the audience. The film is well cast with big stars and the performances are good, but it hinges on fluid and fast paced often overlapping dialogue that says so much but yet says so little. The film tries too hard to be high art, and maybe it is, maybe psychology classes can examine these characters and dissect every line and find the hidden meaning, but the normal audience will most likely be bored by it all. The film tries to do too many things. Is it a story about an emergency health crisis? Is it a story about a failed marriage? Is it a story about a midlife crisis? Drug addiction? Depression? Anxiety? Infidelity? Why was there a whole segment on Americans fascination with car crashes in movies? I'm sure the novel would be great fodder for a college level class spending a semester examining the themes, but as a two hour movie it just didn't work.",
    "date": "2024-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I think many reviewers are missing the point of this movie. I did at first. It is about going so far into something that you have become a useless expert. You can spout fonts of information about something that does you and your listeners no good. The film is less about what is directly happening to the characters, and more about what it makes you feel to witness it. I LOVED the final scene.",
    "date": "2024-03-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The movie is quite funny, especially in its depictions of academia and in the character's reaction to the disaster. However I'm not sure the second half of the movie works at all.",
    "date": "2024-02-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I singed up for Rotten Tomatoes just to say how bad this movie was.  This was spun as a dark comedy and that drew me in. Ends up it was dark, but not funny at all.  The acting was poor, I didn't get the Hitler stuff, and the characters were somewhat annoying. And the dance scene at the end, how bizarre…. Overall a waste of 2 hours.",
    "date": "2024-02-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This was very \"stagy\" from the heavily rehearsed dialogue being rapidly blurted out to the VERY theatrical ending that came across as overly choreographed, but ironically the perfect ending for something that looks like a play taking place on a stage…rather than an actual film production. The storyline was all over the place, disorganized and sloppy, but this film did rack up a few brief moments worth watching.",
    "date": "2024-02-14"
  }
]