[
  {
    "user": "Sebastian Zavala Kahn",
    "rating": 2.5,
    "text": "The biggest problem with “Kung Fu Panda 3” is tone: while the first two films WERE funny, the third film TRIES to be funny with too much hyperactivity and “gags” everywhere, saturating the viewers instead of making them laugh. Full review in Spanish.",
    "date": "2024-03-16"
  },
  {
    "user": "Jana Monji",
    "rating": 3.0,
    "text": "While this is the weakest of the now four feature films, it does give Po his father and show his two fathers negotiating team parenting. Po must find his chi and fight jade zombies with the help of his biological father's panda village.",
    "date": "2024-03-13"
  },
  {
    "user": "Rolando Gallego",
    "rating": null,
    "text": "Kung Fu Panda 3 continues centering its potency on gags and slapstick humor... [Full review in Spanish]",
    "date": null
  },
  {
    "user": "Brian Eggert",
    "rating": null,
    "text": "Overall, the animation arguably achieves the best looking of the three movies; however, Kung Fu Panda 3 is also the most inconsistently stylized.",
    "date": null
  },
  {
    "user": "Don Shanahan",
    "rating": null,
    "text": "Its nimble combination of clever humor and endearing heart is undeniable.  This is a cant-miss crowd pleaser that pulses with energy in all the right places.",
    "date": null
  },
  {
    "user": "Richard Crouse",
    "rating": null,
    "text": "The rare sequel that holds up to the original. It's respectful to the story but more importantly it's respectful to the audiences who have grown to love these characters.",
    "date": null
  },
  {
    "user": "Mike Massie",
    "rating": null,
    "text": "Visually, everything continues to advance in sharpness and movement and flashiness.",
    "date": null
  },
  {
    "user": "Richard Propes",
    "rating": null,
    "text": "We've become part of the Valley of Peace and the world of Po and his friends and mentors.",
    "date": null
  },
  {
    "user": "Allen Almachar",
    "rating": null,
    "text": "Perhaps a simple, good-hearted story with plenty of color, comedy, and action is all that people need. And if that's the case, Kung Fu Panda 3 does what it needs to.",
    "date": null
  },
  {
    "user": "Chris McCoy",
    "rating": null,
    "text": "Flowing freely between styles inspired by anime, Pixar, and Asian woodcuts, Kung Fu Panda 3 is easily the most visually lush film DreamWorks has ever produced.",
    "date": null
  },
  {
    "user": "Debbie Lynn Elias",
    "rating": null,
    "text": "Be it Panda-Rific, Perfectly Panda or Panda-monium, one thing is for certain when we're talking about Kung Fu Panda 3 - It's the Best.Panda.Ever.",
    "date": null
  },
  {
    "user": "Mattie Lucas",
    "rating": null,
    "text": "These are surprisingly strong but incredibly relevant themes for a children's movie, and Yuh continues to relay them with humor and grace.",
    "date": null
  },
  {
    "user": "Rachel Wagner",
    "rating": null,
    "text": "It's exciting, funny, sweet and I was consistently entertained. I want to give a special congrats to director Jennifer Yuh Nelson.",
    "date": null
  },
  {
    "user": "David Brake",
    "rating": null,
    "text": "Powered by humour, a plethora of colours, textures and - most importantly - a strong story, Kung Fu Panda 3 is a film that ensures the panda himself has a legacy.",
    "date": null
  },
  {
    "user": "Mae Abdulbaki",
    "rating": null,
    "text": "\"Kung Fu Panda 3\" is very well done, the characters fun, and the fight that Po has to handle, both personal and otherwise, make for an enjoyable animated feature that teaches good lessons, while still remaining entertaining.",
    "date": null
  },
  {
    "user": "Allen Adams",
    "rating": null,
    "text": "[Kung Fu Panda 3] is a film that, while undeniably familiar, still manages to retain a bit of freshness.",
    "date": null
  },
  {
    "user": "Micheal Compton",
    "rating": null,
    "text": "Kung Fu Panda 3 may not have the same emotional impact as the first two films or the higher-level Pixar productions, but is still a solid bit of family entertainment.",
    "date": null
  },
  {
    "user": "Frank Ochieng",
    "rating": null,
    "text": "Thankfully, Kung Fu Panda 3 is just as fresh and frothy the third time around. Quite frankly, this infectious kiddie karate chop to the giddy soul is rather charming.",
    "date": null
  },
  {
    "user": "Jennifer Heaton",
    "rating": null,
    "text": "It doesn't quite have the originality of the first film or the boldness of the second, but it still has heart where it counts.",
    "date": null
  },
  {
    "user": "Jacob Oller",
    "rating": null,
    "text": "Kung Fu Panda 3 pushes the series forward towards its potential as a centerpiece of biculturalism.",
    "date": null
  }
]