[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Don’t waste your time on this one",
    "date": "2025-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Me Time (2022) — starring Kevin Hart and Mark Wahlberg — should’ve been a surefire comedy hit. With a duo known for their charisma and comedic timing, expectations were high for something outrageous, funny, and wildly entertaining.\n\nUnfortunately, the film falls flat on almost every level.\n\nThe humor feels forced, the pacing drags, and both Hart and Wahlberg are guilty of overacting to the point where scenes become exhausting instead of amusing. Wahlberg, in particular, seems to push way too hard in moments that don’t require it, turning what could’ve been subtle laughs into awkward stretches of screen time. And Kevin Hart, though undeniably talented, leans so heavily into his usual shtick that it feels recycled and hollow.\n\nRegina Hall, while a strong actress in many projects, feels miscast here. She doesn’t quite ground the film the way her character should. Instead, her role feels more like an afterthought or parody than a meaningful addition to the story. There’s a lack of chemistry and purpose for her character that makes her presence feel underutilized.\n\nAnd let’s be honest—the only thing anyone seems to talk about with this film is Mark Wahlberg’s nude scene. If that’s the most memorable takeaway, then the film clearly missed the mark.\n\nMe Time is forgettable, frustrating, and ultimately a waste of potential (and budget). A film with this much star power shouldn’t feel this bland, but somehow it does.",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Trying to be funny, but it just isn't.\n1/3 of the movie builds up to... nothing. And then it just keeps on being not that funny. \nTurned it off before the end. Life is too short.",
    "date": "2025-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Bad movie but the beginning when he got attacked by birds kinda of funny.",
    "date": "2025-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "some entertaining parts but it tried too hard to be funny and relied too much on rapid dialogue by wahlberg and hart.",
    "date": "2024-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This movie is way to harshly rated did nothing wrong it was a kevin hart movie",
    "date": "2024-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "shittiest movie I've ever seen. wanna waste 2 hours? this is it. I'd rather watch the goat screaming meme on repeat for 2 hours. never have i ever regretted wasting 2 hours of my life . imagine being a movie so bad that you make a Rotten tomatoes account just to leave a review",
    "date": "2024-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "A vaguely funny comedy with a plot that had no idea where in the world it was going.",
    "date": "2024-03-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The movie was okay to watch but not the best to be honest, you kind off feel bored in the middle of the movie",
    "date": "2024-02-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "yikes that was bad, mark whalberg was good but only if the script is and this is just sad",
    "date": "2024-01-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Great feel good film! Not the best reviews but it'll lift your spirits and that's what a Kevin heart film is meant to do.",
    "date": "2024-01-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This seemed like a 5 year old wrote it—not funny, basic as heck",
    "date": "2023-12-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Me Time spent too much time on the development of side characters, leaving very little time to focus on the chemistry between Hart and Wahlberg.",
    "date": "2023-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "this movie is like a food with lots of salt (Kevin Hart) that will make you want to puke.",
    "date": "2023-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I think it was funny and I dont see why IT ONLY HAS 6% ??!?!?",
    "date": "2023-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Rating: 6/10. 69/100",
    "date": "2023-04-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It was ok. I had a couple of \"laughs\" but that was it. Thought it would be better with Mark and Kevin as main cast but I guess I got my hopes up.",
    "date": "2023-03-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "What begins with a decent premise is executed terribly. It's simply not a movie but a montage of lousy, unfunny gags involving bodily fluids. Househusbands everywhere deserve better.",
    "date": "2023-02-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Kevin and Mark are fun to watch, you can't deny...but Me Time kinda fumbles towards the end. With resolution being split between both main characters, it's hard to be satisfied with the ending...but some great laughs along the way.",
    "date": "2023-02-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Marky Mark phoned this in. They should have explored the Hart and Santino dynamic. That would have had the potential to be a lot funnier.",
    "date": "2023-02-06"
  }
]