[
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Ben and Jerry Stiller are gold. Besides that meh.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was absolutely hilarious when you take it for what it is - simply a comedy! Those who overthink the characters and morality behind the character decisions are overthinking it and setting the wrong expectations. The cast and writers nailed it!",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I think the original 1972 movie is a better film, but this one is good too.  There are plenty of laughs.",
    "date": "2025-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is my favorite Ben Stiller movie! It is so stinking funny 😂",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Don't listen to the reviews- they are probably all too young to have any fun without being offended. If you liked Something about Mary= you'll like this. Funny story, cool concept, decent sophomore humor, it's a fun movie to watch, though predictable. I WILL be keeping this in my collection. Enjoy.",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "He waited all his life to get married. \nToo bad he didn't wait another week.\n\nThe Heartbreak Kid is a 2007 American romantic dark comedy film directed by the Farrelly brothers  💔\n\nNot bad, but not my favourite either 😉\nIt’s ok, but I feel mixed about this one 😉\nI’d recommend it if you like this genre, but if not then probably give it a miss 👍🏼👎🏼\n\nEddie, the 40-year-old confirmed bachelor finally says \"I do\" to the beautiful and sexy Lila. But during their honeymoon in Mexico, the woman of his dreams turns out to be a total nightmare, and the guy who could never pull the trigger realizes he’s jumped the gun.",
    "date": "2025-06-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "10/10 Movie smashed. I haven’t laughed that hard in years. Went in completely blind to the story and cracked up from beginning to end.",
    "date": "2025-04-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Filme bacana, o roteiro é bacaninha, o filme tem cenas mais ou menos de comédia, a história é bacaninha, o elenco é bacana e alguns ajudam a melhorar o filme, mas o filme deveria ter cenas bem melhores.",
    "date": "2025-04-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Really funny, especially if you're a Ben Stiller fan.",
    "date": "2024-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Just another Hollywood trash movie from the 00s that is very homophonic, go figure",
    "date": "2024-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Amusing Ben Stiller comedy movie about marriage and relationships.",
    "date": "2024-05-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Avoid at all costs. Only redeeming factor is the nude sex scene at the start. Best breasts in the movie. Then shut it off. Pale immitatiin of tge Charles Grodin original.",
    "date": "2024-04-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Predictable but funny! The cast is fantastic.",
    "date": "2023-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I liked the beginning of this movie, but as it progressed from San Francisco to Mexico, it started to become crude and unfunny. I liked the locations, and the overall look of the movie is bright and upbeat with plenty of sunshine. Comedically though, it's a real mixed bag. Some of the setup's are good, but it doesn't seem to recognise when it crosses the line of good taste. It's a shame because with more care, it could have been a much better film.",
    "date": "2023-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This is absolutely hilarious. Not sure why it didn't get better reviews. Recommended for a good laugh.",
    "date": "2023-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I tought I was not going to like it since I saw one rom com and I hated it and even if they ate all the same this was actually fun and Ben Stiller is good in it.\nExcept everything while watching the finale I was going to kill myself since I want Ben and Michelle to get together.",
    "date": "2023-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent show. As I read the reviews I am very surprised, maybe it’s the easily offended!! One of Stillers best!",
    "date": "2023-04-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "only boomers can say that the old one is better, i try to see that thing and is boring as hell, this with ben stiller is so good",
    "date": "2023-04-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's pretty funny. I can't believe it got such a low rating. I don't usually watch romantic comedies, especially lovey-dovey PG-13 movies. They make me want to gag. But this movie was entertaining, crude, and funny. Grownup fun.",
    "date": "2023-02-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's funny, engaging, and ben stiller is a hoot. While I can see why some ladies don't like it, it is a light hearted comedy at the end of the day and shouldn't be taken too seriously.",
    "date": "2022-09-28"
  }
]