[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Great story. Could only the be a bit faster on the beggining when telling a bunch of random people's history.",
    "date": "2024-02-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "An extremely intense documentary about an extremely intense sport. Up there with Free Solo and it will stay with you for a while.",
    "date": "2023-12-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "You have to see this movie. It is cut from real footage but assembled together to make it look like a film. Extraordinary when you know that everything on the screen is for real. This is next level fabulous.",
    "date": "2023-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "\"The Deepest Breath\" is a beautifully crafted and captivating documentary that masterfully blends stunning visuals, thrilling suspense, and genuine human stories. Whether you're an avid fan of underwater exploration or simply looking for a thought-provoking and inspiring film, this documentary will leave you in awe of the human spirit and the wonders of the ocean depths. Prepare to be mesmerized and moved by \"The Deepest Breath.",
    "date": "2023-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely breathtaking",
    "date": "2023-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely mesmerizing! 'The Deepest Breath' documentary takes you on an unforgettable journey into the profound depths of human experience. The storytelling is masterfully crafted, weaving together emotions, science, and breathtaking visuals. A thought-provoking exploration that leaves you with a newfound appreciation for the beauty of breath and life itself. A five-star masterpiece that resonates long after the credits roll.",
    "date": "2023-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "87%. Starts a bit slow - educating you on the sport and meeting the people involved. The last hour is fascinating. Alessia gets the world record but then really wants to go to the really challenging underwater cave and that's where everything goes wrong. The way they shoot it is crazy because it seems as though Alessia and Stephen are both dead, until Alessia is finally shown interviewed and you realize Stephen saved her and sacrificed himself. Incredible story.",
    "date": "2023-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Endorphin porn, a shallow look through blue tinted lenses at people who know how close they are to touching death with every deeper dive. No matter how beautiful the photography, the locations, the Adrenalin junkies' diving bodies, there is no escaping the fact that free-diving at this level is  dicing with death every time, and the people who organise it are utterly reckless in their failing to provide adequate safety measures for divers. The film fails to address this, just as it fails to cast any meaningful light on the personalities of the ‘stars' of the film. It's a truly tragic film, a cleverly constructed snuff movie. While viewers won't get the almost two hours of their lives spent watching it back, at least two of the people in the film won't get their lives back at all. Truly sad.",
    "date": "2023-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Plunging into the peculiar world of competitive freediving, THE DEEPEST BREATH is a deeply compelling documentary, where stunning underwater cinematography and the elegant dangers of freediving take on a stirring mythic dimension. Part tale of obsession, part moving love story, this is a rare docu that ultimately makes the human spirit its true subject.",
    "date": "2023-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing, eye-opening story. Excellent stuff!",
    "date": "2023-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Documentario eccellente ed emozionante come spesso riesce a fare Netflix.\nRacconti di vite al limite senza tralasciare dettagli e senza mai abbandonare l'oggettività necessaria a raccontare in maniera imparziale gli avvenimenti; dando voce a tutti e cercando di indagare su ogni aspetto il più possibile.\nLa storia di Alessia e di Stephen è romantica e tragica, raccontata dal principio alla fine senza trascurare i dettagli della loro infanzia e della loro formazione.\nLa sequenza iniziale è un capolavoro per la potenza con cui arriva, inaspettata e devastante nella bellezza e nella brutalità.\nProgetti di questo tipo aiutano a rendere più noti gli sport meno frequentati e possono anche aiutarne la sicurezza e lo sviluppo.",
    "date": "2023-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Never knew this extreme sport existed. In my opinion it also seems like the most dangerous one too. \nIt was exciting to watch as each reached a record and we're setting a goal for themselves. I would recommend watching.",
    "date": "2023-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely incredible.  Moving and edge of your seat scenes.  If you are interested in extreme sports or not, you will find the incredible discipline required fascinating, inspiring and somewhat scary.",
    "date": "2023-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "As beautiful as it is intensely uncomfortable make this an unforgettable watch",
    "date": "2023-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Well done, interesting topic.",
    "date": "2023-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "'The Deepest Breath' is part compelling documentary, part thriller, part real life tragedy. But more importantly one of the best films I've ever seen.\n\nSYNOPSIS: 'A champion and expert safety diver seemed destined for one another. Despite different paths taken, they meet at the pinnacle of the free-diving world, experiencing the thrilling rewards and inescapable risks of chasing dreams through the depths of the ocean'.\n\nVisually stunning with incredible photography from the real events shown within the documentary, 'The Deepest Breath' is such an intense movie it will stress you out.\n\nAs someone who has a fear of going under water this film touched on every fear I have and more. I found myself transfixed and glued to every second on screen.\n\nIf you ever wanted an examination of how small humans are compared to the world around us, and especially the underwater world, this is that film.\n\nThis isn't just a story of sportsman and women pushing them to their absolute limits, it's a story of love and the most harrowing of losses. The line of risk vs reward runs deep here and I'd argue that the risk was just not worth it.\n\nI can't express how good this film is. More importantly it touched me and made me feel the loss and pain of those involved within the documentary.\n\nPoignant, moving but terrifying.\n\nIt's just the best. Watch it! \n\n10/10",
    "date": "2023-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's a emotional and painfull documentary about the braves of too many persons that's form part of the most extreme sport in my opinion",
    "date": "2023-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Part romantic drama and part nature documentary, The Deepest Breath will leave you in tears. While at times disjointed and hard to follow, the film chronicles Italian freediver Alessia Zecchini and her mission to break a world record with the help of safety diver Stephen Keenan. There are some serious questions about this, namly why are people in love so willing to push the envelope. The title says it all, and the filmmaker does an excellent job of setting up what freediving is. Often uncomfortable, it is very hard to believe how long these people hold there breath! While I wanted more about the relationship, it focused more on diving. Exciting and full of energy, but what really works is how well the sea is captured on film. Despite it being repetitive, the final few scenes more than make up for it! Final Score: 7/10",
    "date": "2023-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The excitement and danger of diving in a documentary that has enough to put the viewer in the shoes and scenario of the same protagonists. The action level may not be satisfactory for everyone, but that shouldn't be a problem.",
    "date": "2023-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "You are anxiously waiting for the end of each dive counting each second they hold their breath.  The views underwater are breathtaking and the story really touches the heart.   Well worth it.",
    "date": "2023-08-05"
  }
]