[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 01 hour, 53 minutes, and 29 seconds!!!!!!!!!!!!!!!!!!!!!!!!!! Rated PG-13 for Drug References, Crude and Sexual Humor, Language and Violence!!!!!!!!!!!!!!!! The USA grossed over $158,100,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A more serious movie.  Good plot.  Great performances.  I prefer the silly Sandler movies, but this is a good movie and a good watch.",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A great retelling of the classic Burt Reynolds movie. Sandler brings all the laughs and great characters. Tim Treakle",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's a very good movie, the cast complements each other a lot and together they create a good plot, I recommend it. \n\nJhesua Díaz",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "What a huge huge huge crap.",
    "date": "2025-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "You know the first 30 minutes or so is pretty good actually. Quick setup, moves fast, and the humor is pretty good actually. It's typical Sandler stuff but it's done well. Nothing clever or deep but heck neither was the original either. The soundtrack is great and easily the best improvement from the original. But on the flip side nothing else I'd say is done as good as the original. Everything else is half decent though and the direction isn't bad. This has higher production value to it I'd say than a typical Sandler comedy and has a color saturation look to it a bit which I liked. Chris Rock is great also and the best character in this. The story is pretty much exactly the same as the original with no real changes besides Sandler humor. so much so that I don't really see how it justifies existing beyond Sandler fans who haven't seen or aren't aware of the original. Sandler isn't bad but Reynolds was better as Paul. It feels like Sandler is just being himself and lacks Reynolds charisma. Oddly enough Reynolds in this is....alright I guess. He feels like an afterthought and besides paying homage I don't get why he is here. His character really doesn't add much that couldn't have been done with Rock's. This also focuses more on building the team and gags. It starts to wear itself off a bit as it drags a bit assembling the team and getting repetitive a bit adding forgettable characters. The game itself isn't bad but again it's more gags than the original during this part. But I will say it is easier to follow signifcantly than the original in that regard too. But the tradeoff comes from more gags where the originalw as much more serious at this point. I think beyond Sandler fans, most would like the 74' one better. While that isn't a masterpiece it's overall more consistent and has more charm despite the humor maybe not landing as well. Most could skip this though. Not the worst Sandler comedy though and defintely one of his better 00's ones.",
    "date": "2025-06-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Better than cuties. Stone Cold Steve Austin says the N word",
    "date": "2025-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "“Some laughs but mostly just okay” – 3/5\n\nThe Longest Yard tries to mix sports, comedy, and a bit of action, and while there are moments that land, overall it feels kind of uneven. The cast, led by Adam Sandler and Chris Rock, brings some funny bits, but the jokes don’t always stick and sometimes feel a bit forced.\n\nThe football scenes have energy, but the story leans on familiar clichés and predictable plot points. It’s watchable if you want a light, goofy sports movie, but don’t expect anything too fresh or memorable.\n\nNot a bad way to kill some time, but it doesn’t really stand out.",
    "date": "2025-05-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not your typical Adam Sandler comedy but good homage to the classic.",
    "date": "2025-03-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Probably one of the worst remakes ever. To believe Adam Sandler compares to Burt Reynolds as a sexy badass NFL quarterback is laughable.",
    "date": "2025-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is one of those movies that critics love to hate on, because it has Adam Sandler in it. It’s perhaps the best Adam Sandler classic of all time. It will make you laugh and cry, and it will excite you for the final scene(s) which is obviously the game. An emotional roller coaster, this movie at times is hilarious, at times it also will have you feeling like crying your eyes out at what happens to Caretaker. Finally, what happens to Caretaker will have you angry, yet pumped for the ultimate revenge. The game. Which in itself, is a great mini-movie within the movie. Best Sandler film ever with a star studded cast.",
    "date": "2024-12-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I don’t outright hate the longest yard remake, but I wouldn’t say I like it either. It’s kind of “meh.” It’s not a good movie. I will say there are moments where I can see Adam Sandler and Chris Rock having some decent chemistry with each other. They bounce off each other decently well. I can see why people wanted to put those 2 folks together. It’s the remake based on the original 1974 film. There is some humor in it where I’m like “that was dumb.” If there is a better script then the film would be funnier. There is some fat jokes which I’m like “really?” Some of the jokes don’t work comedic wise. The longest yard remake is not even close to being one of the worse movies ever. There are moments that make me chuckle, but it’s not a hilarious movie. There are a lot of flaws. It’s got a neat concept where Adam is a quarterback and assembles a team in training. He’s got to get a team together before the big game. Adam and Chris are good friends throughout most of the film and Burt Reynolds is the coach of the team. There are some positives, but it has lots of problems.",
    "date": "2024-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A copy of the original in many ways, the final game between the Guards and the Inmates comes down to the same schtick.\nAnd even ends with the same score (I think) ... except on my scorecard where it comes up 1 point shy of the original.",
    "date": "2024-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Such a nice film from 2005. I mean, it’s a remake of The Longest Yard from the 1970s.",
    "date": "2024-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Man, this movie has so many jokes and man amazing actors through the whole thing. Not going lie Chris Rock scene in the cell oh my gosh gets me everytime damn time another good ass movie love the football and always a mc double we need lol",
    "date": "2024-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great comedy, seen it a few times and I think it’s a good one to watch when bored.",
    "date": "2024-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It’s a movie you can watch with the family to enjoy a couple of times!",
    "date": "2024-06-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The single greatest movie of all time. Comedy? ✅️ drama? ✅️ sports? ✅️ simply amazing",
    "date": "2024-03-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The Longest Yard has no reason to exist because of 2 reasons, 1. What does American football have to do with being in jail & 2. Why would you cast Hip Hop artists like Nelly & D12 in a Happy Madison film? And also shame on this movie for making a reference to Forest Gump, this isn't just the worst film of Happy Madison Productions it's also a contender for one of the worst of 2005 full stop.",
    "date": "2024-03-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I'll start by admitting that I had no interest in this movie at all. I only saw it because I was dragged. Was it as bad as I thought? Not at all. It was way better than I expected. We all know those mindless comedies with barely a plot, cheap dialogue, and jokes galore. I thought this was one of them. I was wrong. This remake had a pretty good storyline and a few laughable jokes and moments. I usually don't laugh out loud at movies, but I did find myself doing so three or four times here. So that takes care of the Funniness Factor. The story is easy to get involved in--you want to see the prisoners kick the guards' butts in football. It is a well-played story and fun to watch. Sandler is not one of my favorite actors, but I have to give him his props because I am starting to see that he usually stars in movies that are at least remotely funny and that have a pretty decent plot. But the main thing is that his characters usually act the same. I would get into the slight lack of character development, but I'm sure you don't care to read about that. You only wish to know if this movie is funny or not and if it's worth watching! Well, yes, the movie has its moments and it's good to watch, especially if you like football or are a Sandler fan. This has its good kicks and it is near a touchdown in the comedy category. So if you want to have a good time and relax to some entertainment, you can watch this one =)",
    "date": "2023-11-10"
  }
]