[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love Aston Kutcher and Reece Witherspoon, it reminded me of the 00’s rom coms, they both always starred in. Light hearted, a little cheesy, but thats what i loved about it! A feel good movie :)",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Was already having a bad night. Ordered pizza and put this on hoping to cheer up. This movie made my night worse",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Quite literally one of the worst movies I’ve ever seen. I don’t think a movie has ever made me so angry.",
    "date": "2024-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Disappointed. I usually love a good Ashton Kutcher Rom com and we haven't had one in a while. And who better for the female lead than Reese! However, we never get the two of them together through a majority of the movie. We see an opening scene where they romp and then a ton of split screen phone calls where there is no building of this supposed romance hiding within them. We get a little chemistry from Jesse and Reese and I was hoping this was going to be a scenario where Ashton and Reese discover they don't have feelings after all and she reconnects with Jesse but...no. There is this reunion at the end where we are supposed to feel something but feel nothing because we had no build up of this relationship. Great cast, horrible plot.",
    "date": "2024-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I don’t think I can recommend this movie just because it was so cheezie. Personally not my fav. It had some funny parts but very badly written",
    "date": "2024-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I enjoyed this film. I’m really surprised about the bad reviews. It was a pleasure to look at both their apartments which were both beautiful and I liked the story. Was it great, no but it was certainly enjoyable. It was a nice little romcom, perfectly enjoyable.",
    "date": "2024-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "So boring, no chemistry at all between the actors.  Don't waste your time",
    "date": "2024-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Almost didn’t watch this because of bad reviews. That would have been a mistake.  Enjoyed it for what it was - a light warm hearted rom com.",
    "date": "2024-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Le film est plat, l’intrigue est basique, le jeu des acteurs n’est pas bon. Les dialogues ne sont pas drôle la fin est prévisible.",
    "date": "2024-04-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "A storyline so loosely woven it doesn't even qualify as fabric. A screenplay so weak that characters struggle to make their connections clear to viewers. Background and legit character development...ppffft...we'll be having none of that! A missed opportunity for the cast (the one redeeming quality of this project), too bad this singular quality isn't enough to make this worth spending an hour and a half of your life's time. I'm shocked that this actually made it to the screen...an unfortunate error in judgement.",
    "date": "2024-04-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "In a world desperate to make a connection, I found this movie to be trite and completely lacking in the sort of relationship it was meant to be built on. From a one night hook up, we're meant to believe that these characters have built a life long friendship? Please. And suddenly, he's been in love with her the whole time? Ick. I don't know how this movie got made, but I could write a better script. Seriously. It's not good when you like the supporting characters more than the main characters. The gardener that meant nothing? Wtf? Not bagging the actors, cos I love them all (seriously, they are the only reason I watched this tripe) but this movie feels like a souless money making venture that failed abysmally",
    "date": "2024-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The script and story are okish , it's your typical rom-com without the com, bit when you cast Ashton Kutcher in a comedy it tend to drain much of it out and whatever spark it did have left is smothered with the lack of on screen chemistry any of the the actors have with each other, and ridiculously awfully wooden and boring performances from Tig Notaro and Steve Zahn, its not even worth putting on for background noise",
    "date": "2024-03-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie was the most lame plot with absolutely no redeeming qualities",
    "date": "2024-02-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "So very pedestrian. Not impossible to think this film was put into producion as a cash cow. It has no scheduling issues (given they are never in the same shot together, by design)",
    "date": "2024-01-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Waste of time.\nWooden acting.\nRidiculous characters.",
    "date": "2024-01-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Despite every fiber in my being realizing this is nothing more than a sitcom-level rom com without a single original idea to add to the genre, I have to follow my heart and give this a lukewarm recommendation for one simple reason: I genuinely wanted these characters to end up together at the end. And I assume that's the ultimate goal of a movie like this. I'm not going to spend sentences justifying my opinion - I just gotta follow my heart. Surprisingly, what won me over was not Witherspoon, who can do movies like this in her sleep, but Kutcher. He's an actor who has never impressed me in the past, but I appreciated him here, particularly in his scenes with Witherspoon's son, well played by Kimmel. Supporting performances by Steve Zahn, Zoe Chao and Tig Notaro are humorous but feel more like gimmicks than people. And any rom com fan will guess every moment within the first 15 minutes. But Kutcher and Kimmel won me over. I can safely say I won't watch this again, but I don't regret watching it in the first place.",
    "date": "2024-01-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great script, loved it !",
    "date": "2024-01-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I gave it half a star because my date said to stay awake. It was insufferable. The first is the lack of any chemistry between the two costars, the second is the kid who looks like a girl and we're supposed to believe he likes sports, and finally the absurd friends  that are the support group for these dysfunctional immature idiots. \n\nI end now because I just wasted an hour and a half of my life and do not want to waste any more time.",
    "date": "2023-12-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "If you liked \"A Lot Like Love\" you'll like this.  Similar movie, just a couple decades later.  Decent flick.",
    "date": "2023-12-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Your Place or Mine is a throwback to old rom-coms we used to enjoy starring some actors we used to enjoy. However, the filmmakers don't really try anything new or interesting. Like a run-down ride at a carnival, this movie chugs along the same track we've been on many times before, but it's not quite as fun as it once was. There's no real reason for the two leads to not be together, other than the invisible barrier the writers invented. And, much like the rickety amusement park attraction, Your Place or Mine comes to jerky, abrupt end, leaving the viewer somewhat unsatisfied and slightly annoyed.",
    "date": "2023-11-03"
  }
]