[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a great, fun film with heart. Don’t listen to the negative comments, it’s well worth a watch!",
    "date": "2025-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Just a total timewaste. I am not a big critic but what I can say that there were very silly mistakes, matters that could be handled or perfected.",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Though not terribly memorable, Gunpowder Milkshake is a fun enough action flick that stands out from the flood of \"girl-power\" action films thanks to its incredibly engaging cast.",
    "date": "2025-06-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Gunpowder Milkshake tries too hard to be a stylised female John Wick. It needed more inspiration instead of ripping off Hong Kong action movies.\n\nIt also lacks the heavy duty gunfire which I  thought it will be there.",
    "date": "2025-06-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely brilliant movie,just finished watching it and will encourage all I know to watch it to.",
    "date": "2025-05-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Jane Wick by someone who didn't see John Wick but thought it was a good idea to make female version.  Painful to watch.",
    "date": "2025-03-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Corny? Predictable? Maybe but I enjoyed the hell out of this movie. On to the review.\n\n\"Gunpowder Milkshake\" is a visual treat, boasting a stellar cast and a vibrant, action-packed storyline. Karen Gillan absolutely steals the show, delivering a performance that is engaging and entertaining. The film's vibrant tone and slick direction make it one of the most entertaining action flicks of 2021, hands down.\n\nHowever, despite the array of talented actresses, it feels like most of them are waiting in the wings until the final act to truly shine. This slow buildup does detract a bit from the overall impact, but when they finally get their moment, it’s explosive and worth the wait.\n\nThe movie masterfully blends style and substance, offering a fresh take on the female assassin genre with nods to classics like \"Léon\" and \"La Femme Nikita.\" The action sequences are nothing short of spectacular, with a delightful mix of blood, guts, and elegant twirling that keep you on the edge of your seat.\n\nWhile the narrative may not be the most compelling, and it's quite by the books and predictable, the film compensates with its eye-catching visuals and dynamic performances. It's a bit like a rollercoaster ride—perhaps not the deepest experience, but undeniably thrilling and a whole lot of fun.\n\nIn short, \"Gunpowder Milkshake\" is a dazzling, fun-filled ride that action fans, especially those who enjoy female-driven stories, will undoubtedly appreciate. It’s not perfect, but it’s a bold, entertaining romp that promises and delivers a good time.",
    "date": "2025-03-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "An entertaining shoot-em up movie. Who knew a library could be so deadly...",
    "date": "2025-03-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Sakto lang na very formulaic or may umay factor. Oks sana un ensemble casts pero nakulangan ako sa mga fight scenes & gore. Siguro hinabol nila na kontrolin ang violence para pasok sa PG13 o young audiences. Daming sayang sa pelikulang to.",
    "date": "2025-02-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I have set up an account just to review this movie.  It was so bad I couldn’t let it waste other people’s time too without trying to prevent it.  If you only have this movie as an option, turn off your system and sit in silence.  This is a perfect example of what happens when there is too much money thrown into a movie for actors, and the story is just pieced together from other movies and the director is just stealing from other successful directors for a style that they hope will sell.  It’s a big puff of a movie with no semblance of a plot or direction.  I guess it’s only redeeming quality is people were paid in the process of making the movie.",
    "date": "2024-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Gunpowder Milkshake is a lotta fun reminiscent of Atomic Blonde, but partially a little stylised like Sin City and maybe a little Leone thrown in too. Karen Gillan is great as the older Sam left by a mother on the lam for working a little too hard for her killer firm. Left behind Sam is cared for by her mom’s handler Nathan (Giamatti) and he turns her into a more deadly employee than her mom. Alas, she kills the wrong guy before trying to get back money stolen by a firm accountant who’s daughter’s been kidnapped and feeling a kinship for this absent parented girl she messes up badly. All hell breaks loose when wrong guy’s daddy goes after the girl & Sam & she enlists the aid of her absent mom (Headey) & her mom’s friends (Bassett, Gugino & Yeoh). It’s a freakin blood soaked free for all and just a lot of fun. Coleman is great as the little girl! \nPut it this way, if it made enough to order a sequel, I’d buy another milkshake.",
    "date": "2024-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Scarlet is a professional assassin but her last job went wrong and now she has to go into hiding, leaving her 12 year old daughter Sam behind. Sam is raised and protected by Scarlet's handler Nathan, who is the Human Resources head of the assassin organization 'The Firm\"\n    Now it is 15 years later and Sam has become Nathan's top assassin. Sam's new hit is a man who stole money from The Firm. Easy job, kill him and bring back the money. Not! The thief's young daughter (Emily) has been kidnapped and Sam takes it upon herself to rescue and protect her.    \n   But The Firm is not happy and sends more assassins to kill Sam and Emily. \n     \"You think you have a chance here? I have an army.\" - Virgil\n    Now their only hope to survive is the three Lady Librarians.\n     This is a very polished, high stylish, fast-paced action, thriller that looks and feels like a Pulp Fiction magazine come to life.... With just a touch of Anime neons and violence. \n      The story is fueled with Girl-powered super cool assassins with super cool guns. The awesome cast really makes the story work. How can you go wrong with Michelle Yeoh, Lena Headley, Angela Bassett, and Carla Gugino. Just a pure entertaining popcorn flick.\n   Cast - Lena Headley, Michelle Yeoh, Angela Bassett, Carla Gugino, Karen Gillan, Paul Giamatti",
    "date": "2024-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The plot is not as original as the sharp and shiny snazzy neon style and settings suggest, so that doesn’t help it any.  We’ve already seen role reversal casts, so nothing there either.  Then they introduce the kid and, as per the Netflix usual, there seems to be an overabundance of relationship drama and dialogue. This is not 2004 where a film like this might become a trendsetter, now in 2024 it barely reaches the bar for what constitutes a typical and average film in 2024.  The conclusion partly delivers on the low expectations setup, but it was far too contrived.  Kill Bill 3 it is not.",
    "date": "2024-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Aside from a few moments, this comes across as a reject shop version of John Wick.",
    "date": "2024-06-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Acción impecable en una historia que nos hace reflexionar sobre las decisiones impulsivas que hemos tomamos y que ahora nos afectan en nuestro presente. GunPowder Milkshake es genial. Tiene todos los componentes para ser una gran película de acción, una trama simple centrada en la venganza, un diseño de producción impecable y con suma personalidad, extras que se entregan en cada toma y que le dan un dinamismo brutal en cada una de las cientos de escenas de acción en montajes fenomenales. Una trama que expone de forma interesante el concepto de la venganza, viéndola más cómo un obstáculo en cuanto a resentimiento y resolución en vez de como una solución al conflicto, (el factor de cientos de películas de acción), el darle ese giro al concepto de la venganza que hemos visto que se ha estandarizado en Hollywood cómo una norma en él género, para mi es lo que le da su propia identidad. Una película que a pesar de volcar todo su foco en un desenfreno de acción se da el tiempo de ser introspectiva con sus personajes, aunque sea de forma superficial, la película se encarga de dotar de tridimensionalidad las acciones tanto de las protagonistas cómo de los antagonistas de la cinta, en la que hacen una sutil crítica rome sistemas “patriarcal” con “La Firma”, este poderoso grupo de hombres que desde un punto de superioridad minimizan las acciones que la protagonista ha hecho para ellos. Una Película que gracias a lo poderoso tanto de su discurso cómo de sus golpes logró diferenciarse en un género que muchas veces discriminamos cómo reiterativo y simplista. Una historia súper entretenida de ver.",
    "date": "2024-06-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Simply an awful film. Music, dialogue, acting, humour, and action scenes are all lacklustre and pretty dull",
    "date": "2024-05-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The movie tries to be more sophisticated than what it is. A lot of blablabla. Thin plot. Stupid caracters. There are many better movies to see.",
    "date": "2024-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Unwatchable.  The tone of this film is rough.",
    "date": "2024-03-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This was surprisingly good for me.. had a Wick feel about it, I really enjoyed it 👍",
    "date": "2024-03-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "John Wick without the penises. Also without the forethought, story, fight choreography, atmosphere, writers, budget, direction, gun play, score, acting, set design, stunts, effects, or any pretense of realism or storytelling.",
    "date": "2024-02-18"
  }
]