[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not bad. The loyalty of corporations.",
    "date": "2025-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Disjointed and unsympathetic. Let’s keep the Porsche and the Country Club as long as we can. Did not develop collapse of jones’ characters bad marriage. Somehow the millionaires turned pro-labor.  Coooers’ character suicide was telegraphed ahead. Costner must have needed work.",
    "date": "2025-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Let me first start out by saying...I WANT MY MONEY BACK!!! Why would a star studded cast like this do such a crummy movie that is equivalent to diarrhea!!!!!!? Was it the money they needed? Looks like a first years film school student attempt at a movie. If you rent it or buy it, after the movie's over, be prepared to sit on the couch with feeling of utter disappointment!!!!",
    "date": "2025-06-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "El volátil mundo de los negocios y el complicado arte de sobrellevar el desempleo. Si bien el resultado no marca historia, se agradece que el guion y el reparto le dan un tono que coincide con la realidad.",
    "date": "2025-04-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I'd watched this movie closer to 2010, when it was released, but watching it again in 2023 it still felt impactful, although maybe nowadays there would be more of these \"company men\" looking to open their own business or invest in a franchise - like a very good friend of mine, a company man all his life, unemployed close to age 60, ended up doing after not finding a job. The movie rang quite true and was very watchable and entertaining, which is expected from the leading actors, though looking back on it, it actually was superficial in many of its portrayals.",
    "date": "2025-03-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This is an excellent movie tells a true story.",
    "date": "2025-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "If you have ever lost a job then you will find thingx to relate to in this movie. All of the characters exhibit the reactions, feelings, and behaviors related to being laid off/fired.",
    "date": "2024-06-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A good drama about the evil capitalist corporation and how it destroys the poor labor workers. A little biased to the left, but it doesn’t tells lies either. Great cast, always good to watch Kevin Costner to perform.",
    "date": "2024-05-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Depressing at times but we'll-acted by a stellar cast",
    "date": "2023-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The Company Men features a monumentally talented cast playing a set of characters with starkly different personalities and motivations. This allows the film to explore different perspectives of the storyline. The tone is decidedly somber and sinister, which works well for the subject. An attempt to provide an uplifting, hopeful ending feels like a studio executive insisted on a happy ending to increase marketability. The result is an ending that is a jarring departure from the rest of the film both in tone and quality. Ignoring that piece, which ironically may speak to the issues the story is addressing, the overall film is as enjoyable as it is meaningful. I agree with other viewers that the focus on upper class white men may not be relatable to all audiences. But as one of the millions of Americans personally touched by the events the film portrays in the decade since its release. I found the focus on otherwise unrelatable characters makes the film watchable. Had it instead focused on average workers, it would have still been excellent, but personally harder to watch by hitting too close to home. I would definitely watch this one again.",
    "date": "2023-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "An excellent film that tells the stories that so many have encountered through the unexpected loss of a job",
    "date": "2023-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I really liked this film.  Not for the action or the twists, or even the drama.  It is a solid look at what happens when people with wealth and power are downsized, and they struggle to adjust to a new life without what they had.  Some people adapt and learn humility, and some, well... don't.  And then life goes on.  The movie doesn't really have a point of view.  It has each character present their own point of view - even the asshole CEO presents his 'side' (albeit not very sympathetically).  If I had to fault this film, it is that in the end, life just... goes on.  Nothing really happens.  And maybe that is the point.",
    "date": "2022-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A very relatable story.",
    "date": "2022-01-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Solid, touching drama about downsizing and its effect on men who define themselves by their jobs.",
    "date": "2022-01-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Sad look at corporate downsizing.  They may be educated and making good money but when the hammer hits, money problems and other psychological problems arise.  The CEO is me, me, me while Jones is the CFO I believe and he has a heart as he see all the money be spent on BS yet people lives are being destroyed.  One thing I thought was off was Affleck's home.  No way he would be living in that house outside of Boston and the car and country club with Disney Vacations on a $120k salary and his wife a part time nurse at about $45k.  That house goes for over $800,000 with taxes in the 15k+.     Two takeovers and a merger before I was 30 set me off on my own career as an owner.  I have a CPA.  I saw 60 year old men being terminated after 30 years of employment.  I had 55 year old men and woman who could not find jobs 3 years later and begging me for employment at my little firm.  It is sad.",
    "date": "2021-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It is better to be civil servants.",
    "date": "2021-05-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I've been there in small measures and large, so if you don't know how devastating it is to loose it all, it's more than one can imagine. My experience was in the early 90s as the cold war with Russia ended, defense contracts being cancelled, hige numbers of people being laid off. I was working 3 part time jobs with accountanrs, engineers, and programmers (my work), stuffing mailers on the weekends, answering phones, filing papers, whatever it took to stay alive. This film does a good job of showing what people of various ages experience as their lives are destroyed. Good acting and a solid story.",
    "date": "2020-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "There are films that depicted and documented the beginning stages and lingering aftermath of the 2007-08 recession, and this film actually bridges the two immediate periods right in between whereas we understand via the empathetic direction of the struggles people went through from masculine pride to economic and labor sacrifices including affecting relationships. The excellent cast and director John Wells, in a more distinctively formal impression, painted the picture quite nicely at a very human pace, something that is worth at least discussing at a minimum between the other pictures of the shared topic creating one whole narrative. (B+)",
    "date": "2020-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I don't know much about business, but that doesn't mean its hard to appreciate a good business movie, despite a few dumbed down bits, The company Man comes with a strong feeling and some heart and decent performances from everybody that is good enough for me. The Company Man is actually a rather sad movie, there is a good amount of talk, but nothing ever feels too contrived, wasted or unnecessary, So for this being an ok film, not being as great as the movie critics are saying, I give \" The Company Man \" a solid C.",
    "date": "2020-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I added a star for Ben Affleck.",
    "date": "2020-06-25"
  }
]