[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Hubie Halloween is an incredibly funny, and silly good time with a great cast, and some twists and turns, which make this an entertaining Halloween comedy, and one I’ll watch over and over again.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thought it was hilarious!",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love this movie! A family-friendly Halloween movie. Adam Sandler is just a cherry on top!",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Hubie Halloween (2020) is a goofy, family-friendly Halloween comedy starring Adam Sandler as a well-meaning misfit trying to protect his town from spooky chaos. It’s full of slapstick humor, silly characters, and cozy Halloween vibes. While the jokes can be hit-or-miss and the pacing uneven, the film’s heart and colorful atmosphere make it a fun, harmless watch for casual viewers.\n\nCharming but uneven; more sweet than scary, and best enjoyed with low expectations and a bowl of candy.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love this movie, it’s fun! Just good fun. Everyone that reviews this bad needs more joy in their life.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It’s Sandler and his crew having fun and being silly. My kind of comedy.",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1 hour and 43 minutes!!!!!!!!!!!!!!! Rated PG-13 for Language, Crude and Suggestive Content and Brief Teen Partying!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The Halloween mystery theme is great but that’s about the only compliment I can give this movie because in reality this is just a bland comedy movie filled with incredibly unlikable characters and boring jokes. I don’t really like how Adam Sandler acts in this one but his character is decent but I just hate that everyone is such an asshole to him for no reason. Is that funny? No it’s really sad actually.",
    "date": "2025-10-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great, fun movie for Halloween",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Adam Sandler, Kevin James AND Ben Stiller. Some of my most favorite actors ever all in one movie?!? \n\nIt’s so funny to me that the main characters from grown ups tend to stay in movies together. I love it actually. \nI also love that he incorporates his daughters and wife and I’ve never noticed how much he incorporates them. \n\nI also love at the very end he put a memories for Cameron Boyce 🥹 \n\nThis movie was kinda cringe and definitely not one of Adam Sandler best but it was still good. \n\nThe amount of the most random actors I’ve ever seen in movies is in this one. (Shaq O Neil, Peyton List, Maya Rudolph, Tim meadows, Kevin Quinn from girl meets world, Rob shneider, Good lunch Charlie character, Steve buscemi, Jude squipp, kid from stranger things, ravi from Jesse, girl from ant farm etc.) it’s so weird seeing so many different people together.",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "As usual rotten tomatoes is spectacularly wrong with its rating.\n\nDoes anyone even come here for a serious review.\n\nEasily the best Sandler movie by a mile.\n\nRarely do you find the chemistry involved in making  this film ! \n\nScript, performances casting... \n\nAs good as happy gilmour was in its day.. \n\nMind blowing, has me in tears everytime !!! \n\nPure magic 😎😎😎😎😎",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Divertida y deja un lindo mensaje, para ser una película para la temporada de halloween cumple bastante bien. Tal vez este lejos de ser la mejor comedia de Adam Sandler y por momentos se siente lenta o tonta pero igual cumple con lo que tiene que cumplir, o sea hacer reír.",
    "date": "2025-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It’s funny but just meh.",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It's a fuggin mess. And not as funny as it could be. It felt like they shot it on a lot in a 48 hours period and edited it on the fly. A couple yucks I suppose.",
    "date": "2025-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best and funniest Halloween movies",
    "date": "2025-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "La trama es buena la actuación de Adam Sandler es chistosa",
    "date": "2025-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Definitely a must see with the family! As a millennial I love the quirky silly cheap humor. Star studded cast. All the Halloween vibes with a little spook but mostly laughs.",
    "date": "2025-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Pleasantly surprised, funny and corny cute. Would recommend for family movie, even with the bathroom humour. Will be a yearly Halloween tradition.",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of my favorite comfort movies. It is such a good movie, hilarious, heartwarming, and a great ending. Just take it for what it is, a feel good family Halloween movie. It’s literally perfect to me, I watch it at least 2-4 times each season",
    "date": "2025-09-08"
  }
]