[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Not the same without Paul walker but it’s still an amazing movie",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I struggle to give any of this series more than 3.5 stars due to crassness, ridiculousness, predictability and over the top acting. But there's no doubt it's entertaining!",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Pretty good I will definitely watch them all 5 6 8 are great but 10/x and Hobbs and Shaw are the best ones",
    "date": "2025-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Despite missing Brian, F&F8 remains a strong, solid and pedal-to-the-metal thrill ride. Things went a little OTT after this one maybe they should of stopped after 8 films.",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The last Fast and Furious movie I actually liked. Even this one is a bit too much to tolerate. \n\n\nIt has high intensity scenes, good soundtracks and doesn't hit the brake.",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was a great movie. One of my favorites!🔥",
    "date": "2025-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Movie is okay, it's fun but you take the best thing abt Dom away",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The Fate of the Furious is honestly a masterpiece  it’s my favorite movie of all time.",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This was so bad. The F&F legacy was ruined after this point.",
    "date": "2025-06-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Movie was alright. But from here, the downfall of the franchise started...",
    "date": "2025-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Successful action movie sequel in 2 hours and 16 minutes!!!!!!!!!!!!!!!!!!!! The worldwide gross is $1,236,009,236.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!! Starring Vin Diesel and Dwayne \"The Rock\" Johnson!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Worst fast and Furious movie ever! at least they they Call it Fate inplace in fast! Harpooing scene was good but how can a guy elbow his door out of his car, Charlize made thisovie even worse!",
    "date": "2025-05-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Brings a lot of mystery, normally I would rate it 3 stars but Jason Statham earns the full package",
    "date": "2025-03-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Awe Ben, I love you. You were so good in this movie credit given to your co-actors what a great group I love you see the next one",
    "date": "2025-03-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "With changing different ideas from speed racing to the era of technology, this 8th part of the movie changed the whole franchise, after Paul Walker's passing away, and the technology which becomes the main idea in the movie.",
    "date": "2025-01-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Esse velozes e Furiosos o 8 eu acho ele mediano/medíocre porque tem algumas cenas de ação que fez eu não gostar muito tipo a tecnologia tipo quando a vila do filme usa a tecnologia que eu esqueci o nome dela mais eu acho que e cipher ela ativou um monte de carro na rua no piloto automático e ela fez muita loucura cara tem inclusive o final do filme que e ruim o motivo e que o torreto sempre bota família a cima de tudo mexeram com a família dele ele vai matar esse cara ele simplesmente aceita o Jason Statham na família depois do cara ter matado o HAN isso incomoda muito por isso de 0 a 10 eu do pra ele uma nota 6/10 ele também deixa um vasio no peito tipo e o primeiro filme sem o paul Walker daí vc vê e tá faltando alguma coisa aí",
    "date": "2025-01-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "GREAT LIKE ALL THE OTHER ONES!!!",
    "date": "2024-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Although it is clear this film struggles being the first in the franchise (excluding tokyo drift) without Paul Walkers - Brian O'Connor it is still another great film in the franchise with the only negative being the team lacks some sort of character that Brian did bring. However despite this it brings another compelling story for the audience to love and a great new addition to the universe.",
    "date": "2024-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "today I review The Fate of the Furious, 8th chapter of Fast and Furious and 1st film without Paul Walker. this film is absolutely beautiful even if I don't like the idea that Toretto becomes bad even if fortunately he becomes good again but from here on the saga is diminished by the absence of Paul Walker but the film is really good, I really like the action there and the explosions. I'll close this review by saying positive opinions for the 8th film but the saga has declined since Paul Walker no longer exists but it's still a good film, see you.",
    "date": "2024-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The story is so ludicrous that I dont know how this didnt get a worse rating overall.  So Dom's ex gf is kidnapped by Charliese and dragged around in a flying fortress (that never needs refueling ala agents of shield) until the kid is so old that it can say \"Dada\"??  And they give her fresh clothing, makeup, and she/they actually look relatively happy?  And Dom is willing to give up the world to save them without telling anyone what's up?  And then Charliese kills the mom with the kid in the same room, in front of Dom, to try and convince him to toe the line?  WHAT THE EF? Why go through all the trouble to just kill her?\n\nNot to mention the zombie car chase in NYC could never have happened with the old clunkers they used in the scene, even if you didnt consider the NYC traffic which would have stopped it in about 10 seconds. The cars jumping out of windows of old buildings (a la Cap-Civil War), guess what--- that's not how cars are stored in NYC.\n\nAlso, submarines dont launch themselves b/c you turn them on. Also, starting a sub in a dry-dock, without ocean water running through its heat exchangers, would kill it quickly. \n\nTechnology, Dom and other craziness aside, why did Charliese want Dom so badly as her henchman?  She took a \"no thanks\" from Statham but went all out to get Dom; a streetcar driver?  She couldnt find one more willing bad-guy, anywhere, with her endless resources?  \n\nAnd Dom was willing to put Letty in endless harms way? How in the world can she or anyone else EVER trust him again? No matter the reasons, his actions of betrayal and willful blindness to the effect of his assaults, batteries, and property destruction, were so outrageous that they absolutely cannot be forgivable, and you'd expect him to spend the next several hundred years, justifiably, in jail. \n\nProbably the saving grace to this otherwise ridiculous movie was Statham and Johnson, who are a blast to watch together. Statham was FINALLY allowed to use some of (hints of) his comedic talent in this one, thankfully. For those scenes alone, and really for nothing else, this gets 2 stars.",
    "date": "2024-07-07"
  }
]