[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "a good overview of the legend’s upcoming",
    "date": "2025-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "There are moment that hint at regrets in his personal life that never materialize. Totally understand not wanting to get into in this format, but the brief allusions to it make the film seem incomplete.",
    "date": "2025-05-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "\"Sly\" offers a nostalgic trip through Sylvester Stallone’s filmography but falls short in revealing much about the man behind the legend. While the behind-the-scenes stories of his iconic roles are interesting, the documentary seems more like a tribute to his career than an in-depth exploration of his personality. I walked away feeling like I hadn’t learned much more about who Stallone really is. The focus on his professional life overshadows any deeper dive into his personal journey, making it easily forgettable. This would have worked better as a miniseries, allowing for a more well-rounded and insightful look into Stallone’s life. At its core, it's a decent watch for fans but lacks the substance needed to be truly memorable. 2.5/5.",
    "date": "2024-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "the best ending movie that I ever seen",
    "date": "2024-02-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "An inspiration to believe in yourself when no one else does.  Sly shares words of wisdom along with his life and experiences.",
    "date": "2024-02-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A riveting and heartfelt auto-documentary on a significant 80s movie star.",
    "date": "2023-12-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A really good doc about Sly . I found it very interesting to see and learn about his perspectives about his career and his Life .",
    "date": "2023-12-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I wish I had enough money to make a documentary to narrate about myself.  Cmon Sly, your life has got to be way more interesting than this.  I mean, you skipped right over your early work in film without even mentioning the porn flicks.  The last thing we needed was a sanitized timeline with wide lens views of your house and life-size Rocky statues.  I hope there's a Sly 2.",
    "date": "2023-12-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "If you already know the basics of Sylvester Stallone's story, you're not going to be surprised by Sly. This documentary is fairly basic & surprisingly brief as it quickly glides over the history of the famous actor. It feels almost as if you're chatting with Stallone over lunch. The movie gets somewhat repetitive as it talks about how he was underestimated and then overcame the odds, but then it hits you with an unexpected emotional punch that leaves you thinking about what really matters. Sly isn't a groundbreaking documentary, but it's worth a watch if you want to get to know him a little better.",
    "date": "2023-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Loved it about how to use your life to write and direct movies.",
    "date": "2023-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "As a documentary it works well enough to describe the actor Sylvester Stallone, in his own words, avoiding anything that seems like egomania. Those who will surely be most pleased are his followers.",
    "date": "2023-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Completely uninspiring. I have watched documentaries on Beckham, Robbie Williams, Britney Spears, Arnold Schwarzenegger - and all were great. But the Sly documentary is a complete whitewash of his life, where he largely only mentions the positive while feeling sorry for his ageing self and blaming any mistakes on his father. There is no mention of the sexual abuse allegations, his half sister and her death, Brigitte Nielsen, his near divorce last year, the breakup from his current wife back in the 80s when he thought Dickinson was pregnant with his child, the accusation by Pamela Anderson, his first wife, and only a passing reference to his son's death. There are a few shots of his wife and daughters but they aren't allowed to speak. It's just basically the great I am. Total cop out!",
    "date": "2023-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "He's a legend! I learned a lot about him in this documentary. What an incredible person and an artist!",
    "date": "2023-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Who don't love Sylvester Stallone. He's beyond a great actor",
    "date": "2023-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "makes u feel wanting more for such an iconic star and inspiration to millions....it's fairly short, not better than \"Arnold\" that came out some months ago.",
    "date": "2023-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Great documentary of a man who truly made the most of his life.",
    "date": "2023-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A lesson on drive and determination!",
    "date": "2023-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "For a man to be as successful as Sly is he is a man without joy--was a downer---hope he finds happiness at some point",
    "date": "2023-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A bit indulgent but still a fascinating life.",
    "date": "2023-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The documentary was great! Especially if you're a rocky fan it dives deep into his psyche and how personal the character is to his real life persona. I honestly wish this got the Arnold treatment and was broken down episodically. Sly feels so short for a man who's had an amazing career, But Stallone does like to do sequels, So let's see. If you have any interest in the man behind the celebrity and a much more intimate portrait of the human being, It's a must watch. I'm 39 so I grew up with this man and have always looked at him as one of the best to ever do it, he deserves more though.",
    "date": "2023-11-06"
  }
]