[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Tiene una gran historia y un gran por qué de la creación e inmortalidad de Pinocchio.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Nicely animated with some references to Frankenstein, but as a musical Del Toro’s Pinocchio doesn’t  work for me. Just gruesome to hear and to watch.\n\nIf you don’t mind the musical aspects of this movie, give it a try. Otherwise skip. There are other Pinocchio movies that do better.",
    "date": "2025-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Guillermo del Toro's Pinocchio was one of the best Guillermo del Toro movie and my favorite stop motion movie.",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie has good animation, music, written songs and acting were very good! It was worth rewatching. It was fun and thrilling experience.",
    "date": "2025-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A respectful adaptation to the 19th century novel gives del Toro another Oscar and shows how animation is not a genre.",
    "date": "2025-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I have mixed feelings about this movie. \n\nI loved that they all decided to stay together and saved the money but I didn’t like the way they changed a lot about it from the original. \nThe ending was so sad.. \n\nIt was a whale who ate them but whatever that creature was..",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom, para mim a caracterização do Pinóquio ficou horrível.",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Guillermo del Toro sprinkles his signature dark whimsy on a fairytale classic with stunning puppetry and catchy original songs.",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "this is the most emotional pinnochio movie it is a bangar i would recommend it",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Le Pinocchio de Guillermo del Toro est un véritable bijou visuel et narratif. Magnifique de bout en bout, ce film d’animation en stop-motion est une réinvention sombre, poétique et profondément humaine du conte classique. En tant que grand fan de Guillermo del Toro, j’ai été ravi de retrouver son univers unique : un monde à la fois fantastique, gothique, et empreint de mélancolie.\n\nVisuellement, c’est une pure réussite. L’animation en stop-motion est d’une finesse remarquable. Chaque plan est soigné, chaque mouvement est fluide, et l’attention portée aux détails rend le film vivant. L’univers artistique du réalisateur se ressent dans chaque recoin, avec ses créatures étranges, ses couleurs automnales et cette atmosphère à la fois magique et un peu inquiétante qui lui est propre.\n\nDel Toro ne se contente pas de raconter Pinocchio, il le transforme pour y insuffler sa propre vision du monde : celle d’un monde où la mort, le chagrin et l’impermanence de la vie font partie du parcours de tout être humain. Le film délivre une morale belle et touchante : il faut chérir chaque moment passé avec ceux qu’on aime, car rien n’est éternel. Ce message est transmis avec subtilité, sans jamais forcer l’émotion, ce qui rend certaines scènes encore plus poignantes.\n\nMême s’il s’agit d’un conte pour enfants, le ton est parfois plus mature, voire un peu sombre. C’est pourquoi le film s’adresse peut-être davantage à des enfants un peu plus âgés ou à un public familial qui apprécie les histoires à double lecture. Il y a de la tendresse, de la douleur, et une véritable réflexion sur la vie, la mort, la liberté et l’amour parental.",
    "date": "2025-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Well, what do you know? Guillermo del Toro at his finest!",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is now officially my new favorite movie! Take notes lionsgate 😂 Im gonna give this movie alot of awards, best animated movie! Best stop motion movie! And best movie ever! And it was very dark and so emotional!  So 11/10! Well deserved!",
    "date": "2025-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very carefully crafted passion project that is much closer to the book, and puts a great spin on a classic idea. The cast, music, and especially the stop motion are all incredible.",
    "date": "2025-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Um dos melhores filmes de animação que já vi.\n\nUma ótima releitura do clássico de 1940 para um público mais jovem, enredo com dramas emotivos e com personagens carismáticos, além de diferenciar das outras adaptações de maneira tão única.",
    "date": "2025-06-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Dark, beautiful and mesmerizing.\n\nThe stop-motion animation was superb, and the overall feel was dark and deeply emotional.\n\nThe songs, however, were horrific and poorly written… and completely unnecessary. The film would have benefitted from having the songs removed completely.\n\nDespite a stirring and tragic first act, the film began to drag shortly thereafter and I turned it off around the halfway mark.\n\nDecent effort. Not something I would revisit.",
    "date": "2025-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A truly magical & phenomenal piece of animation, Guillermo del Toro's Pinocchio is equal parts a dark fantasy epic & coming-of-age tale.",
    "date": "2025-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What an amazing story, fulll of contrast and the design of the fairytale is exactly like the ancient myths. After seeing pinocchio's fate, I might say the ending is a powerful tool to explore (A familiar sacrifice, love to our love ones).",
    "date": "2025-06-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I just saw it yesterday and It was phenomenal. I believe death is a complex theme to share with some friends/family. A movie with details, focusing with a story beyond a simple \"Kids Show\", is what make you feel entertained. \n\nKids see an innocent message according to their age but adults can see a deeply experience. A movie that combines a powerful lesson but without being so pretentious.",
    "date": "2025-05-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "LOL, the 22nd winner of the Academy Award for Best Animated Feature!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-05-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing storytelling animation and music!",
    "date": "2025-04-11"
  }
]