[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Honestly the starting of the movie was slow, but they made up for it in the end, it also had waaay more potential had they executed it perfectly, still pretty solid definitely worth a watch",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I've had to endure far worse after seeing the Screen Gems logo. I really enjoyed the game back then, and I'm very glad that David Sandberg's version isn't a direct adaptation of the game, but rather takes place in the same universe as (presumably) all the \"Dark Pictures\" games. Creative ideas, good effects, and a likeable cast make for entertaining viewing. However, the very shallow script and the lack of genuine horror for me unfortunately prevent \"Until Dawn\" from rising above mediocrity. It's watchable, but there are many far worse video game adaptations.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Il classico adattamento.\nNon c'entra niente con il videogioco se non per il pretesto della ragazza scomparsa.\nLa cosa interessante dovrebbe essere la storia della clessidra che dovrebbe essere il concetto di ricominciare il gioco e prendere scelte diverse, ma potevano prendere qualsiasi altro titolo della saga per poterlo sviluppare.\n\nComponente paranormale ingiustificato e assurdo, c'è perchè sì. \nI personaggi piatti, classicissimo horror americano di teenager che vengono massacrati.\nDi Until Dawn c'è solo il titolo e forse il mostro. \nLa parte dove esplodono mi ha fatto morire dal ridere in modo negativo",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Based on the game I thought  it would be  flop it's terrifying  scary",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I love horror but this is diabolically bad. Annoying characters played by annoying actors saying badly written dialog. Unrealistic reactions to things. A preposterous concept delivered badly. Not scary or even mildly diverting.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "From until dawn only has the name... why anyone can creat a decent videogame based movie?",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "One of the absolute worst movies. No creep factor, just goes straight into a whole lot of gore for no reason. Just silly,and the thing is so dark you can hardly see whats going on. Sick to death of 5 teenagers on a trip. How many times has that been done? If I could give this one less than a star rating i would give it minus 5 stars.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very good scary movie!",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It was okay, but I really hoped it would be more like the game I adored. I didn't like the demonized storyline at all.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Keine Ahnung warum das hier überhaupt Until Dawn heißt. Klar will ich nicht 1 zu 1 noch mal das Spiel sehen, aber hier ist nichts vom Game drinnen. Das ist irgendein x beliebiger Horror Film, der nur zufällig so heißt. Schlecht ist er aber nicht.",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Having only played Until Dawn for the first time earlier this year, thoroughly loving it and still amazed I managed to keep everyone alive on my first playthrough, I was very reserved about what this adaptation in name only would bring to the table. While it attempts to blend multiple horror subgenres into a single blood-soaked narrative, the lack of inspiration in each new variation yields a spoil of diminishing returns, spinning its wheels and becoming more tired with each cycle, leaving a solid premise dead on its feet. Unlike the source material, the film doesn't successfully unite various flavours of onscreen terror as much as it haphazardly smashes them together through a cast of bland, hapless Gen Z mincemeat. I am glad that they at least kept Peter Stormare from the game, as he was a more than welcoming presence. What I can't abide by is the lack of any of the other game's cast of characters, including Emily, my beloved. The under-lit and depressingly flat photography combined with a weak and disposable script do not gel with David F. Sandberg's relatively ambitious direction, the impressive practical effects, a serviceable score by Benjamin Wallfisch and some occasional bursts of fun. All the potential Until Dawn might have had is frustratingly squandered, but, on its own, lower-stakes terms, it's a passable, if rather unfrightening, experience, dispensing clichés that are as mouldy as the haunted house in which its characters are confined. Had it been called literally anything other than its namesake, maybe I would have been kinder to it; otherwise, it's a Wendi-no from me.",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It was fun but a bit repetitive.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The idea isn’t bad, I see the vision. But the execution is mid. There’s a big lack of emotional connection between characters. Clover’s sister Mel got lost, we see how she misses her but we don’t get to feel it, there wasn’t enough scenes when we truly get to see how close they were. Also, their mom has d*ed but we never get to know how. There’s more, Clover and Max are ex lovers. If that wasn’t mentioned that one time you couldn’t tell that they were together. Nina & Abe are in the relationship, it wasn’t believable. The movie and acting in general was flat. The biggest plot hole is that we don’t know nothing about that evil doctor, like how we even discovered that magical hourglass and where did it came from… Questions that need answers.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "It’s disappointing that this film is “Until Dawn” in name only and doesn’t truly adapt the game. However, the time loop element is intriguing, and I did enjoy the group’s camaraderie.\n\nUnfortunately, the horror is generic and uninspired, and the visuals are equally dull, marked by flat cinematography. Overall, it’s a shallow film that delivers a lackluster execution of what could have been an interesting concept.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "When this movie starts it is obviously directed with gusto and the dialogues, though not brilliant, feel vivid and engaging. But all the good will it built in the first half hour goes to become surprising at first and pretty soon increasingly stupid and banal at the point that you feel that anything goes. As a result you just lose all interest, turning a promising start in the realization that this is just disposable youth entertainment at best.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "An adaptation of positional alignment for attracted non-gamers to grasp the creatively visioned mythology in service of the genre, plus one effective jump scare than most horrors, only to reach conclusive criticism over the nonsensical lengths’ elliptical illogic that seemingly ridicule the disconnected game with no constructed thrills. (B-)",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "7/10. 75/100. | Watched w/ Chloe Lainhart asleep next to me.",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Until dawn review I love this casting and there acting was amazing Dolby vision looks amazing Dolby atoms made sound more realistic scary the storyline was really creative clever \n5 star \n10 out 10 star \n96 out 100",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I went into this movi not looking at it from a PlayStation perspective but rather just another horror flick. With that being said I was pleasantly surprised and entertained.",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "really liked it. The movie kept me hooked from start to finish with its suspense and atmosphere. The story was well-paced, and the mix of mystery and tension worked perfectly. It had moments that genuinely surprised me, and the visuals were beautiful and dark in the right way.\n\nWhat I enjoyed most was how the plot developed naturally without feeling rushed. The characters had depth, and the ending was strong and satisfying. It’s one of those films that keeps you thinking even after it’s over. Overall, a great movie and definitely worth watching.",
    "date": "2025-10-28"
  }
]