[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The Weekend Away is a horrible movie. It had a horrible development, its viewers are constantly led in circles, the characters are dullard and vacuous, and there is no reverence for many things, including marriage. This movie rushed its viewers and didn’t consider many details it should have. This movie, overall, is detestable, and personally, I am glad this movie has the low ratings that it has.",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This another low budget Netflix movie is more than just a boredom. It's also a vacation in Croatia commercial... Ppl, nothing ever will make me watch this movie again. It's just pointless. was there a mystery? Yes. But with the way the plot was developing i found myself least and least interested in it. The ending was just so uninspiring that it seemed like the whole team couldn't just wait until they finish working on this garbage. It was supposed to be Leighton's comeback i guess. well... better luck next time.",
    "date": "2025-10-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A good set of twists but nothing to really stand out. Man Zain is a real ride or die",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The acting was great, liked the way it was directed, well filmed, entertaining and worth a watch.",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "With beautiful cinematography of a picturesque coastal holiday resort, lush palm trees , great nightlife and amazing architecture “The Weekend Away” works really well as an advertising video for The Croatian Tourist Board.  However it doesn’t work as well as a murder mystery thriller. \n\nBeth ( Leighton Meester ) is invited on a girls weekend by her recently divorced best friend Kate. Beth a new mum to Aster or Esther, pronounced as both throughout, has been rather low due to both the lack of attention from husband Rob and exhaustion due to her baby. Beth  takes the opportunity to reengage with her friend and have some quality me time away. \n\nWhat transpires is a wild night out that descends into a drunken drug filled evening ending up with Kate dead in the water. Now accused of Kate’s murder, Beth takes it into her own hands, with help from a taxi driver, to discover what really happened. \n\nIt struck me that given Beth’s actions of how she recklessly destroyed evidence and nearly killed someone before actually doing so,  that I would also accuse her of her friends murder. Even the handy way Beth finds crucial evidence also suspiciously points the finger of guilt towards her. Beth being the killer would definitely have made for a much better twist than the actual ending. \n\n“The Weekend Away” seems like a standard, but rather well made, feature length episode of a  long running TV whodunnit series. “The Weekend Away” keeps the audience guessing as  most of the characters that Beth engages with are very suspicious  and seemingly have some sort of motive to kill Kate. It’s also rather too convenient how crucial evidence is found and how easy it is to kill someone and walk away without any manslaughter charges. Great cinematography though.",
    "date": "2025-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Captivating start and beautiful setting. Unfortunately this wasn’t enough for a compelling thriller. The lead actress became increasingly annoying to watch with her constant cries of desperation in a flimsy plot.",
    "date": "2025-05-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A movie I have seen a thousand times. Nothing new. Not good, not bad. Not nothing.",
    "date": "2025-05-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A good movie. Must watch.",
    "date": "2025-05-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "As Lifetime movies go, The Weekend Away is a Friday or Saturday entry. Like a Sudoku puzzle, it's a little tougher, a little grittier and takes longer to solve on Fridays and Saturdays.\nAnother thing about Lifetime movies and Sudoku puzzles. They offer the same nine numbers and you just have to put them on the grid correctly to get the solution.\n\nConfused? That's the purpose of a movie like The Weekend Away. It throws what, maybe nine potential suspects at you and tells you to figure it out. The clues are barely meaningful and leads that do have some teeth are soon trumped by some other factoid that just appears out of the blue.\n\nThe Weekend Away should not ever be spent in Croatia, mind you.\nAlthough the scenery is one of the positive points in the film, it is heavily outweighed by a bad story with third-rate actors -- even the ones at the top of the bill -- playing characters you will have little interest in following through to the end.",
    "date": "2025-04-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I enjoyed all the twists in the plot & didn't know who did it until the very end.",
    "date": "2025-04-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a great thriller with twists and turns that bring plenty of surprises. Leighton Meester shines, as does Croatia.",
    "date": "2025-02-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The movie is okay to watch. You get to see Croatia and that is fun. But the plot is predictable.",
    "date": "2024-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Thriller d'azione che parte con alta dose di divertimento e di sensualità ma che ben presto si tramuta in un incubo ad occhi aperti per la protagonista a cui sembra vada tutto storto.\nLa sceneggiatura però presenta un numero troppo elevato di forzature e di concatenamenti che rendono il prodotto estremamente artificioso e poco credibile.\nUna serie di truffatori, psicopatici ed assassini praticamente accerchiano la protagonista che di fatto si ritrova ad essere l'unica persona senza intenzioni criminali in tutto il film.\nNonostante questo, qualche bel colpo di scena ed una serie abbastanza varia di sequenze riesce a rendere quantomeno sopportabile la pellicola, pur non riuscendo nell'intento di renderla di qualità.",
    "date": "2024-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Uninteresting develops into a mildly interesting before concluding with a thud.",
    "date": "2024-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Why movies like this one are even made anymore?! It's like a million other movies with the same story and execution. It's so unoriginal and uninspiring it just hurts. Don't know why I watched it :)",
    "date": "2024-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Sooooo i liked it, could have been better for sure for some reasons :\n- it should have been longer \n- should have deepen the characters \nAnd the acting was pretty great except, and it kills me to say it, for Meester : she was good most of the time but for raw deep emotions or even just surprise that wasn't it, i couldn't detached myself from her performance as an actor and had trouble connecting with her character, it wasn't believable for me so it's a shame.\nI am glad i didn't read the book before end because i would have been more disappointed probably.\nI think the movie was fine and the cast was really good, especially the roles of Kate (real great), Zain (amazing) and Rob (really good), the creepy landlord was pretty well played too.",
    "date": "2024-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's fantastic, fast paced suspence thriller. Must watch movie. Lead roles - specifically Leighton Meester - is excellent.",
    "date": "2024-02-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I guess I'm starting to get out of touch with critics and audience tastes. Surprised this is rated as low as it is. For the genre, I thought they did a good job. I liked it. Kept me guessing what really happened. The last twist was probably one too many though. Should have ended it the scene before. But all in all, it was an enjoyable watch.",
    "date": "2023-12-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "this was a good movie i dont get why all the bad reviews from the viewers",
    "date": "2023-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The movie in itself could have been better if we had known more about the characters. The lead character is weirdly shady but so trusting and the people she meets , that's not how normally the world works? And its absolutely crazy that she never noticed her husbands violent behavior before the end. There is little logic to the movie but it wasn't an absolute waste of time. \nIf it was darker it would have been better.",
    "date": "2023-10-29"
  }
]