[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A total toneshift from the first to the 2nd but I still really enjoyed the movie",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The story can be a bit..bumpy, but despite that Stephen Lang DELIVERS as The Blind Man once again!",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Fantastic! Stephan Lang is unforgettable, his character Norman has a dread about him that fills me with horror! Brilliant film!! 4.5/5",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Unlike the first one, this is more of an action film than a horror film. There are a few creepy camera shots at the beginning again, but then the whole thing continues more in the style of a hard action thriller. Still, the film is definitely entertaining once again. Stephen Lang, returning as the blind man, has a great presence and comes across as almost unbeatable here. There are also a few good twists again, but overall everything doesn’t feel as cohesive as in the first film. I didn’t expect it to reach the same level as the first one, but I still find it quite good and worth watching.",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "About what you'd expect from a sequel - they felt the need to kick it up a notch. It wasn't terrible but didn't necessarily work in this case. Did keep me on the edge of my seat though.",
    "date": "2025-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It was one of the few movies I thought had a decent sequel.",
    "date": "2025-04-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Exciting action scenes and an attempt at the previous film's villain's redemption bring an unnecessary sequel that is enjoyable to an extent.",
    "date": "2025-02-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Not as good as the first, but I do like how it takes the premise of the first and turns everything to the max.",
    "date": "2024-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "\"Don't Breathe 2\" does not match the brilliance of the 2016 home invasion thriller, despite presenting the same level of violence and brutality. The sequel introduces a moral compass that creates an element of ambiguity. Independently of how we perceive or judge him, the blind man remains the same: unforgiveable and deadly.",
    "date": "2024-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "loved seeing him kill the father and mother.",
    "date": "2024-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "One of the most disappointing sequels I’ve seen in quite some time because it takes away the suspense and shock value of Don’t Breathe and turns it into an standard thriller without any artistic value",
    "date": "2024-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Just not a good idea for a sequel. Trying to get the audience to root for the blind man just doesn't work after all of the terrible things he did in the first film. It may have some entertaining sequences, however it also has an extremely flawed plot.",
    "date": "2024-01-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This movie fails from the jump because the opening scene has a fake CGI fire. It's next problem is it attempts to make this man a protagonist and attempted sympathy figure. After the triumph of the original, it's has hard to recreate the tension since it was done before and better before. That said, some exciting set pieces like the water ripples scene in the third act, the young actress was terrific and it's technically well done. It just can't overcome the script.",
    "date": "2024-01-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was the most amazing movie I've watched. I do actually believe the 2nd movie is better than the 1st.  It was suspenseful, gory, terrifying, emotional, gut wrenching and it definitely kept me on my toes. You could relate to the characters more, understand why they are the way, they are and feel their pain. Absolutely loved it! It was more than just a scary horror movie.",
    "date": "2024-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was so entertaining, I loved the emotions and the ideas of this movie. Although some scenes may be a bit unrealistic, it was an amazing movie. The relationship between the father and daughter was such a roller coaster.",
    "date": "2024-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Yeah a bit predictable for me 🤷🏻‍♀️",
    "date": "2023-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Strange followup that seems to have missed the point.",
    "date": "2023-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This uncomfortably subversive follow up to the skin crawling effects of its predecessor will rub many the wrong way as the plot hinges on providing a depressing and morally gray bloodbath. It doesn't always work, but this is a supremely well crafted and entertaining film!",
    "date": "2023-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I accidentally watched Don't Breathe 2 instead of Don't Breathe 1, the latter of which had good reviews.  So I was rather surprised when this film just jumped into a bunch of mindless action and gore.  Where is the plot?  Where is the character development?  About halfway through we actually get some of each, but it's too little too late.  And of course it doesn't help that what we do get is over-the-top cartoonish.  All that being said, I must admit Stephen Lang is fantastic in his role as an aging badass.  And despite the terrible dialogue given her to work with, Fiona O'Shaughnessy was also super hot as the evil mom.  So yeah, it was enjoyable for what it was.  But I would not recommend it.",
    "date": "2023-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "3.0 stars;     It didn't quite stand up to the first movie. It was a tense thriller in its own right, however. There wasn't much expansion on the original, even though the plot was different.\n\nThe Steven Lang character was just as forceful and creative.. I thought Madelyn Grace was good as the daughter(?).\n\nIs this the end of the series? If not, where are they going (plotwise) from here if there is a Chapter 3? \n\nNot inserting a spoiler alert at this point.",
    "date": "2023-09-27"
  }
]