[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Wouldnt recommend until Netflix releases the settings so we, the viewers, could actually read the captions that suppose to be translate for soooo many dialogues in Afgan?! I live in Canada and dont know that language-sorry! \nAnd I do like Butler and is sad not to enjoy one of his movies.\n Viewed on Sept.23,2025 thank you",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This certainly is another Gerard Butler action movie. It is also definitely another war movie.  The action was inoffensive. There were a handful of good suspenseful scenes. The character of Parshand was likable. There is just nothing memorable about it. I just finished this movie, and I can already feel the memory of this film fading away.",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This is a good movie. I thought it was in safe or there was a lot of action Gerard Butler doesn’t incredible job in that type of role as usual.  Only fairly obvious mistake is, I don’t know what they were thinking with the motorcycle guy and trying to turn him into some sort of Pakistani Ethan Hunt. It was weird and it didn’t work. I actually feel like you could remove him entirely from the movie and it would be better for it. it was giving Bollywood vibes not what you want in an action film of that type.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This was one of Gerard Butlers better movies. I liked it.",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very good action movie. Really enjoyed it.",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "21st Century Spook Story, Mix of Mick Herron & Le Carré\n\nComplex story evokes the pace and nuance of a Le Carré story with a 21st century setting.\n\nThe NVG chase scenes were great.",
    "date": "2025-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The critic score is the one to trust this time.",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Butler is fantastic in this movie he really fit the role. Was overall a great watch however I believe it leaves a lot more story telling out on the table that could have been told",
    "date": "2025-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It’s a very solid movie.  Watch for yourself and you’ll see why so many leftwing critics hated it.",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Writing not the greatest. Why blow up the nuke facility before your people get out? Did the writers tthink the Bad guys would not figure out who was responsible? Opening scenes show western guy working on Comm systems. Would we have enemies working on our stuff?",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Let me start off by saying the action was good, but there wasn’t enough. Netflix labels this movie a mystery and I wouldn’t call it a mystery, there wasn’t much to solve. I got the feeling there was much effort given by Gerard Butler pretty sure he phoned it in, I don’t blame him.",
    "date": "2025-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "As an American retired operative that has lived this life, I can truthfully state this was spot on as far as Hollywood goes. A little over the top in some areas yet to anyone who's been there done that this was excellent.\n\nBravo Zulu\nCody B.",
    "date": "2025-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great acting. \nSolid story.\nVery well done.",
    "date": "2025-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent movie.  Good story and likable characters.",
    "date": "2025-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I enjoyed the movie.  Butler always does a good job.",
    "date": "2025-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I was binge watching action movies series.. came around Kandahar. I was not keen on watching this at first.\n\nFortunately I watched and it was awesome. I would put this beside Hurt Locker. Simple, plain, emotion, real action. No drama, unusual dialogs, etc. It also showed how agents create numerous frenemies to stay alive.\n\nWowww Gerard Butler has banged it.",
    "date": "2025-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Gerard Butler and Navid Negahban try to escape from capture by Iranian forces after an explosive CIA operation in the Middle East. Gerard and Navid are great actors and very compelling. I like that they take this totally seriously for a simple action thriller on Netflix. Navid's character telling Gerard's CIA agent the human cost of America's operations was a powerful scene. The night vision goggles shootout against the helicopter was pretty awesome, I'm not going to lie.",
    "date": "2025-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Decently good film!",
    "date": "2025-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was a great movie. I was interested the whole. I’m mean I put down my phone and watched the whole thing.",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Slow beginning but it picks up and gets very intense. Resiliency and not taking NO for an answer, very wild and yet very human. I really enjoyed this movie.",
    "date": "2025-08-09"
  }
]