[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It kept my attention despite some of its bizarre and unsettling humor.  I only saw it with my friends Tina & John.  I don't plan to see it again.  Saw on Amazon.",
    "date": "2025-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 41 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated R for Drug Use, Crude Sexual Content, Graphic Nudity, Pervasive Language and Some Violence!!!!!!!!!!!! The USA grossed over $18,600,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I thought it was a really strong attempt. Writing was great, direction was great, acting great. It had it all, except I just didn't really laugh. It's not that it wasn't funny, it was funny in that way where I would say to myself in my head, \"that's funny,\" but I didn't actually laugh. Dirty Grandpa was another one that I found similar. I saw something else recent with Deniro that I had to turn off, but Dirty Grandpa I watched all the way through and thought it was good, I just didn't laugh. It was missing that one thing to carry it across.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved this movie. Of course it’s not realistic in any way but it was fun to just enjoy without thinking too much. Would live a sequel.",
    "date": "2025-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This has some pretty funny parts.  It deserves a much better rating.",
    "date": "2025-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Don't listen to the negative reviews, this film kicks some serious ass as a solid comedy cop action romance thriller! Must see if you love any of the above",
    "date": "2025-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Not very funny but I found it entertaining for the most part. Definently panders to motocross enjoyers, it feels very forced throughout. The music was very well done in my opinion.",
    "date": "2025-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This wasn't a remake so much as a poorly done parody.",
    "date": "2025-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme ruim, o roteiro é fraco, as cenas de comédia sao fracas, o elenco é mais ou menos, e ninguém ajuda a melhorar o filme, a história é fraca, e o filme deveria ter cenas bem melhores e relevantes para fazer o filme ser bom.",
    "date": "2025-03-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Chips walks the line between an action movie and a late-night comedy and it does this very well.\n\nFull of fun chase scenes, witty dialogue and wacky characters.\n\nThe only negative I can find is that the short runtime doesn't give the characters room to grow. I would have loved to see a sequel.",
    "date": "2025-02-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "People who find ridiculous, creative banter comedies must be dead inside. I've heard it's \"low-IQ\" and such, but as an aside, it's tightly structured, the leads have excellent chemistry and it's unabashedly poking fun at itself. \n\nAll actors involved, from Pena and Shepherd to the cameos, all have terrific lines and spot on delivery. \n\nThere's actually a story, but it's built upon the outlandish dialogue and unashamedly crass humor. The action is wonderful 80s style buddy-cop fare.\n\nIf you're dumb, or overtly sensitive or even a Debbie Downer, you'll think it's dumb. Nuff said.",
    "date": "2025-01-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Filme: ChiPs   @chipsmovie\t\t\tAssistido: 26-12-24\nElenco: @daxshepard @mvegapena @vincentdonofrio @rosa_s_336@hiryanhansen @jessica_mcnamee @ohadambrody @kristenanniebell @eerikestradaofficial \nModelo: #comedia #ação #policial\nDuração: 1h 40m\tAno: 2017\nMinha opinião: È triste assistir a este filme, é meio pornosanchada com uma comédia trash. E lembrarmos de Chips do seriado que foi sempre sério e que curtíamos nas noites dos anos 80.  Com Ponchelero (Erik Estrada) e Baker (Larry Wilcox). Quando você vê este filme você que assitiu os seriado vai se decepcionar. Porque não tem nada haver. Um filme exagerado em tudo e isso ultrapassa. Quando você assite Agente 86, Star Trek, Mister Magoo, Os Gatões,... Você vê a similaridade com as séries. Mas aqui nada haver. O filme retrata um grupo de assaltante de carros fortes. E a quadrilha é formada por policiais. E Baker e Ponchi para desvendar. Sendo que Ponchi é um agente do FBI infiltrado e altamente tarado. E Baker esta meio separado além de ser atrapalhado. O filme pega fogo quando o filho de Ray é decapitado e sua irá para a vingança. E chega ao final com a musica do seriado por 3 segundos. \nRoteiro e enredo um coco.\nVale apena assistir? não\nNota: 2",
    "date": "2024-12-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Funny family humor. Decent homage to the original show but not great.",
    "date": "2024-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Chips is awesome movie",
    "date": "2024-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a really good fun movie, especially if you're feeling a  bit stressed and want to relax, I would probably even watch it again, very good destress movie",
    "date": "2024-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Maybe some of the c ock suckers on here need to chill out. This is fun. Re educate yourself. Watch it again.. relax.. laughter. Try not to scrutinise. \n\nThere are at least two quality actors. \n\nIt’s fun!!!! Tacky…",
    "date": "2024-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "As a huge fan of the original CHiPs TV program - this was dire. A vehicle only for bad jokes and toilet humour - nothing to like about it at all!",
    "date": "2024-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Watchable smile movie, no matter how you feel this will cheer you up, unless your some one who is easily offend by films like American pie….",
    "date": "2024-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The second you open the chip packet you have left the theatre",
    "date": "2024-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Not as bad as people made out. Watchable and dax did a good job.",
    "date": "2024-02-05"
  }
]