[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best romantic movies I’ve seen.\nThe chemistry between Sofia Carson and Nicholas Galitzine is incredible.\nThe beach scene at the end of the movie was spectacular.\nThe moment when Luke heard Cassie’s confession was so moving. You can see the disbelief all over his face — he was so cute.\nI could watch this movie over and over again.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "If you want a solid story that puts substance before politics then this is for you. It's fun, romantic, sad and genuinely moving - kind of like the real world we live in. Great music, too. And the fact that I made it to the end says it all, because I rarely do that these days!",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "These critic reviews are bullshit. I love this movie. I beg of everyone to please just ignore the critic reviews and watch this movie, you won’t regret it",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Actually much better than I imagined from the reviews. Worth watching for Galatzine & Carson.  Cool music too.",
    "date": "2025-10-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "If you are in your romantic era, this movie will absolutely hit. The story line that goes from business relationship to love relationship is absolutely enticing to watch unfold. Despite being complete opposites, love develops in the most conflictual way, and the tension between the main characters makes this movie even more satisfying. I just loved Purple Hearts, and how we know the love is genuine after all of the chaos that happens between the main characters. In addition, this movie has a butterflies in your stomach ending!",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "How is the critic score so low thus movie was beautiful",
    "date": "2025-06-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Simple, beautiful movie.\nFull of music and love.",
    "date": "2025-06-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Good apart from her singing",
    "date": "2025-04-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I love how they portrayed Cassie’s character development, from being a very independent person, to allowing herself to be loved. And also the character development of how she loved. I loved how it wasn’t a slow burning movie, and had a very straight narrative. Additionally, Sofia Carson played her character very well, which added to my overall review of the movie. The only reason why I’m giving it a 4/5 is because their feelings for each other were very confusing, especially for Luke’s perspective.",
    "date": "2025-04-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Cringe at times but the main characters are gorgeous and will satisfy your hunger for a romantic movie",
    "date": "2025-04-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Very nice story because it doesnt go too political but mentions it i think that is for the best to keep the viewers atention. But it did feel that the ending bit was rushed even tho its a 2 hour movie it feels like there was more story to tell. Leading actors hard carry the movie to be great and would love to see the story to keep on going in another one.",
    "date": "2025-04-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Good movie, great actors.  Should watch",
    "date": "2025-03-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I don't know why some of the critic's reviews are so harsh. There are stereotypes, there is politicization. I'd be one of the first to shun something for those things, especially when they're done in a shove it down your throat kind of way. \n\nHonestly, in the first half hour or so, I thought maybe I wouldn't be able to finish the movie because of some of it. I noticed something though, unlike other movies, shows and media, Purple Hearts ISN'T trying to shove an agenda down your throat. The characters have their opinions, just like people but it's what makes each of them, them. \n\nThe movie isn't about which opinion is right, which view is right. The movie is about the characters and their story. How they grow, change and overcome, which is what life is. Was it a perfect movie, no, but by the end credits I had to pee so bad I cranked the volume to listen to the songs again while I ran to the bathroom. I could've paused it at any time to go, but the story had me engaged the whole time and I didn't want to stop watching. That is what makes a great movie, to me.",
    "date": "2025-03-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "it was good and i enjoyed it a lot while i was building my chinchilla cage",
    "date": "2025-03-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very moving and really shows the character development and maturity and how they overcome these challenges together. Just wonderful.",
    "date": "2025-02-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The movie was ok. If the plot was written a bit more better I think the movie could have recieved a more advanced rating. The movie follows Cassie a waitress/ bartender looking to make it big in the music industry. She has recently discovered that she has type 1 diabetes and can't afford her insulin and is not making enough money to afford the cost of living when she meets Luke, a marine who is about to head out to fight in Iraq. They both make a deal to get married so that Cassie can recieve health benefits to afford her medication. The movie is kind of an enemies to lovers plot that is sort of poorly developed. I like the characters but the plot is extremely thin. I did find their love story kind of cute though <3",
    "date": "2025-02-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "\"Purple Hearts\" seems to have been unfairly criticized by many reviewers, and it's amusing to read some of the fragmented critiques about the film. While I won't argue that the movie is perfect—it’s far from it—I genuinely believe it’s not as bad as the reviews would suggest. In fact, it manages to deliver a solid viewing experience.\n\nNicolas Galitzine and Sofia Carson shine in their roles, creating a connection that feels genuine and impactful. Their chemistry is palpable, and it’s hard to understand why critics have given the film such a low score when the audience clearly appreciates it. I’m not claiming this is an awe-inspiring, groundbreaking film, but it certainly tells a compelling story that allows viewers to empathize with the characters.\n\nI recommend giving it a watch. While it’s not on my list of movies I revisit regularly, I find myself watching it at least once a year or whenever I see it pop up in my suggestions. It's a film that, despite its flaws, offers enough to make you want to check it out again. The direction, scenery, editing, and lighting were all executed well, which adds to its overall appeal. So, if you’re looking for something decent to watch, I would definitely say give \"Purple Hearts\" a chance.",
    "date": "2025-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I absolutely loved Purple Hearts. The amount of accomplishments it achieves in one film is incredible. It honours the sacrifice of military personnel, it gives an excellent example of how to set aside political differences to first be humans to each other, it discusses the faults of the American healthcare system, it raises awareness about drug use, it shows the difficulty of dealing with grief, and raises awareness about diabetes. On top of that, there is fantastic music accompanying important plot shifts in the movie with Sofia Carson who has such a unique tone and a decent range in her voice. I was so impressed by the acting and chemistry of the main characters, and I could not recommend it more. I must have watched it at least 7 times at this point. Seems like it will be a biannual viewing experience for me. Great job!",
    "date": "2024-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I've seen this a few times.  It's a good movie.  Love how the two characters fall into place with each other.  Will definitely watch this again.",
    "date": "2024-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The movie is really cute, idk what you guys are on.\nI like the character development, and the scene keeps on changing smoothly between each scenario. The character build is a bit not there yet, the acting was kinda stiff, so the arguments sometimes seems a bit out of place. The ending is a bit... not satisfying? It's cute that they resolved with each other and all but what about the legal issues?\nOther than that, would totally recommend to anyone who needs a dose of romance and cuteness (and someone cutting onion... lol), I cried so prepare some tissue I guess.",
    "date": "2024-10-29"
  }
]