[
  {
    "user": "Jillian Chilingerian",
    "rating": null,
    "text": "Nothing about the film feels natural or believable.",
    "date": "2023-08-22"
  },
  {
    "user": "Carlos Ovalle",
    "rating": 7.0,
    "text": "Despite an undercooked third act and some long stretches of unfunny riffs, Good on Paper finds a way to keep you engaged throughout the film’s 90-minute runtime.",
    "date": "2023-01-22"
  },
  {
    "user": "Keith Garlington",
    "rating": 1.5,
    "text": "By the end it’s really hard to buy into anything “Good on Paper” is selling. Outside of the first 30 minutes, nothing about the film feels remotely authentic from its flaky characters to the unconvincing relationships.",
    "date": "2022-08-16"
  },
  {
    "user": "Zoë Rose Bryant",
    "rating": null,
    "text": "Good on Paper may have a standard set-up, but writer-star Iliza Shlesinger quickly reinvigorates this regular romcom plot with her signature style and comedic stylings.",
    "date": null
  },
  {
    "user": "David Nusair",
    "rating": null,
    "text": "...begins to wear out its welcome to an aggressive degree...",
    "date": null
  },
  {
    "user": "David Fear",
    "rating": null,
    "text": "As an \"anti-rom-com,\" hijacking the genre's rhythms without adhering to the rules of the game, Good on Paper is fine. As a satire of showbiz vapidity, it's decent. It's not nearly as subversive as you want it to be.",
    "date": null
  },
  {
    "user": "Tilly Pearce",
    "rating": null,
    "text": "Good On Paper has some things going for it, but it falls into a classic, cardinal sin of film promotion: the trailer gives too much away. In fact, it gives away everything.",
    "date": null
  },
  {
    "user": "Jennifer Green",
    "rating": null,
    "text": "Iliza Shlesinger and Margaret Cho make a very funny duo, and while this collaboration isn't great cinema, it's an amusing and well-paced hour and half of entertainment.",
    "date": null
  },
  {
    "user": "Tatat Bunnag",
    "rating": null,
    "text": "I'd recommend giving this film a try if you're able to manage your expectations. However, don't watch it if you're expecting a typical rom-com.",
    "date": null
  },
  {
    "user": "Molly Adams",
    "rating": null,
    "text": "[The film] is hemmed in by the constraints of its own genre, committing more to milking a few laughs than crafting any meaningful commentary on dating in the golden age of grifters.",
    "date": null
  },
  {
    "user": "Allen Adams",
    "rating": null,
    "text": "Good on Paper earns its title, a decent idea whose execution doesn't measure up...a clumsy and intermittently watchable film, one that squanders a great deal of potential.",
    "date": null
  },
  {
    "user": "Edward Porter",
    "rating": null,
    "text": "The storyline is unpersuasive (although it's said to be based on Shlesinger's experiences), but the film's loose, chatty style - under Kimmy Gatewood's direction - is pleasant enough in a typical indie-comedy way.",
    "date": null
  },
  {
    "user": "Ed Potton",
    "rating": null,
    "text": "Shlesinger makes an engaging lead, charismatic and thought-provoking if not often laugh-out-loud funny.",
    "date": null
  },
  {
    "user": "Natasha Alvar",
    "rating": null,
    "text": "Iliza Shlesinger and Margaret Cho on screen together is a winning combination. Unfortunately, more is needed to make Good on Paper succeed as an anti rom-com.",
    "date": null
  },
  {
    "user": "Carla Renata",
    "rating": null,
    "text": "Iliza Schlesinger takes a familiar premise and spins it with stand-up comedy reminding girls sometimes what is good on paper is a hot buttered mess waiting to be exposed",
    "date": null
  },
  {
    "user": "Lisa Trifone",
    "rating": null,
    "text": "Absolutely no one in Good on Paper seems to believe any of the words they're saying.",
    "date": null
  },
  {
    "user": "Paul McGuire Grimes",
    "rating": null,
    "text": "I couldn't help but wonder if this story would actually work better as a short stand up story instead of being stretched to a 90 minute movie.",
    "date": null
  },
  {
    "user": "Sean Collier",
    "rating": null,
    "text": "While it's not necessarily a shocking arc ... [it's] both a twist and, in many ways, refreshing for any romcom-adjacent genre.",
    "date": null
  },
  {
    "user": "Adam Graham",
    "rating": null,
    "text": "As a stand-up routine it may have worked, but some material is best left to the stage.",
    "date": null
  },
  {
    "user": "Jade Budowski",
    "rating": null,
    "text": "A solid premise and Shlesinger and Hansen's unconventional chemistry make it more than worth your while.",
    "date": null
  }
]