[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A slow burning powder keg of mystery and emotion that winds up the audience and never lets it go.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's long, bleak and relentless. There are some good performances and gritty cinematography, and you are carried along for a time - it just about manages to make you suspend your disbelief until the end, but, perhaps, only just. It doesn't hold up to scrutiny on reflection. You won't want to watch it again, unless to pick holes in the plot, because it depends on the dénouement.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great lead actors. Fantastic all throughout. Really brings out the emotions from inside.",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "While the plot is problematic, the atmosphere and performances of Jackman and Gyllenhol make this dark mystery one of the best films of 2013.",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Phenomenal, one of the best thrillers ever made",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "must watch, a film that makes you think for hours",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The film would have benefited from a more disciplined direction, the story progressed in such a way that it was very difficult to follow the repetitive plot when feeling a bit tired. The character development was weak. However, the idea and basic storyline were good.",
    "date": "2025-10-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "constant tension and unbelievable plot",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Tonight we watched this one.\n\n'PRISONERS'\n\nBefore watching..\nMy brain.\n\nBlah blah blah Hugh Jackman.\nBlah blah blah Jake Guylenaaaahhhlllll or whatever.\n🙄\n\nI stand corrected.\nFirstly, it's a long film.\nIt's also like,... Thriller, Drama or something...\nNot Horror.\nUsually, when it a long film, it's filled with filler content.\nThis one was different.\n\nBrief synopsis;\nTwo young girls vanish.\nHell Bent Revenge Dad out for, well, Revenge...\nDetective actually doing good work and trying to solve crime...\nMany misunderstandings and distrust begin.\nThing is, at 2.5hrs long, I'm usually very sceptical ov what's being screened.\nVery few scenes could be cut from this one.\nWell written for thee screen.\nWe enjoyed it.\n\nVaughn Roxx gives this 4 Stars.\n☆☆☆☆\nSun Angel Roxx gives this 4 Stars.\n☆☆☆☆\n\nTotal 8 Stars out ov 10.\n☆☆☆☆☆☆☆☆\n\nDefinitely worth a look.\n🤙😎",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Villeneuve's Prisoners captivates throughout its two and a half hours of runtime, with the product being a film that propelled his name into the mainstream. Yet, for all its success, it's difficult to overlook a lot of the sloppiness reflected in some random, unexplained character motives and clichéd detours seen in many mediocre thrillers.",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I can’t recall a movie that stayed with me longer than Prisoners. My wife and I have never had as quiet of a ride home from the movie theatre before or after and we don’t even have kids. The cast, the score and the acting couldn’t of been any better. Extra credit to Gyllenhall, Jackman and Dano they nailed very demanding roles that had to stay w them as well, it couldn’t of been easy. If you have young kids I’d strongly recommend sitting this one out. To all involved- a sincere thank you for making such a outstanding, grippingly grim, emotionally charged, penetrative piece of cinema…Bravo!",
    "date": "2025-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This has got to be one of best thriller drama movies I have ever seen. It kept my attention throughout the entire movie and only a handful of movies have been able to do that in my lifetime.\nThe acting is unbelievable and the twist is so unexpected. Anyone who thinks this movie is bad should be banned from leaving reviews.",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely incredible movie, great premise, emotional at times, kept me on the edge of my seat and I wasn't able to solve the mystery until the very end.",
    "date": "2025-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great suspenseful movie and would definitely recommend \nAmazing build up and great ending with exceptional acting",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Filmed like a horror film, and with a mood to match, Prisoners is haunting and will stick with you.",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Excellent mystery that asks the question how far will a parent go for their child.",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Absolutely amazing. This is one of the best movies i have watched, but that cliff hanger, i hate it",
    "date": "2025-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I just saw an amazing indie film that reminded me of this film. The mood and feel of going through tragedy in a bleak town in the Midwest. \n\nThe acting was superb! Jackman carries an all-star cast as this film kept me guessing till the very end. Just loved it!",
    "date": "2025-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "One of the better suspense-inducing scripts in a long time. Before he was the Dune guy, Villaneuve did this very organic mystery that also managed to insert a couple ridiculous smart plot twists in the middle. The ending made perfect sense, but it was also camoflaged perfectly. One of the best mysteries you could ever watch.",
    "date": "2025-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Decent film but it can be slow at some parts of the film as not much really happens",
    "date": "2025-07-17"
  }
]