[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Jumanji: The Next Level is pretty similar to the first, but plenty of funny moments, action sequences, and great performances from new players Awkwafina, and Danny DeVito, make Jumanji: The Next Level another hit.",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A fun sequel that repeats the beats of \"Welcome to the Jungle\", but changes enough elements with the scenery and acting dynamics to keep things fresh. Once again, we get see the impressive comedic acting range as the movie switches up the personalities of all the actors, multiple times. Danny Devito and Danny Glover are pretty funny as the two bickering old folks trapped in younger bodies. I liked Danny Devito's line about how \"getting old sucks\". Awkwafina is a fun addition to the group. Kevin Hart finally gets to play against type as his whole hit is rambling extremely slowly, while  Dwayne Johnson speaking like Danny Devito was amusing. The Jumanji adventure storyline is arguably thinner this time around. But I'd argue that the teen drama is more engaging with the topic of friends drifting apart in college and the fear of missing out when all you see is their best moments on social media. You could argue they backtrack on Spencer's character development, but to be fair, this is a conflict that often happens in college. We get some cool new environments and scenarios, such as that dune buggy ostrich chase in the desert, the switchblade face off in the Bazar town, the tense mandrill escape on the hanging bridges, and snowy castle storming in the climax. SPOILER, but the twist of Bethany being a horse being translated by old man Kevin Hart had me in stitches. Same goes for the Unic elevator bit and Jack Black Bethany threating to torch everyone up. We also get a sad reveal with Danny Glover's character that feels poignant, despite the odd resolution at the end. The villain felt even more forgettable this time around. But he's not on the movie much, and I suppose they were never the focus anyways. Overall, it's an entertaining sequel that keeps up the momentum and will satisfy fans of the previous installments.",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "THE ROCK & KEVIN HART MAKE ME LAUGH. THE ROCK ACTNG LIKE DANNY DEVITO THAT'S FUNNY.",
    "date": "2025-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Fun movie… enjoyable",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The Next Level doesn’t maintain the laughs like its predecessor, but it still is fun.",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie manages to achieve a very hard objective: doing worse than the first one.",
    "date": "2025-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A sequel that is as good as the first. Still funny and action packed",
    "date": "2025-06-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Slightly worse than the first movie, including the acting, but I'd still say they are equal for a movie star type of movie.",
    "date": "2025-06-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I actually love this movie a lot!! The humor, cast, and even the story are great! (Honestly maybe even funnier than the first!!) This and the first are some of my go to movies to watch when I feel sick or need a little pick me up! Im surprised people to talk about these movies more!",
    "date": "2025-05-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Entertaining for kids and for families. Nothing I can fault in this movie but 3 stars is enough.",
    "date": "2025-05-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A really funny watch",
    "date": "2025-04-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's alright. It's probably the weakest one hoenstly Very mediocre all around. The soundtrack is pretty forgettable overall. The setup of introducing DeVito & Glover with the original 4 is clunky. It doesn't feel fully fleshed out and honestly it can get confusing who is who in this honestly because were so used to who was the avatar for each in the other. So while it was a clever idea to do a Freaky Friday type switch, because there is so many characters and each ahs a Avatar it just becomes very hard to tell whose who. It may not have been so bad if they didn't divide them up into subgroups on top of that making it jumpy too at points. The humor is alright honestly. Some jokes get a laugh but a lot are just old people jokes that are surface level stuff. Another problem this has in a huge chunk of this there is tons of plot expose explaining things we already were told last time. So on top of being a bit repetitve with the same basic idea, your explaining the same too for no reason. The new villian is forgettable lots of the locales just aren't that memorable as before. CGI is alright in this. The reason for returning is kind of forgotten about it feels like with so many subplots but it's pretty basic to follow. The hanging bridges action scene was cool, creative, unique and the best part. Also, one of the few scenes where the expose was low. I liked the ending too. Kind of had a 80's family movie feel to it. Overall though skip this. It doesn't really do anything better than the previous one and is probably the weakest of the trilogy.",
    "date": "2025-04-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely hilarious movie, and it was easy to watch! Definitely should view! All the main characters play their parts really well (especially the old guys!).",
    "date": "2025-01-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A fun and humorous romp.",
    "date": "2025-01-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "LOL!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2024-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Cute movie. Very funny. Especially when they all swapped bodies",
    "date": "2024-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Focused too much on Danny Devito and Danny Glovers characters. All of the Jumanji cast spends the whole time pretending to be new characters and it eliminates the charm from the first movie. Not good.",
    "date": "2024-12-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I want this to go away",
    "date": "2024-12-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "While the humor is strong, the emotional arcs feel weaker compared to the first film.",
    "date": "2024-12-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "É inferior aos 2 outros, mais ainda é muito bom",
    "date": "2024-12-17"
  }
]