[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A shity movie with slow motion abuse and slopy acting and choreography.",
    "date": "2025-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Una película de accion bajo presupuesto genérica con todas sus virtudes y defectos que se deja ver a pesar de todo. Pero lamentablemente al llevar el nombre Hard Target es imposible no compararla con la de Van Damme y ahí es cuando pierde por knockout. Zafa.",
    "date": "2024-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie to set your mind to zero. Do not expect high tier writing and dialogue but great action!",
    "date": "2023-01-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Just a few things wrong with this. Spoilers: why didn't he pick up the weapons from the first hunter, he could have got ammo, a sniper's rifle, a knife and a taser. When fighting the girl any one his his kicks would in reality have broken something.\nI'm surprised the fair-fighting hunters didn't call in some tanks or Apache gunships to make the hunt even easier. A B52 bomber would have helped as well.\nThis film is on par with the Predator ones where the odds are so stacked against the prey it makes the hunters look like huge cowards.",
    "date": "2022-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Hard Target 2 is a sequel in name only to John Woo and Jean-Claude Van Damme 1993 action classic. It stars Scott Adkins as the titular Hard Target, and you get what you come for in a Scott Adkins flick. Scott kicking the shit out of the baddies. Robert Knepper is doing his best Lance Henriksen impression and failing miserably. He's a fine villain, just trying to be like Henriksen's iconic villain from the original. Temuera Morrison plays Knepper's henchman and frankly he should've been the main baddie, gives a very menacing performance. The hunters are your typical who's who of drug lords, hick father and son, tech guy and the daddy issues woman, played by the always badass and beautiful Rhona Mitra. Who frankly is wasted, should've been the henchman to Morrison's main baddie if I casted this flick. She plays the role perfectly though and commands the screen. Plot is basic, but that's these kind of movies, it was good enough to keep me interested. This is easily the best directed Roel Reiné film I've watched. Action isn't too shaky and is filmed well. Has the homages to Woo like the slo-mo, doves and the slo-mo doves. My only real complaint is that it's a little too long, it's stops in the middle for a few but picks back up. Could've tightened it up a little. Also bugged me that this MMA fighter knows how to properly handle firearms and a compound bow. No mention of any experience with firearms or hunting, just perfectly knows how to handle a rifle and check corners. All in all I got what I wanted in a Scott Adkins Hard Target sequel.",
    "date": "2022-03-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Jesus Christ Scott Adkins needs to do better action movie and Hard Target 2 is not a sequel it's just nothing.",
    "date": "2022-02-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Truly painful to watch.",
    "date": "2021-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It's an odd thing for them to do a sequel to a solid but underperforming film 23 years later. But to be honest conceptually it's been done before from the most dangerous game to surviving the game and hunger games amongst others. The film centers around a ridiculously hunky fighter named Wes Baylor played by Scott Adkins who mistakenly kills his bestie (although it seems like they're more, lol). He goes into a severe depression and becomes an underground fighter. Than a generic rich guy tricks him into becoming the prize prey for a group of savage wealthy hunters. The movie has pacing issues and is exe uted amateurly. It also doesn't help that the performances range from overly mediocre to gawd awful. Adkins may look the part but his acting is really rough and Rhona Mitra is so laughable in her role andI usually love her. The end result is just okay neither the action or fight choreography com er close to the original but its marginally entertaining. The films strongest asset is a cast of mostly gorgeous guys. Scott Adkins is ridiculously sexy and Adam Saunders, Jamie Timony, Sean Keenan and Troy Honeysett make for great eye candy as well.",
    "date": "2020-02-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Not that bad. Not really related to the first film. The location is good.",
    "date": "2018-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "A bunch of rich dudes decide they want to hunt someone for sport. But then the guy they pick to hunt turns out to be an MMA fighter who specializes in kicking his opponent in the head until they die.",
    "date": "2017-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I have no idea why this is a \"sequel\" to the original cult classic Hard Target.  At times it feels like it should be called \"Hard Target: The Parody\"  because it is so silly with the acting and story.  The overuse of Slow-mo and pigeons is...I guess to pay homage to John Woo, but I'm not quite sure.  The action sequences are pretty good at times, but ultimately it is a B-movie.  If it was called \"The Hunt\" or \"The Hunt in the Jungle\" it would have probably been better.  But when you call it Hard Target 2...",
    "date": "2017-04-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The movie had very good cinematic level, great camera work, scenes, locations, had good action, and the main villain by Robert Knepper was super well delivered (best performance in this picture, other than I'm a huge fan of Scott) and I couldn't but to notice: It almost could have been a great movie!\n\nIf not for the problem of absolutely crappy logic glue holding the scenes together. The big story, fine. But so much illogical unrealistic scenes were forced into the movie for some weird reasons, made it feel like they forced the script like in that game when a teacher gives you a list of words or expressions and you have to write a story that incorporates it: \"camel\", \"vanilla ice cream\", \"The pen is mightier than the sword\", \"toothbrush\", \"The squeaky wheel gets the grease\", \"propulsion engine\". Now go write a great story, just make sure to use all of these words!\n\nIf the story was a realistic, believable fiction, then this would be an awesome tribute to the original. The filming had to facilitate a very very poor script (logic wise).\n\nYou see, Chance Boudreaux was a war veteran, so you watch him just know some things and you don't ask why he does know all this - well, he's a war veteran. But Wes Baylor is a ring fighter, how on Earth does he know the stuff he knows in the movie? Not any hate towards Scott, but the story is so poorly written.\n\nThe Tha and her brother are poor villagers in a middle of jungle yet they are well spoken in English.\n\nThe General, LOL, the amount of incredible lack of logic behind what script writers made this character be is just beyond disappointing.\n\nRobert Knepper did really deliver great acting, but even he had to struggle with the fact that script writers got on some insane intoxication when working on the story, like in the sushi scene.\n\nAnd the character of Sofia was so unrealistic that Rhona Mitra had no chance in saving it. The only way for that character to work would be if it was not played by an action actress like Rhona but a sophisticated drama performer at the level of Jack Nicholson in The Shining, to picture some sort of psychopathic/narcissistic Sofia in a psychological thriller setting.\n\nI just want to add, that I am so disappointed because:\n\n1. The original Hard Target was really a good movie \n2. So would be the Hard Target 2 if only for good writers \n3. I'm a huge Scott's fan and I wish he could work with better scripts",
    "date": "2017-03-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "As with any action film headlined by Scott Adkins, Hard Target 2 sounded like an exciting thrill ride.\n\nThe general existence of Hard Target 2 takes me by surprise. The first Hard Target (1993) remains one of the greatest films in Jean-Claude Van Damme's career, a man who remains one of my all-time favourite action stars. But why someone would give the film a direct-to-DVD spin-off 23 years after the original is beyond me. The concept for the film is cool enough to explore again, but there is little chance that a home media sequel can live up to the spectacle of John Woo's cinematic action classic. Given the change of director, the odds of transcendence are exceedingly minimal. However, the presence of legendary martial artist Scott Adkins as the lead gives a huge boost of credibility to Hard Target 2. The man has worked with Jean-Claude Van Damme on multiple occasions as well as starring in the two direct-to-DVD sequels to Undisputed (2002) which both triumphed the original. He did the same thing as the lead of Universal Soldier: Day of Reckoning (2012) which was the best of the series, so all in all this film really had a fair amount of potential.\nThe first plot error in Hard Target 2 is the fact that in Wes Baylor's fight with Tim Sutherland, there is a clear moment where he has defeated his foe before delivering an execution kick to him. Though suspension of belief is acceptable in this situation, we learn soon after that the two are actually best friends. This pushes the story into farfetched territory as it's hard to believe that anyone could be as merciless against an opponent they are so close with. It's hard to honestly believe this relationship due to the aggressive nature of Wes Baylor. This is clearly thinking too much into the plot of a film which has a low standard of story. It is part of the formula to reveal the background of the protagonist's quest for redemption in an action film, but it is more of a challenge to tolerate when the drama is mishandled like this. And even though Hard Target hardly had much of a plot to it, the film still commented on the fact that America was poor in its treatment of war veterans and homeless people which gave a greater sympathetic edge to the film. In Hard Target 2, the Western domination of Eastern cultures is a plot point which has been used in heavy surplus from countless other films and just lacks the same interesting hero or villain to make up for it this time. In essence, Hard Target 2 maintains the same interesting concept as its predecessor\nHowever, amid the awkward display of storytelling in the intro to Hard Target 2 is also a display of the film's action potential. We get to see Scott Adkins doing what he does best as he dolls out the harshness against Troy Honeysett and foreshadows a feature length film of him kicking ass at every turn. But as far as the action ultimately goes, Hard Target 2 is a film with mixed results. The film isn't a perfect fit for the talents of Scott Adkins as he spends the majority of the film running from his enemies more than combatting them. And when he does fight, the film is inconsistent in utilizing the man's fighting skills. There are many moments which make a clear display of his magnificent physical capabilities as a martial artist, but they tend to be very brief bursts of action followed by more extended periods of him running. You can see that Roel Reine has made an active effort to maintain some of the John Woo elements in his sequel such as the elements of slow motion, while the use of motorcycles and many jump kicks help to reinforce the nostalgia. But the glory of the original only receives a modicum of replication in Hard Target 2. The choreography is good, but the cinematography sometimes captures the fight up too close for audiences to take the entirety of the fight in. The mediated touch of slow motion is effective, but it still doesn't glorify the action with any significance. The film aims to have a variety of action with shootouts and chases including themselves in the mix, but it nevertheless appears too briefly to make a major impact on the film.\nStill, the film does deserve credit for its slick production values. Given that the setting for the film is characterized as a hundred square miles of jungle, the scenery does a powerful job in reinforcing this with the cinematography utilizing tracking shots to capture the scale of the jungle. Given that the sights include waterfalls and elephants, there is quite a versatile setting to enjoy. The absence of an urban setting means that there are less explosive set pieces, but it nevertheless means the film is a relatively colourful experience.\nAnd Scott Adkins definitely deals justice in the lead. The man is essentially a flawless martial artist, and while Hard Target 2 may not capture this in its entirety there is nevertheless an amazing burning passion for fighting that he puts on display with his ferocious jump kicks and quick punches. Despite some awkward plotting and thin characterization, he still manages to make a relatively compelling lead with a restrained anger in his line delivery. In his silence, he manages to humanize the character through the subtle expression of vulnerability in his facial expressions. We really gather that he has regrets in his past which contrast with the raw display of aggression displayed in his more intense fight scenes. The film is clearly more of a physical effort than anything else as much of the film is shots of him running through the jungle, but his sheer athleticism keeps him going throughout the entire journey while his versatile displays of flexibility remind audiences why he's so popular in the first place. Scott Adkins manages to deliver as best as he can with the material given to him in Hard Target 2.\n\nHard Target 2 has some nice scenery as the backdrop for Scott Adkins' natural ass-kicking abilities, but the story is less powerful the second time around while the action scenes are often too brief and inconsistently captured.",
    "date": "2017-02-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Aika ummehtunutta toimintaa. Pääosan esittäjä oli täysin vailla karismaa. Tuhnulutku.",
    "date": "2017-02-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Only the basic concept and slow-mo white doves remain from John Woo's JCVD original. Just sit back and enjoy the hunt with Robert \"T-Bag\" Knepper then wait patiently another 13 years for part 3.",
    "date": "2017-01-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Adkins martial arts mastery is on full display on this one.  Plot not so much.  If you want to see someone jump into a split and kick two bad guys off moving motorcycles, this is the movie for you!",
    "date": "2016-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Because we were all dying for a sequel over two decades later without Woo or Van Damme. Oh wait, we weren't, and this is a pile of crap.",
    "date": "2016-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Some Cool Action scenes made it worth watching.",
    "date": "2016-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "it's not bad that's good. It's super boring and predictable and the action scenes are super lame.",
    "date": "2016-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Not really related to the previous film just the same premise. Knepper is a great villain and the best thing in this. Scott Adkins is his reliable best but it's time for him to step up now and find a big screen film worthy of his talents and break him out",
    "date": "2016-09-14"
  }
]