[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Beautiful story of life, choices, love and forgiveness!!!",
    "date": "2025-07-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Awesome it’s a must see movie",
    "date": "2025-04-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a great movie about the journey of adoption. It handles the subject with sensitivity and balance. The fact it is a true story makes it all the better. It is acted well and keeps you engrossed. I reccomend it.",
    "date": "2024-02-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A pretty good film about a situation that many face.",
    "date": "2024-01-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "absolute trash, one of the worst movies i've ever seen",
    "date": "2023-12-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Kirk Cameron, never a let down! Excellent movie, HIGHLY recommended.",
    "date": "2023-12-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Even if I wasn't pro-baby, I'd still recommend this movie. It's inspired by a true story, one that is both beautiful and emotional. Anyone who has ever been adopted can relate to the myriad of emotions of meeting his or her birth parents and the film captures this well. While the film can be corny at times, it's not heavy handed nor does it proselytize on the abortion issue but rather presents a compelling and uplifting story of hope, redemption and sacrifice.",
    "date": "2023-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Very poor wooden acting, especially the mother. Contrived ending which deviates from the original 'true' story by giving the fictional best friend a sister in the exact same dilemma as the main characters birth mother. Avoid if you didn't already realise this that an anti abortion propaganda film (based on a true story - which I'd guess is better than this film)",
    "date": "2023-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I have to go againt the tide one.\nIt's shows the happiest possible result of adoption. The kind of ending that, I expect, anyone who finds themselves needing to give their child up for adoption would hope for. So, in that sense, it's very heartwarming however,  we all know that this candy floss happiness is not what everyone gets.\nAs a pro-choice agnostic this film was too heavy on religion for me, God was mentioned a lot and was constantly thanked throughout the film. Abortion was shown to *only* be taking a life and a cold, thoughtless end to an unwanted pregnancy. And American clinical are shown to also be cold and uncaring.\nUltimately, although I was happy that this film told a true story of a happy life that adoption provided for this person, I was left feeling preached to during this movie. I expect that anyone who is religious and pro-life will love it.\nAlso the colour coded mothers really bugged me.",
    "date": "2023-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Based on a true story, Lifemark tells the story of people impacted by one crucial decision. Every life has great value.",
    "date": "2023-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was so moving and heart warming. I cried a lot lol. I like happy cinema and this was a very happy movie.",
    "date": "2023-03-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "While I definitely agree with message of the filmz the execution leaves a lot to be desired. Still, it's nice to see Kendrick Brothers marching on.",
    "date": "2023-02-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "At the end of the movie where they showed the prolife perspective was where it made me cry and thank God.  it was an incredible true story of God's love.  This was one of my favorite movies I have seen!  Thank you Jesus!",
    "date": "2023-01-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very good movie! Definitely good to have the awareness for adoption!! Love that it got the sales and interest it did, and it stayed in theaters a lot longer than originally planned. I hope it reached/touched/changed a lot of hearts!",
    "date": "2023-01-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing storyline, gray actors and a movie that made me feel like humanity is still alive. Kirk Cameron did great.",
    "date": "2023-01-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was excellent! So refreshing to have entertainment for the family to enjoy. We all laughed and cried and had a great discussion. The acting was fabulous as well!",
    "date": "2023-01-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Powerful movie, great for the whole family.   A must see, true story",
    "date": "2022-12-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It was good, I  enjoyed the realness of it!",
    "date": "2022-12-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Clean and real life situations.",
    "date": "2022-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "WHAT AN AWESOME MOVIE AND STORY ABOUT FORGIVENESS!!!  PRAISE GOD!!!!",
    "date": "2022-10-16"
  }
]