[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Absolutely ridiculous but so enjoyable. Full of fun, explosive sequences, and Drew Barrymore’s moonwalk is so unexpected but so funny. A stacked cast with Sam Rockwell, Tom Green, Luke Wilson, and Crispin Glover??? Plus one of the best soundtracks, packed with banger after banger.\n\nDefinitely recommended!",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour, 38 minutes, and 30 seconds!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated PG-13 for Innuendo, Action/Violence, Nudity and Sensuality!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $125,300,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Although fun, it's really stupid. Like, ludicrously stupid. Had the unnecessary comedic bits and predictable plot been toned down, we might've gotten a better movie.",
    "date": "2025-06-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Charlie's Angels might not be perfect, but I still enjoy it every time I watch it. Sure, there's an overemphasis on style, and it has its gratuitous moments, but honestly, it works. The over-the-top action, comedy, and wittiness complement the movie's tone. It's not trying to be a replica of the original series; instead, it's doing its own thing, and it's a lot of fun.\n\nThe direction is solid, and the plot is simple enough to follow without overcomplicating things. The cinematography has its highs, with some memorable scenes, though the frequent use of slow motion and close-ups can feel unnecessary. That said, they don't hurt the movie-they just add to its flashy, unique vibe.\n\nThe acting isn't bad either. Cameron Diaz, Drew Barrymore, and Lucy Liu bring a lot of energy and charm to their roles, and I like how the movie feels like it's always on the move. The characters are all over the place (in a good way), which gives the film its own signature style.\n\nOverall, Charlie's Angels is a fun, flashy action-comedy that doesn't take itself too seriously. It's entertaining, energetic, and definitely worth a watch if you're in the mood for something lighthearted and over-the-top. It might not be groundbreaking, but it's undeniably fun!",
    "date": "2024-12-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "In 2024, this movie gets much more appreciated. It was never trying to be serious. We understand CAMP now and this is honestly a wonderful representation of strong, complex and fully realized female characters",
    "date": "2024-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Compared to a lot of action films its a dumb corny over the top mindless fun of a film. Nothing great or good about it but nothing to offensive either.",
    "date": "2024-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Charlie’s Angels dives into action and comedy with a standout cast. Although it’s from the 2000s, the film is an example of how entertainment can be both smart and carefree. Despite a clichéd hide-and-seek narrative, it’s the execution that keeps it light. The visual aesthetic and a memorable soundtrack complement the action sequences with choreography and absurdity. While the plot falls into the trap of exaggeration, Charlie’s Angels makes up for it with elegant and playful self-irony. It’s not a deep film, but it’s undoubtedly an experience that delivers quality entertainment and laughs.",
    "date": "2024-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Absolute garbage. Was hoping for a serious mission impossible style movie. Instead got vapid, boobs and bums idiocy encapsulated in an awful unrealistic story line. I can’t believe anybody thot it was good.",
    "date": "2024-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "cheesy and great fun best describe this film starring cameron diaz, lucy liu and drew barrymore.",
    "date": "2023-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Pure Y2K aesthetic and most of the negative reviews don't seem to understand that.",
    "date": "2023-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "An average and predictable action flick that wastes the talent of the actors involved.\nA better screenplay and some originality, and this movie could of been something decent.",
    "date": "2023-06-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's ok overall. It's very dated. The acting is actually not that bad with a lot of quirky energy and actually some good chemistry between the three angels at times. But the characters are one dimensional and a lot of the supporting cast is just ok even Bill Murray who doesn't really have any charm or wit (Which isn't his fault as it feels like most of the actors weren't given much here to work with). The jokes actually every now and then got a laugh out of me for how stupid they were but a lot also fell flat. The cinematography is decent also, the action scenes are surprisingly well done with a lot of practical effects and are all very over the top but are all entertaining and the ebay parts of the film. The soundtrack is a mix of the Charlie's Angels theme, dated 90's-00's pop songs, and generic action music which is ok enough but doesn't mix well because it's so dated. The editing is not that good and is the weakest part of the film. Certain jokes go on way too long, there are way too many scenes where it cuts to showing off the angel's bodies in exploitative borderline softcore porn ways and the non action parts are not that good overall. The pacing is ok as stated before the action scenes save this film from being terrible. Overall it's honestly entertaining enough. Anyone who is a fan of any of these actors I would say give it a watch. Besides that though I would say skip it.",
    "date": "2023-01-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Not the worst or best action movie I’ve seen. Decent one time watch",
    "date": "2022-12-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "If you're looking for high art with lots of nuance, symbolism and layers of meaning, keep looking. But if you just want to be entertained, this is a great movie. It was hilarious, and the action scenes were a lot of fun. I had a blast watching it. Of the three Charlie's Angels movies that have been made, this is the only one worth watching. Charlie's Angels: Full Throttle was like a parody of a parody, and Elizabeth Banks' 2019 remake was just a sewer pickle with bad writing and disturbing rather than dark humor.",
    "date": "2022-12-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Filme legal pra caralho, o roteiro é legal pra caramba, a química entre das 3 lucy liu, drew barrymore e Cameron diaz é excelente, o elenco é excelente e quase todos ajudam a melhorar o filme, as cenas são muito legais, como a cena Do começo, a cena do beco que elas enfrentam um maluco de terno com várias acrobacias, depois de elas resgatarem o knox, e depois no hotel de knox, ele começou a dar em cima da pantera Dylan, depois de transarem, vivian wood a mulher que ajudava as panteras e pediu para salvarem o knox, se virou contra elas, e eric knox foi juntou a ela e junto com o misterioso assassino, the thin man, e depois uma cena bem mentirosa, a Dylan se jogou para trás do vidro, no momento da bala se atirada e foda-se forçação de barra pura, a garota é mais rápida que a bala é foda-se, e depois sequestram o bosley, e descobriram onde o bosley estava por causa da porra de um pássaro e foda-se de novo, e na cena quando Dylan estava na cadeira amarrada e luta contra vários capangas do knox e ganha e foda-se mais uma vez de novo, e no final knox ia matar o charlie mas o missel do helicóptero mudou em direção no caminho e destruiu o helicóptero e matou knox e foda-se, a porra do míssil muda o caminho um tempo depois, mas nunca na hora não é, e outra cena mentirosa, mas com várias cenas sem sentido, eu recomendo esse filme, as cenas de luta foram boas, a trilha sonora foi muito foda, com várias músicas famosas de vários gêneros musicais.",
    "date": "2022-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "HiFy, superspy, haters die, go and cry. Like seriously WHY? It's bad? LIE. You're not a guy! Action is high, comedy ample in supply, candy to the eye, errors don't apply, 'cuz their quantity is dry, so I declare hereby, this is a very good film AYE! Watch it, dont' be shy. Bye Bye.",
    "date": "2022-05-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's cute.  Not great, a bit exploitative, and firmly in the 'camp' genre.  The fight scenes are over the top with wirework and poor CGI.  The plot, such as it is, seems to be a series of SNL skits loosely tied together.  But the film is hard to dislike as it clearly is having so much fun at its own expense.  It is a fun movie as long as you don't take it seriously.",
    "date": "2022-04-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A funny, sexy and smart movie. A truly classic that, for a long time, dictated the rules of the superhero genre.",
    "date": "2022-01-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie, has a great 70's TV show feel, wonderful fun story, best of the movies",
    "date": "2022-01-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This remake doesn't take itself seriously which is a smart move on behalf of the filmmakers. Over-the-top action scenes, chick-flick silliness and extravagant production are turned up to the max.",
    "date": "2022-01-09"
  }
]