[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The plot is all about communication between people and it is shown well enough to be understood by the watcher. The movie is not doing something different when showing us those problems. In that matter, I find the movie dull, but it is worth to watch.",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Uma comédia romântica leve, nada exagerado, as piadas, os falas, os personagens, os roteiros como um todo, soa naturalmente, sem exageros e exuberâncias, pessoas normais, gente como a gente, adoro esses filmes casuais, como se não estivesse ali, como se fizemos parte da decoração, nossas amigas, roteiro redondinho, adorei os desencontros, as fofoquinhas, as questões debatidas, as atuações, tudo encaixadinho… Delicado, adorável, divertido, leve, natural, otimista...",
    "date": "2025-02-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Infinitely relatable!",
    "date": "2025-02-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "At first I thought this was gonna be a boring ordinary romcom but it slowly grew on me. It's a story about middle class LA divorced parents and lovers with lots of small casual dinner parties set in manicured LA houses. All living through imperfect relationships with all the bickering and reconciliations. It's mostly about trust and betrayal and working through them to make it work. It's not a very deep movie but it's not pretending to be. Gandolfini and Dreyfuss deliver a subtle and convincing performance with Toni Collette and Catherine Keener provide great supporting characters. I got a kick out of seeing Toby Huss, who played Elaine's love interest on Seinfeld as The Wiz, appear as her ex husband here. It's also very bitter sweet seeing James Gandolfini perform shortly before his passing. He was a great actor and will be missed. That alone makes this movie worth watching.",
    "date": "2024-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the biggest tragedies of James Gandolfini being taken from us so soon is that we didn't get to see his full comedic potential. He didn't do a ton of comedies but when he did, they were good. I miss that man.",
    "date": "2024-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A pretty weak plot for two really great actors. Maybe that is the way second time mature love works but it was pretty unexciting. It makes you want to rewatch Richard Curtis romantic comedies like Love Actually and Notting Hill, which grab you for the whole film.",
    "date": "2024-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Finally got around to seeing this movie. Took me long enough right?! Well this was just the movie I needed to see. This movie had all the right cast members and the storyline was very realistic. This was a real touching movie about to adults who are just trying to figure life out and still grow up while raising kids at the same time. Love is the key word here, buy what you do with love is the effort.  This movie is worth a shot if you want to be teleported back in to the ealry 2000s and see a great feel good movie",
    "date": "2024-02-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Gosh I just LOVED this movie.  The acting was superb, the characters loveable and the plot was so fun, funny and well written.  Aces!",
    "date": "2024-02-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Really enjoyable dialogue and dynamics, not a RomCom as in \"laugh-out-loud\", but as in not being too heavy-handed on the drama. Dreyfus and Gandolfini are so likable and there's no hiding that he, specifically, is overweight and large, but still wins of over the lady because of his good humor - except when he's upset (fortunately not violent).",
    "date": "2024-02-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This was such a good one with a great cast and storyline. It's a hidden gem that's definitely worth the watch.",
    "date": "2024-02-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Enough Said was a very satisfying romantic comedy with our two leads having great chemistry together. The late great James Gandolfini and Julia Louis-Dreyfus really bring their A+ game here and that is no surprise because everything they are in they shine in. This romantic comedy is more for the mature crowd and has a very sharp and strong script. I loved how Gandolfini went outside the box with his character here and brought a lot of substance to Albert. The movie also speeds by at 1 hour and 33 minutes with never letting up. I think a lot of romantic comedies could take a thing or two from this movie. Enough Said gets a strong 4 stars out of 5 from me.",
    "date": "2024-02-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Julia Louis-Dreyfuss and the late James Gandolfini in one of his last roles Sometimes enough said is enough Director Nicole Holofcener tells an adult romantic-comedy showing the sobering depiction of being middle-aged Dreyfuss plays Eva, a single mom who hasn’t dated in years She then meets Albert, who’s quite handsome and charming But it gets messy when one of Eva’s massage clients Marianne is actually Albert’s ex-wife This woman confides in her explaining why the marriage fell apart and Eva unfortunately starts to pick up her bad habits It starts to affect her relationship with Albert This movie succeeds being approachable with its treatment of mid-life crisis with humor and tenderness It helps this will resonate with many adult viewers Eva deals with the crossroads of reaching this point in her life while also facing the reality of her daughter packing up and leaving for college It’s both Eva and Albert that are past their prime forced to overcome their own cynical views Parents don’t have to lose touch with their inner selves raising a child, duplicity is what can cause a rift in a relationship, cynicism can tear its ugly head, the dark side of mid life crisis is the bitterness and viewing life and people around you through pettiness, facing your middle years is another facet of life The two leads have never been better in this kind of dramedy even of this script is very shallow Some of the line readings are awkward and stilted plus it feels restrained considering the age jokes present Still Holofcener makes the appeal of Dreyfus and Gandolfini sparkle looking at dating in real life as the years pass Even the ending I was getting a bit teary eyed",
    "date": "2023-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "\"Yeah, I've got real boobs.\" Hahahahahahaha! Outstanding flashes of Seinfeld! Julia Louis-Dreyfus has no peer!",
    "date": "2023-05-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "\"Enough Said\" is a light and funny romantic movie that has an interesting situation at its center. It works well because the two leads have genuinely good chemistry. I also think it is nice and optimistic to see a movie about older people finding love since there isn't as much of that out there. I think the writing in the movie is pretty good and sometimes it is very funny. Overall, I don't think it is the type of movie that is immediately appealing to me, but still one I enjoyed watching and found some enjoyment in because of how invested I became in the central romance.",
    "date": "2023-02-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's sweet and charming, it's actually funny, it knows what it is. It's slight, but Enough Said is a very good adult romantic comedy. It really benefits from its fantastic cast - especially Julia Louis-Dreyfus who really shines here.",
    "date": "2023-02-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "For a romance comedy I couldn't really ask for more. Well acted, realistic, self-aware, and endearing, I really enjoyed date night with this movie and my wife of a decade. Maybe getting older helped me identify with this one.",
    "date": "2022-02-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Well acted, well written, well directed film.",
    "date": "2022-01-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A bit too cutesy but loved watching Gandolfini.",
    "date": "2022-01-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Review: Enough Said (2013)\nRating: ★★★★★ (5/5)\n\nEnough Said is one of those rare romantic comedies that feels honest, grown-up, and quietly profound. It made me feel seen, comforted, and hopeful about second chances.\n\nWritten and directed by Nicole Holofcener, the film follows Eva (Julia Louis-Dreyfus—whom I love), a divorced masseuse who begins a sweet, hesitant romance with Albert (James Gandolfini—RIP), only to discover he’s the ex-husband of her new friend and client. It’s the kind of setup that could have easily slipped into sitcom territory, but instead, the story unfolds with warmth, nuance, and a lot of emotional truth.\n\nJulia Louis-Dreyfus is funny, vulnerable, and refreshingly honest. She brings a light touch to serious moments and serious weight to comedic ones. And Gandolfini, so gentle, so unexpected, brings a soft-spoken charm that stays with you. Watching them connect, slip, and try again feels deeply human.\n\nWhat I loved most is how Enough Said explores the awkwardness of midlife love, how trust is harder when you’ve been hurt, and how easy it is to let doubt and fear sabotage something good. It’s funny but never mocking, sweet but never sugary, and honest without being harsh.\n\nThis film reminded me that even when life gets messy, and it does, there’s beauty in trying again. And that’s why I gave it five stars. It wasn’t about grand gestures. It was about people trying to be genuine with each other and finding a connection despite it all.",
    "date": "2022-01-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "a lovely, warm, human, small movie. the key premise is awkward and somewhat unbelievable, but look past that...",
    "date": "2021-10-12"
  }
]