[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Got quite a few chuckles out of this. Easy going and enjoyable.",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Frankly, the money spent making this film would have been better spent being given directly to the cause it purports to support. Properly invested, I would hazard to say more funds could have been raised and viewers wouldn't lose 2 hours of time.\n\nThe story is poorly contrived, at best. The acting, while not the worst I've seen, is not helped nor does it help the story. Please leave the Bible to tell the stories of faith. The only inspiration this provides is that of donating directly to your charity of choice -- not supporting d-rated attempts at bolstering faith that are really just capitalist Christian circle jerks in disguise.",
    "date": "2025-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What's not to like about this movie?  The story was a great one. More stories were being told within the first one. The film quality seemed high budget. The cast was right on. The cast was so likable and they did a great job at delivering the message in the story. The location of the movie was beautiful.  I definitely recommend this movie.",
    "date": "2025-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Was this a failed Hallmark film?  Cohen was somewhat hunky at the beginning, but the film was not funny -- moreover unemotional.  Kaitlyn will never be Winona Ryder.  Jonathan Pryce stooped too low.",
    "date": "2025-05-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "How is Camilla Luddington getting parts in movies. She is absolutely awful.",
    "date": "2025-04-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Some weird Christian movie that seems to think if lesbians just find the right man they will be cured and turn straight.   Was this made in 1942? Can’t believe this type of stuff even got made",
    "date": "2025-04-04"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "There is a lot of lying for a faith based movie. This was the biggest waste of an hour and half ever. How did this get made?",
    "date": "2025-03-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I watch a lot of movies. I am a retired Anglican priest and retired commercial roofer. At first I was confused by the way the movie, The Healer was progressing. By the end I realized that the portrayal was an accurate description of one of the many convoluted ways in which God can and does work.",
    "date": "2025-03-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I'm  not an expert in anything film wise but I do watch a lot of movies and such. I don't feel that the lacking part of this movie are the actors, no I feel that the direction moved in a very strange way. Hard to explain but it felt stilted and hesitant then plowed ahead so fast that it just didn't have a good flow sort of stuttering back and forth.\n  The premise of the healer would have been better played as confused not angry. I don't blame the actor. \nThe background musical choices were uninspiring and more distracting than providing accompaniment and emotional texture.\nNot horrible but not worth the time really. \nI wish that I could say that it was quirky but I can't and that's just sad.",
    "date": "2025-01-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Acting was not very good...but the script may have had a lot to do with that.  Liked some parts and overall theme...but just landed rather flat.  Poorly directed and written for most part.",
    "date": "2024-12-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A fantasy, and a truly BEAUTIFUL film.  A somewhat familiar \"looming-death\" plot; fine script, especially Abigail's; very well cast; very well acted; gorgeous location.  I was a basket case at the end, and even more when the Paul Newman credits appeared.",
    "date": "2024-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Hopeful.  Sorry for those who didn't enjoy because of what/ how they think.",
    "date": "2024-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The pretending to be a lesbian storyline made me want to throw things. Just ridiculous!",
    "date": "2024-04-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a great uplifting movie.",
    "date": "2024-04-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I just watched \"The Healer\" and found it to be such a touching story..   I highly recommend people check it out...  all the way to the end.  It was a blessing to me.",
    "date": "2024-01-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The Healer is a feel good, uplifting movie with a wonderful cast. My 12 year old enjoyed it too. All of the people (and animals) involved made the world a better place when they created this one.\nLovely to find a movie that leaves you feeling so good.",
    "date": "2022-04-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Basically, \n•At the beginning of the movie, this guy gets what he wants from women no matter the cost. \n•Middle of the movie, He becomes the chosen one to heal a lot of sick people but doesn't want the gift. \n•End, meets a young girl with cancer who changes his mind about healing people. He wants his gift back but is told no by his uncle so he goes to a church in the middle of the night to yell at God and gets his gift back. \n•The end. \n•I hated this show. It was really stupid.",
    "date": "2022-03-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wonderful movie. Very good acting. Thoughtful message. My wife and I thoroughly enjoyed this movie. We are not religious but the message of hope, friendship, compassion, and love is universal and needed. If you have not had enough life experiences to realize the value of a movie like this then you should not be commenting. Thank you to the actors, producers, director, and everyone involved in making this movie. We wish you the best. To the commenters who have given a bad review of this movie because of their disdain for religion or their perceived attack on homosexuality, you are sadly missing the point and value of this movie.",
    "date": "2022-03-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Like it a lot. Nice message. Well performed.",
    "date": "2022-02-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It is pretty much what you would expect from the description. It was reasonably well done and entertaining enough.",
    "date": "2021-09-04"
  }
]