[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This documentary is extremely aggravating because we all know this is almost exactly how twisted the system is & cant do a thing about it. Theres good people & bad people with child protective services, you never know who youll be dealt. We have these mental institute belonging cat lady Karens like the one here, who either want a child & cant have one so they prey on other people’s children or theyre just plain mentally ill and miserable and search desperately for reasons to be able to get satisfaction by tripping over their power in removing children from their homes. The system also sides with these people because they all work together & the system is overall complete trash. \n\nIn this situation there was absolutely zero ABUSE sensed from the mother, the ketamin was advised and prescribed by the doctors & the only thing that took the child’s pain away. The mother was not opposed to them using any other method that ensured her child wasnt in pain, they just were mad at her tone which isnt a reason to destroy a child’s life by removing them from their parents because youre weak minded and cant handle an argument with a worried parent, which by the way IS YOUR JOB TO DO.   They responses from sally smith and the other doctor after the mother died was absolutely desgusting. You guys are pigs. Pig is cleaner than you. \n\nThat all being said, it was absolutely  selfish of the mother to do that having two children who need her. No doubt there. Shes weak and selfish ahd wrong for that but had she abused her child by overmedicating?",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This documentary is egregious sensationalism. It does not merit the label “documentary.” None of the evidence pointing to Maya truly being a victim of medical child abuse was presented, and no education on what this form of abuse entails was presented. The filmmakers should be ashamed of themselves. They have put more children in harms way and have made the job of child protection much harder.",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This is not unbiased journalism. How is it that in approximately a year, the child went from wheelchair bound and \"likely to die\" from CRPS, a non-fatal condition, to walking with crutches after receiving only physical therapy. What, loving, caring mother would kill herself at the time her child needed her most. If Beata was such a strong woman, why would she kill herself after being temporarily separated from one child  when she had another young child at home who needed her. Seems like there is a lot more to this story.",
    "date": "2025-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "An engrossing documentary highlighting the battle between parents and hospitals whilst in this case the child suffers immeasurably. \nThe lack of empathy is heart-breaking at times and we see just how brave Maya was during all of this and her awful CRPS and what she went through and still does today.\nThough it favours the victims without maybe just a touch more balance, the case was completely proven in the court ruling that followed.\nThese stories need to be told.",
    "date": "2025-03-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This documentary falls grossly short of the responsibility documentary filmmakers hold in presenting complex stories. Its one-sided portrayal risks perpetuating significant misconceptions about both this specific case and medical child abuse in general. The potential for this misinformation to negatively impact public understanding and, consequently, future victims, is deeply concerning. The film's apparent lack of care in its storytelling is troubling. Seeking additional, balanced information is crucial for those wanting a true understanding of the situation. A dialogue with the filmmakers about the film's impact, particularly on mandated reporters, would be valuable. The film's accuracy is seriously questionable, and the need for accountability should be considered.",
    "date": "2025-02-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wow what heartbreaking  story  I was in tears  I admire  maya mother  may she r.i.p  may God bless your family  wacth over you ❤️",
    "date": "2024-12-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The title of the documentary, \"Take Care of Maya\" is drawn from an email draft left by Maya's mother, Beata, to her husband Jack Kowalski. This Netflix documentary tells the story of the Kowalski family from Florida. Maya Kowalski, the daughter of Jack Kowalski and Beata Kowalski, who was rushed in emergency to John Hopkins All Children's Hospital in 2016, where hospital management deliberately and medically abducted Maya and blamed her mother, Beata, of child abuse.\n\nThe documentary sent shockwaves across the country and beyond for the distress and trauma experienced by the Kowalski family, who also lost Beata Kowalski, who committed suicide after being accused of child abuse and refused permission to visit her detained daughter for three months.\n\nThe Kowalski family is now resolved to sue John Hopkins All Children's Hospital for causing them trauma and to prevent other families from going through the same ordeal. Jack and Maya proclaim to be fighting for Beata Kowalski, a fighter who never caved in to bogus accusations.\n\nThe Kowalski family was awarded $261 million in punitive damages by the jury in early November 2023. However, as Maya Kowalski stated, no amount of money will bring her mother back.",
    "date": "2024-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "“Take Care of Maya” is a deeply moving and thought-provoking documentary that sheds light on the harrowing experiences of the Kowalski family. The film follows the story of nine-year-old Maya Kowalski, who was admitted to Johns Hopkins All Children’s Hospital in 2016 with a rare illness. As the medical team struggled to understand her condition, they began to question the family’s dynamics, leading to Maya being placed in state custody despite her parents’ desperate attempts to bring her home.\n\nFor someone involved with the Department of Children and Families (DCF), this documentary is particularly impactful. It highlights the complexities and challenges faced by families and healthcare professionals when dealing with rare medical conditions and the child protection system. The film captures the frustration and agony of being caught in a system that sometimes prioritizes suspicion over compassion.\n\nThe documentary is both heart-wrenching and infuriating, as it exposes the flaws in the healthcare and child protection systems. It leaves viewers with a sense of urgency to advocate for better understanding and support for families in similar situations. While the film does not provide easy answers, it encourages viewers to reflect on the importance of empathy and the need for systemic change.\n\nOverall, “Take Care of Maya” is a powerful and essential watch for anyone involved in child welfare, as it underscores the importance of balancing medical investigation with compassion and understanding.",
    "date": "2024-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "To call this a \"documentary\" is insulting to the genre. It is so manipulative, it leaves out a considerable amount of qualifying evidence, and it relies on a plethora of logical fallacies to promote its \"argument.\" I don't know if the filmmakers realize the damage they are doing to children and child welfare systems creating a film like this. This film is dangerous: it promotes the harming of children and sides with their abusers. They need to take an ethics course before they try making another \"documentary\".",
    "date": "2024-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The munchausen by proxy diagnosis is so glaringly clear when you hear all of the facts of this case, not just the extremely biased view in this documentary. I hope that other children don’t meet their death as this film will serve as nothing but a way to discredit legitimate concerns over medical child abuse.",
    "date": "2024-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I applaud those who decided to make this movie happen. These institutes must be exposed!.",
    "date": "2024-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Shocking documentary of a young girl that gets trapped in a hospital because one social worker suspects munchausen by proxy. Terrors of the government wielding too much power.",
    "date": "2024-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Biased and scary. This mum appears to have all the signs of Medical abuse. That poor girl. Interesting it came out right before the court case appeal. Not info on the medical side of things, I feel sorry for the health professionals if shite like this is legal to be produced. Please if you haven't already listen to the podcast about this form of child abuse. That said I wish my mum put me in a two week K-hole, YEW! Research people before you make judgement on the health system. If that was a parent beating up on their child your reviews would look very different.",
    "date": "2024-04-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Infuriating and amazing documentary on corruption and awful human beings who are evil and changing lives of parents and their children. It is stretched a touch. There is only so much to take before you have to hit pause. It is rare we can look into the eyes of pure evil, but it's important to see people lie with impunity just so you know what they are capable of. I would have like to know why these people were lying. What was on the back end for them? If they are evil wouldn't that also make them mentally ill or most certainly lying? Altering lives forever has to come with some consequence? This is all happening in a Florida hospital with the Johns Hopkins reputation. Mind numbing! FInal Score: 7/10",
    "date": "2024-03-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Brutal story that needs to be heard, and they did an excellent job on the production of it all. Very, very well done. If you're a human being, you will be crushed by this movie. It will sadden you and anger you, but you will benefit from hearing it. This is a reality we all need to be aware of, especially parents.",
    "date": "2024-02-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I watched this without any prior knowledge or expectations and was taken on an emotional journey that moved and angered me in equal measure. What an indictment of the American medical and legal system, in which money plays the pivotal part.",
    "date": "2023-12-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Heartbreaking and infuriating. The level of suffering the Kowalski family endured at the hands of the Johns Hopkins children's hospital and the so-called justice system is almost unimaginable. That they perservered and continue to fight in court to hold the system  responsible for this tragedy is a testament to their extraordinary courage.",
    "date": "2023-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the scariest things I've ever seen. The system is setup to punish and increase those punishments at every turn of you defending yourself or your family. Worse yet when it all comes out that they are wrong it has built in safeguards to not take responsibility for the actions of the individuals who cause so much pain. People  should be in jail or prison over what they put this family through. Instead they will be allowed to buy their way out of accountability.",
    "date": "2023-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "🤬🤬🤬Must watch. It's maddeningly eye opening.",
    "date": "2023-10-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Sad and sometimes confronting story of a young girl being held captive by a hospital.",
    "date": "2023-10-05"
  }
]