[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It's entirely unrealistic and very disappointing. I think movies should strive for more realism at least.",
    "date": "2024-06-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "As an Australian, this story was told very similarly from what i remember it being as a child. Obviously with a bit of extra hollywood esque magic sprinkled in. The acting was not bad considering it is an Aussie film, and the main character playing Jess felt perfect for the role.",
    "date": "2023-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Both inspiring and entertaining",
    "date": "2023-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great Movie, feel good, inspirational great pacing.",
    "date": "2023-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "All said and done it's a watchable film.",
    "date": "2023-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best movie I've seen in a long time!\nExcellent movie for any age to see.",
    "date": "2023-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Sit down with the entire family and bond over this one. Don't miss it!",
    "date": "2023-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Jessica Watson's story has long deserved a movie. I always love seeing Aussie stories in film and what the Aussie industry is capable of. This movie is great, inspiring, engaging and has very pleasant colours. Teagan Croft and all of the cast were really good. Movie's based on true stories always add more dramatic elements but that is what helps it to work on film. I did feel that the pace should've been slower in some story beats, particularly I the movie's set up. But True Spirit captures the true spirit of Jessica. Go see it!",
    "date": "2023-05-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Engaging, good cast, and well shot. Starts off a bit cluttered but quickly finds its pacing. GREAT family movie, but clearly Hollywood-ified. 83/100",
    "date": "2023-05-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The movie had potential but it was really painful to watch how stupid the main character is.  She has an entire night to prepare for a storm and she's doing all the things during the storm.  Among the many other stupid things this character does.  I know she's just a kid but she was not responsible enough to do this trip.  Also being the youngest is just a stupid concept for example how young do you go?  Is the next one going to be 15 or 14 it's just a stupid concept this shouldn't be a record.  The characters are also dry and forgettable.  Mostly watched while doing other things it couldn't keep my attention for long periods of time.",
    "date": "2023-05-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I really enjoyed this story . I had never heard about her till this movie but I really found it to be a powerful story . Dreams can happen when you really put in the hard work .",
    "date": "2023-04-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Enjoyable real life story about a teenage girl who sets a goal to circum-navigate the globe and achieves it after overcoming insurmountable odds while her family in Australia guides her along the way.",
    "date": "2023-04-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "ONLY MOVIE EVER that I had tears in my eyes nearly the whole way through.\nThis young woman's spirit will stay with ke for the rest of my life.\nThe love and support of her family was next level. \nWhat a family bond \nWell Done Jessica Watson you are hero and inspiration to children across the globe.",
    "date": "2023-04-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing movie for the family to throw back some popcorn to. Very inspirational for all, but especially the younger generations. Seems to be very close to the true story from what I've looked up",
    "date": "2023-04-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thought this movie had some beautiful scenes and the acting was amazing, the chemistry between the cast made the movie better",
    "date": "2023-04-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "🤩😃🥰😍👍🏻🤔👍🏻👍🏻",
    "date": "2023-03-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's a hallmark type movie. Fine if that's your thing.",
    "date": "2023-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "É o tipo de filme que incentiva principalmente as jovens mulheres a irem atrás de seus sonhos – e esses sempre valem a pena ser vistos.",
    "date": "2023-02-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Minha opinião: Um filme de fato veridico, Onde Jessica Watson uma garota de 16 anos quer se tornar a mulher mais jovem mulher a dar a volta ao mundo dentro de um veleiro, um desafio que durou 7 meses. Temos Bem que é o seu coach seu líder. E temos Julie e Craig que são seus pais e mais seus irmãos. A família de velejadores onde Jessica encotra seu desafio de dar a volta ao Mundo sem atracar seu veleiro em terra, vendo que um outro jovem havia feito. E na preparação ela colide seu veleiro com navio, sem dinheiro para concertar  o veleiro, amigos da vizinhança ajuda a reformar. E assim ela sai no mar, passa pelo sul das Américas, alcana a linha do Equador, ultrapassa o sul da Africa, enfreta uma grande tempestade que pensou que iria morrer, mas o veleiro aguenta firme. Até que passa por um período longo sem vento no meio do oceano e entra em desespero, mas ao final alcança seu objetivo. Quando ela parte um pequeno povo foi se despedir e com a mídia colocando em xeque sua aventura. Quando ela conclui tem milhares de pessoas a esperando, além de toda a mídia e políticos. E hoje é a jovem mais nova a dar a volta ao Mundo. Um filme de superação e conquista. A atriz Teagan tem uma boa atuação. Um filme bem construído com as limitações orçamentárias. Vale assistir.\nRoteiro e enredo medianos.\nVale apena assistir? Sim, para dar um Up em suas emoções.\nNota: 6,5",
    "date": "2023-02-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Such a great movie. Characters 10/10 lore 10/10 emotional scenes 11/10. I haven't cried this much ever since I watched the ending to the greatest showman. Such an incredible movie based on real life!",
    "date": "2023-02-14"
  }
]