[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Idk why but it’s the scariest thing k have ever watched",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "pretty decent movie overall; had some really good and boring parts equally. enjoyed the concept even though it’s not a unique idea. ending was pretty good though imo !",
    "date": "2025-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I groaned when Taylor Russel's character, one of our two protagonists, first started delivering the dialogue that is meant to tell the audience she was a genius.  It wasn't the only sloppy storytelling technique.  Had the moviemakers taken the time to smooth out the rough spots, ESCAPE ROOM could have become a classic.  The most horrifying part of the story is when we see the influence of puppet masters with too much money on their hands.  What we see in the \"escape room\" might be fiction, but it doesn't necessarily have to be.  Sadism, unchecked wealth, no oversight. . .it's what has brought our world to the abyss.",
    "date": "2025-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "There are times when the script should change based on what an actor or actress is able to bring to the table. This is one of those times. One of the best characters is removed very early on and it's like when the team you're rooting for in the world series gets cut. It's hard to care for another 45 minutes after that. Another major problem is how the players are being rushed through every room, but they still have time to drag on with extremely boring waiting sequences. The solutions are designed to be way too quick and specific. In all the extremely well designed rooms, there is only one specific and uninteresting way to get through them. That makes 99% of the set entirely useless. Maybe that's good for a real life horror scenario, but not very compelling for a film you want people to watch.",
    "date": "2025-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Find the clues or die.\n\nEscape Room is a 2019 American psychological horror film directed by Adam Robitel  🔑 \n\nNot bad, but not my favourite either 😉\nIt’s ok, but I feel mixed about this one 😉\nI’d recommend it if you like this genre, but if not then probably give it a miss 👍🏼👎🏼\n\nSix strangers find themselves in circumstances beyond their control, and must use their wits to survive.",
    "date": "2025-09-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I wouldn't call it boring, just maybe unimaginative.",
    "date": "2025-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not bad. Not great or anything but a decent movie. Seemed like a late late 90s movie or early 2000s movie.",
    "date": "2025-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I really enjoyed this movie . Very fun and scary plus unique.",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The designs in the rooms were amazing. I was searching for something that stands out while being an escape horror. Character development was pretty good, the plot was cool, and the room designs (once again) is magnificent! Though, it's hard for me to not like horror movies.",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "While there is some questionable acting in this film, the premise and setup is actually really cool and could possibly start another \"Final Destination\" meets \"Saw\" type franchise, I personally wanted to see more when it was over, the writing is smart most of the time, Taylor did a decent enough job and was interesting to watch, some of the other actors could have been casted better, the film is worth watching if you are a fan of escape rooms, thrillers where you need to think and solve, or just want a fun watch you can chat about while you watch it type of thing.",
    "date": "2025-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I thought it was great.  Extremely tense, good actors.  Very unique.",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "If you go into this movie assuming it’s going to suck, you might enjoy it.  It’s a fun dumb movie.  Don’t overthink it.",
    "date": "2025-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It honestlyyyyy wasnt as bad as I was expecting lol. I was ready to give it 1 star off the bat. But there were some redeeming qualities about it. Now, the acting wasnt the best and the actual story had flaws but overall it was more entertaining than your average awful movie.",
    "date": "2025-09-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Although entertaining and set at a good pace, the movie failed to deliver any form of actual problem-solving with most of the solutions just being thought of immediately. Also, besides the start of the movie, none of the challenges required any type of puzzles to escape and instead were just survival-based. Despite the characters being somewhat realistic, they were very unlikable and had little to no character development. Overall, if you want to watch an entertaining film based around  mysterious people making survival games, watch Squid Games.",
    "date": "2025-09-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I watched Escape Room on Netflix, where six strangers enter a game promising $10,000 but soon realize the puzzles are deadly traps in a sadistic life-or-death ordeal. While the characters were likable and there was plenty of action, the movie didn’t really pull me into the puzzle-solving—it felt like a passive experience, and I was left wondering why this was happening and how these people were chosen. The plot and theme disappointed me, and the ending didn’t satisfy. I’d give it a 2.5 out of 5.",
    "date": "2025-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "*Escape Room* (2019) uses the popular escape room concept to create a suspenseful thriller with creative puzzles and strong visuals. The film explores how characters react under pressure, revealing personal traumas that fuel the tension. With solid performances and a sequel-ready ending, it delivers an engaging and intense experience.\nRead the full review here: (Indonesian version : alunauwie.com) and  (English version : uwiepuspita.com)",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "(CASTELLANO) Escape Room arranca con una idea tan simple como atractiva: varios desconocidos atrapados en salas que parecen imposibles de superar. No descubre nada nuevo en el género, pero consigue enganchar gracias a un ritmo ágil y a escenarios que, por momentos, sorprenden por su ingenio.\n\nLa película se disfruta sobre todo en su primera mitad, cuando cada sala se convierte en un nuevo reto lleno de tensión y con detalles que mantienen al espectador pendiente. Ahí es donde el film funciona como un pasatiempo: ágil, con sobresaltos bien medidos y lo bastante ingenioso para no aburrir.\n\nEl problema llega cuando el guion intenta ser más ambicioso de lo necesario. Los giros se ven venir de lejos, los personajes resultan demasiado arquetípicos y la resolución final no está a la altura de lo que promete. Se percibe cierta obsesión por preparar terreno para una posible secuela, lo que resta fuerza al desenlace.\n\nAun con esas carencias, Escape Room cumple con lo que promete: un thriller de entretenimiento ligero, que se disfruta mientras dura aunque se olvide rápido al salir de la sala. Una película que no pretende más que ofrecer un rato de tensión y, en eso, cumple dignamente.\n\n(ENGLISH) Escape Room starts with an idea as simple as it is appealing: several strangers trapped in rooms that seem impossible to overcome. It doesn’t bring anything new to the genre, but it manages to hook the viewer thanks to a fast pace and settings that, at times, surprise with their ingenuity.\n\nThe film is most enjoyable in its first half, when each room becomes a new challenge full of tension and details that keep the audience engaged. That’s where the movie works best as a pastime: fast, with well-timed scares and clever enough not to bore.\n\nThe problem comes when the script tries to be more ambitious than necessary. The twists are predictable, the characters feel too archetypal, and the final resolution doesn’t live up to what was promised. There’s a clear obsession with laying the groundwork for a possible sequel, which weakens the ending.\n\nEven with those shortcomings, Escape Room delivers on what it promises: a light thriller that entertains while it lasts, even if it’s quickly forgotten once you leave the theater. A film that doesn’t aspire to more than providing a moment of tension, and in that sense, it succeeds.",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It managed to keep a good pace, but I really did not like the characters. Also, we are left with a lot of unanswered questions at the end.",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Enough to be enjoyable.",
    "date": "2025-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was good as far as escape room movies go, but it wasn't a new idea or anything super unique. I enjoyed it though!",
    "date": "2025-07-06"
  }
]