[
  {
    "user": "David Bax",
    "rating": null,
    "text": "They all shine as befits their star status but there's little here worth casting their light on.",
    "date": "2021-01-06"
  },
  {
    "user": "Richard Propes",
    "rating": 0.0,
    "text": "The film itself is destined to be one of the year's absolute worst efforts and easily the worst of Marshall's long career.",
    "date": "2020-09-17"
  },
  {
    "user": "Avaryl Halley",
    "rating": null,
    "text": "This movie is watchable on a Sunday with your mom.",
    "date": null
  },
  {
    "user": "Andrew Galdi",
    "rating": null,
    "text": "The thing that prevented it from just totally tanking for me was that the spirit in which it was created and delivered was so earnest... they were just having fun.",
    "date": null
  },
  {
    "user": "Linda and Al Lerner",
    "rating": null,
    "text": "We expect more fun from Garry Marshall, one of our favorite directors.",
    "date": null
  },
  {
    "user": "Sharronda Williams",
    "rating": null,
    "text": "I had high hopes for this move but that soon went away 30 minutes in.",
    "date": null
  },
  {
    "user": "Pooja Pande",
    "rating": null,
    "text": "Mother's Day is a feel-good movie and it makes for a good one-time watch.",
    "date": null
  },
  {
    "user": "Frank Ochieng",
    "rating": null,
    "text": "With previous dreck such as 2010's \"Valentine's Day\" and 2011's \"New Year's Eve\" one can imagine what other arbitrary calendar concoction that Marshall can lazily muster up to showcase as a companion piece to his string of hapless holiday treats?",
    "date": null
  },
  {
    "user": "Deirdre Crimmins",
    "rating": null,
    "text": "Audiences who like a shred of cohesive story telling or characterization, or even a chuckle during a supposed comedy, should stay very far away.",
    "date": null
  },
  {
    "user": "Alison Rowat",
    "rating": null,
    "text": "There are a couple of nicely barbed lines, but this is a film so syrupy on the whole you may want to keep hold of that empty popcorn bucket lest nausea strikes.",
    "date": null
  },
  {
    "user": "Mae Abdulbaki",
    "rating": null,
    "text": "\"Mother's Day's\" attempts at being funny miss the target by a long shot and to be blunt, it is downright boring. Saying the film is an underwhelming catastrophe is an understatement.",
    "date": null
  },
  {
    "user": "Lisa Johnson Mandell",
    "rating": null,
    "text": "[The characters are] all put in such preposterous situations with such confusing timelines that the suspension of disbelief rapidly becomes too much work.",
    "date": null
  },
  {
    "user": "Pamela Powell",
    "rating": null,
    "text": "There's drama and humor, but not enough to keep your attention for the two-hour running time. The film meanders aimlessly in the last half hour, attempting to tie up the loose ends.",
    "date": null
  },
  {
    "user": "Reagan Gavin Rasquinha",
    "rating": null,
    "text": "It's a tad unfortunate to see Aniston hamming it up to the high heavens, doing what she has been doing in rom-coms since, well, forever.",
    "date": null
  },
  {
    "user": "Rachit Gupta",
    "rating": null,
    "text": "Apart from the pretty faces and the challenges of raising kids, there's nothing really that would connect with any of us.",
    "date": null
  },
  {
    "user": "Matthew Bond",
    "rating": null,
    "text": "No one is actively bad but the film still manages to hit so many jarring notes.",
    "date": null
  },
  {
    "user": "Sarah Marrs",
    "rating": null,
    "text": "I recommend Mother's Day to no one, unless you happen to despise your mother and are looking for a passive-aggressive way to communicate your loathing to her.",
    "date": null
  },
  {
    "user": "Keeva Stratton",
    "rating": null,
    "text": "If you like your films light and bright, without pause for any of the authentically raw emotions that would naturally be associated with any one of these story lines, then go on, take your mum and go see Mother's Day.",
    "date": null
  },
  {
    "user": "tt stern-enzi",
    "rating": null,
    "text": "This doesn't come across like the kind of movie anyone would want to take their mothers to as a sign of appreciation for giving birth to them. Enough already, Mr. Marshall.",
    "date": null
  },
  {
    "user": "Andrew Lapin",
    "rating": null,
    "text": "It's hard to convey what a deeply, deeply cynical film this is.",
    "date": null
  }
]