[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I want this movie to come back to theaters this year or next year",
    "date": "2025-09-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 29 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated PG for Mild Rude Humor!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The original creator will be missed!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This one is hilarious and I love the fact that the chipmunks were going to school.",
    "date": "2025-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Even though this picture was deemed to be a hit when I came out, it has not aged well since it's released. Back to Syrian Productions has a habit of introducing characters like Aunt Jackie and Toby but not bringing them back for subsequent sequels. The other problem I have with this film is that the Chipmunks are sent to a high school instead of an elementary school. After all they are supposed to be children. My favorite scenes are the one with Toby. Because when Anne Jackie has a problem Toby steps in to help take care of the Chipmunks. We learned that Toby is a shy awkward guy who likes a particular girl and the Chipmunks help him come out of his shell. The film is a mess on one hand because of Ian Hawke. He's the sleazy record producer that tried to harm the Chipmunks and later the Chipettes. He goes as far as to break into an empty apartment and assume living there. He even goes as far as the dress and drag at the end of the movie to play fake being the Chipettes. Some of the antics of Ian Hawke are questionable at best. If it weren't for the Toby scenes I wouldn't watch this film at all. Characters like Aunt Jackie and Toby get short changed while Dave has often abrasive at times the 5:00 shadow and is very abrasive at times",
    "date": "2025-06-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I was so excited to see the chipmunks again and in the movie theater this time when it came out. I was dancing in my seat and smiling the whole time. I was even more excited to see girl chipmunks. If you loved the first movie you’ll probably love this one just as much.",
    "date": "2025-04-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I cant stress this enough, WHY WERE THE CHIPMUNKS SO FREAKY!!??\n\nLet me paint a picture for you,\nYou are a freshman in high school on your choir’s feild trip to toronto. Your old decrepit tour guide Gary randomly takes you to a meat market and you don't want to be there. You hate it so you go to the thrift shop down the street. You take a gander around and then you find Alvin and The Chipmunks The Squeakuel. You think its silly and then you remember that the bus ride home needs a movie playing on the Tv’s, turns out you purchase it and then 2 days later as the bus driver takes you home you are subjected to the unimaginable torture of enduring this wet fart of a film. My life would be better is i had not left the market for the thrift store, so i am telling you to listen to Gary",
    "date": "2025-04-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This is the third testament in the Bible",
    "date": "2025-04-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Quit the shit",
    "date": "2025-01-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "If you want your kids to fall asleep fast just put this movie on and they will be sleeping in no time",
    "date": "2024-12-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "https://youtu.be/O_LLpeicB3k?si=brtRW38_EWL5HyrV\n\n^^^check out my longer review^^^\n\nEvery once in a generation mankind invents a new word that moves the English language into its next phase of evolution. Our generation's is Squeakquel.",
    "date": "2024-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Liked how the bald fella put the chimpkins in jail",
    "date": "2024-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Not as good as the first one, but the main star of the movie wasn't the chimpmunks it was Zachary Levi.",
    "date": "2024-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Look dude the people here rating this movie like it's out here claiming to change the landscape of cinema need to use their brains. It is a kids movie, it is for children. 21% is a ridiculous rating for a kids movie that I remember being enjoyable when I was a kid. Upon recent rewatch, the movie wasn't the greatest I'd ever seen by any means, but I have the self-awareness to realize that I am not the target audience for this movie and can't expect it to still feel the same when I'm older and more cynical.",
    "date": "2024-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "this was the best movie of all time i would watch this nonstop for 7 years \nmy favorite part was when alvin crashed the plane into the south tower",
    "date": "2024-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "That was even worse than the first one",
    "date": "2024-03-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "AMAZING! The best movie I've ever seen. CHIPMUNKS 4LIFE! I've watched it 12 times",
    "date": "2023-12-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "O filme é bem legal, algumas pessoas não gostaram, mas eu amei!!!",
    "date": "2023-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "2 words: cash grab.\n\nPeriod.",
    "date": "2023-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Between the unclear plot, corny acting, lame jokes and lack of focus, Alvin & The Chipmunks: The Squeakquel is one of the examples of making a sequel because they want to and not because they have to.",
    "date": "2023-10-17"
  }
]