[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The worst one YET. The whole movie is like 5 different storylines. The characters are mostly useless.",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of my favorite movies of all time , I would reaally appreciate a sequel of this movie, I know that it is not in your mind, but many of us would by pleased",
    "date": "2025-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Transformers: The Last Knight is an underrated film, that's all I can say.",
    "date": "2025-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Underrated as hell... only weird thing was how Megatron came back... they never explained it I think",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Transformers 5 The Last Knight was the last movie by Michael Bay before he left the transformer series and Transformers 5 The Last Knight was a good movie to the Transformers series the plot was intense to where they have Optimus prime turn evil by his creator and the whole fight between Optimus and bumblebee was insane it was intense seeing Optimus beat bumblebee really scared fans and going to have Optimus prime being taken off by a bunch of knights was just going to literally furious everyone but the story focuses on King Arthur and Marlin staff when you find out that what everyone was after",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Some epic scenes and moments, but it was quite boring waiting for Optimus or Nemesis to show up and when he did he just fought one battle after killing one knight and then goes back while bumblebee somehow speaks after cybertron fell even though he spoke in the first movie?",
    "date": "2025-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 2 hour and 34 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated PG-13 for Language, Intense Sci-Fi Action, Some Innuendo and Violence!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $130,100,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I can't tell what happened to the transformers franchise after Dark side of the moon but it's a huge downgrade. What did i just watch...",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It’s the biggest peace of dogshit",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Listen, im only here for the transformers and the fights. Love the animation and the sounds",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A bunch of ideas on the grill without definition. The best part was the intention to make sci-fi, but the worst was trying to fill screen time",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Probably the Battle of Earth!!",
    "date": "2025-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Rushed. Bayverse reconed itself AGAIN. Every Bayverse movie sucked except for the first one because of that.",
    "date": "2025-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "it's SUUUUUUUUUUUUUCKS",
    "date": "2025-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The movie could have been better (or still bad)if they didn’t have new things appear every scene. Bumblebee being in ww2: confusing and introduced for one scene. Optimus being evil: two scenes. Quintessa: like four of three. This movie would still be boring ether way.",
    "date": "2025-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I saw This film In the cinema in 2017, I absolutely loved every second it of it. It is my 2nd favourite Transformers movie ever. The 2007 film being my favourite, I don’t understand the hate it has received but I guess people will hate anything they want. 100/10 rating from me\nPlease Michael bay continue your transformers films, I really enjoy them!\nI was absolutely thrilled when I saw it on dvd in the shops and bought it immediately!\n\nPlease watch this film you will not regret it!!!",
    "date": "2025-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom.",
    "date": "2025-06-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Definitely the worst film in the franchise, if not one of the worst of all time. The only thing that sustains the hours of film are the visual effects, which unfortunately are not enough.",
    "date": "2025-05-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "the retcon of when bumblebee arrived on earth just makes this one very confusing",
    "date": "2025-05-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "AH QUAL É ESSE FILME FOI LINDO CARAMBA EU QUERO A CONTINUAÇÃO!",
    "date": "2025-05-07"
  }
]