[
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "3.1/10 - Bad acting, very unrealistic writing. I think the only reason I put it this high is because I really like Liam Neeson. The action scenes were done poorly, felt like a low budget movie. In addition, it wasn’t so bad too the point were it makes it more entertaining. Sometimes movies are so bad that they are good. One of the few good things was the plot wasn’t all that bad.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "horrific acting, writing, acting and plot.  worst i have seen in years!  its Macguyver meets Liam’s heir’s need for more money.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "2/10, would recommend.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "OMG - downloaded it to watch whilst on a flight . . . first half hour it’s just about OK but after that it descends into a truly horribly bad film . . bad plot, bad acting, bad script, bad special FX, . . and tries to cover all genres in one go (action, thriller, comedy, romance) - you name it, it’s trying to be it! Please tell me Liam Nealson got paid a shed load  - because that can only be the reason he did this film! I watched until end as a) too late to switch to another film before flight landed; b) it started to get SO bad, it became comically entertaining!",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Major plot holes, and absolutely ludicrous gun play. It reminded me of the A-Team back in the day. 1000's of rounds of ammo and very few casualties. Loved all the characters though.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "i think its possible the director may be blackmailing liam neeson",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Bad script, poor special effects, poor casting, lost of time",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "If you are a dull-minded 14-y old, this might be a decent popcorn movie.  Otherwise, it's a waste of time.  \n\nIt feels like a movie.  It has its moments.  The actors are certainly trying.  But it's senseless cliches, ridiculous violence, impossible situations.  One and another and another.  Which means that, in total, this is drivel.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Awful film!!",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This movie sequel is sooooo bad in every way, and I wouldn't want it any other way.",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The ' critics ' can suck my thingy.  We always knew it wasn't going to win any awards. However it was entertaining for a moment in time. The critics look at everything through the len of awards, letting down the audience.",
    "date": "2025-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Filme:\tMissão Resgate: Vingança\t\t\tAssistido: 20-10-25\nElenco: @liam_neesonn_original @neeson_liam @bingbing_fan @_amelia @_ameliabishop @maheshjadu @sakshannagic\nModelo: #ação #suspense\nDuração: 1h 54m\tAno: 2025\nMinha opinião: Creio que Neeson queria conhecer o Nepal a base do Monte Everest e aproveitou e fez um filme para pagar os custos de sua viagem. É a explicação mais plausivel, de um filme feito nas coxas. Todo artista em o seu auge e depois o declinio. O filme anterio de Missão Resgate (2021) ja deixou a desejar, mas neste conseguiu superar. Um mix de Speed (Keanu) e filmes de montanha. Neeson teve seu irmão morto e cremado pediu para que suas cinzas fossem jogadas no Everest. E assim ele vai e tem uma guia Fan para leva-lo. Na hora que estão indo o onibus é sequestrado para eliminar um aldeião que é contra a construção de uma represa para gerar energia. E assim a quadrilha passa a perseguir o grupo que foge, foge até não conseguir mais. Até que ao final vencem os inimigos, apesar da perda. \nVale apena assistir?: tudo fraco, estória, enredo, cenas de lutas, tiros, efeitos e romance.\nNota: 3",
    "date": "2025-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Not sure why this movie is titled as if it were a sequel. It doesn't seem to have any ties to the first movie.",
    "date": "2025-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very suspenseful. Good character development.  Likeable protagonists and despicable antagonists. Great cast and performances. Action and good storyline.",
    "date": "2025-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It was good with action but it really misses the mark to me I wouldn't be surprised if there is a 3rd though it's kinda how these things go I'm still trying to figure out why it's called vengeance exactly",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It has to be the worst movie of the year. It's surely Neeson worst one.",
    "date": "2025-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This sequel to 2021’s “The Ice Road” sees Liam Neeson return to his role as big rig ice road driver Mike McCann, who travels to Nepal to scatter his late brother’s ashes on Mt. Everest. Soon however, he and his tour guide, who conveniently has prior military experience, find themselves fighting off a gang of mercenaries holding their tour bus hostage.\n\nDespite a few decent action sequences, everything about this film was as forgettable as the original movie, which was actually more exciting than this sequel. There’s no ice roads, there’s no vengeance, lots of cheap CGI, poor visual effects, forgettable characters, ridiculous plot points. I love Liam Neeson, but even he couldn’t save this drag of a movie.\n\nHonestly, skip this movie, you’re not missing anything, you can just thank me for watching it so you don’t have to",
    "date": "2025-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Oh wow, it's been that long since I last saw a Leam Neeson movie, and his iconic line:\n\"If you let my daughter go now, that'll be the end of it. I will not look for you, I will not pursue you. But if you don't, I will look for you, I will find you, and I will kill you\". \nGreat movies and was expecting something with the same caliber.\nThat's why when I saw this one I couldn't think anything but either he needed the money ( which I don't think he does) or he was plain bored and did it just because.\nTerrible writing, terrible plot. Terrible movie. Usual Leam but the terrible acting from the rest of actors don't help him.\nNow, you have nothing to do? Ok, watch it.",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "ICE ROAD: VENGEANCE is an unabashed genre action flick, as the title indicates. Like its 2021 predecessor, this second movie finds a plausible enough premise to get Mike McCann back on the (ice) road, this time in Nepal's Himalayas. The acting is uneven, and the movie often feels formulaic, but it has a great setting and enough momentum to again provide a serviceable weekday action-thriller.",
    "date": "2025-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Sir Liam Neeson never fails to inspire — and Ice Road: Vengeance is a thrilling sequel that surpasses the original. The locations are stunning, the VFX are top-notch, and the action is gripping from start to finish. Straightforward, intense, and packed with adrenaline absolutely loved every minute of it!\n#iceroadvengeance #sirliamneeson",
    "date": "2025-10-11"
  }
]