[
  {
    "user": "Joe Lipsett",
    "rating": 2.5,
    "text": "Despite being frequently absurd and illogical, there’s something pleasurably trashy about Fatale. It is quite watchable and the exploration of race, while frequently verging on stereotypical, expands the scope of the subgenre in intriguing directions.",
    "date": "2023-08-23"
  },
  {
    "user": "M.N. Miller",
    "rating": 2.5,
    "text": "While the result is more engaging than one would expect, make no mistake, Fatale is exactly the type of movie you think it is going in and was made for the ones who enjoy the genre.",
    "date": "2022-09-09"
  },
  {
    "user": "Zoë Rose Bryant",
    "rating": null,
    "text": "Fatale’s story is a not-so-subtle riff on 1987’s Fatal Attraction, but Hilary Swank’s engrossing performance is enough to keep us engaged regardless.",
    "date": null
  },
  {
    "user": "Keith Garlington",
    "rating": null,
    "text": "Even casting a two-time Academy Award winner can’t bring the movie the oomph it needs.",
    "date": null
  },
  {
    "user": "Witney Seibold",
    "rating": null,
    "text": "The film begins with an intriguing twist, and then very quickly peters out. Not even Swank can elevate a goofy stalker flick like this.",
    "date": null
  },
  {
    "user": "Anni Glissman",
    "rating": null,
    "text": "The premise of Fatale relies on harmful stereotypes of mental illness.",
    "date": null
  },
  {
    "user": "Harris Dang",
    "rating": null,
    "text": "Taylor and Loughery have assembled an enjoyable nuts-and-bolts throwback thriller with Fatale. It lacks the prurience of its predecessors but Spinotti's cinematography and Swank's razor-sharp acting take it up a notch to make it a hoot and a half.",
    "date": null
  },
  {
    "user": "Sarah Ward",
    "rating": null,
    "text": "Just ends up recycling tired, simplistic, overused cliches about unhinged women into a monotonous and unnecessarily convoluted package.",
    "date": null
  },
  {
    "user": "Anthony Morris",
    "rating": null,
    "text": "This not-particularly-erotic thriller may have staggered out of the 90s like the last twenty years of television never happened, but if you're on its wavelength there's a lot of fun to be had",
    "date": null
  },
  {
    "user": "Jake Wilson",
    "rating": null,
    "text": "The writing is notably wooden, though the cast is skilled enough this may not register straight away. Once the penny drops, the film becomes a rather fascinating study in all the tricks actors use to bring routine dialogue to life.",
    "date": null
  },
  {
    "user": "Jim Schembri",
    "rating": null,
    "text": "A proficiently directed slice of genre cinema with enough crazy-woman psycho thriller tropes to keep the shebang from ever stalling...Matters are never allowed to get too silly so when the over-the-top moments come they're given the lethal edge they need.",
    "date": null
  },
  {
    "user": "David Bax",
    "rating": null,
    "text": "Fatale's successes and failures lie in Taylor's ability, or inability, to gussy it up and imbue it with his own slick imprint.",
    "date": null
  },
  {
    "user": "Deirdre Molumby",
    "rating": null,
    "text": "Even with the incredible Hilary Swank headlining, this movie is just bad. It's completely predictable, and gets trippier and sillier as the feature progresses.",
    "date": null
  },
  {
    "user": "Sean Mulvihill",
    "rating": null,
    "text": "Fatale just isn't sexy or sleazy enough to be truly captivating. Instead, Fatale basically lives down to its premise as nothing more than a Fatal Attraction knockoff.",
    "date": null
  },
  {
    "user": "Emily Laytham",
    "rating": null,
    "text": "Fatale is not as sleek, sexy or stylish as it bills itself, and the topsy-turvy road of twists it promises feels more like a straight path toward a lukewarm ending.",
    "date": null
  },
  {
    "user": "Mark Meszoros",
    "rating": null,
    "text": "Fatale is kind of silly, a movie to take in while you devour a big bowl of popcorn.",
    "date": null
  },
  {
    "user": "Kathia Woods",
    "rating": null,
    "text": "A guilty Pleasure",
    "date": null
  },
  {
    "user": "Grant Hermanns",
    "rating": null,
    "text": "\"Proves to be one of the best thrillers of its kind in years.\"",
    "date": null
  },
  {
    "user": "Reginald Ponder",
    "rating": null,
    "text": "A Black fatal attraction has been done before but not quite like this. A solid cast, an interracial relationship, a successful Black Business and some twists and turns makes this something you won't see coming but is worth seeing",
    "date": null
  },
  {
    "user": "Korey Coleman",
    "rating": null,
    "text": "Almost to the point of parody...but if you watch this with the right group of friends, it can be fun, perfect for streaming despite the ridiculousness...",
    "date": null
  }
]