[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's a cgi masterpiece, with a rich story, wonderful character development, and it will take you on a rollercoaster ride of emotions! It's unfortunate that we never got the rest of the story! Some critics should be fired for being bad at nowing what's good!",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is not my favorite genre of movie (sci fi), but loved this one. The main character Alita, was so quirky and had a strong determined spirit, which pushed the story forward. Loved Waltz's father figure character in this, it was so wholesome and sweet. The visuals and special effects were cool too.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Our grandson recommended this to us and we were not disappointed.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A sci-fi masterpiece!",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing movie, amazing CGI before the movie industry downfall. Still waiting for the sequel.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I can't believe I didn't know this movie existed until today! It was so good!!!! I really hope they come out with #2",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Salazar is fantastic as Alita. The effects are quite well done and the story  was exciting and pulls you in to root for the feisty Alita.",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved the film, just been kept waiting a very long time for the next installment. \nIt's a spectacle of a sci-fi film that deserves it long awaited sequel. Bring it on.",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One would have to have no heart to not enjoy this film.  With exceptional visual effects and a virtually perfect main character with genuine vulnerability, a heart of gold, an immense power to fight evil and a full character development arc, this film qualifies as one of my top few favorites.  Its strength of heart and emotional power actually brought some tears to my eyes.  It does the early chapters of the original manga justice and shows that live action anime movies CAN work!  My favorite cyberpunk movie, hands down!",
    "date": "2025-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This movie was like Cyberpunk meets Astroboy with great action!",
    "date": "2025-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A near perfect example of an ambition being bigger than budget and capabilities, yet despite this and it's many, many flaws, it's an enjoyable film, though the story is messy and the cgi can't keep up",
    "date": "2025-09-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love Rosa! She made Alita come alive!",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved this movie, and keep hoping for a sequel.",
    "date": "2025-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Alita: Battle Angel (2019)\nGreat Screenplay, Cast and Special Effects\n(11,887 – 13 Jul 2019 / 16 Aug 2025 – by Claudio Carvalho)\nIn 2563, three hundred years after the war \"The Fall\", the mysterious scientist Dr. Dyson Ido (Christoph Waltz) finds part of a female cyborg in a junkyard and brings to his laboratory. He finds that her human brain is amnestic but intact and gives the name of his deceased daughter Alita (Rosa Salazar) to the cyborg. Alita meets on the street Dr. Ido´s ex-wife Chiren (Jennifer Connelly), who is also a scientist that works to the powerful Zapan (Ed Skrein). Then, she befriends the young Hugo (Keean Johnson), who brings cyborg´s parts to Dr. Ido, and learns that both dream on moving to the floating city of Zalem. Hugo teaches Alita how to play Motorball and she learns that the champion of the Motorball Tournament moves to Zalem. Soon Alita discovers that Dr. Ido is a hunter warrior and after finding her cyborg body in a crashed spaceship, she decides to become also a hunter warrior, but Dr. Ido refuses to replace her body. Who was Alita and what is the secret of the cyborg body found by Alita? \n\"Alita: Battle Angel\" is a sci-fi adventure with great screenplay, cast and special effects. The Japanese anime of an amnestic cyborg that finds who she was is engaging to any sci-fi fan. Dr. Ido is a sort of cyborg Dr. Frankenstein, and the direction of Robert Rodriguez is entertaining as usual. The conclusion indicates that there will be a sequel. It seems that the acquisition of Fox by Disney caused the delay of the expected sequel. My vote is eight.  \nTitle (Brazil): \"Alita: Anjo de Combate\" (\"Alita: Battle Angel\")\nMy Blog: https://maniacosporfilme.wordpress.com/",
    "date": "2025-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "THIS SO AWESOME 👍😎 I LOVE THIS MOVIE 🎥 GOOD MOVIE 🤩🤩🤩💯👏👏👏🍿🍿🍿🍿",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Underestimated masterpiece - ABA2 pleeeaaase",
    "date": "2025-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love this movie!  I am a scifi fan going way back.  I hope the the second comes out soon.",
    "date": "2025-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love it so much! Still waiting after all those years for a sequel. Please make it happen!",
    "date": "2025-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Best live action anime ever made on planet earth so far! Very historic film for the world of live action anime. Thank you James Cameron. #AlitaArmy\nSincerely, \nYoutuber \nEnigma Seeker",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The story, effects, directing, and acting was amazing! I NEED a sequel!",
    "date": "2025-07-26"
  }
]