[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Depois de \"Armadilha\" qualquer sequestro/terrorismo em larga escala, estádios e show, parece nos simplórios, mas aqui temos um belo exemplar, com ótimas cenas de lutas, envolvendo dessecações, cozinha com gordura quente, e afins, e aquela dupla improvável, o fortão esperto, e o funcionaria engraçadinho desajeitado, amamos, garante aquela dose minima de humor sacarótico… Boas cenas de ação, uma trama pouco convincente, mas secundaria, pitada de humor, adorável....",
    "date": "2024-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Yeah, it's \"Die Hard\" in a soccer stadium. It is almost comical how many plot points this movie \"borrows\" from the 1988 classic, all it's missing is having it take place during Christmas. But, in all honesty, it isn't a bad thing to be like \"Die Hard\".\n\nDave Bautista plays our John McClain for the film, and he does a good job. Bautista is a wrestler who has actually put in the work to become a believable actor. There are emotional beats in this film that he delivers very well. And the movie understands that in order for the story to work, our protagonist has to be vulnerable. And they do a good job of making Bautista feel like he is on the backfoot for the majority of the film.\n\nIf only the film could have rip offed the same sort of tight story telling. Great action choreography and top notch directing of \"Die Hard\".",
    "date": "2024-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Thanks to a game cast and all-star direction, Final Score is a far better time than it has any right to be. It's unapologetically loud, lowbrow, crass, and routine, but what it isn't is self-conscious, which makes the familiar proceedings nothing short of endearing.",
    "date": "2023-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A really well made (for it's budget) piece of Hollywood brought to East London and a movie that probably pleased the West Ham owners better than the ‘Green Street' one did. \n\nLooks more expensive than it's 20million budget and the cast throws themselves into every scene. The story has as many holes as any single hero Hollywood movie, so it's best enjoyed with all sense of realism switched off.\n\nGains points for the starring role of the now defunct Boleyn Stadium that was at Upton Park. Worth a watch if a bout of escapism is required.",
    "date": "2023-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It's crap, but enjoyable crap.",
    "date": "2023-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Der amerikanische Soldat Michael Knox (Dave Bautista) besucht die Tochter seines verstorbenen Kameraden in London und geht mit ihr zu dem Fußballspiel West Ham United gegen Dynamo aus Russland. Arkady Belav (Ray Stevenson) hält das ganze Stadion als Geisel, um seinen für totgeglaubten Bruder Dimitri Belav (Pierce Brosnan) zu bekommen, um die Revolution für die Freiheit von Sakovya wieder zu starten. Michael versucht dies zu verhindern und seine Nichte zu retten.\n\nFinal Score ist ein typischer Actionfilm der sich nichts neues traut und seine Idee von der Kulisse eines Fußballstadions nicht zu nutzen weiß. Dave Baustista ist als Hauptcharakter gut ausgewählt worden und passt gut als Held in einen Actionfilm rein. Pierce Brosnan hat nichts zu tun, bis auf eine Motivationsrede, die zwar ganz interessant ist, aber die Motivation irgendwie nicht richtig erfasst. Wenn man ihn ansieht, guckt er nur in die Luft und redet nicht viel, obwohl man denkt, dass er mehr zu tun hat durch die Filmposter. Der Bösewicht, gespielt von Ray Stevenson ist der Klischee-Bösewicht und verhält sich wie die anderen Bösewicht unlogisch. So erschießen Sie unschuldige Leute, aber die Nichte von Michael nehme sie nur als Geisel und tun ihr eigentlich nichts an. Generell wird die Kulisse gar nicht genutzt und wenn richtig unlogisch. So gibt es eine Verfolgungsjagd mit Motorrädern innerhalb der Stadiondächer, wo auch Kampfszenen stattfinden. Die Kampfszenen sind sehr stark geschnitten und am Anfang mit wackliger Kameraführung kaum anzuschauen. Die Computereffekte sind sehr schlecht gemacht, man sieht, dass einige Szenen nicht im Fußballstadion gedreht wurden, sondern vor Greenscreen. Anfangs war der Film noch unterhaltsam und die beste Kampfszene war in der Küche, wo Michael leiden musste, um jemanden zu töten. Am Ende ist Final Score ein Film mit einer Kulisse, die auch auf einem Hochhaus oder anderen Kulisse stattfinden hätte können. Der Film hat viele Logiklöcher, die im Actionfilm zwar oft zu finden sind und nicht immer stören, aber in diesem schon, da man das Potenzial nicht erreichen kann. Am Ende denkt man, dass der Film wenigstens Konsequenzen hat, aber dies ist aber nicht der Fall.\n\n\n6/10",
    "date": "2023-06-14"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A decent mind numbing action flick that could have been a lot better if the third act didn't get more over the top then it needed it to.",
    "date": "2022-12-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "2.5 stars. Basically same concept as Die Hard but at a soccer game and without the great one liners of Bruce Willis. Also, Dave Bautista sucks at fighting in this movie, the opposite of his character in See.",
    "date": "2022-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A thrilling action film with high stakes and good acting",
    "date": "2022-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I like Dave, he's made some interesting choices; this wasn't one of them. Every cliche in the book in this one...that's not on him though. I'd like to see more like I Spy or Stuber from him.",
    "date": "2022-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Good action & story overall with this cast in a soccer stadium, but I find it a little bit hard to believe that nobody noticed everything happening until the end of the match.",
    "date": "2022-03-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "me gusto bastante la pelicula 8/10",
    "date": "2021-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Regular action movie, with very little to add, but maybe the scenario",
    "date": "2021-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Bit predictable at times but enjoyable overall.",
    "date": "2021-03-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I'm not into football or football related films usually but this is a pure action film. On the go constantly somik happening. So wen u start don't leave your seat as u may miss somik good.",
    "date": "2021-03-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Final Score is a knock off of Die Hard and Sudden Death staring Dave Bautista who acts as a former special forces soldier who takes his niece to the final soccer match of the year not knowing a group of Ukrainian terrorists are trying to take over the stadium. The terrorist group is headed by Ray Stevenson who finds out his own brother (Pierce Brosnan) who was not really dead but rather put in a witness protection plan. Unlike Die Hard where Hans was trying to steal bonds and gold, this one was trying to bring his brother back into the fold and on the same level as Sudden Death with Jean-Claude when the final stoppage of play the arena would literally blow up. The story was filled with action that was believable but it was worth to watch once.",
    "date": "2021-02-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Go into this one with low expectations. There are more than enough over-the-top action scenes and strange moments for football fans (Tony Cottee from Sky Sports showing up, for instance) to make this one enjoyable. Sometimes there is nothing wrong with the totally brainless. Pierce Brosnan's insanely phoned-in performance as a Russian on the run is hilarious in and of itself. Overall, I would recommend it.",
    "date": "2021-01-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Cool story horrible acting . This guy should stick to wrestling...",
    "date": "2020-12-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It definitely rips off Die Hard & Under Siege 2, but its still fun, and Dave Bautista is a solid action star.",
    "date": "2020-09-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Bautista is quickly becoming one of my favorite action movie stars. Much like Stallone's films, his movies are fast paced and keep you on the edge of your seat. This story is so quick, you blink and you'll miss an important component of the plot. Absolutely loved it. And the guy that worked at the soccer/football game almost stole the show. He was hilarious and quirky and had so many epic one-liners. This is a must see, and in fact, it's a movie I will definitely watch more than once. If you like action-packed thrills with some humor perfectly thrown in, you'll like Final Score. You will not be bored for a second.",
    "date": "2020-09-10"
  }
]