[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It was a great and emotional story. However, Sofia Carson is a bad actress and I just couldn't get past that. She made it cringe and unwatchable, even though I did adore Corey's performance.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Boring. That’s literally the only thing to say about this film. Is so plain and unflavored that is simply wonderfully boring",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I note that many reviewers have dismissed this film as contrived, formulaic and lacking a believable story line. What they have seem to have forgotten is that this is a rom com tinged with tragedy - why would you expect it to be believable. That is not the point!\n\nI thought the film was well written and the script smart with some good messages for those of us willing to listen.\n\nAll I can assume is that a lot of reviewers are so jaded and world weary that they cannot enjoy a good romantic story when it is put in front of them which is a shame.\n\nThe locations definitely helped and the Oxford backgrounds provided a romantic backdrop against which the story unfolds.\n\nFor me this was a good, entertaining watch with a good cast and engaging leads. What's not to like? Quite a lot if you are a film critic with no sense of romance or place or time. For the rest of us I can recommend this delightful film which I thoroughly enjoyed.",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "its a sad story. but the strory line is nice. it reminds us to follow our passion and live and the enjoy the mess and the fun.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The movie could've been more realistic about the reality of cancer and it's effects on your body. Other than that one detail, I really enjoyed the film with a sad ending. I've watched it repeatedly & the movie has a great soundtrack.",
    "date": "2025-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "So emotional, didn't expect this...",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Unbelievably poor film with very lazy writing and so many cliches it is painful. The writing being done by someone who clearly isn't from the UK really shows when someone uses, apparently without irony, 'the dogs bollocks' as well as the constant mention of crumpets, something most people don't often eat. And to cap it off it has a horribly depressing ending. Not something I'd recommend.",
    "date": "2025-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "J’ai trouvé quelque chose de très touchant dans l’acteur principal et son combat est très poignant. C’est une histoire d’amour qui change un peu car elle est vouée à une fin prématurée ce qui n’empêche pas d’être vécue à 100%. Par contre, ce n’est pas le meilleur film romantique que j’ai vu dans ma vie.",
    "date": "2025-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This film is actually so bad it’s laughable. I can not take any of the actors seriously. I made it 15 minutes in (I wanted to stop watching before, but told myself to keep trying). You can physically SEE them acting so hard instead of embodying their roles. Do not waste your time with this childish garbage.",
    "date": "2025-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Netflix has great romantic movies!  Great look and great performances",
    "date": "2025-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I really like this movie even though it has a sad ending.  I love poetry, seeing the English countryside. The two love interest have chemistry.  I enjoyed it but wished it was written with a better ending.  Perhaps the thought of the script was to show respect for ones wishes.",
    "date": "2025-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It’s a little slow and starts off ok but it starts to fall into cringe territory after their date and I couldn’t even finish it…and I watch cheesy anime romances. Smh",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "After a very long time i saw a good romantic movie.",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing movie! plot twist at the end!",
    "date": "2025-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Movie dragged on quite a bit. I couldn't even finish it because it was that boring. Or maybe it was just Sofia Carson's monotoned voice that zoned me all the way out.",
    "date": "2025-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "When I first stalled this movie, I thought it was a typical love story that I've seen a million times before. When I got into the movie, I realized with the setting, being in Oxford being in England and the real believable cast sporting cast along with the beautiful actress. Sophia Carson, I was immediately sold on this film. I think you will enjoy this love story.",
    "date": "2025-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I enjoyed this movie quite a bit. I laughed, and I cried, but it was overall a good watch.",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Should have let my partner watch it when I was out of the house.\n\nHonestly, a pretty painful watch and an unfortunate look at the poshy lifestyle of those living in Oxford - a poor representation of the rest of Britain. Oh, but it makes sure to try to get our stereotypes done quickly - getting splashed from puddles, fish & chips where the American can't understand the english language, and a kebab after a night of drinking.\nThe overall storyline is guessable within the first five-ten minutes, new college girl from America falls in love with her Poetry Professor and has a quick over-the-top romance. I am writing this after an awful 40 minutes watched.",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The only reason I watched it all the way through is because I was still mourning finishing the book. I was so absolutely appalled at how much worse the movie was (you always expect this but it was SO much worse) that I had to look it up. Netflix says the movie is based on the book but I also read that the book is based on the screenplay, which makes more sense. Regardless, don’t watch the movie.",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "incredibly boring its just another badly written movie that trys to hit all the plot points without any real substance. we just hop right into this over the top romance that happend in a day and you cant care about the characters. no real substance",
    "date": "2025-09-03"
  }
]