[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "NOT true to the book. So very much wrong with this movie. Why waste their time?",
    "date": "2025-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "An adventure survival drama based on Daniel Defoe’s 1719 novel of the same name, set in 1703, in which Crusoe departs Scotland for a year but, after months at sea, a violent storm wrecks his ship. He becomes the sole survivor, stranded on a desolate island.\nWhile it is undeniably a product of its time—reflecting outdated notions of white superiority that have not aged well—it still offers moments of nostalgic entertainment. Pierce Brosnan is far from his finest here, and the film takes significant liberties with the source material. Yet, despite its flaws, it served as an enjoyable reminder of the novel I read two decades ago. Unfortunately, the ending diverges sharply from the original story, which somewhat diminished the overall impact for me.",
    "date": "2025-05-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Robinson Crusoe still alive, the story of our lives. Sometimes our ship lost and we need to improve and start by the beginning a couple of times. \n\nClassic movie, but eternal masterpiece",
    "date": "2025-04-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "An absolute classic severely underrated masterpiece.",
    "date": "2024-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Ok version of the often told tale.",
    "date": "2023-02-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The dog was ugly and so was Friday. I would have hung myself.",
    "date": "2019-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie adaptation of a three century old story completely deviates from its source material by favoring bad writing, acting and many clichés.",
    "date": "2018-04-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I watched this movie with moderately acceptable interest for the first hour. It has a kind of TV movie stink to it, but it's not horrible. Bland, yes; white savior-y, yes (but that might be from the source material which I've never read). Pierce Brosnan's beard changes constantly. On the ship before the boat crashes he has a kind of goatee and stache thing going, but no cheek hair, but after the crash he grows a full beard. Also he wakes up face down in the water. Fuck's up with that? Also his Jesus speech was a bit overcooked, and overall he's not entirely convincing. But still, it's okay, Maybe my opinion of the film is heightened because I'm comfortably relaxing in a Korean hotel, sitting on the heated toilet seat, receiving an incredibly satisfying bidet/enema from the toilet, which, all things considered, could make any film acceptable no matter how uninspiring it truly is.",
    "date": "2015-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Just watch Cast Away",
    "date": "2015-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "DVD version runs 90 minutes, opposed to the original 105. Watching the movie I am sure the extra 15 minutes would have helped. The Film seems unfinished somehow, with many pivotal moments missing. It never lives up to its potential, but there are signs of a good film in there, unfortunately they didn't \"bring it\" for this one.",
    "date": "2014-03-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Just love these desert island films - friday or wilson?",
    "date": "2014-02-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "quite disappointing pierce rendition of the classic. friday wasn't impressive either. weak direction in general. probably someone's graduation project",
    "date": "2014-01-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This is one of the few films I disagree with critics on. A very worthwhile and rather heartfealt movie with some flaws.",
    "date": "2014-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Very unfaithful to the original book, and much the worse for it.  Also a very inept and stupid movie in its own right.  Don't bother.",
    "date": "2013-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "La película hace por completo aun lado toda la historia de robinson y ni aun  la actuación de pierce brosnan logra salvar la película",
    "date": "2013-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I rather enjoyed this movie... Makes me want to read the book again.  I bet it's been 25 years since I read it.",
    "date": "2013-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "very good movie. i love movies that deal with the absence of mankind rather than being overwhelmed by it.",
    "date": "2012-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A bit different kind of version of Robinson Crusoe.",
    "date": "2012-06-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "An older style of an adventure movie. The story itself was ok. The acting was definitely aged, yesterdays drama style. Average all the way around.",
    "date": "2012-05-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The movie never takes a moment to slow down and explore its surroundings but the relationship between Crusoe and Friday works.",
    "date": "2012-04-17"
  }
]