[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I have no idea what these entitled critics saw but i loved this movie and it left ya with feels at the end. Really good suspense in my eyes. No idea what cliches 1 guy saw and the detroit critic just sounds like he'd be a bore to hang out with. 🤦🏻 Oye!!! 😁",
    "date": "2025-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Critics too harsh.  Cage delivers a tempered performance and Benjamin B. makes the most of his role.  They are enjoyable to watch on screen together.   The character Dragon was sub par, but the reveals toward the end made it interesting and the suspense gradually built to a satisfying climax in the third act.",
    "date": "2025-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Genuinely just a bad movie. The dialogue is cringeworthy and the acting is comically over the top and amateurish. The story itself feels like the writer gave up halfway through and then said \"what if mental illness?\" and the ending just leaves a bad taste in your mouth. Your time would be better spent looking for something else to watch then to sit through this.",
    "date": "2025-02-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "That poster makes it look way more crazy that it actually is, I gotta say.\n\n'A Score to Settle' isn't one I'd personally recommend. It does attempt to portray some interesting things with the lead character, though all in all it is quite meekly done and doesn't quite come out right; in my opinion, of course. Nicolas Cage is at least a good screen presence, naturally. He is the only plus point I have for this film.\n\nThe rest of the cast aren't the best, they are all rather disappointing in fact - no-one behind Cage sticks in my memory. The biggest negative I have for this movie, though, is the lack of entertainment. For an \"action thriller\" built on a revenge storyline, barely anything happens until the very end - and even then, it's quite underwhelming.\n\nThere are far better productions from this genre and from this lead actor out there, no doubt about it.",
    "date": "2024-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Not the best film Cage has been in, not remotely.  It's not really his fault, he played his role well.  Movie just wasn't great.",
    "date": "2024-05-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This one isn't worth the watch. He's supposed to be a tough guy gangster out for revenge? What a joke!!!! The character is weak!!! If someone killed my child while I was doing time for them the first thing I do is kill their kid and then them. No bs talking. Just plain revenge! Don't waste your time",
    "date": "2023-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Cage has been in a LOT of movies.  Some are bound to be bad.  This is one of them.  I could only take so much of him stumbling around pretending to be dying.",
    "date": "2023-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I am a big Nicolas Cage fan, but even he could not save this movie from itself. The movie is poorly written, plagued by bad acting, has a very tired/used-up concept and plot, and developed at a slow pace. The only positive thing in this movie was a major and clever plot twist in the second half. That twist changed the whole perspective on what was going on. I thought it was pretty smart. That's the only good thing I will remember from the movie. Also, to be fair, the movie became more interesting and the tempo picked up in the last 20 minutes. Overall though, it's a forgettable movie. But, if you're a big Nicolas Cage fan like myself, you might find this movie to be watchable. If you're not a big Nicolas Cage fan, I would skip this movie altogether because you'll be very disappointed. I can almost guarantee it.",
    "date": "2023-02-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "What a waste. You wonder why Netflix is dying? Movies like this sewage, with big name stars and sucky scripts with no substance. The shame of it is that the money spent on this pointless pile of poo could have been used to make something entertaining.",
    "date": "2022-04-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is no national treasure. Terrible movie",
    "date": "2022-04-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "For a lower budget movie, it's really very good.  Some great writing and acting.  I recommend it.",
    "date": "2021-01-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I didn't realize his son was dead until half a movie was played. A strange movie",
    "date": "2020-12-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A more somber entry from the “revenge” section of the Cage filmography. The twist is predictable, but the film as a whole is watchable. Cage could’ve gone “full Cage” as someone suffering from fatal insomnia, but opts for a more grounded performance.",
    "date": "2020-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Now this was pretty bad, but I was prepared for way worse. Honestly if we could have increased the factor of crime a little, and decreased the factor of truly terrible music a lot, A Score to Settle might have full-on crossed the line into being actually good.",
    "date": "2020-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Was low key really good. Never sure what you're going to get with Nick Cage, but this one is pretty good.",
    "date": "2020-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Really enjoyed it. Great acting from cage. Some support actors were a little subpar but the plot twists were great and moving. I dont understand the horrible reviews.",
    "date": "2020-05-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Terrible, absolutely no action at all. This is a drama with no plot and awful dialog -10/10 we stopped watching after 39:56",
    "date": "2020-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Bad story that was poorly shown, acting was meh including Nicholas cage. Not worth the time.",
    "date": "2020-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "WTAF! Just don't bother. Absolute trash. Nicolas Cage is band in my house as of tonight.",
    "date": "2020-05-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This movie was surprising. I was stunned by the relationship with his son. That doesn't  happen very often so it was certainly worth the time to watch it.",
    "date": "2020-05-03"
  }
]