[
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It has the potential for a clever idea with the money and all like a Billy Wilder type comedy but it falls victim to unfunny gags and when it does try to be serious it just becomes cliche and does all the tropes you'd expect. The editing and pacing aren't good. The opening just bounces aorund very sloppy between the two and once they get married stuff just happens and 90% is flat or unfunny. Than once it starts being serious and actual development happens it's just standard stuff, very predictable, and nothing done particulary good. The second half is strongerbut only because it gets more focused and the bar is pretty low. Everything else is ok at best. The two leads got some decent chemistry but are weighed down by the unfunny material and basic direction. It's a pretty typical 00's romcom for better or for worse. Diaz is defintely the stronger of the two for sure. Ferina's not bad and probably the best thing acting wise for what it's worth. But still skip it.",
    "date": "2025-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Enjoyed it so much very fascinating!",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "70/100- cute little romcom. is exactly what you expect.",
    "date": "2024-12-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Two of the worst actors in Hokeywood teamed together. Neither can act, has any charm, or talent.",
    "date": "2024-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The category in \"Final Jeopardy!\" is Box Office Bombs and the question is \"how do you make Cameron Diaz as unlikeable as possible?\"\nThe answer is: you pair her with the king of douchebags, Ashton Kutcher.",
    "date": "2024-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of my favourite rom-coms of all time. Definitely doesn't deserve the hate it gets.",
    "date": "2024-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A 5-star romantic comedy! Joy McNally (Cameron Diaz) and Jack Fuller Jr. (Ashton Kutcher) meet in Vegas where they accidentally married. And because he got a USD 3,000,000 jackpot with her quarter, the judge decided that they must give a 6-month trial to their marriage before divorcing and deciding who gets the money. What follows is a comedy with games and traps, which they settle for each other to get the divorce and to keep the entire sum of money. It's a journey in which they learn about each other and themselves. Still, they get a divorce. But then... I let you discover what happens next. Don't miss a great laugh! Enjoy the movie!\n\nP.S. Those of you, who gave 1-star to this comedy (and to other movies), would you PLEASE TRY to be a little bit more ENCOURAGING with people watching movies and, in this case, have a great laugh, rather than discourage them from enjoying some quality time. THANK YOU!",
    "date": "2024-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Very underrated imo, a lot funnier than most comedies these days.",
    "date": "2024-03-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A perfect movie to put on for a date to not watch so you can do other things. Easy ice-breaker any night; \"Hey what do you want to do tonight?\" ; ; \" Wanna watch What happens in Vegas? \" WINK WINK",
    "date": "2024-02-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "somewhat normal romcom, not amazing but i did enjoy it.",
    "date": "2024-01-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Good concept, very funny, well acted.  Don't understand how this is at a 25 and 30 % scores.",
    "date": "2023-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Classic Rom-Com to spend your night with just popcorn and PJs.",
    "date": "2023-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "When an episode of designing women  from the 80s early 90s dose a vegas episode in 25 muinets better you have issues, although granted in the latter years story lines crossed over. Notice how I didn't mention the movie. I like the stars there sweet people in real just terrible actors.",
    "date": "2023-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I'm back! And I'm reviewing `What Happens In Vegas - 2008`. And for me this movie doesn't make sense. You get drunk,you \"get married\" and then they sleep together. But it's a drunk night stand and it shouldn't have even counted as a real marriage. And then,they win the lottery and HAVE to stay together for half of the money. Like bruh,if I was one of them I'd have gone. I ain't being married to you. I'll take all the money and what you gonna do about it? Arrest me? I don't think so.",
    "date": "2023-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "What Happens in Vegas is a perfect \"turn on in the background, laugh at the bits but not focus on the plot\" types of movies. On the surface, I think that this film is hilarious. Ashton Kutcher and Cameron Diaz dive fully into their roles and there is decent chemistry between them. There are funny snippets throughout that are incredibly memorable and quotable (\"You know why!\"). The plot itself is forced and the goofy score makes dramatic moments come across as silly. That being said, there are still laugh-out-loud moments and I would be happy to see that it's playing on a cruise, plane or car ride.\n\nIt also contains arguably one of the best mid-credits scenes in cinema!",
    "date": "2023-05-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Funny, stupid plot with lodgic problems all over. Watchable laughs. Good afternoon movie.",
    "date": "2023-04-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Ok but completely forgettable.",
    "date": "2022-12-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "What Happens in Vegas barley has any laughs and relies on a predictable redundancy factor in the rom-com genre. But with serviceable acting performances from Cameron Diaz and Ashton Kutcher as well as decent costume designs, What Happens in Vegas is an adequate at best film especially if you're a fan of the romantic comedy genre.",
    "date": "2022-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A standard romantic comedy (complete with obligatory ending chase scene), but the reason it gets the extra half a star is because of some hilarious moments and one-liners with Ashton Kutcher. Not a great movie, but a fun one to watch.",
    "date": "2022-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Filme legal pra caralho, o roteiro é legal, gostei da história do filme, e gostei também muito das cenas do filme, e ficou muito bom a química na cenas entre a Cameron Diaz e o Ashton Kutcher, no final os dois ficam juntos com os 3 milhões de dólares, com tudo isso, eu recomendo esse filme vale a pena assistir.",
    "date": "2022-08-17"
  }
]