[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "After suffering from the whole series, I was ecstatic that it was finally over. Twilight was okay, the following films were god-awful, Breaking Dawn Part 1 was just watching Bella have a baby. But here we are at the end. \nThis one was much better story-wise. There are a few twists and enough action to keep one going. Bella is a vampire mother now. She was a boring, no-personality human, but as a vampire, she's pretty bad-ass. Having a child to fight for and protect gives her more depth, and her acting here is so much better than the first film. \nIt's cheesy, campy, (and a tad creepy when we learn what little Renesme's future holds). And it's not a great film, at all. But it is leaps and bounds better than the three that came before it.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Having seen this movie I can't say that it is terrible, but it is not good either. It's rather dull. I never read the books but I have seen the entire saga in cinema, although I am not a fan. I wanted to make review for the entire movie series but to be honest, I don't remember what happened before. This movie suffers from lack of excitement. I don't know why, but there is not a single exciting scene in this movie. The actors have managed not to show any real emotion and everything they say sounds hollow, like ordinary script-reading. We have some bad guys in black who could have been frightening for what they represent but they are also boring. But for me, the main problem in this movie (and the rest of saga) is the image of vampires. There are many, many stories about vampires and, of course, there has been some alterations regarding their powers. Some turn into bats, some not. Some are sexy, some frightening, some both. Some have mind-control power. Some are killed with wooden stakes or holy water or whatever. But they are Always nocturnal creatures.\n\nThey are afraid of the sun and die from it. In this version we have vampires who glitter in the sun without dying. But whatever. It is a young adults fantasy and the main goal has been achieved: the books and the movies earned money. And the movie itself has been nominated for Golden Raspberry Award 2012 in 11 categories, which also means something. So, watch this movie and the rest of the saga if you are a fan, a movie critic or a filmoholic (or film-addict).",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It’s Breaking Dawn!!!! Be serious! The best!!!",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love this movie!! Such a great ending!",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A classic that will always be one of my favorites!!!!",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Such a good movie! Loved all the action and twist and turns from the book.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "You have to watch from the beginning, but the data draws you in. You want to help Bella. You want to help Edward.  You want to be a Cullen for their family loyslty and devotion. There are too many draws in it for me, I can't name them all.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "ABSOLUTELY LOVED!!!! I hope they play this movie again sometime soon !!",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Thank you for bringing twilight back to theatres !! Enjoyed seeing the “big fight” on a big screen. Wish I could see the whole series all over again.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Like no time has passed",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was wonderful getting to see this in theaters again!! 😭💖",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Was even better the ten thousandth time. So amazing to see it in theaters again after all of these years.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Seeing it in theaters made it feel like seeing it again for the first time. Nostalgic. 10/10",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Watched it with my daughter, we both loved it!",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it. Never got to see all 5 movies when they came out and glad this happened again in theaters so I could experience it and in great seats. Definitely crossed this off my bucket list. Glad this happened again in theaters again.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Really good, most entertaining out of the series.",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1 hour and 55 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Ages 13 and older!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The worldwide gross is $849,413,897.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Cool end fight",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "On part with Eclipse, it's a good ending for the franchise but it takes forever to end. Also, that opening credits? 🙄",
    "date": "2025-07-16"
  }
]