[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Awesome Christmas movie - great classic to watch every year.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "a go movie! watch this movie back in kindergarten, oh man I miss them days...:(",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is LITERALLY THE BEST CHRISTMAS MOVIE OF ALL TIME! You have to watch it if you haven’t seen it. It has a great story, amazing actors and characters, and really funny parts at times. The traps are well thought up and clever, as well as funny and diverse. Even if you think this movie is for kids, just try it. It is literally my favorite movie of all time. The score on rotten tomatoes is for some reason kind of mid. This movie deserves a 100% all the way. You can’t  go wrong with this movie! Merry Christmas!",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The BEST! A Christmas MUST watch film!",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Must watch it. A classic movie and very good laughs for all ages",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The movie is really good! I love it and watch it every year at Christmas. One of the best comedies I've ever seen! Every time it's funny to see how Kevin behaves when he's \"home alone\".",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A classic. Full of nostalgia for those that grew up with it, and yet the premise, the story and the humour still holds strong today. Excellent lead by Macauley Culkin, with an incredible supporting cast.\n\nA must see for all the family, or as a throw back to days gone by.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A Christmas classic! One of my favorite movies! 10 out 10 recommend it",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best Christmas movies ever. It captures a beautiful kind of humor that comes straight from what it feels like to be a kid—full of imagination, mischief, and innocence.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best Christmas movies ever made",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This has to be one of the best christmas movies there is! So enjoyable and so funny. Really enjoyable for families to watch together and if you don't watch this movie you're missing out.",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This, and national lampoons Christmas vacation are the most classic, and the most enjoyable, and the most funny Christmas movies of all time",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "enjoyable for sure-great Christmas classic",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This film is really good. I kind of feel like the whole plot of it is amazing a classic Christmas movie for the holidays.",
    "date": "2025-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best movie hands-down",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Cachos, So Fire, Night Like, and you should anybody to watch",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Favorite holiday film. Nothing beats it.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This film is awesome I love watching it every year the cast was great in it even Joe pesci and Daniel stern",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Home Alone is one of those classic movies that you want to keep watching over and over again. It’s funny, has lots of slapstick, and is one of the best holiday movies ever made.",
    "date": "2025-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best holiday movies ever made. Iconic movie for everyone, every family has definitely watches this movie.",
    "date": "2025-10-10"
  }
]