[
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The worst chapeter, boring, stupid and patetic",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is the first of the serie in which I can't find anything nice in it.. the story goes too much out of characters, bringing back Mia without Brian(of course) contraddicts all shown in previous movies. Story becomes more absurd than this anyway, without spoiling anything.\nIn addition, compared to the previous movies, there is too much computer graphics. Scenes become surrealistics breaking any inch of reality left in the actions. Worst movie of the saga.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Love the fast and furious",
    "date": "2025-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It isnt my favourtie movie from this franchise because it isnt really about cars annymore. Dom Toretto is like a super soldier from a marvel movie.",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Kinda bonkers, but in the end, all it ever needed was (yes I’m going to say it) FAMILY.",
    "date": "2025-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This is great. I will definitely watch them all but they get good after five.",
    "date": "2025-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Not my favourite of the F&F saga but still gets the blood bumping and engine revving. The space scene was daft but the reintroduction of Mia and Han (spoiler) was a genuine surprise. John Cena the strongest villain of the whole series.",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was a pretty awesome movie!🔥🔥",
    "date": "2025-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The Movie is fun but just okay, I hate that they went to space tho",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The story brings good background but it also shows how real family is important",
    "date": "2025-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Who needs logic when you’ve got family?",
    "date": "2025-05-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Successful action movie franchise in 2 hours and 25 minutes!!!!!!!!!!!!!!!! The USA grossed over $173,000,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "They pick the wrong side of the Road! Why they keep bringing death character's alive going into space it doesn't make Sense!",
    "date": "2025-05-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Totally unbelievable-more than normal. But it’s always a cult favorite.",
    "date": "2025-05-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely love the series but it seems to be dragging along",
    "date": "2025-02-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing, It's The Reason why i'm into the fast and furious movies to this day. Fun fact. I watched the 9th one when the 10th One was released a month before. during June 2023",
    "date": "2025-02-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "As someone that grew up watching all the fast abd furious movies from day one, I've always refused to watch anything after fast 8. I've waited until now to watch this and honestly, i wish i never bothered.\nI don't know how they managed it, but it's the first time the cast has felt like they have no connection at all, like a pile of strangers trying to act like friends. They've ruined the entire franchise with this movie on it's own.\nIf you're like me and still haven't watched this, don't bother, i wish i could back in time and be able to say that again. Disgrace.",
    "date": "2025-02-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The one where the Fast Crew went to space. I don’t think I really have much to say about this film other than it was just severely mediocre and one of the lesser Fast and Furious films. John Cena, who should have been a high point, felt wasted and shoved into the plot in some way so they could tell another Dom story. The characters seem to be running in circles like usual and they explain Han’s return in the dumbest way possible with an unclear plot hole. The movie just feels very dull and you can tell that they are slowly fading out with Paul Walker’s now-absence, relying on telling Brian’s story in odd, backward ways as to not bring his character in, but keep his character and family relevant still. It wasn’t anything fantastic, but I wouldn’t say it was horrible to watch. I found it boring, a little tedious, and just not at all what it should or could have been.",
    "date": "2025-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "If you knock the movie for being overboard and completely ridiculous, then you have not been watching the previous movies. Lots of action, lots of great cars, and yes… they put a damn car in space lol. Gotta love ‘em for it.",
    "date": "2025-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "F9 The Fast Saga - 4/10. Justin Lin returns to the directing chair for yet another one of The Fast And The Furious instalments. Though the previous films in the series seemed to have understood their ability in making the outrageous expansion in story into some fun watches, this film looks like the start of the end for the series. The movie just seems like a story they had to tell before they do the inevitable 2 part finale to the franchise. When the long lost brother of Dominic Toretto comes back to fray to help with a world ending plan, the Fast family must do what it takes to help stop the plot from happening. With ridiculous set pieces, cheesy dialogues, and a long lost brother plot which gets predictable super fast, F9 offers nothing new in general for fans of the series and regular movie goers. The problem the series is getting to at this point is that the whole racing element of the franchise is mute, and is substituted with grand ambitions. What started as a franchise based around street racing, the movies are revolving around these rogue characters who are in these crazy action sequences. The film goes above and beyond (literally and metaphorically) in this movie to show that they just want to make these huge action set pieces. But theres no thrill or shock value. Everything just sort of happens. The acting in this instalment feels super hammy, and the writing just doesn't hit the mark. My main question is: if the main character had a brother that was this huge force to end up fighting with him, where was he all this time? Why did it take 9 movies to finally get to that point? However, there are some few high points in the film. When Tyrese Gibson's character notes that they seem to always leave every incident for all these movies with no scratches, it supposed to be played up as a dumb ass remark. But honestly, its probably the only time in the movie where the ridiculousness actually is brought to question in a meta way, and it could have lead to a really great way of creating a more meta film that understood its ridiculousness level that its trying to achieve. Unfortunately, we are left with a movie with some decent action that is trying to be super serious.",
    "date": "2024-12-28"
  }
]