[
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Jill Wagner looks much older than her partner Nick Bateman. Despite she was only 43 acting in 2022 ,and he was 35 ,  she looks more like his mother than a partner. Couldn’t watch to the end … sorry … wrong actress for the role ! Hard to watch !",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A very heartwarming film   enjoyable",
    "date": "2024-12-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The performances were flat, the dialogue stilted. The pacing was painfully slow.\n\nThe plot is your standard Hallmarkesque holiday romcom boilerplate; with a collection of familiar, reliable, veteran actors; and yet the movie lacks that Hallmark ‘spark’.\n\nWith dozens of Christmas movies running on two channels nearly 24/7, there are better ones to spend two hours on.",
    "date": "2024-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was a really cute movie with good performances from all the actors. Growing up is hard to do for all of us, but love seems to always show us the way. For some it's moving in to a different place for others it's taking on responsibilities and loving someone else... Be grateful and thankful for all the blessings life gives us is the true essence of this little film 🤍",
    "date": "2023-12-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The Whitney character must be at least mid forties in real life so I found this very distracting as Daisy's dad looks much younger, and the story says she wasn't ready to get married; that aside this festive film is nothing different from the usual romantic feel good Christmas movie. A predictable plot and a poor acting performance from the main characters will have you nodding off half way through should you have a little too much Eggnog!",
    "date": "2022-12-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "As far as the genre goes, this is very good. Jill Wagner shines. She is cheerful and full of energy. Most of the rest of the cast are fun as well. Unfortunately, the leading man is practically sleep walking through the movie. Jill Wagner just runs circles around this guy. He's like the enemy vampire in \"What We Do in the Shadows \"",
    "date": "2022-11-09"
  }
]