[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This is like a less chemistry filled and more comedic version of Ghost. And now I know where they got the idea for Soul",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Just Like Heaven has a pair of likable leads, but even they can't give it a heartbeat in the face of schmaltzy romcom antics.",
    "date": "2025-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Excellent movie! Big improvement on the standard rom-com plot.",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Filme bacaninha, o roteiro é mais ou menos, as cenas são bacaninhas, a história é mais ou menos, o elenco é bacaninha, e poucos ajudam a melhorar o filme, os personagens são bacaninhas, e o filme deveria ter cenas bem melhores e relevantes.",
    "date": "2025-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A really good romantic comedy. Loved it!",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "IT'S SWEEEEEEEEEEEEET! Shame stuff like seldom come these days. So much chemistry between Mark and Reese.",
    "date": "2025-03-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is one of my MOST LIKED collections. Very funny movie filled with romance and heart felt emotions .The spontaneous and impressive performance with cute and clean interactions depicted with comedy and supernatural romances has exploitated our sentiments..",
    "date": "2025-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "If you have lost a spouse you may really root for this movie. \n\nIt was nice. Light. Fun. Not too sad for a widow to watch.  \n\nI can relate to not putting yourself out there after a loss.",
    "date": "2025-02-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "super cute, feel-good movie. love anything with ruffalo in it and his bod is smokin'.",
    "date": "2024-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Beautiful movie! Definitely watch!",
    "date": "2024-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I am not a fan of Rom coms but wanted something to turn my brain off that was light. As I was \nLooking for a movie to watch I saw this and like both actors so gave it a shot and liked it.",
    "date": "2024-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I'll watch anything with Mark Ruffalo in it, this is one film I've gone back to a few times, when I need a bit of easy to watch fluff.",
    "date": "2023-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "really cute CLEAN movie-we need more like this",
    "date": "2023-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Love this movie, funny, sweet, and extremely entertaining. Feel good movie!",
    "date": "2023-10-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Sweet and lovely! Not difficult to believe in the story.",
    "date": "2023-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I really liked this. Lots if interesting ideas, a great story, and a few surprises along the way. I enjoyed the characters, the special effects and the locations. A very satisfying movie, with a nice happy ending.",
    "date": "2023-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Very cute, I loved it. Ruffalo falls in love with the idea of a girl he imagines appearing to him in the apartment he occupies. Lucky for him, it's Reece and she is not just an idea.",
    "date": "2023-02-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's a little heavy-footed and almost tries too hard, yet I quite enjoyed 'Just Like Heaven'.\n\nReese Witherspoon and Mark Ruffalo are a strong pairing, with Jon Heder spearheading a good support cast ably. It's a well paced film at around 90 minutes, there are some decently amusing scenes in there alongside some more sombre ones - the majority of which come off rather well. Some parts are cliché, but not to the degree that it affected my enjoyment.\n\nOne that is well worth a watch, in my opinion of course.",
    "date": "2023-01-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Resse witherspoon is in coma and falls in love with 2005 mark ruffalo before he decided to act. This feels like someone lost a bet, while the film offer brilliant sequences such as stealing a body, kids who have ghost tea parties, the perfect coach and driving a mini van stunt wise. Uhh this is bad in every way and perfectly stupid to watch again.",
    "date": "2022-12-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It has a cheesy ending but I found myself enjoying this movie more than I thought I would. It's a nice, feel good comedy with two likeable leads. Mark Ruffalo and Reese Witherspoon have good chemistry.",
    "date": "2022-12-08"
  }
]