[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Loved thisssss!!! I know that right!",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I didn’t like the writing or (most of) the characters.",
    "date": "2025-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Not to exaggerate, but I think this is probably the worst movie of all time. Tyler Perry as producer and director displays an in your face lack of care for his audience, an egregious greed and laziness about his product. Rather than donating to established charities, he should use his platform to showcase and elevate Black actors and writers rather than reducing them to blackface. He is a lazy, greedy man.",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "LOL, a funny and successful comedy movie in 1 hour and 47 minutes!!!!!!!!!!!!",
    "date": "2025-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Resulted transition’s structural consistency continues the sourly dramatic taste per ridicule integrity albeit the frivolous categorization, Madea’s return remains hilarious through witty deliverance in confident, reassuring form, becoming one of her most enjoyable outings. (B)",
    "date": "2025-04-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Had to be AI written. Made an entire account to say it was an awful movie.",
    "date": "2024-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This was SO good! I really hope we get another movie or two with Madea. This one was actually one of the best \"Madea\" movies Tyler has made so far... Please keep em' coming! 🫡",
    "date": "2024-02-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Completely trash. Idk what the audience is talking about. This is one of the occasions where the critics got it right.",
    "date": "2024-02-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great jokes, but story… eh…",
    "date": "2024-01-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Tim, o bisneto de Madea, vai se formar em Direito e a família decide comemorar organizando um churrasco. Porém a comemoração pode terminar mal com a revelação de vários segredos dos participantes. Tyler Perry continua com a sua fórmula de sucesso nos Estados Unidos: um roteiro fraco, os seus personagens caricatos e politicamente incorretos e um elenco muito fraco, com interpretações mequetrefes, cheio de mensagens inspiradoras e de impacto. Para completar, temos Madea representando o documentário do show da Beyonce em Coachella em 2018, totalmente dispensável e sem nenhuma ligação com o filme. Só para fãs.",
    "date": "2023-12-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Funny movie Tyler Perry is great",
    "date": "2022-12-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "very funny movie to see 😅.",
    "date": "2022-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Funny, but the drama sequences induce pain. These long, drawn-out moments bog the pace of the film down tremendously.",
    "date": "2022-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "love all the Madea's movie this one was different and more musical.",
    "date": "2022-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The Beyonce spoof at the credits is the only creative or fresh part of the film - the rest is reheated fries: sometimes it seems like a good idea but it just doesn't work out",
    "date": "2022-05-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I have sharp objection to the \"Madea Homecoming\" film in that I found it horribly anti-gay and counterproductive to the black gay community in particular, which is a most marginalized group within the gay community. We're a group that already gets treated like trash enough as it is within the black community and the gay community. This movie did nothing other than to help to perpetuate that.\n\nMy resentment with the movie is in how the romantic-relationship related wrongdoings, misconduct, lies and deceit of a heterosexual woman are treated very seriously with all characters—Madea mostly—reacting with vicarious rage, offense and violence. However, when the romantic relationship wrongdoings and misconduct are, conversely, against a black gay male in the film, all the characters—Madea mostly— respond with flippancy, apathy, and even shaming of the gay black character for daring to be hurt. Throughout the entire movie, we were witness to Madea pointing guns, raising hell, and attempting to get physical when the heterosexual character was wronged by a heterosexual man regarding their romantic relationship. Oh, the crimony!!!\n\nHowever, Madea's reaction to the gay male being wronged by the heterosexual female with regards to his relationship was to repeatedly excoriate the gay male to stop behaving hurt, let his mother go on with her affair with the gay guy's boyfriend and exact words to the gay character \"go on home.\" \n\nYes, that bad! The same heterosexual female character that all the characters in the film and Madea mostly was trying to avenge is the same character that went so low in the gutter as to have an affair with her homosexual son's boyfriend behind his back, both of the 2 lying to the son. The home wrecker mother later admitted only not accepting the proposal because she didn't want to move away Ireland, nothing to do with hurting her son. \n\nWhat offended me most was I always adored in the Madea character and thought she was on the side of right, that she would be ready to rage and avenge the gay character. All she did was laugh and cackle her shemale head off along with the rest of the characters. This scene is then followed by a long hammy lesson learning type scene from Madea in her bedroom. \n\nWhat was the lesson from Madea? Nothing to do with how the heterosexual mom just essentially spit at her son and now at his graduation, while she acted like the victim the whole movie; rather, the lesson from Madea is the heterosexual mom needs to follow her heart and accept the marriage proposal made from the man she had an affair with, that saying \"no,\" was wrong, that she needs to take risks and go live her life. In the end, the gay black son is presented as \"doing the right thing\" and accepting their affair and that since the family accepting him as gay, it's even. \n\nAs a gay black male, this was the most insulting, degrading and demeaning pile of slop movie I have ever seen. Tyler, you should have left Madea in retirement if you were going to use her as a weapon to spit on an already marginalized community. We as black gays receive enough disdain as it is without you using your films to impose that our the hurt and pains of gay black men do not matter. I have always been a fan of your work Mr. Perry, but not anymore. I loved the Have and Have Nots and previous Madea films and even this one I thought was funny and had a lot of potential, but I couldn't get over the anti-gay disdain shown. Madea comes off as a homophobic and I was waiting for granny to get socked in the face like she likes to do to others when they are offensive. Put grandma back in the grave, Tyler. She overstayed her welcome. Disgusting!",
    "date": "2022-04-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The movie was terrible! The worst movie Tyler Perry has ever made! It was too focused on being woke. Which I could look past but it was the whole movie.",
    "date": "2022-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Really funny,altogether a great film",
    "date": "2022-04-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I just adore and love all Madea's movies. This one doesn't disappoint. The addition of Mrs. Brown freaking true brilliance Love her sooo much. I love that the movie didn't skimp on any crude humor. Keep it coming.",
    "date": "2022-04-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "As the rating it just passed the time nothing more.",
    "date": "2022-03-30"
  }
]