[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Ben Affleck and Oscar Isaac are the main reason you should watch it.",
    "date": "2025-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "First half of the movie was solid as the heist goes just as planned. Then the plan takes a crash landing over greedy reasons and they start throwing the money away at everything.",
    "date": "2025-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Boring film did not really enjoy it most charchters were boring and plot was not great.",
    "date": "2025-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Genuinely had the most potential out of any action movie in a long time. Cast was amazing (though Pedro Pascal’s character was superfluous), plot setup was fantastic, it was on track to be an excellent film. But it just wasn’t. It felt like everything was going right and then everything went wrong in five minutes and then the movie ended. It seemed as though the director wanted to go deeper than just a regular action movie and landed flat on his face. I finished the movie and was disappointed, no longing for more, not even caring what happened after. Don’t waste your time",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Unlikeable cardboard characters decide to do something completely selfish and despicable. Severe consequences follow. Because the characters have no redeeming social value, I didn't care whether they lived or died. So I turned the movie off. I can't believe that some experienced professional on this project didn't raise a red flag and point out what a god awful idea this movie was. Then again, there were apparently creative differences that caused some people to quit, so maybe they didn't have the mojo to convince the right people. If you like explosions and action, regardless of the setup, you might like this, but if you need to get invested in characters in order to enjoy a movie, look elsewhere.",
    "date": "2025-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It is sad to give it this rating because this movie has 3 amazing actors (Oscar Isaac, Ben Affleck, Pedro Pascal) but this movie is just generic and honestly sad, i am not watching this again.",
    "date": "2025-06-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The movie begins with good character building, establishing each protagonist's personality and background, and quickly drawing you into the plot. This part of the film is done quite well for the most part and does a good job at keeping you intrigued. Sadly, that doesn't last. A particular scene comes to mind where there's noone keeping cover while loot is being put into bags; and it beggars belief that trained, seasoned ex-military would get that careless even in front of a huge tempting mound of cash. During all of this, an armed antagonist doesn't seem to want to do anything about the banging and shouting going on in his house, but then decides to come out of a panic room only when there's at least Affleck, Hunnam and Isaac right outside its door, obviously looking for him.",
    "date": "2025-06-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Triple Frontier is more than a little narratively uneven, but when it comes to gun-toting realism, writer-director J. C. Chandor doesn't disappoint.",
    "date": "2025-06-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I liked Pedro Pascal's performance. Most of the movie was a lot like Wildlands.",
    "date": "2025-05-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I loved this movie. It's got a great cast, and I love the action and story. It’s definitely more of a guys movie - It’s quite a wild ride that will raise your testosterone.",
    "date": "2025-05-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie will give you a run for your money definitely worth the watch military ops going after a criminals money good stuff love to see more like it",
    "date": "2025-03-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Great cast, mediocre movie, and the ending seemed like they ran out of money.",
    "date": "2025-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I went into this film with low expectations. The writing was bad, but the acting and gun fights made it worth watching - - but just barely.",
    "date": "2025-02-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I won't spoil the ending for you such as it is. That's 90 minutes of my life that I will never ever get back and believe me I'm pissed about it. My wife says \"oh, let's try this.\" I told her that I would never let her pick a movie for me ever again.",
    "date": "2025-02-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Very predictable full of cliches action movie, to the point that it gets boring at times.",
    "date": "2025-01-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Confused at best. An amoral stew of logic and emotion best summed up in one of the final lines “Tell Molly he was a hero”.",
    "date": "2025-01-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Greed is a deadly sin, and Ben Affleck paid the ultimate price to teach us that lesson. Thank you Ben Affleck.",
    "date": "2025-01-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "One of Netflix's best Originals, Triple Frontier is a fairly straightforward action-thrillers elevated by gripping action sequences, outstanding performances from the entire cast, visceral sound design & some stunning cinematography.",
    "date": "2024-12-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Good actors but a lacking screenplay. Couldn’t make it through to the end. No emotional investment with the characters and every decision they made was the wrong one which seemed utterly preposterous considering these were supposed to be the most disciplined men in their industry.",
    "date": "2024-12-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "\"Triple Frontier\" follows a team of five ex-military men on a heist to steal the ill-gotten gains of a South American drug lord known as Lorea. The men reluctantly agree, but soon find themselves in over their heads. Throughout the film there are recurring themes of greed, as the men must decide how much money to leave behind to assure their survival. This feels a bit ironic. Here this is a story about risk and reward, where the movie itself takes very few risks and just delvers a pretty straight forward action film.\n\nThe movie isn't bad. It is well cast, has a couple of good twists and plays an interesting game of morality. The characters are nothing memorable and none of the scenes stand out as that impressive.\n\nAs long as Netflix is burning money, they might as well keep recording it for us to enjoy.",
    "date": "2024-11-20"
  }
]