[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Not great but not bad. 6.5/10",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The reviews on this seem really low.  Yeah, it is a bit cliched, and you can see the ending from the minute Washington is gunned down in the store.  But it has a really strong cast, strong production quality, and while the writing is the BEST, Keanu actually acts here... it isn't Shakespeare - he isn't a great actor - but this is one of his better outings.",
    "date": "2025-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1 hour and 47 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $26,400,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "It was really fun to watch. It keeps you on the edge of your seat. There was no drawn out parts that made you yawn. Keanu and Whitaker made the story really believable.\n\nThe backdrop of LA was perfect for this. Story screams attitude with a bit of over the top cop action but in a good way. Awesome flick for the guys.",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was a great movie! \nThe cast was awesome, take a look at all the mainstream actors in this movie! You’d have to really mess things up not to get a high rating. I cannot understand why this 2008 movie isn’t rated higher?\nWatch the movie and judge it yourself. If you’re looking for action and plot twists and more you’ve found it.",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Direção: Bom\nAtuação: Bom\nRoteiro: Ok\nCaracterização: Bom\nSoundtrack: Ok",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Maybe it's sentimentalism, but I utterly enjoyed the movie. To my shame, I found myself muttering: They don't make them like that anymore. Kinda honest in its flaws. If you are the type of person who chooses to watch this movie, I am sure you will enjoy it.",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Just watched this movie. Never thought i'd see John Wick and Captain america in one movie. A bunch of other great actors as well. Honestly I loved the movie. I was shocked when i came here and saw such a low rating so made an account here to review it myself. 10/10 for me I don't agree that it was predictable at all. I think it's a must watch movie.",
    "date": "2025-06-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "While it's not Shakespeare, this movie is good. I don't get the distain for this movie from the critics. Is Reeves's character a flawed cop? Yes, but his brutality is only directed at the bad of society. When he realizes those from his unit are worse than the bad guys he puts down, he seeks retribution.",
    "date": "2025-06-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Street Kings a predictable and sometimes boring action movie with a great cast of actors.\n\nThe characters are mostly stereotypical, Tom Ludlow is a good protagonist, but doesn't offer anything new or exciting. The dialogues are not bad, but there's nothing that stands out. The plot is predictable, but still enjoyable. A few characters' intentions were not clear by the end, that was confusing.\n\nThe cinematography was terrible. The slow motions were boring and some of the shots were really weird. The fight scenes were also badly-shot and edited, because I couldn't see anything. The pacing was okay, I wasn't bored because of it. The lack of excitement comes from the predictable story and the stereotypical characters.\n\nStreet Kings is not a movie I'll rewatch, but it was exactly the kind of goofy action movie I wanted to see.",
    "date": "2024-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Brilliantly cast and superbly acted.",
    "date": "2024-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "79/100 - entertaining, a story about police corruption, pretty standard. nothing crazy stands out in this movie good or bad but its worth watching.",
    "date": "2024-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Awesome movie, loved everything about it. NRJ.",
    "date": "2024-04-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "the wasn't great movie, some of the performances were not good but it was an ok movie",
    "date": "2024-04-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Keanu's best every acting performance in my opinion and what's not to like about corruption and dirty cops. Decent little film",
    "date": "2024-03-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great Movie...\nFantastic acting, great story.",
    "date": "2024-03-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Pretty good flick with a solid cast. Keanu Reeves usually gets a lot of criticism for his acting but he was great in this film.",
    "date": "2024-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A somewhat predictable gangster flick, but not without some of its own \"deep\" moments pulled from the grueling day to day lifestyle which is keenly depicted here by David Ayer",
    "date": "2024-01-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "On paper, there's aspects of greatness such as in the Hong Kong film \"Internal Affairs\" where in law enforcement one cannot know who to _truly_ trust. But oh man the dialogue. It deflates every suspenseful scene with its immaturity. It's like written by a 13 yo. \"You were a brother to me! I can't believe this is true. Was everything else a lie, too?\" It's \"The Room\" level dialogue paired with a decent attempt at a conspiracy movie.",
    "date": "2024-01-03"
  }
]