[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was amazing. We laughed a lot and were totally engaged throughout. Great fun.",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Playing With Fire (2019) is a pretty OK adventure, it has some cool and fun moments and other cheesy moments, but it's hilarious. It's a simple film with exaggerations that the audience might like and it has firefighters.",
    "date": "2025-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It does not want to take itself seriously.\n\nFrom the start, they make me seem to make me OK with the scene about a forest fire. I would also be attracted to it for John Leguizamo (Rodrigo) who is always being upbeat in comedy movies (no wonder Sid is my favourite character in Ice Age).\n\nThere are a few goofs in it.\n\nThe main focus is when they have to look after 3 siblings: Bryan, Will & Zoey. I do not believe that Brianna Hildebrand was a great actress in this but at least, being the oldest, is a role model knowing to look after younger siblings without any irritation on her.\n\nJohn Cena is Jake Carson, who seems to be sane & strict (similar to Ken from \"Bee Movie\") but he is funny & is told to have heart in it.\n\nOften, children in movies can be my favourite characters of the movie (the funniest ones) similar to Harry from \"Freaky Friday\". The best funniest part was when Will accidentally used paint thinner to clean the 4×4, spills & causes a bubbly flood.\n\nThe other best moments were when they Brynn & Jake spoke about what happened to their parents 🪦🪦. Obviously, they need emotional moments.\n\nAnother thing, anyone can be a Brony. They watched MLP, even Will & the firefighters were about it (especially Rodrigo). The firefighters/smokejumpers getting involved over MLP was adorable & funny (especially on Zoey's birthday) & about Axe & Pinky Pie.\n\nBut the scene between the birthday & the official ending was unnecessary.\n\nDo you think I am going to watch it again, like CWACOM 2?",
    "date": "2025-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 01 hour, 36 minutes, and 00 seconds!!!!!!!!!!!!!!!!!! The USA grossed over $20,500,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Starring John Cena as Jake!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Copyright 2019-2025 Paramount Pictures and Nickelodeon Movies!!!!!!!!!!!!!!!! Rated PG for Rude Humor, Mild Peril and Some Suggestive Material!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Simple kids movie with standard plot and some jokes.",
    "date": "2025-02-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny, heartwarming and a fun time! ⭐️⭐️⭐️⭐️🩷",
    "date": "2024-12-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Playing With Fire - 5/10. Saw this a long while back and I’m surprised I never logged it in. Playing With Fire is John Cena’s attempt at foraying into the family friendly film genre. All the big hulking action stars have done their part in trying to broaden their respective audiences with this type of career move. And though I would say out of all of them Schwarzenegger was the most successful, Cena’s attempt in terms of acting is good, but the overall film is subpar. Playing With Fire feels like a tv movie of sorts, and it plays to a Disney channel level goofiness. Not saying that goofy is bad or not something you should attempt to do in comedy, but here, it just feels a little too childish. There’s some hilarity that ensues with the situation, but overall, its a wacky tale that is designed for fans of Cena and for people that just want a non consequential film to watch!",
    "date": "2024-12-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I thought this was an absolute blast",
    "date": "2024-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Idiotic clap trap, hated every minute of it.",
    "date": "2024-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This is an overhated film, it's not the best film, but it's a good comedy for kids and parents to enjoy",
    "date": "2023-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The film is terribly bad, it disrespects class, the humor is terrible, everything is poorly done, it is literally terrible, it deserves a 0, it is a rotten film that you should never watch",
    "date": "2023-12-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I regret watching this film in theaters.",
    "date": "2023-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "8.8/10\nHilarious comedy for families to enjoy, perfect family movie night option! I couldn't stop laughing after watching! John Cena was super funny in this film, the rest of the cast was also laugh-on-the-floor funny! Keegan Michael Key and John Leguizamo never got old! The only thing I disliked was the poop jokes.",
    "date": "2023-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "super funny and very enjoying",
    "date": "2023-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Como película no es muy buena, la historia es cliché y solo algunos buenos chistes funcionan mientras otros dan un poquito de vergüenza ajena. La cosa es que hay que verla para adonde esta apuntada; es directamente para chicos y claramente a ellos les gusta, a los adultos no les va a parecer mala o aburrida pero tampoco la gran cosa. Sirve para pasar un buen rato y ya.",
    "date": "2023-01-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The one thing i can say is that i think the poster kinda predicted the pandemic.",
    "date": "2023-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "One of the worst, poorest excuses for a script I have ever seen.",
    "date": "2022-12-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "If I had a family this would probably be a nice family flick 2.7",
    "date": "2022-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "LOL, the funniest 01 hour: and 36 minutes ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2022-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I've seen some films in my time but this is painful.",
    "date": "2022-02-12"
  }
]