[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie should be condemned... Phobe.",
    "date": "2025-06-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's worth a watch if you're into ten dangerous convicts trying to kill each other, and your lead is Stone Cold. It's not perfect or pretty, but damn, it's worth it",
    "date": "2024-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is one of the worst movies I have ever seen with it cynical preachy message about nonviolence, when it's being so hypocritical using a ton of violence. Plus this movie is super unpleasant to get through with two attempted/successful sexual assaults in the entire movie, plus the acting is abysmal",
    "date": "2023-06-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is a terrible steaming pile of mediocrity and bs. Some of the worst acting I have ever seen- seriously. I have seen rusty nails and bricks with better acting skills, more charisma, and likeability than these actors. Asinine plot, storyline, and script. The dumbest dialogue ever. Even the action scenes are boring. Overall, this is an unbelievable, unconvincing, unrealistic, and stupid movie from start till finish.",
    "date": "2023-03-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Minha opinião: É um filme onde um empresário quer lucrar com as apostas on line no mundo todo. Então ele decide fazer uma competição com condenados a morte que estão pelos presídios do mundo e trazer para sua ilha e fazer eles se confrotarem uns com os outros e quem vencer terá sua liberdade. Enquanto todos os participantes são assassinos, traficantes, guerrilheiro,.... Tem um bom rapaz que entro por ultimo, substituindo um participante. E quem é? Steve Austin, um ex-fuzileiro e bom moço que estava preso injustamente. E assim começa a competição. Acontecem atrocidades, estupro, traição,....... E vai assim morrendo um atrás do outro. Até que no fim Austin se liberta e vai atrás do grande vilão. Existem várias versões deste estilo de filme, e este não é dos melhores. Mediano para fraco. E existe cenas fortes de crueldade, que não seria necessário.\nRoteiro e enredo fracos.\nVale apena assistir? Não\nNota: 3",
    "date": "2023-03-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I liked the concept of the movie and it is similar to Arnies Running Man. Did you know that former World kick Boxing champion Sam Greco was Steve Austins double, when they jump from the helicopter it was Sam jumping. The movie was shot in Queensland Australia.",
    "date": "2022-02-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I enjoyed the movie, am I correct in thinking it's loosely based on a Japanese movie called \"Battle Royale\"?",
    "date": "2022-01-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Had the opportunity to be great, but some storylines were introduced in the middle of the film that no one will care for that really drags this film down",
    "date": "2021-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Honestly, this is one of my all-time favorite action flicks.  Particularly for a low-budget film.  Acting throughout is solid, albeit a little lackluster at times, but I think they really nailed the premise here which is what I liked most about The Condemned.  This isn't a mindless action film, it's got depth to it and almost acts as a fictional social experiment; making an unrealistic storyline come to life by highlighting just how terrible humanity can be. It perfectly depicts the depravity of society tuning in, in droves to pay to witness live murder, torture and rape.  The emotional rollercoaster is also captured brilliantly.  First, it seems like you've tuned in to watch a real-life Battle Royale, but as it gets darker, you see the characters (namely Hoffman and Musset) start to question their own involvement and morality.  Hoffman's performance was a stand out for me in that regard.  I strongly believe this is almost exactly how this would play out in a real life scenario.  The excuse of: \"Well, they're going to die anyway and they're murderers, so who cares what they go through\" is precisely how society would react in my opinion and Wiper captures that beautifully.  Robert Hammone encapsulates greed and selfishness to a tee and it worked as stark reminder that people are willing to sell anything, with no regard for human life, if it lines their pockets.  Most of the action scenes are tons of fun to watch, even though some of the dialogue is a little cringe at times.  Austin plays his role perfectly and bounced off Jones - who is as sadistic as they come - exceptionally well.  While the storyline is predictable, I was okay with the \"happy ending\" in this one and I highly recommend giving it a watch if you're into OTT action movies.",
    "date": "2021-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A preconcept for \"The Hunger Games\" contributing a violent, weakly fought and thinly plotted seed into the battle royale narrative genre with prophetically hypocritical conflict in slow burning justice that overshadows a slight political commentary till the finalizing satisfaction, all while Steve Austin tried his simplistically macho best in holding the overall weight. (B-)",
    "date": "2021-06-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I liked it very much. Refreshing, and I would go so far to say not politically correct (which obviously is a good thing) there is an honest depiction of what would happen if you had to fight for the death plus there's juicy scenes where a female is fondled. Although I would like to see a movie go further and have unwanted s e x with a female because that is real life as people keep saying. Unfortunately the female wins against her abuser which is predictable, I would like to see the guy have his fun with the female and then go on to win it, because being PC doesn't help a good script. I despise perfunctory accountability on the guys perspective i.e. the female kills him because he tried to \"get inside her panties\" etc. All in all good film with good action from Stone Cold Steve Austin. Have a beer or three and enjoy! Have a good day X:)",
    "date": "2021-04-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "An interesting idea for a movie and well executed.",
    "date": "2020-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "'The Condemned' simply isn't a great film, due to its subpar acting, mostly predictable plot and average other aspects like the cinematography. However, I can't deny it still makes for solid action viewing. Just to be enjoyed for what it is.\n\nWith that said, it actually does have an interesting concept - one that is kinda fascinating. The film commits to it fairly well, hitting many correct notes in regards to the morality of the matters at hand. I also didn't think it would take such a dark-ish tone with it all.\n\nSteve Austin is decent in the main role, he is no Dwayne Johnson or even John Cena but he has the right look for a beefed up protagonist. Vinnie Jones is Vinnie Jones in this, he's exactly how you'd expect him to be. The rest of the cast are largely forgettable, though Madeleine West actually gives the film's best performance as Sarah - despite only appearing in a minor part, I felt her character's feelings. It's also cool to see Rick Hoffman in a role pre-'Suits'.\n\nIf you just want pure action with loads of fighting, this is one for you. The second act and the last remnants of the ending drag, but it's largely a fun watch if you don't take it too seriously.",
    "date": "2020-05-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's a good time passer and was entertaining at points. Very interesting concept but made to be more action than horror which I think was the wrong direction. Had the very typical \"hero American\" who was morally and physically superior to everyone else just to stroke the ego of Americans. Expected from an American film company though. Overall, alright film.",
    "date": "2020-04-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "If you're a fan of action like myself, I would surely recommend this film. Not the greatest acting but all together and entertaining flick. I was honestly surprised when seeing the score it received on R.T. I'm a fan of all genres and I was quite satisfied.",
    "date": "2019-12-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It knows that's its dark and it roles with it. It works on a certain level for me but some scenes are a little too much for me. If like action that are sold perry on violence then this is for you.",
    "date": "2019-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The Condemned set out to be exactly what it was. And for what it was aiming for, it was perfect.",
    "date": "2018-12-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Interesting concept for a movie. Reminds me of the lovechild of Quentin Tarentino and Survivor",
    "date": "2018-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A very simplistic yet very entertain action movie it shows you that you  don't need Michael Bay to make a good action movie just some good ass fight scenes. This is a great movie to watch while having some cold ones.",
    "date": "2018-06-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Its one of those movies that's just fun to watch. Enjoyable concept. The fight scenes were not filmed well, way to much camera movement. When you have someone like Steve Austin (who knows how to fight) there's no reason to avoid shooting the fight scenes correctly.",
    "date": "2018-03-27"
  }
]