[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Another gun ho action flop,",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The movie was based on an amazing and heroic story. A teriffic cast, too bad the film making missed the mark.  Lots of explosions and action, but eventually became repetitive and tiring. Hokie one liners and canned dialogue were too common and created an almost unintentional comical effect.  Very disappointing :(",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Good action. A little long.",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's an excellent movie that tells the story of 12 of the most amazing American heroes, and a lot of Afghan heroes who are fighting together against the Taliban shortly after 9/11.\nProduced by Jerry Bruckheimer, whose movies are simply the best.\nIt's based on a true story And there were no boring parts of it whatsoever as some reviewers and some professional critics have stated.",
    "date": "2025-09-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A pretty solid movie. Based on a true story, it’s hard to believe that all 12 came back home.",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "\"12 Strong\" is a war movie following the first special forces team deployed in Afghanistan after 9/11. It is hard to sell the audience on the idea that America is the “underdog” in this situation. Especially when they have the ability to call in dozens of air strikes on the opposing troops. This movie easily blends in with the sea of other war movies and does very little to stand out. War movies already have a difficult time differentiating themselves from each other. But as I finished the movie, I asked myself, \"what differentiates this movie from the dozen others just like it?\" And the answer I went with was the alliance with General Dotsum. He was a unique character, and the uneasy alliance between him and the American troops was novel for a film like this. Other than that, I guess if you have never seen another war movie, this one will do just fine.",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Es buena la película con una trama e historia interesantes",
    "date": "2025-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Although I don't know the story behind what happened in 2001 very well, this film turns out to be very entertaining for what it offers.\n\nIt's full of history, motivation, and values.\n\nI also like the fact that some of the sets are completely real. Everything was filmed outdoors.\n\nThe only thing missing for this film to be a gem was for us to empathize with the rest of the Squadron, since very little is explored about them, and we are not affected at all if something bad happens to them.\n\nThe rest of the film—The War, the battles, The Enemy—are very good. 🪖\n\nI give it a 4-star rating because of how good the film was.⭐⭐⭐⭐ Ok.",
    "date": "2025-04-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Because it's a true story and done so well in the fighting scenes I'm recommending it. Navid Negahban is very good.",
    "date": "2025-04-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Not normally one for war films but this was a great watch and very eye opening! Did not realise it was a true story - extraordinary for the soldiers involved",
    "date": "2025-03-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Unbelievable true story. Great action edge of you seat stuff. Would watch it again",
    "date": "2025-03-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It was ok, nothing new. Plenty of action as to be expected, but overall no real character depth so felt a bit hollow to me. If you’re after an easy no effort watch this would be a good option. If you want depth, maybe this wouldn’t hit the mark.",
    "date": "2025-01-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Awesome movie lot of action 5 stars",
    "date": "2024-12-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Lacked realism, the acting was sub par, basic action movie",
    "date": "2024-12-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Hard to watch because of the poor acting, predictable storyline, bad writing, and over-the-top battle scenes. Not worth  two hours.",
    "date": "2024-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I just watched the comic",
    "date": "2024-05-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The only reason to watch this is that there is a true story the film is attempting to depict. But it's so cliched and unrealistic I hardly got excited. Except for the horseback charges - its always exciting to watch people on fast galloping horses, despite the stupidity of them all being bullet-proof under close automatic weapon fire, the most obvious silliness of the film. \n\nThis is one of those movies with inane shoot-em-up scenes where six of our heroes run into open scenes under fire from hundreds of bad guys shooting, and bizarrely, the bad guys all die and the heroes never get hit. After ducking for cover, any one of our heroes is able to step out from behind cover and stand up and bang bang bang kill a whole lot of baddies who are firing at him. But we're so familiar with bullet-proof American gunslinger good-guy from 1950s Westerns, so you kind-of can ignore this as dramatic licence.\n\nBut then our guys call in B52s to drop bombs from 32,000 feet that fall directly on the Afghan enemy, and watching from nearby (!), a few minutes later our guys walk in vicctoriously to peruse all the dead bad guys. In reality, the real  ODA 595 special forces group \"in one 18-hour battle, ... destroyed over 20 armored and 20 support vehicles\". \"They guided hundreds of GPS-guided 2,000-pound JDAM precision-guided munitions dropped by... heavy bombers onto Taliban and Al-Qaeda positions near Mazar-i-Sharif\". Never did the film convey the gritty dramatic reality of what actually happened.\n\nThe film's premise is that the evil Taliban need to be defeated so that Al Qaeda can't commit even worse acts than 9/11. This just wasn't true.",
    "date": "2024-05-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Fine movie. Could have been more engaging but I like that it’s a true story and I enjoyed the strategy.",
    "date": "2024-04-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is outstanding! It doesn't drag and needs no \"nuance\".",
    "date": "2023-12-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's a Michael Bay action movie, you get what you come for. Great action, great score, heroism everywhere, and then the rest of the movie.",
    "date": "2023-10-27"
  }
]