[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "O filme se seguisse uma trama mais realista seria muito melhor, pois só a problemática da imigração já é um terror. Quando se mistura com o sobrenatural, ai o filme perde um pouco o foco e falta explicação e motivo pra tudo que acontece. O monstro em si é pouco explorado e terminamos nos sentindo bobos achando que o filme seria o máximo.",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "a pathetic waste of time. The start was interesting, but everything happened too fast and the ending was so unexpected and uninteresting. It made the start of the movie look useless.",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Sayang oras. Nagsimula syang ok, mukhang promising sa umpisa pero lumaylay sa ending. Natapos ang kwentong di man lang sinabi kung anu at paano napunta yung nilalang na yun. Bigla din nawala sa kwento un isang babae bukod dun sa hinagis sa hagdan",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "SPOILERS. It’s bizarre. In all that I’ve read about Ītzpāpalōtl, I don’t see anything that depicts her as a monster that eats the heads of her victims with her toothed hooha. Also, a couple of creepy white men preying on undocumented immigrant women. It’s certainly a choice.",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The movie title seemed so familiar to me that I thought for a sec that I already saw it... It looks like a lot of new horror movies have the similar titles to the old horrors, Idk. The movie itself is nothing but another mediocre horror: Wasn't bad but with the stronger plot de a few details would ve been better. The \"monster\" was very overwhelming tho...",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Poor adaptation of a good novel.\n\nHaving come into this on the back of finishing the novel I was quite excited. However everything about this adaptation is so far removed from the novel I do not understand how they are connected at all. The characters names, settings and back stories are all so far removed from the original source.\n\nIt's a real shame as the book was a fantastic premise to a great horror story. \n\nAs a stand alone horror movie it lacked any real story, little build up. It was very disjointed, things just kind of happened without any real explanation. I didn't find it particularly scary, it was nicely acted and the characters could have been engaging given more thought and effort. Overall very disappointing.",
    "date": "2025-09-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It wasn't really that scary, but the plot is good, and the flow of the story is consistent. It wasn't really my cup of tea as a horror fanatic, but to divert the situation into reality, it is scary. not the ritual of the owner but the fact that, you are in such a place, in such a situation, and then you experience such thing.",
    "date": "2025-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Starts out as a pretty predictable haunted house story, although the stress and fear of being an undocumented immigrant comes through strong. The last third of the film shifts into the bizarre with allusions to ancient Mexican mythology, a strange and creepy monster (if a little obviously CGI), and a frightening villain. I was rooting for the heroine to kick some butt and wasn’t disappointed, although the suggestion at the end that the heroine might become the villain was a bit unsatisfying, but nonetheless probably less cliche than an escape and a return to normalcy.",
    "date": "2025-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Really enjoyed it, interesting premise.",
    "date": "2025-04-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Not scary\nGood plot\nGood writing",
    "date": "2025-03-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Well written well acted horror outing thoroughly enjoyed this film depicting an immigrant attempting to find the American dream becoming caught up in a twisted landlords sacrifices to an ancient Mayan god/entity",
    "date": "2025-02-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Could've been much better with a further story around the box. All we get is a poorly designed monster that doesn't really look like anything familiar. I was invested from the beginning, but I noticed way too many plot holes to give this a higher rating.",
    "date": "2025-02-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A standard haunted house horror, with an extra added horror element or two, that is able to keep my loose attention.",
    "date": "2024-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Some things are bigger inside than out. The antagonists of this movie are either inhuman or inhumane, but not both. Weird, worrysome, and with a creative and unsettling final boss design, this movie is disorienting but worthwhile in my opinion.",
    "date": "2024-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The movie had it moments but overall just falls flat at the end.",
    "date": "2024-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Great movie, nonetheless I was expecting a better design for the final boss, and for the ending too.",
    "date": "2024-03-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Ok, I did not care for the beginning wind up, but I put it aside and watched from there at another time and I was enthralled by the subtle effects, plot pace and the Shrine- type ending. Overall I would say well played. Way better than 60%. There aren't many movies that pull it off after the first 30 minutes of ho hum but this one did succeed. I only write these when I think the film has more value than the ratings.",
    "date": "2024-02-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The most pathetic movie I have  ever watched there is no \nstory at all just a monster eating women\nSuch a waste of time",
    "date": "2023-12-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Not bad. But not great either. A slow film with decent casting and acting accompanied by good set and sound design and a fun, if over used, art style and aesthetic. If you don't mind wasting some time, or to leave something on in the background while you do other things, give it a shot but don't expect to be blown away.",
    "date": "2023-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "So many things were left unexplained at the end but it was still a decent horror flick to watch. The acting was okay and the elements were my kind of scary. The creature at the end was meaningless though, or there were so many references that I couldn't grasp.",
    "date": "2023-04-30"
  }
]