[
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "There were some good moments in this film and some really fake ones also. Some of the action scenes were so fake I laughed and said oh yea, right. For young boys and drunks I can see it being a fun film. There are many better films to watch, for me Not even a rainy day would save it.",
    "date": "2025-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "One of my biggest guilty pleasure films. Obviously The Transporter 2 isn't gonna win any awards for creativity or story but it's still a damn entertaining action film.",
    "date": "2025-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolute banger of a movie...",
    "date": "2025-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Its good… but sometimes very ridicoulus.",
    "date": "2025-06-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Failed action sequel in 1 hour and 28 minutes!!!!!!!!!!!!!",
    "date": "2025-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The movie is silly,cheap and a little shameful,but the cars,chases, flights and the cool Jamaican guy featured in the movie are really cool, they saved this movie from being a complete junk",
    "date": "2024-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Enjoyed the driving stunts but the fight sequences were silly.  Like many action flicks the hero fights off several bad guys.  Why don't they all jump him instead of taking turns?",
    "date": "2024-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Felt a bit unnecessary don’t remember much about it",
    "date": "2024-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "If it were up to me, I would pretty much enjoy this ride. It's the action sequences and the car chases that make TRANSPORTER 2 a feel good movie for every action movie fan out there.",
    "date": "2024-04-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It is bonkers and he is amazing",
    "date": "2024-02-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The ex-British Special Forces officer turn professional Transporter, Frank Martin has relocated from France to Miami, Florida, and he has taken on what just maybe his toughest job ever... driving wealthy 6 year old Jack Billings to and from his elementary school.\n     Well this was supposed to be just another job, a simple favor to a friend. Then Frank unexpectedly becomes close to Jack and very protective of him.\n   \"Look at me. I promise I'll never let anyone hurt you a lot\" - Frank\n     But when Jack is kidnapped on Frank's watch, he becomes the suspect. Now on the run from the law and chasing after these kidnappers, Frank discovers this is more than what it seems, and their real plan is to release a deadly virus, a virus that only they have the antidote.  \n     I like this second Transporter movie. The villains are a bit over the top, but I expect that from Luc Besson, Its a \"French Thing\" But Jason Startham is totally awesome as the super cool and stylish Transporter...... And just like Frank's his new tricked-out Audi A8 car, this movie is just a fun action-packed ride. \n   Cast -  Jason Statham, François Berléand,   Alessandro Gassmann, Amber Valletta, Kate Nauta, Matthew Modine, Jason Flemyng",
    "date": "2023-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The hit woman works in her panties.   \nThat's all I got.",
    "date": "2023-09-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Over 15 years old this manages to be a way more fun installment of the franchise. Frank Martin the infamous Transporter is back. This time he drives around for a wealthy divorced couple with a son. But he’s about to be part of a drug cartel scheme who plans to infect all the politicians controlling the various governments in charge. The son is kidnapped and Frank must not only save him but bring down the people whom are the source of the deadly bio weapon. A fast pace, slicker action scenes, and kickass fights make this a step up from the original. I’m glad that first movie made enough money in dvd sales and brought Jason Statham back. This one had better action despite all the green screen effects and the shorter running time. Yes there’s a lot of stupidity throughout but it delivers on the high-octane thrills giving Statham a more balanced edge. True it might be forgettable but if it’s dumb thrills you want from this character then director Louis Leterrier does just that.",
    "date": "2023-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I liked the first one, but this one challenged me. Realism is always tested with these sorts of films, but this sequel went way too far with impossible car flips, a plane crash that didn't kill everyone onboard and bullet dodging which made no sense at all. Fight scenes where all the bad guys conveniently run out of ammo is just lazy writing",
    "date": "2023-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "87/100 - jason stathom kills it in this movie. funny, action packed, good plot. and francois is amazing playing inspector tarconi. their dynamic makes for great comedy.",
    "date": "2023-03-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Jason Statham doing what he does best. Stay for the action, not the acting.",
    "date": "2022-12-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Good action and good sequel",
    "date": "2022-12-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Cringey, stereotypical villains with an idiotic, unnecessarily complicated, unabashedly unoriginal master plan about a virus that spreads like a wildfire, yet somehow the hero doesn't get it and it can be contained by a magical antidote? Check. Shallow, cliched bond between the hero and a kid, whose mum either drools over the hero or shows her maternal instincts? Check. Ridiculous dialogues, mediocre CGI and absolutely impossible, preposterous action? Check. The stunts were really good though.",
    "date": "2022-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The worst of the trilogy, LOL!!!!!!!!!!!!!!!!!!!!!",
    "date": "2022-04-10"
  }
]