[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "(CASTELLANO) Hay películas que se ven con la misma facilidad con la que se olvidan, y esta es una de ellas. La mezcla de acción y comedia funciona a ratos, sobre todo porque Kevin Hart y Woody Harrelson consiguen sacar chispa de su extraño dúo, aunque la química nunca llega a ser tan explosiva como promete.\n\nEl humor es irregular, con chistes que entran bien y otros que se sienten forzados. La trama se mueve entre tópicos del género y persecuciones de manual, sin aportar nada nuevo. El resultado es una sucesión de escenas que cumplen con lo mínimo para entretener, pero que rara vez sorprenden.\n\nLa dirección de Patrick Hughes mantiene el ritmo, aunque todo parece demasiado rutinario. Hay momentos de acción simpáticos y algún golpe cómico efectivo, pero el conjunto carece de personalidad. Lo que podría haber sido una “buddy movie” con carácter se queda en una fórmula reciclada.\n\nEn definitiva, es una comedia de acción ligera, apta para una noche de sofá sin demasiadas pretensiones. Se deja ver, tiene algún gag salvable y no aburre, pero tampoco destaca. Una película entretenida y ya está, de esas que desaparecen de la memoria tan rápido como llegaron.\n\n(ENGLISH) There are films that are as easy to watch as they are to forget, and this is one of them. The mix of action and comedy works at times, mainly because Kevin Hart and Woody Harrelson manage to spark some energy from their odd pairing, even if the chemistry never quite reaches its full potential.\n\nThe humor is uneven, with some jokes landing well and others feeling forced. The plot moves between well-worn genre clichés and predictable chases, without bringing anything new. What’s left is a string of scenes that barely meet the minimum to entertain, but rarely surprise.\n\nPatrick Hughes’ direction keeps things moving, though everything feels routine. There are a few amusing action moments and the occasional effective gag, but the film lacks personality. What could have been a “buddy movie” with character ends up as a recycled formula.\n\nIn the end, it’s a light action comedy, perfect for a couch night without high expectations. It’s watchable, with a couple of redeeming laughs, and it doesn’t bore, but it never stands out. An entertaining film, nothing more, and one that fades from memory as quickly as it arrives.",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's good humor, i just find K. Hart to be a little cheesy. Bumped it to Three Stars for the ending fight scene.",
    "date": "2025-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Amazing and super Funny I like Kevin hart comic timing and his humor his superb and Action was fantastic",
    "date": "2025-06-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It takes a long while for hilarity to actually kick in if that’s the main draw besides the buddy pair-up stirring potential dynamical amusement, resulting in being less than the sum of its parts and enough to certify the instant cynical doubt in should’ve known this would be unfunnily indifferent. (B-)",
    "date": "2025-04-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Funny, entertaining. Lightweight but enjoyable",
    "date": "2024-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Movie was good, guaranteed will make you laugh. Could use a better ending tho",
    "date": "2024-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "No, just... NO, this film, I wish I could unsee it. Horrible.",
    "date": "2024-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I love the comedy of this silly movie.",
    "date": "2024-04-16"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It didn't keep my attention could not watch the whole thing.",
    "date": "2024-03-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very good...it has action, it's funny plus it's fresh. I recommend it!",
    "date": "2024-03-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "more funny than anything. Great date movie",
    "date": "2024-02-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is so underrated \nKevin hart absolutely rocked \nBest plot!!",
    "date": "2024-01-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Good storyline but silly and over the top in places.",
    "date": "2023-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I barely watch movies twice, but this is an exception. To show, I've only watched movies twice, 3 times in my life including this movie. It is hilarious!",
    "date": "2023-12-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Expected it to be boring but in terms of enjoyability it's great, definitely got some laughs out of me",
    "date": "2023-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "So much potential from two A list talents. But the movie sucked b@lls. Sorry but it just did. Don't waste your time watching the movie or even the trailer.",
    "date": "2023-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Have you ever watched a movie and wanted to smash the screen every second of it? You are not? Here's your chance. Hart is unwatchable and annoying from the first appearance, Woody too, the story is shallow and unconvincing, there are few interesting dialogues and scenes. Avoid this movie at all costs.",
    "date": "2023-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It has its moments but nothing special. Great way to pass time.",
    "date": "2023-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Besides a couple fun action sequences, the movie follows an overdone formula which Hart can't seem to escape.",
    "date": "2023-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The Man From Toronto had promise - Hart's silly combined with Harrelson's cut-throat killer instincts. But, it didn't end up being that funny - almost like their elements cancelled each other out - Hart pretending to be a hitman could've been a lot funnier.",
    "date": "2023-09-12"
  }
]