[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love how light hearted this movie is! It’s a lot of fun to watch!",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was the best hallmark movie I had seen in a very long time. It had some of favourite cast from b99, the characters felt just as silly and nostalgic as I remember christmas movies being when I kid. This type of movie isn’t meant to be over-critiqued, it’s meant to be embraced with open arms, free of judgement, and recognize what the meaning of christmas is again in a world so disconnected from our own communities. I’ve found a lot of joy and comfort in watching this movie, maybe even sparked hope that not all new movies are lifeless and boring. It’s a christmas miracle!",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Der Film ist der mit Abstand schlechteste den ich je gesehen habe. Eine schreckliche Kulisse, ein nerviger echt idiotischer Sheriff, dümmliche Protagonisten, null gedanklichen Inhalt, richtig miese Satire auf Pretty Woman und ein dümmlicher, naiver Hauptdarsteller der, wie der Film schon aussagt, einen heißen Schneemann darstellen sollte, was aufgrund der echt schlecht aufgehalten Brustmuskeln, dem dümmlichen Gesichtsausdruck, der seltsamen Frisur und der extrem dünnen Lippen absolut nicht gelingt. Der Film ist weder liebenswert, noch romantisch noch amüsant. Wirklich eine unglaubliche Beleidigung für jeden Zuschauer der auch nur einen Hauch von Niveau und Geschmack besitzt. Einfach eine unglaubliche Zeitverschwendung.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I mean it is literally not good.",
    "date": "2025-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "once again, a film where the problem is not its premise but rather everything else, a woman who takes care of someone, protecting them and showing them the world, doesn't that sound like a... mother??!, what kind of passions are these?, once again a Swiss cheese film, with holes and holes, a weak script.",
    "date": "2025-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Frosty is canonically a lovable idiot. A subtle satire of the Hallmark Christmas movies that is in on the joke, but walks the line so finely that it ironically is a solid version of the feel-good, festive films it is satirizing. While the tongue in cheek aspect might be confusing or even off-putting to the target audience, its unique tone helps distinguish it from the heaps of Christmas movies on streaming services. Dustin Milligan plays a decent himbo made of snow, while Lacey Chabert delivers one of her signature flat performances in straight-to-streaming Christmas films. It’s ultimately the comedic performances of Craig Robinson, Joe Lo Truglio and Katy Mixon Greer that elevate the film.",
    "date": "2025-05-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I wanted a light rom com and thought I was prepared to enjoy the intentionally silly plot, but I don’t know how I got through it.  The cast did their best with the material and I felt for them.  Wish I’d cleaned my oven instead.",
    "date": "2025-01-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Direção: Ok\nAtuação: Ok\nRoteiro: Ok\nCaracterização: Ok\nSoundtrack: Bom",
    "date": "2025-01-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Frosty felt too old to be innocent. Like-you’re not a baby, figure it out. Also, seemed like he had three frosty babies rolling around with the strong preexisting dad vibes, lack of chemistry, and the weird bad boy undertones that reminded me in their subtlety of Edward scissor hands…the charm and nuance that make the latter so good. Frosty felt desperate and in a desperate environment. Would watch again very drunk.",
    "date": "2024-12-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "An amazing movie, where cinema and art truly joined. Worth every penny of my my Netflix subscription. I loved everything thing about this high on drug master piece. Please watch it!",
    "date": "2024-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I luv this silly but wholesome Christmas movie",
    "date": "2024-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Cheesy story about how a snowman figure suddenly coming back to life. Despite it being cheesy, it does fit on the comedy section. There is romance and love that was shown and not overbearing to watch. It nevertheless introduces a woman who missed her husband and then magic helped her found love. There were many funny bits which may seem too much for the older audience, but I understand the necessity of it. It never struck me as how a snowman turns out to be a fast learner and a girl magnet at the same time. Would I watch it again? Maybe not. But is it worth watching for the first time? Sure!",
    "date": "2024-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Y'all love those kinds of Christmas rom-com movies?  Well, do I have just the one for you, and this one is gonna make ya feel Hot and Frosty.  Jokes aside, yes, this is what you expect a cliche filled type of Christmas romantic comedy type of movie.  Lonely widow trying to have a heart towards along with a dorky dude that is like Frosty the Snowman but instead of a magical hat, he comes to life from a magical scarf, which isn't explained much except it's just magic.\nNow everyone performed okay as the script goes along with plenty of absurd decisions, but it's just how much of the romantic comedy cheese that you would get.  Of course, the center of attention being Jack, the snowman, being a nice guy while helping everyone in town.  To be fair, how can you hate this guy?  Matter of fact, you can't be mad at everyone when you can get a laugh out of most of the humor in this.\nMovie delivered some charm, delivered some humor and out of all of the cheese that you'd get out of this, you might just have fun with it, if you're bored and just wanted to watch it with your loved one.  Or if you're single and a hopeless romantic, you might also get some enjoyment out of this.\nAt the end of the day, this is certainly how you expect from Netflix making a kind of Hallmark movie that you'd see on occasion.  A bad kind of movie?  Maybe.  Did I still have fun with it?  Sure.  It might as well be one of those so bad, it's good for a handful of folks all around during the Christmas month since this movie screams Christmas romantic comedy.\nI'll give this movie six snowman coming to life, with the magical scarf covering him up out of ten.  6/10.",
    "date": "2024-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I originally stopped watching it because I wasn't a fan of it initially. However I tried it again with my wife and I have to admit, I had a lot of laughs. \n\nI'm a big fan of the cast chosen for the comedic relief, and they didn't disappoint. That, and the actor that played Jack pulled off a damn fine performance. \n\nOverall, I'm surprised to say it was one I'll watch again! \n\nI also loved that there were so many Canadian performers.",
    "date": "2024-12-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "You can take Lacey out of Hallmark but you can’t take the Hallmark out of Lacey.",
    "date": "2024-12-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It isn't going to win any awards - but don't take it so seriously. If you do, then it is not enjoyable. But if you allow yourself to be charmed, it is somewhat satisfying. Dustin Milligan was ripped AF, but also looked like he needed to eat. Lacey Chabert is always very charming. The sheriff was the most annoying thing about the movie. Lauren Holly was hilarious and her role should have been expanded.",
    "date": "2024-12-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's definitely not going to win any oscars but it's a very fun, cheesy, feel-good film all the same. My boyfriend and I thought it was ridiculous and entertaining.",
    "date": "2024-12-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I watched it because it was filmed in Ottawa and Brockville Ontario  Canada .It is nice to watch films like this that put you in X MAS spirit .Will watch it again during the holidays.",
    "date": "2024-12-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Honestly the worst film I’ve watched this year! It’s genuinely spoilt Christmas for me. \n\nAfter watching this film I feel depressed… and I’ve gone into downwards spiral since… I used to love Christmas but since watching the film it’s the worst time of year for me. \n\nIt’s a shame to humanity that people have made copious amount of money on such drivel.",
    "date": "2024-12-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was so fun! I haven't enjoyed a movie so much in a long time. Frosty is so charming and handsome. The man I follow every day is so much like hot frosty. When I show him this movie he is bound to realize we belong together because I am just like the lead girl! (The only difference is that I am not a widow like her!) If only Mark Hansen would say he loved me back like hot frosty did. I also have two cops on my tail like the silly cops in the movie. It took some of the weight off knowing that the town will take my side if the cops ever catch me. Baravissimo to an excellent movie with an excellent lead!",
    "date": "2024-12-24"
  }
]