[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved these movies there needs to be a part 4",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I watch romcoms to sleep, since the plot is pretty much always the same. This one kept me awake. Halfway through it I figured it had to be from a fanfic and guess what?? \nI can't judge the original book since it was literally written by a 15yo, but why adapt this?",
    "date": "2025-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "they keep saying jacob elordi is the hottest guy in school because otherwise no one would think it",
    "date": "2025-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The Kissing Booth deploys every rom-com cliché in the book with little care given to achieving any real sentiment.",
    "date": "2025-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie is so unbearably cringey , the acting is horrible and the couple itself has no chemistry. The best friend and her pact with him is so bizzare",
    "date": "2025-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "pelo menos para minha idade, esse filme é daqueles que deve assistir. é um teen romance super incrível, e eu sou apaixonada no noah flynn (jacob elordi) principalmente por conta desse filme. a joey king nao me impressiona tanto na atuacao, mas é uma producao que me marcou bastante. tem um lugar no meu coracao. sempre vou amar a amizade da elle com o lee. espetacular e marcante pra mim.",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "i freaking love cringey teen romance movies. idk why everyone hates it🙄🙄🙄",
    "date": "2025-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I am a sucker for cringeworthy teen romance lmao",
    "date": "2025-04-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The kissing booth is a rom-com directed by Vince Marcello in 2018 \nthe lead actors other than her are Joey King place the rôle of Ella Evans y Jacob Elordi place the role of Noah Flynn and Joel Courtney place the role of Lee Flynn \nIt's the story of two brothers, one of whom has had a best friend since birth the other is a bad boy but falls in love with the best friend in question \nNoah flynn y Ella Evans live their love story behind the back of Lee Flynn but this brings them problems\n\nI think it's a good film mixing love and comedy. The actors play quite well despite their great ages for their roles as teenagers.\n\nThe sets are pretty good except in some shots where the green background is too present. \n\nFinally, this film is cool to watch to spend a funny and exciting time",
    "date": "2025-03-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Hard to Rate\nThe acting was good, for the type of movie it was. The chemistry was great. I liked all of the main characters, but the writers WTF? They blamed the love interest for what the main female character was responsible for? WTF? Did I miss why everyone hated the love interest as well? I mean, sure, maybe they didn't think he was right for her, I get that, but they all seemed to actively DISLIKE him. EVERYONE in the mc's life hated him. I didn't get that at all.",
    "date": "2025-02-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Elle and Noah relationship is not only extremely toxic, but is also barely legal, wich made me uncomfortable most of the movie.\nLee character is just so dumb, how tf he doesn´t realize that the rules they made when they were kids are so stupid?",
    "date": "2025-01-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I absolutely love this movie as well as the kissing booth 2 and 3 I can not stop watching them they are just too good!!!! I would 💯% recommend this movie to you if you want to watch a romance film it is amazinggggggggggg and I really wish they would make another movie because I would definitely watch it and if you haven’t watched yet I recommend you go watch it asap",
    "date": "2025-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I cannot comprehend what trash I have just watched. This is the president of the sexually driven, low budget \"romance\" movies that have destroyed the romcom genre. The only nice thing in this movie is the cute montage at the start of the movie.",
    "date": "2024-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It's Girl Screams: The Movie",
    "date": "2024-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie is really bad. I was forced to watch this with my ex and i just slept through the first and the second because of how boring and cringy they were..  she had to cheat on me and made me watch these shitty movies.. I guess i should've taken it as a red flag when she made me watch this.",
    "date": "2024-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Truly one of the worst films i have ever sat through…bordering on hilarious for it’s unbelievability and tired, modern tropes. Not worth the watch.",
    "date": "2024-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie should just be labeled as a comedy. The cringiest movie ever. The predictability and sheer cliche plot made it absolutely laughable. I couldn’t stop laughing, this is what i imagine to be 9 year old girl gold.Absolutely horrific. Visualise all the bad preteen high school movies and put them in one and poof you have created the kissing booth. Tbf it was a good laugh.",
    "date": "2024-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is not groundbreaking cinema but a good time. This movie is meant for you to shut off your brain and have a good time. I loved it when it came out and I loved it now.",
    "date": "2024-06-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "the shittiest movie ever",
    "date": "2024-04-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Was not a pleasant movie to watch. The dialogue was cringy, almost seemed that they brought random words used by teenagers to make it seem relatable. It was not.",
    "date": "2024-03-19"
  }
]