[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very nice!!!! And I love it! Don't forget subscribe Lambman Butcher Studios on YouTube and follow on tiktok",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Perfect 👌 movie for a movie night",
    "date": "2025-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Super smooth transitions.\nHilarious sense of humor.\nIdentic to the books series.\nIf this isnt incredible\nI dont know what it is.",
    "date": "2025-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One word\n\nPeak\n\n25,000,000,000,000/10 I don't even have to explain it",
    "date": "2025-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "ARE YOU WORRIED ‘BOUT IMPENDING DOOM?\n\nDA DA\n\nTHIS EVIL VILLAINS GOT YOU FILLED WITH GLOOM?\n\nDA DA\n\nWELL DON’T YOU FEAR, THERES A HERO IN THE SKY, THE SKY, THE SKY!!\n\nDAH DA DAN!\n\nITS NOT A BIRD AND ITS NOT A PLANE!\n\nHONK HONK\n\nAND ITS NOT AN EGG SALAD SANDWICH!!!\n\nITS THE WAISTBAND WARRIOR, HEAR HIS MIGHTY BATTLE CRY:\n\nTRA-LA-LAAAA!!!\n\nHEY WATCH OUT CRIME!\n\n(UNDERPANTS)\n\nITS WEDGIE POWER TIME!\n\nNAH NAH NAH NAH NAH\n\nCAPTAIN UNDERPANTS \n\nYEAH YEAH YEAH!!!",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Captain Underpants is not good as  Dog Man, And I would say the movie is horrible due to childish stuff.",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Great because it is about this two friends called George and Harold and thy love to draw comics but there best comic is the amazing Captain Underpants but there principal Mr. Krupp doesn’t like fun things so When George has a hypnotising ring he hypnotises Mr. Krupp and he turns him into Captain Underpants it is so funny 🤣 and there is this villain called Professor Poopy Pants who wants to get rid of laughter because everyone makes fun of his name because is sound weird and funny and there is this one kid in Gorge and Harold’s class named Melvin and he doesn’t get any jokes so Professor Poopy Pants uses Melvin to control one of his inventions the special toilet so Professor Poopy Pants make the toilet big using is gun that makes things small or large but so Captain Underpants stops him great movie 7/10",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 29 minutes!!!!!!! Rated PG for Mild Rude Humor Throughout!!!!!!!!!!!!!!!!!!!! The USA grossed over $73,900,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Happy 8th anniversary!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Based on the graphic novel series!!!!!!!!!!!!!!!",
    "date": "2025-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "One heck of a movie. Honestly it’s almost absolutely brilliant, amazing prequels and I just don’t see a problem with most of it. definitely deserves a sequel, 3 out of 5 stars.",
    "date": "2025-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This is a really funny movie that needs a sequel!!!",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie is really fun and beautifully animated. I also especially like how this movie takes a kind of stale plot and makes something great out of it, especially considering the source material is about a naked middle aged man defeating potty humor named villains. Well done DreamWorks 👏",
    "date": "2025-05-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It's faithful to the books, but the film really just seems a mess of mindless potty humor. I don't like George and Harold being voiced by adults.",
    "date": "2025-05-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A movie about a grown man running around in underwear should not work but it really does",
    "date": "2025-05-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "TRA-LA-LAAAAAAAAAAAAAAA",
    "date": "2025-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Truly a hilarious movie that will leave kids alike happy.",
    "date": "2025-04-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is absolutely amazing. It is funny and incorporates many fun Easter eggs relating to the comics. The plot of the movie is easy to follow and there is rarely a boring moment. It’s one of those movies that make you want to stay in your seat all the way through. \n\nIn conclusion the Captain Underpants movie is a child friendly movie that fun to watch no matter your age.",
    "date": "2025-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Captain Underpants: the first epic movie is a perfect adaptation of the books. the animation and personality of the characters is just so good! the turbo toilet 2000 also manage to make it in the movie, which I thought was really cool. the humor is splendid! and I wish this movie felt a bit longer. the pacing was not terrible, but also not great. but still pretty entertaining throughout the entire movie! overall, if you love potty humor, you will love this movie, 8.5/10.",
    "date": "2025-04-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Captain Underpants is a very creative and goofy book series. Some superheroes look like they are flying around in their underwear. Captain Underpants is naked, goofy, and hilarious! This movie will cheer up kids and adults of all ages!",
    "date": "2025-03-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This has to be one of the worst movies I've ever seen. Captain Underpants: The First Epic Movie is just bad.",
    "date": "2025-03-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Faithful to source material and fun and bright enough, just very immature.",
    "date": "2025-03-17"
  }
]