[
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "If 'Die Hard 2' didn't exist, then this would be Die Hard 2.\nBut it does exist.\nSo it isn't.\nExcept, it is.\nOr what's that James Bond film with the airport scene?\nMaybe it's that.\nSome of the scenes are ludicrous, completely unbelievable. And yet, still, it's worth a watch. Can't explain or justify why 😂",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This movie certainly has its boring moments, but it’s certainly still worth a watch for the mystery and thriller elements! Watch out for that car chase - 10/10 scene",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Not perfect, but well acted and great fun.",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I enjoyed this movie. I thought it was a lot of fun and had some truly thrilling moments. It was fun to put myself in the protagonists position and see how I would respond. The movie does have some unbelievability or even thoughts of \"why didn't he do this or that\", but overall I would recommend it as a really fun movie.",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Ok but a bit predictable in parts.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Rarely you can describe a movie with just one word but here we can do that. STUPID",
    "date": "2025-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "ABSOLUTE TRIPE!! FACT!!...",
    "date": "2025-10-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "well-executed, clean-cut, smart movie. Everything is done well. The actors really nailed these roles, particularly Ethan: subtle, natural, likable, and not too showy while leaving room for growth as the plot expanded. A feeling of close confinement defines this movie, with the entire plot feeling tense, quick, and inescapable.",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Even Bateman couldn't save the movie from the myriad of tropes, the least of which is the ending. Oddly timed humor, painfully unrealistic depiction of an airport, and it leaves a viewing with one lesson: LAX must be a sanctuary city.",
    "date": "2025-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is so good. great story, good action, and great emotion. I was on the edge of my seat the whole time.",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved this film a shame it wasn't in theaters it would have done well. Great amazing action can't wait to watch again 😀.",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Really good film. Not too deep, tense at times a good watch for a wet afternoon. 👍🏻",
    "date": "2025-09-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "One word: TAUT! This movie is a credit to the genre. Out-of-the-box plot, twist, twist, twist, non-stop tension and conflict, never 'jumps-the-shark\", terrifically acted, directed, and a really good script, which should give a clue as to why Bateman and Egerton were signed on. Once all the exposition is out of the way, it's one hell of a ride. Rotten Tomatoes PopcornMeter, or whatever it is, gives it a mediocre score, while the Critics give it a VERY respectable 88. Trust the Critics on this one.",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I really dont get the Hate for this Movie, it had a fantastic Storyline and was the whole time very thrilling, the Actors and Action Scenes were great and even though there were some Scenes that were not necessarily needed it still didn't made a huge difference to me, Overall a very good Movie and probably one of the most exciting ones that has been released last year, crazy I only now have been watching this.",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "We loved this movie. Don’t listen to the bad reviews. It was sooo goooddddd",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Actors were good. Writing was abysmal! Worst writing, so many plot holes, wasted acting talent. Come on Netflix - who did you hire- the writer from Serial Ape-ist?!\n\nNetflix has become like old Hollywood. Crappy writing, studio actors cranking out garbage formulaic films. Please do better.",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It had me on the edge of my seat, the guy is kinda dumb though and makes the worst possible decisions but still good movie.",
    "date": "2025-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The worst writing ever. Ethan, the protagonist, is extremely dumb and makes zero smart moves, reflecting the writer's IQ. It's astonishing that this movie gets 88% rating here. I gotta say the critiques on this site have rotten brains just like TJ Fixman.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Suspension of disbelief is difficult in this one.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The concept was decent but the actual storyline and writing is painful.  There was nothing realistic about any of this and the pacing was all over the place.  Can't believe there is a consideration for sequel to this movie (I just read that somewhere)",
    "date": "2025-08-04"
  }
]