[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "My favorite movie out of all of them.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 02 hours, 26 minutes, and 14 seconds!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated PG-13 for Intense Sequences of Violence/Action, A Suggestive Situation, Language, Some Frightening Images and Thematic Elements!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The worldwide gross is $869,070,923.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Jennifer Lawrence should have won her Oscar for this film instead.",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This was just so boring not as good as the first one",
    "date": "2025-09-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Phenomenal story, deep lore, great performance by Jennifer Lawrence and co. This movie tops the first movie in my opinion in almost every way. This is a great movie!! Gets you unemotionally invested and is super suspenseful. Nearly perfect!!",
    "date": "2025-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This definitely the best addition to the franchise as a rebellion is starting to form in Panem with Katniss as the face of hope, Snow tries to control her narrative. I liked how they switched it up having all the victors play in the Hunger Games but I don't care about the campaigning.",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A step up from its predecessor, with deeper character development and expanded world-building. However, noticeable continuity errors, plot inconsistencies, and an abrupt ending hold it back from been a masterpiece.",
    "date": "2025-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The best of the series!",
    "date": "2025-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "“The Dark Knight of the Hunger Games franchise. This is some Empire Strikes Back level of film with so much underlying themes about grief/loss, struggles/survival all being presented as entertainment for those cheering on the ruthlessness of the games and for us at home, who want to see all the survivors win - in particular, Katniss Everdeen, a very convincing, Oscar-Worthy, career defining Jennifer Lawrence who channels every single human emotion on screen of someone who is completely emotionally and mentally distraught by the circumstances she found herself in but has no other choice then to stay and fight. \n\nFrom indifference to horror shock to helplessness - as her character navigates through stress, PTSD/survivor’s guilt and grief - and finally the internal and external rage that courses through in her expressions and body movements. You are watching a professional. \n\nEverything is heightened here. The other supporting characters are at their A game even Elizabeth Banks and Woody Harrelson are fleshing out their characters nicely. This is a film about trying and standing defiantly against all odds no matter how daunting it is or how high the climb may be.",
    "date": "2025-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "7.9/10\n\nGood movie but they just keep getting worse from here",
    "date": "2025-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The best movie of all the series. An excellent balance between action and story.",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A good sequel. I enjoy this franchise. The books are good. There is another Hunger Games Battle Royale in this film. There are some other books in the series like “The Ballad of Songbirds and Snakes” and “Sunrise on the Reaping”.",
    "date": "2025-06-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Everything good about the first is massively improved in this sequel.",
    "date": "2025-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Once again a great hunger games film, a small step down from the original but still very enjoyable.",
    "date": "2025-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Absolute dogshit of a movie...",
    "date": "2025-05-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This is the best book and movie of the hunger games franchise. Definitely recommend it!",
    "date": "2025-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Way better than the first one.",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is the best book adaptation I have ever seen. This movie comes with suspense, fear, humor, and a love for the characters.",
    "date": "2025-04-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Most people think that this is the best in the series but I disagree. You can’t beat the original. On some parts, Yes, I think it’s better. But overall I’d rather watch the first one but only by a slim line. They are both as good as each other.",
    "date": "2025-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "AMAZING!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-03-23"
  }
]