[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Silverton Siege is a South African film partially based on a true story that raises questions about freedom, slavery and injustice. Composed of a script that takes certain creative licenses when narrating the story, but that is far beyond being a film about the search for freedom.\n\nSilverton Siege chronicles the events that accidentally triggered the \"Nelson Mandela Freedom Movement. An emotional film full of feelings of justice and liberation. With outstanding performances and a fairly acceptable editing, the film is permeated by constant tension and by the unbridled rhythm of a group of people who find themselves involved in a spiral where everything seems to be getting worse. An unmissable and indispensable story.\n\n\"It always seems impossible until it's done, Silverton Siege uses certain licenses to tell a story that deserves to be told\"",
    "date": "2022-05-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I don't know how this film got such a high approval rating, it's absolute garbage. The combination of action and melodrama just doesn't jel. It feels like a film that doesn't know whether it wants to be an action narrative with social commentary, or a soap opera. None of the characters are likable, I don't find myself rooting for the hostage takers (even if their cause is noble) nor do I find myself empathising with the hostages (the white supremist bank manager and the albino girl who thinks she's white are probably the LEAST likable in the film). The pace of the movie is good, but all the tension and build up doesn't seem to lead anywhere because the hostage takers don't actually kill anyone, nor do the police kill the hostage takers (even though they have MULTIPLE clear shots - which could have ended the entire prolonged ordeal) - so how are we as viewers suppose to feel scared for the hostages (or the hostage takers) if no one is being killed. Furthermore, this film was shot fairly ok, but it has a weird dull orange tint/filter applied to it, which just makes the whole thing feel so depressing and lackluster (in fact I would even go so far as to say that this film could've done better as a short story or mini-film - but not a full 1hour and 40mins) This film does however have one saving grace: Arnold Vosloo. He's always been an incredible actor and he gives a really good performance with the material he's been given. My verdict: Zero. But I'll give an extra half star just for Arnold Vosloo's performance. Final verdict: Half a Star",
    "date": "2022-05-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Incredible sorry that must be told and never forgotten!",
    "date": "2022-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Enjoyed this one even though I had to have the captions on as I have a hard time with accents.  The early anti-apartheid fighters or to the other side terrorist wanted to blow the diesel storage tanks up  (S. Africa as with Nazi Germany found a way to turn coal into diesel).  There a whistleblower and the group then holds a bank hostage.  Watch it.",
    "date": "2022-05-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What a fantastic movie. It shows that we never must go back to apartheid",
    "date": "2022-05-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This crime drama was great. Arnold Vosloo, Elani Dekker, Thabo Rametsi, Noxolo Dlamini, and the rest of the cast did a great job in this movie. This true story about anti-apartheid members planning a sabotage mission that went wrong and ends up in a bank hostage situation was intense, dramatic, and suspenseful. It's about fighting for freedom and being treated equally. If you're a Netflix member, you should watch this movie sometime. It's worth watching.",
    "date": "2022-05-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Started off to watch a movie while doing some stuff but I was unable to do anything as I was hooked to watch from start to end. The main characters' acting makes you want more.\n\nThis movie doesn't patronize terrorists or the crimes they make. This movie also didn't show too much blood and violence. Instead, the movie evokes the nationality in you and shows that violence doesn't always solve your or your nation's problems.\n\nRefreshing to watch and the message for freedom is strong. As a citizen of a colonized country, watching \"Silverton Siege\" triggered a lot of emotions and made me re-think about my perception of freedom so I gave it a 4 out of 5.",
    "date": "2022-05-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I fully enjoyed it for its entertainment value. I never attempt to pick apart a piece of art to see how it works as it spoils the whole experience. The fact that I was able to get through the whole production was proof to me that it kept me involved.",
    "date": "2022-05-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Silly and cliche. They even had a pregnant woman in the hostage situation.",
    "date": "2022-05-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is an epic, important South African movie. Well shot with great acting.",
    "date": "2022-04-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Silverton Siege\n\n\"You don't know me; you think it's easy being me, looking the way I do, people constantly sniggering and debating who I am, you don't know me.\"\n\nSilverton Siege is a South African thriller movie penned by Sabelo Mgidi in his screenwriting debut; the film is solid and magnificently shot by the careful and dazzling eye of Shaun Harley Lee. Silverton Siege is a different genre from Dube's previous movies, and he follows the format of a thriller instead of a straight-up, vanilla biopic.\n\nThe cast includes Thabo Rametsi, who is proving to be a Netflix fixture with titles like Kalushi: The Story of Solomon Mahlangu and Amandla, both titles are available on Netflix. Arnold Vosloo needs no introduction. Noxolo Dlamini, Stefan Erasmus, Tumisho Masha, and Michelle Mosalakae are among others in the cast.\nThe film follows the story of three MK agents, Stephen Mafoko, Humphrey Makhubo, and Wilfred Madela, on a mission that suffered sabotage and tactical ineptitude from the police force; the three MK agents find refuge at a Volkskas bank in Pretoria East next to Mamelodi.\n\nThe pacing of the film is even. The film escalates tension, instantly raising the stakes due to the thriller genre. Mandlkayise Dube dwells in exposing the characters. He uses the story to show their transformation; in a typical movie, the main character undergoes the character arc, but Dube makes everyone a \"main character,\" and we see people shift, even the character actors. The centerpiece of the bank is circular, showing a movement that runs endlessly forward. Even the entire bank is circular, marking how actions reverberate through time. This motif may hint at the conversation that needs to occur to highlight our issues as a country – at some point, measures need to follow and not end up with circular conversations.\n\nThe conflict element of storytelling is worrying. Calvin and Terra cannot take life per the orders from High Command \"No civilian casualties!\" There is no atmosphere of danger due to the straitjacket the characters are wearing. When Calvin (Thabo Rametsi) is outside burning cash, he is a sitting duck, and it is a mystery how come no shot took him when the SWAT team had clean shots over a dozen times he was exposed. Partly Johan Langerman is responsible as he issued no order to kill even though his superior wanted it. There were many occasions when the trio was vulnerable to countermoves by the hostage and the police, but none were taken.\nDube enjoys drowning his characters in massive sets that are almost ant-sized compared to the set. The same thing was done with Mr. Deeds (2012) with Adam Sandler; having inherited billions, he is set in a world too big, including giant bed, mansion, cars, etc. This motif is essential in that it highlights the powerlessness of the characters against an entire state of the National Party; however, they were part of a national resistance militia (Umkhonto Wesizwe). The three in this setting were alone, outnumbered, and vulnerable. Throughout this film, one feels that they have no bargaining chip or cannot negotiate themselves out of the mess. This reveals that these were not trained soldiers but a militia with mini tactical skills. The lack of tactical acumen is seen in the shooting scenes in Silverton before being trapped in a bank; there are two scenes where all three have their backs to the police force in hot pursuit, and they follow no staggered tactical movement forward where one uses fire to cover the other two. Then another assumes the cover position to assist the previous operative in advancing. One soon realizes that this will be a brutal fight for our protagonists, setting a foreboding atmosphere of fear.\nThe film uses poetic justice to play controversial liberation struggle songs that would not be appropriate in any other setting. The film uses this responsibly to punctuate the theme of the struggle.\n\nSilverton Siege echoes from Wakanda with the war cry, Ibambe. It's a wink to the Marvel Cinematic Accident that I believe is accidental rather than deliberate.\n\nProduction design done by Chantel Carter (Daryn's Gym, Fiela se Kind)  takes the cup in that they went all out in transporting the audience back to the '80s, using cars, aircraft that reek of the 80s vibe, even the orange payphone reminds us of years gone by. Same with costume design done by Ruy Filipe (Hotel Rwanda, Mandela: Long Walk to Freedom), one can imagine the mammoth task of putting together a legit police uniform; there was a concern with the yellow shirt by Aldo Erasmus's character (Stefan Erasmus), but one later realizes that it was the filmmaker's way of telling us that he is the Judas Iscariot of the movie, yellow is a color of caution as depicted in the traffic lights, how does a covert operative wear loud colors in the middle of an operation. The filmmakers hid this very well as it was a shocking twist in the movie that one does not see coming.\n\nThabo Rametsi plays Calvin Khumalo in a movie setting. Calvin is a scary name seeing that the alien creature in the movie Life (2017) is named Calvin, a very malevolent antagonist, while Calvin Khumalo is the brains of the unit in Silverton Siege, unlike his namesake, he is a peacemaker. Arnold Vosloo, having played Habib Marwan in 24, a very menacing and memorable character, is trapped by duty in Silverton Siege. He wants a safe outcome for everyone, and he has an impossible task of appeasing the terrorist and the police from decimating each other and the hostages. He approaches the role in a muted fashion without being overbearing. Vosloo is a seasoned actor and is humble to be billed second after Thabo Rametsi in the ending credits, and his presence anchors the movie.\n\nThe movie is woke in that it includes a female character in the lead, none of the Silverton Siege trio were women, but Noxolo sank her teeth in the role; filmmakers have to tell the story using poetic justice to move a little away from the historical setting and present a thriller movie that is nonetheless educational.\nThe film uses Digital Melanin Cinematography to depict dark-skinned characters fairly. Dube is passionate about cinema and wants every frame captured with integrity and artistic flair.\n\nThe film is much better in production values than Dube's previous installment.\nThe film uses a new technology called Digital Melanin Cinematography; it seeks to render dark-skinned characters in their native hue; movies like Moonlight (2016) have a similar ethos.",
    "date": "2022-04-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Not sure how much was a true event but it's bring more lights that the darker side, pretty enjoyable.",
    "date": "2022-04-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Predictable. Dull. Full of stock characters and situations. Unimaginative. The facts are questionable at best. Badly made. Very disappointing.",
    "date": "2022-04-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A half-baked, hackneyed and poorly executed attempt. The story is not factual. The director seeks to lionize a group of common bank robbers - why? Their intentions were not noble. Like most of the ANC, they were simply crooks who caused the death of innocent people. Don't waste your time watching this pile of garbage.",
    "date": "2022-04-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The best S.A. film I've seen, and another Netflix win! I really liked the fact this was NOT a typical Hollywood-style \"based on true events\" film. It felt real, like it was a live news segment. Newb South African director Mandla Dube in his second directorial debut gives us near perfect directing, even with his cast direction. Just as impressive was the writing by amateur Sabelo Mgidi in their first ever writing credit. The screenplay wasn't perfect (I wanted to know more about the older black lady), but it was better than I've seen some seasoned writers come up with lately. The 100 min runtime and great pacing were well used, I actually wanted more. It was pretty much non-stop thrills and suspense. I really enjoyed the story and its relation to Mandela's voices for freedom.\n\nThe cinematography and color palettes were spot-on, as were the sets and props to reflect the 80's era. The score was fitting and the sound on point. But most impressive was the convincing and outstanding performances by the three leads portraying activists, who are pretty much unknown newb actors that gave award-worthy performances. \n\nI really didn't expect much from the low ratings and reviews from the wannabe critics, but I was pleasantly impressed with the entire production. If you enjoy \"true events\" films especially historical ones, this is a must see. It's a well deserved 9/10 from me.",
    "date": "2022-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a really really great film that shows the harsh reality of living in Apartheid south Africa, and which takes place mostly in Pretoria, showing the dynamics of Afrikaaner power and the oppression of the Zulu, and what must be done, and who double-crosses who, and the rest of what goes down in an action packed flic. I have lost faith in Netflix mostly since one of their staff went on a racist rant and with all the crap they are releasing lately, but this is a great one and is highly recommended as it eventually becomes apparent this is about the release of Nelson Mandela.\nIs is funny and harsh that Montreal lawyer Irwin Kolter was quite pivotal in getting Mandela out of prison and the local anti-semite Yves Engler is now ragging on Kotler: the point is racists and their apologists are still alive and well and Madela's legacy continues to reverberate and racists and antisemites continue to try to silence those that fight for what Mandela struggled for.\nGood movie. Continued debate.",
    "date": "2022-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's nice to see how many people get offended when a movie with black people is released. I think they are mad because someone decided to fight a racial dictatorship. Is funny because people like Roosevelt, Stalin, Churchill and Hitler fu*#$d the world in the 20th century, while while Gandhi, King and Mandela were men of peace, preaching nonviolent resistance to those regimes.\nIs a must watch.",
    "date": "2022-04-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "One of the best movies on neflix and i loved the characters and the ending.\nbut please search for the real story i think it should have adopted more of the original events but still is a good movie",
    "date": "2022-04-27"
  }
]