[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1 hour and 36 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated PG-13 for Some Strong Language!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "An engaging insight into a seminal moment in music history.",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I think Bob Dylan is the representation of what my social skills are.\n\nThe Greatest Night in Pop is a wonderful documentary that flawlessly portrays one of the most important nights in music history. It’s amazing how, in just a few hours, they managed to bring together the most influential artists of the time and coordinate something as ambitious as “We Are the World.” The direction and archival footage capture perfectly the energy, the tension, and the magic that filled the studio that night. Watching so many distinct voices come together for a common cause is moving and a clear reminder of why that night remains unforgettable in popular culture. A heartfelt tribute to an unrepeatable moment.",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "How the hell did they get all these legends in one room? This is such a fun doc, especially seeing the behind-the-scenes of artists working together (and clashing, lol). Stevie Wonder just vibing out while everyone tries to get it right is *chef’s kiss*.",
    "date": "2025-03-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was great watching it all come together with most artists helping each other and some walking out! The voices are amazing!",
    "date": "2025-02-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This was such a fun watch! Seeing *We Are the World* come together with so many legendary musicians was incredible. Even if you don’t know much about music (like me), you *know* this song and that moment—it’s just that iconic. Lionel Richie steals the show as a storyteller, and it’s so cool to see these superstars acting like regular people, getting nervous, or even starstruck. The chemistry between everyone is amazing, with spontaneous sing-alongs and funny little moments that feel so real. It’s funny, heartwarming, and even emotional at times.  \n\nThe footage is fantastic, and hearing all these big names talk about it gives such insight into the process. My only gripe? I wish they had gone deeper into why the song was made and what it meant for the world. Still, it’s an awesome snapshot of music history. A solid 3.5 stars!",
    "date": "2024-12-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "No es mi favorita está entretenida pero es lenta",
    "date": "2024-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Not simply a retrospective. It's a taught thriller with a ticking time bomb element you won't believe until you watch it. How they pulled it off was amazing!",
    "date": "2024-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Solid documentary, but I'm not a huge fan of the genre.",
    "date": "2024-06-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Após ficar ciente de que haveria um documentário falando sobre os bastidores da música We Are The World, eu fiquei me perguntando pq demorou tanto tempo assim pra falar de uma obra em que reuniu os maiores nomes dos anos 60, 70, e 80 e principalmente iríamos descobrir como Quincy, Lionel, Michael e Wonder chegaram a esse feito. Já na Introdução senti falta de um aprofundamento na causa por trás da reunião de grandes artistas. Somos apresentados a Harry BeLafonte o precursor da causa que seria o motivo dessa reunião tão poderosa, porém em um ritmo acelerado (talvez seja a edição acelerada e emocionada para nos falarmos como tudo isso aconteceu) faz nos esquecer do motivo e do por quê tudo issp aconteceu.\nUm dos produtores, Lionel Richie, que liderou o projeto e aqui nos conta com riqueza e emoção, nos convida a acompanhar e apreciar o comportamento de cada estrela do pop, soul e rock and roll. Cada gesto, cada incômodo, insegurança e principalmente a ansiedade de concluir um grande projeto. Faz com que o telespectador se sinta naquele ambiente rico e poderoso.",
    "date": "2024-05-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This chronicled an era and the stars that made it so special!",
    "date": "2024-05-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a song that was overplayed in the 1980s. For those who grew up then, we can sing it even if we don't really like that song. BUT... the story behind the making of this song is fascinating, and this documentary freezes in time the moment that our childhood icons gathered together in one room to make a difference.  Check your ego at the door and enjoy this wonderful documentary.",
    "date": "2024-04-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "In 1985, Harry Belafonte, Lionel Richie and Michael Jackson harnessed their talents to bring together some of the biggest music stars of the period and, over the course of an evening, creating We Are the World in an effort to address the famine disaster in Ethiopia.  The Greatest Night in Pop, a documentary that covers the process from writing of the song to the star-studded recording session, is relentlessly entertaining from beginning to end and a great piece of nostalgia for those who remember the time period.  Defying the odds, the singers (including the likes of Springsteen, Billy Joel, Stevie Wonder, Ray Charles and countless others) managed to check their egos at the door, for the most part, and dedicate an evening to saving lives.  Worth the price of admission alone are the shots of the always aloof Bob Dylan looking lost and more than a little confused throughout the session.",
    "date": "2024-04-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The film stretches to create any points of tension, which limits its potential as a great documentary. It's still quite the time capsule or artifact of music history.",
    "date": "2024-03-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Um documentário tão perfeito que deixou meu coração quentinho, essa música já era impactante tornou-se ainda mais diante do contexto lindo, Vou me abster de falar da ironia dos EUA estarem salvando a África, e apenas me encantar com o talento máximo desses artistas, Cindy Layper, delicinha, Tina, Steve, Michael, e o pobi do Bob Dylan que não sabe cantar...",
    "date": "2024-03-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Very joyful to see how they did that amazing song, among such a big and iconic singer is powerful.  how the left their proud outside to do that song is amazing. Watch it, you will know a lot of people on it for sure.",
    "date": "2024-03-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I would be utterly shocked if any other movie this year was more entertaining, more nostalgic and more personally meaningful to me than this documentary. I was a couple months shy of my 12th birthday when \"We are the World\" was recorded - I bought the 45rpm record, the audio cassette AND the sheet music so I could learn to play it on the piano. Watching this film not only reminded me of what a significant artistic moment this was in my life but what a significant moment it was in the history of music. To have the opportunity to not only watch those involved but see lots of never-before-seen footage - well, it was a surprisingly overwhelming experience. And it brought back a flood of memories! AND I learned so much - the singer they wanted involved but didn't come, the singer who got fed up and left, and the singer who became so inebriated he couldn't remember his part. But none of it is done in an exploitative or salacious manner. It's all love - even those who had some misgivings about the experience reminisce fondly. I doubt this will have the same impact upon those who didn't live through this moment in time. But for me, it was akin to watching family home movies - it indeed felt that personal. One of the great viewing experiences I've had in recent memory, and it's virtually impossible for me to be objective. - Jeff Marshall, Movie Blogger (Facebook)",
    "date": "2024-03-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Interesting, informative. Worth a watch.",
    "date": "2024-03-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "So I have seen the music video for we are the world multiple times, and when I found out they were making a documentary about the making of the video, I was intrigued. And it got me even more intrigued after I saw the trailer.\n\nSo Netflix's the greatest night in pop is the story of the Making of the huge we are the world collaboration on January 25, 1985, which featured dozens of the worlds top musicians at the time singing to raise awareness for famine in Ethiopia. Some of the artists include Lionel Richie, Michael Jackson, Cyndi Lauper, Bruce Springsteen, and Kenny Loggins. The Director of this movie is Bro Nguyen Who directed the Saturday night live documentary live from New York in 2015 and the Bruce Lee documentary be water in 2020\n\nSo there's a lot of positives with this documentary. This is an example of a documentary that utilizes interviews with people instead of just telling a straightforward story. I enjoy these type of documentaries because you get to hear from the people themselves with their experiences and it's not just the artists. You also get snippets from people behind the scenes that arranged The music and lighting. \n\nAnother thing I enjoyed Is that you get to see all the different things that added pressure to making this song a reality. Everything from controlling the egos of all of the artists involved to Doing it all in one night and especially after the American music awards, which happened right before hand with Lionel Ritchie hosting. They also had to deal with who would be singing the solos because you wanted different contrasts of voices\n\nThis is not necessarily a negative but it's a little disappointing that Michael Jackson is not around anymore because it would've been interesting to hear his perspective of the making of the song along with the other artists. \n\nSo my favorite decade of music is the 1980s. I am glad that I was able to watch this great documentary because it gave me more insight into this event. If you are a music fan or just a fan of the song, I recommend seeing it because you will get to see the process In a whole new view",
    "date": "2024-03-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I didn't expect this to be anything more than a nostalgic documentary about that famous song from 1984. Wow it was so much more. I never knew it was all filmed and sang in 1 night. Very emotionally moving and heartfelt. Best documentary I've seen in awhile. 👍❤️",
    "date": "2024-03-02"
  }
]