[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This might be the worst acted film I’ve ever seen. Absolutely abysmal. The plot is head achingly obvious, the acting, the acting, seriously the acting is sooooooooooooooo bad. Watched it on DVD. Awful.",
    "date": "2025-09-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A moment of inspiration has led me to look into Sarah Carter’s filmography, and this movie caught my attention. Clearly, she’s not the star of this movie, as the leads in this A-grade movie are the show and I have to admit this caught my eye for a while given they have done plenty of romance films. I finally decided to watch this because it was based on a similar event between a couple where an accident took the memory of the wife, with the husband doing all he could to uphold his love for this woman that saw him as a stranger.\n\nPaige and Leo are a young and beautiful married couple living their life in Chicago when an accident puts them into the hospital with Leo obtaining minor injuries but with Paige obtaining a mild case of amnesia that takes away five years of her life, with four of them being with her husband. Leo then gets unexpected help from Paige’s estranged family as she treats Leo like a stranger. As his memories from his first time meeting her and all the promises they have made, with extreme patience and love, Leo works his hardest to help his wife.\n\nThis looked good, and I did enjoy the movie, but at the same time I can’t help but feel disappointed that the fictional story was nowhere near as good as the real event. I get it, people often mistake passion without hard work, and especially without faith. Make no mistake, many of the actors in this movie are great, but the story was lacking and in many respects poor taste. Both performers, Rachel McAdams and Channing Tatum are great. The rest of the cast is marvelous, big and small, and they made it great. I still wish another thirty minutes were made, showing that the couple did more. All in all, a fine movie, just not a great one.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This film is based on a real-life happening. However, the way it is presented is very drawn-out and at times becomes tedious to watch, waiting to see the ending.",
    "date": "2025-06-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Why the \"based on a true story\" thing? I have a hard time feeling that this was actually really based on the couple. If it were they should have changed it a lot. \n\nThe premise is fantastic, and the execution was weird. The actors do what they normally do. Put with the right material they can perfectly charming. Maybe not strong enough to carry a poorly written movie? \n\nAnd that was what was so frustrating about this movie. If it were written better with more engaging lead characters it would have been a home run. Instead it was boring in parts. How? The concept is so great! I could not help but to be disappointed at the execution during this. I wanted so much to like this movie so much more. \n\nIn the end it is dull and somewhat forgettable. Dang, what a shame.",
    "date": "2025-01-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Pretty bad and annoying",
    "date": "2024-02-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "First whomever reworked and adapted the story did a TERRIBLE job. First, where were the wedding photos and picture albums? Where was the history for the relationship? The writers were very weak with building backstory. Also, being married the husband has the legal decision about his wife, especially if there has been mental incapacity not her estranged parents. Changing so much of the true information to fit their convoluted idea of this adaption of that real life story was irritating and just downright atrocious. The actors are the only thing that made the movie. But the storyline they created was infuriating rather than endearing. Unless you want to feel pissed off the wholw time don't bother watching.",
    "date": "2024-02-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I think \"The Vow\" is sweet enough to satisfy romance audiences and also give people something to watch as a date night movie. I do think the movie is romantic, but while watching it I felt so fixated on how sad and bleak this situation really is, and I felt kind of mixed about it by the time it ended. The two leads have good chemistry, but the movie never really allowed me to get to know them as individuals and just chooses to focus on them as a couple. I think there were layers that could have been explored here that are simply overlooked, but I still think the movie does a decent job at what it sets out to do. I do think some of the dialogue in the movie is not the best and overtly cheesy, but I also found myself invested in the main couple and was rooting for them. Overall, it may be a movie better suited for hardcore romance fans, but I do think it is something I enjoyed surprisingly more than I anticipated.",
    "date": "2024-02-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Awful. Worse than a soap opera from the 70's",
    "date": "2024-02-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "pretty sweet movie and story. love wins. and people find way to each other. in a perfect world... :)",
    "date": "2023-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "A huge stretch of a story requires big acting and directing.  \nSadly it's a disjointed script, passive acting and gaps in believability. \n\nThe drive to overcome the devastating accident and stay true to their marriage vows has been watered down to mild dating.",
    "date": "2023-06-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Imagine this situation I'd go crazy, the way the parents took over is ridiculous, but his letting go is even more ridiculous.",
    "date": "2023-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I liked it, it was a basic romantic movie with an important and beutiful message",
    "date": "2023-04-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The Vow is a very average romantic drama with a twist. From the beginning, I knew exactly what I was in for but it still managed to hook me. I was invested in our two leads relationship throughout the entire runtime. Their emotional chemistry was great and it was beautiful to see the two fall in love again. This story has a slight crinkle to the romantic film genre with our lead having a relapse in memory. I thought this subject was handled well, but the movie still manages to fit itself into the same story structure of every romantic comedy, which was a bit disappointing. Rachel McAdams was great and Channing Tatum was, well, Channing Tatum. Can't ask for much from him. At the end of the day, this movie brought tears to my eyes, job well done.\n\nScore: 66%\nVerdict: Good",
    "date": "2023-02-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Most true stories do not make good movies. It is because it is a good script that makes a good movie. True or not is not the point. It's a miss for the Vow. I place the fault entirely on the director who did a mediocre job on both the storyline and the directing. McAdams is great. That's about it.",
    "date": "2023-02-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I liked it but felt like the ending could've been better.",
    "date": "2022-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A shallow and familiar movie for date night, nothing more.  McAdams was excellent and Tatum, while a bit below average in the dramatic acting department, does a serviceable job.",
    "date": "2021-12-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The film has a difficult time making the chronology of the facts, but it is good entertainment",
    "date": "2021-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The movie was based on an extraordinary concept that I never thought of.\nSo it was interesting to see how they would tackle something so complex as that.\nThe movie also wasn't a typical roamnce movie. It tackled the many complications that make relationships so trickery to navigate, such as:\n-Family acceptance\n-Friend acceptance\n-Relationships with past lovers\n-Secrets and personal things that aren't to be mentioned\n-Judgement\nAll of this one experiences when in a relationship because as much as you love someone, the person is still human. With human tendencies, and this films confronts this too.\n\nBut besides that, I loved that it didn't have the typical happy ending.\n-The girl didn't magically or miraculously regain her memory\n-They also didn't let her fall back in love immediately, instead they let her linger for 6 months without him. All by herself knowing of her history with the guy (I digress... I'm actually rambling. Lol.)\n\nAnyway, this was a touching movie, and there definitely was nothing \"typical\" about it either.\nIt...made me feel in love.\nKudos to the cast. Kudos to Rachel McAdams, Kudos to Channing Tatum, you guys made this into a masterpiece.\nThank you.",
    "date": "2021-05-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I saw the first few minutes of this movie and it looked good, so I rented it. I'm sad to say it wasn't worth the 3 dollars and 99 cents. I usually really like Rachel McAdams but in this movie she just annoyed the heck out me. I'm wasn't impressed with Channing Tatum, either. After that initial few minutes, I just kept wanting it to be over. While the ending was a relief, it by no means made the previous hour and 40 minutes, worth it.",
    "date": "2021-05-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Storia d'amore drammatica con una trama tutto sommato originale.\nMa il problema sta tutto nel personaggio di Tatum, scritturato come fosse un maniaco; con certi comportamenti al limite dell' assurdo; sarà difficile interpretare le reazioni in situazioni così particolari, ma sicuramente il lavoro non è stato fatto bene.",
    "date": "2020-12-05"
  }
]