[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I dunno why anyone hate this, but this is got to be silly and hilarious!",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is an underrated gem!",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I kind of fell asleep.  Look, this thing is Dumb and Dumber dumb.  But it also has something a lot of comedies no longer have - scenes that make you bust out laughing.  Yeah it isn't Shakespeare, yeah it is offensive, but it IS sporadically funny as heck.",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "funny movie, idk why others think it is bad.",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Norbit is a very dumb but hilarious movie.",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "All over the place. I would’ve loved it if there was more Rasputia.",
    "date": "2025-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's was very funny and also the best Comedy Movie ever",
    "date": "2025-09-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Horrible movie. Offensive in so many ways it is hard to describe.",
    "date": "2025-09-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Love this movie, it’s so hilarious and it puts me in a good mood when I watch it.",
    "date": "2025-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Norbit has been a family favourite of ours since I was a child. It is typical Eddie Murphy humour and has you belly laughing from start to finish.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Fun movie about learning to stand up for yourself, and honestly, I enjoy Eddie Murphy as an actor, so I had a lot of fun watching this. Reading the critics' reviews it just makes me wonder, \"What were they thinking?\" I mean,  did you really go to an EDDIE MURPHY movie expecting a sophisticated and grounded story? Please grow up and learn to have fun. Movies are about entertaining the masses; if it isn't for you, then go watch something that is. Don't bully those who genuinely enjoy it. 3.5/5 stars.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The point of a comedy is laughter, and this movie has you dying of laughter from beginning to end. One of the all time great comedies in my honest opinion.",
    "date": "2025-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The point of a comedy is laughter, and this movie has you dying of laughter from beginning to end. One of the all time great comedies in my honest opinion.",
    "date": "2025-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The point of a comedy is laughter, and this movie has you dying of laughter from beginning to end. One of the all time great comedies in my honest opinion.",
    "date": "2025-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The point of a comedy is laughter, and this movie has you dying of laughter from beginning to end. One of the all time great comedies in my honest opinion.",
    "date": "2025-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Norbit has been an ALL TIME CLASSIC/ FAVORITE. I grew up watching this and laughing every time! Even Knowing where, what, why, and when it’s going to happen. Love it honestly !!",
    "date": "2025-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I don’t know what movie these reviewers saw but Norbit is HILARIOUS! I still quote lines from this movie.  Need a Good Laugh - Norbit. Need a break from doom scrolling - Norbit. Need some comic relief in these crazy times - NORBIT! Watch the movie.  It’s worth it!",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Alright you gotta go into this movie fresh, no spoilers or anything else. The story is great, an orphan abandoned and raised by a new family can’t beat it right? Packed with comedy and drama only Eddie can bring to life, this movie was hilariously funny. Each character played their part well and never gets old. Im sure we can relate we all know someone or a family member going through something similar. I’d recommend watching!",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love norbit! I’ve probably rewatched this movie 20 times! 💖",
    "date": "2025-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Words can't really describe how bad this movie is.",
    "date": "2025-08-12"
  }
]