[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I wish I could give zero stars. Not comic accurate at all! Flashpoint was completely ignored and instead, replaced with this junk!",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I really like this movie. In fact I enjoyed it more than Quantumania. While then and right now I havent done a more or less proper DCEU binge, I loved this movie. The writing was great and the story was good. The acting was amazing as well. While the movie couldve indulged in more multiverse elements during one part, the movie was great nonetheless. I understand that it was controversies that caused the movie to flop, with the possibility of a lie on someones end concerning actor likeness being used without permission, but this film was great. Shouldve released before beetle and lost kingdom, but a great film. I hope in the following years that it becomes an underrated gem akin to the Incredible Hulk (which I have t seen yet). While the ending couldve done more of a final farewell type thing with the credits emphasizing that the DCEU was over, the film was still good. And I hope that one day people will realize its underrated.",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Michael Keaton returns as Batman. What else is needed? Sasha Calle was a very good Supergirl.  If Ezra Miller hadn’t F’d up his personal life and was able to do the talk show circuit, this movie would have been well received. I didn’t like the killing off of Supergirl and would have loved to see how the movie would have ended if her stand alone Supergirl movie got released instead of shelved. I would still like to see it. The ending with George Clooney was great though. Left room for a sequel.  People take this stuff too seriously, it’s a comic book movie, not Casablanca.  It was enjoyable. I really liked it!",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "First off this JAMES Gunn destroyed us from getting the best Batman to come back we would’ve had Michael Keaton come back as the regular Batman so in this aspect, this signifies the best and the worst WB Batman movie ever.  \n\nBut this movie is amazing love it The best bat is back.\n“Only for james Gunn to kill it”\n\nA few moments of bad cgi. Cause they didn’t want to spend money on this idea”cause of james gunns vision” to finish it properly but the story is great.  It’s just a shame. Ezra got so much press for being a nut. But again, who in Hollywood isn’t",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "If we are talking about “the flash” not ezra as many people talking about him not the movie, so the movie is amazing here the flash is faster maybe the CGI was not the best for many people but the movie was fantastic to watch , also if we talked about the actor his “ezra” his performance was majestic in this movie",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Better than most DC offerings these days.  I thought it was highly entertaining, some good chuckle moments, well acted and good story.  I am kind of disappointed that we won't see more of Ezra Miller in this role.  It suited him well and expanded his character from Justice League in all the right ways in my opinion.  (spoiler) it was cool to see iterations of Superman in Christopher Reeve and Nicolas Cage as well as bringing back the original big screen Batman! Kara Zor-El was also super cute!",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not the worst film ive seen",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I watched this recenlty, it was unexpectedly good, captivating story, funny  at times, great music/video",
    "date": "2025-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "good movie,  not great. writing could have been better. relied to much on cgi in my opinion",
    "date": "2025-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's no classic and the story lacks cohesion, but it is funny, charming and entertaining! A Friday night, feel good movie!",
    "date": "2025-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Horrible, se ve espantoso, no tiene coherencia y se me hace muy aburrida. Las decisiones aquí fueron de lo peor que le pasó a DC",
    "date": "2025-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Like The Green Lantern, this movie delves into themes that may be too deep for cerebrally challenged reviewers, especially those who can only think in one dimension at a time.",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not the worst project DC has ever produced, however The Flash has far too many unexplained plot holes. When you have a story based on time travel, there’s far too many details to get entangled by because there’s no rules to anchor the storyline. The plot is just messy and the CG is unacceptable. The film was still fun to watch. Having said that, I’m hungry.",
    "date": "2025-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "An extremely underrated film with an abundance of heart and humour. Keaton is the easily superior Batman of the 2020s, plus we are once more treated to Shannon’s Zod. Hampered by some atrocious CGI.",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Apart from hideous CGI this is a solid movie with heart in it.",
    "date": "2025-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "For what it’s worth, this movie is not as bad as most people said back then. Obviously hasn’t aged the best because the DCEU is dead but back then I thought this was a nice light hearted but somehow big stakes .",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Flawed! What you love is Keaton. And all this does is make you cry for that!  If you’re sentimental like me, you love parts, and hope James Gunn can fit Keaton into the nee DCU.",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "this is by far the worst movie i have ever seen and it is the worst superhero movie ever made it is stupid and the cgi and acting is absolutely terrible",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "They had a Bat kite. What more do you people want?",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Thanks for nothing, bad clown Ezra miller",
    "date": "2025-08-22"
  }
]