[
  {
    "user": "Sammie Purcell",
    "rating": null,
    "text": "Not only does “Good Luck to You, Leo Grande” paint a deft picture of the performance of sex, but it rather artfully displays the pleasures – and dangers – that come when that performance is stripped away.",
    "date": null
  },
  {
    "user": "Francesca Steele",
    "rating": 4.0,
    "text": "In the end, Leo Grande isn’t a film only about sex but also about liberation and emotional intimacy, with oneself and with others.",
    "date": "2024-12-10"
  },
  {
    "user": "Daryl MacDonald",
    "rating": null,
    "text": "Good Luck To You, Leo Grande is a delight and likely one of the best comedies we’re going to see in 2022.",
    "date": "2024-04-23"
  },
  {
    "user": "Denise Pieniazek",
    "rating": null,
    "text": "In conclusion, Good Luck, Leo Grande reflects movingly and insightfully on shame, sexual connection, and emotional frustrations with a bittersweet flavor that manages to entertain us, but also make us think.",
    "date": null
  },
  {
    "user": "Tina Kakadelis",
    "rating": null,
    "text": "There’s a vulnerability in every aspect of the film that makes it endearing, essential viewing.",
    "date": null
  },
  {
    "user": "Serena Seghedoni",
    "rating": null,
    "text": "Good Luck to You, Leo Grande plays out in a conventional way that resembles that of a theatre play because of its intimate nature and attention to dialogue, but that is actually a bold choice",
    "date": null
  },
  {
    "user": "Jillian Chilingerian",
    "rating": null,
    "text": "It is a two-hander that could have been easily a stage play but director Sophie Hyde and writer Katy Brand take risks to deliver this charming exploration of human desires between two top performing actors.",
    "date": null
  },
  {
    "user": "Zach Pope",
    "rating": null,
    "text": "Great performances \nEngaging dialogue \nAnd a charming feature",
    "date": null
  },
  {
    "user": "Manuel São Bento",
    "rating": null,
    "text": "The most significant achievement of Good Luck to You, Leo Grande is the film's impressive ability to create a safe environment where the often uncomfortable topics become comfortable within everyday conversation.",
    "date": null
  },
  {
    "user": "Akos Peterbencze",
    "rating": null,
    "text": "A movie that so welcomingly embraces body positivity through sensual intimacy — in a culture where body image is such a pressing issue — is a goddamn treasure and deserves to be lifted up.",
    "date": null
  },
  {
    "user": "Rubén Rosario",
    "rating": null,
    "text": "There's too much foreplay in this portrayal of repression as the enemy of fulfillment, but Leo Grande also finds wit, charm, and a seamless mix of laughs and pathos along the way. It's informed by kindness and respect.",
    "date": null
  },
  {
    "user": "Ronak Kotecha",
    "rating": null,
    "text": "Ironically enough such movies are slotted as niche, but the emotion here is universal.",
    "date": null
  },
  {
    "user": "Whang Yee Ling",
    "rating": null,
    "text": "The two leads are terrific in a witty sex-positive bedroom farce that seduces and satisfies.",
    "date": null
  },
  {
    "user": "Jeff Simon",
    "rating": null,
    "text": "A very likable sample of a periodic rarity, a first-rate film actress making a serious film about female sexuality with as much frankness and even nudity as the era will permit.",
    "date": null
  },
  {
    "user": "Alex Billington",
    "rating": null,
    "text": "This little film is one huge step forward in sex positive cinema. I honestly want to recommend it to everyone, no matter how experienced they may be with sex already. Everyone can learn something from this.",
    "date": null
  },
  {
    "user": "Fletcher Peters",
    "rating": null,
    "text": "Daryl McCormack graced us with stellar performances...",
    "date": null
  },
  {
    "user": "Dylan Roth",
    "rating": null,
    "text": "More than a mere philosophical exercise, Good Luck to You, Leo Grande is sweet, sexy, and certainly the new favorite film of Father Intintola from The Sopranos.",
    "date": null
  },
  {
    "user": "Ruben Peralta Rigaud",
    "rating": null,
    "text": "Hyde splashes the story with sincere, touching, and sparkling moments that invite empathy, approaching emotions not yet discovered with caution.  [Full review in Spanish]",
    "date": null
  },
  {
    "user": "Gisela Savdie",
    "rating": null,
    "text": "If we ever had a preconceived idea of ​​the patterns that govern a relationship, it's very likely that this film will transform it, with its risky subject, experimental tone, and theatrical style. [Full review in Spanish]",
    "date": null
  },
  {
    "user": "John McDonald",
    "rating": null,
    "text": "Leo tells Nancy he is there to fulfil her fantasy, but she is compelled to keep digging obsessively in search of reality.",
    "date": null
  }
]