[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Everyone should watch this movie. To understand the *nadir* of the quality vs entertainment curve. This is it. The exact bottom. Any better it would become more entertaining. Any worse it would become more entertaining. A movie that will lead you mildly saddened but also excited to understand the quality vs entertainment curve more thoroughly.",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The film falters with a simplistic plot that feels undercooked and predictable. Characters beyond Driver, like Ariana Greenblatt, are thinly drawn, lacking emotional weight. Pacing issues disrupt the momentum, and it leans too much on well-worn tropes without enough innovation. Still, Driver’s star power and the dino chaos make it an entertaining, if flawed, ride for fans of sci-fi action.",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It begins as a repeated story but little by little it becomes as original as it is exciting, offering an interesting perspective on a subject that has rarely been seen in cinema.",
    "date": "2025-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "While it’s an interesting premise that’s no planet of the apes. I found myself not caring about the characters in the story both little girls were annoying and not easy on the eyes.  Dinosaurs were “waxy” or CGI.. I never liked driver from the Star Wars films so I couldn’t find protagonist in him in this one either.",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This is an incredibly mid protector 'father/daughter' style movie masking itself as a cool alien dinosaur action flick that sadly doesn't deliver well on either end of those spectrums. Perhaps if there was more character development, or better action/tension scenes this movie could have been better.",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The reviews are misguided.   Take the movie for what it is, a thriller that is intentionally short on dialogue and high on suspense.   Enjoy it for the heart pounding jump-scare moments and Adam Driver’s performance trying to communicate with his characters 10 year old co-star when they don’t speak the same language.   \nSometimes simple is a great way to tell a story. \nSometimes miss the critic misses the mark. \n\nWell worth the time to enjoy this prehistoric thriller.",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "65 was released in theatres and stars Adam Driver as Mills and Ariana Greenblatt as Koa. The movie is set a long time ago in a galaxy far far away where Mills goes off on a three hour tour as a space ship pilot. During the trip his ship gets hits by asteroids and crashes on prehistoric Earth filled with prehistoric creatures. To escape the planet he and Kora must travel to an escape pod that crashed on top of a mountain or something. Along the way they get attacked by dinosaurs and such and sort of bond. After reaching the escape pod they get attacked by some T-Rexes but manage to kill them and another beastie to board the ship and leave Earth. 65 had a very After Earth meets Jurassic Park 3 vibe but thankfully was better. The SFX for 65 were not that good, 1993's Jurassic Park dinosaurs were better. Also, the plot was awful, there was no character development or arcs, and much of the movie was dull. Both main characters speaking a different language and being unable to understand each other really slowed the pacing as well. For me it was a subpar sci-fi movie that I didn't enjoy the first time I saw it and won't watch again.",
    "date": "2025-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very enjoyable light hearted action adventure film.  CGI affects are excellent. I like the idea that earth was visited before humans came along.",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I knew it had bad reviews, but I loved the idea behind it so I bought the movie. For the first 20 minutes it seemed pretty good, however, it went downhill very fast.\nAfter 15-20 minutes it had basically zero conversations, no story or anything. The dinosaurs were inacurate or made up, mostly just close ups and could have been replaced by any generic alien monsters anyways...\nI was hoping for a sci-fi story where we could enjoy the world of dinosaurs and in the end it just didnt deliver on anything.\nRespect to the actors though, they made the best out of it.",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I am a sucker for dinosaur movies. I have seen them all, most of them several times. I just watched this one for the second time to make sure it was as bad as I thought. It was. Not one to make long reviews. Not enough dinosaurs. Not enough action. Not a good story. But lots of injuries. Non-stop injuries. Great movie about injuries. My review in 4 words. This movie is terrible.",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Dreadful rubbish. Editing/continuity errors.  Some tech less advanced than an iPhone. Mad max for the pre-historics. That said, no script with which to work but not really a dialogue driven type of movie.",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Jurassic Park in space. I would rather write a list with 65 reasons not to watch it than evercwatching it again. No idea why Adam Driver is in this movie.",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "My god! How? Why? Who? It's not bad enough to get away with being a b movie - was this the 1st script written by algorithm? So so much wrong with it I have no idea how or where to start. There is a word that springs to mind - Taxdodge.",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Si bien tiene agujeros, la historia me parece nueva en el mundo de los dinosaurios, la actuación es muy buena, los dinosaurios no son malos pero tiene sus defectos",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It wasn’t amazing, but it definitely had its good moments. I liked the dinosaurs and the my were convincing with a pretty good story. It did get a bit boring in the middle unfortunately.",
    "date": "2025-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Idk what these people are on about. I quite liked it and thought it was a masterpiece! Everyone hated gravity too, but I thought it was incredible! Such harsh critics.",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Wow, one of the worst, most boring, ridiculous movies I have ever watched. They have tools for space travels, laser guns, something that tells you everything is happening but they cannot communicate?",
    "date": "2025-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "65 never reaches the excitement of its premise.",
    "date": "2025-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It’s very slow but the acting saves it a bit. The visuals are cool. Interesting story idea. It’s watchable.",
    "date": "2025-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Moves at a slow (but not boring) pace that helps create tense moments and sudden frights.",
    "date": "2025-07-06"
  }
]