[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A typical mid Adrien Brody movie",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I understand the critic hate on this, but Brody does an awesome job with a tired narrative and makes this movie dark and entertaining. I wouldn’t have minded 30 more minutes of runtime to develop the storyline and supporting characters a bit more. I also really enjoyed the score and soundtrack.",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Wow. So bad. There’s entire minutes that go by with no dialogue. It’s a really bizarre choice.",
    "date": "2025-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I enjoyed the movie, a lot of critics are always overly harsh I feel like it tells a story and does a good job with it.",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "When narration begins with backdrop of inner urban decay.\nImmediately thought this was done nearly 50years ago. Watch Scorcsese's original. Also reminded of the original far superior Old boy \n.But this is a pale imitation .\nBrody produces and apparently chooses soundtrack .\nObviously vanity project. \nPoses well and good hair .\nAwful..",
    "date": "2025-02-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Really liked this. Easily one of Adrien Brodie's best performances. Nice mix of action and drama. Easy to watch with likeable characters. Well written and well directed.",
    "date": "2025-01-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Allright film and cool music and cool shots. Thin storyline. The italian crime boss is the best character in the film.",
    "date": "2025-01-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Secretive guy with a past trying to blend in forced to come out of retirement due to circumstance beyond his control to exact revenge a cliche. This one drags on for over half the movie before becoming too hyperbolically dystopian on every level.  Everything from the constant overcast sky, to the winter months,  everything dirty, even smelly fish and ultra evil bad guys contemplating doing horrible things to innocents just too dark, dark, dark. \nCould have used a lot more nuance but opted to take a meat cleaver to the entire movie rhetorically speaking.",
    "date": "2024-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Gritty and brooding, a slow burn with a melancholy heart. Solid acting, decent albeit predicable plot, with good action when it comes up (perhaps not frequently enough for some viewers expecting more action).",
    "date": "2024-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I like it. Yes, it borrows from other movies , overlaps with equaliser, taxi driver etc. Brody is always worth watching. It could have dragged but it kept my attention so much that I didn't take my much needed nap. Most of the characters are underwritten, but that didn't bother me. May bother you.",
    "date": "2024-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Clean is a great Indy ride. Who is this dude and what is his past, this is what I was thinking the entire time watching. It kept me intrigued...\nThe darkness of this film with a kiss of sunshine from Adrien Brody's character. The struggle he goes through with the loss of his daughter ( his fault) is particularly hard to watch ( in a good way). Loved it! It will be my go to movie to add to the list.",
    "date": "2024-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Love Brody but it is a bit slow moving.",
    "date": "2024-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The movie was very slow moving. The first hour dragged on and it was not easy to follow what was happening. There was no background given to put the movie in context. It had some good action when it finally got to it, but I came close to turning it off. It took way to long to get to the action. I would say skip it unless you have nothing else to watch. Nobody uses a gun? I don't think so.",
    "date": "2024-03-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Yes, it's formulaic - good guy with \"skills\" turned bad guy for a good cause - but it's really good for what it is.  Brody was great, you really felt for his character.  In the same manner as The Equalizer, it had me riveted the entire 90 minutes.",
    "date": "2024-03-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Clean\" earns a commendable 3.5 stars, driven by Adrien Brody's stellar performance and a narrative that presents a more nuanced take on the action genre. Brody's portrayal adds a layer of depth to the film, elevating it beyond a conventional action movie. Drawing comparisons to the high-octane pace of \"John Wick,\" \"Clean\" distinguishes itself with a slower, more character-driven approach. This deliberate pacing allows for a richer exploration of the characters, creating a more immersive and engaging experience for the audience. In the end, \"Clean\" stands out as a compelling entry in the action genre, blending intense sequences with character depth.",
    "date": "2024-01-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It was really good. Gritty, dark, real. Not a glorified, special effects filled, typical Hollywood cr..p, but real, just how the life is in a really tough neighborhood. It could use a bit better \"polish\", but it was really good. Acting was surprisingly good too. I would give it more than 3.5 stars if the ending would have a bit more closure and clarity (it left me wanting to know more)",
    "date": "2024-01-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "An awesome, very underrated action movie. Gritty, cool score, good enough storyline & characters. Should be ranked more like 70% on critic score.",
    "date": "2023-12-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I liked it. It was a little cliche, but if you saw the trailer you knew that it was going to be low key Taken. Fun to see Adrian Brody as the avenging angel character.  I looked at it almost like a comic. The way it is set up with the big boss and the crooked streets. Very Gotham. \n\nThe acting was good if you ask me. It loses a star for cinematography though.",
    "date": "2023-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Quiet. Brutal. Heartfelt. Not amazing, but better than most of these reviews give it credit for.",
    "date": "2023-10-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Poorly cast. Brody isn't believable as blue collar White guy with a poorish accent. The accent attempt was so annoying. He needs to play a banker or something.",
    "date": "2023-10-02"
  }
]