[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Incredibly good movie. The plot is very interesting, and there are also a few really good jokes.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie makes me go over the hedge when I watch it, hoh yeah my brain goes awooga sim 82 when I watch the hot cheeto nuclear bomb scene",
    "date": "2025-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Might be biased cause it's a nostalgic movie for me. But the first time i watched it as a kid instantly fell in love with it. The meaning of the movie, the characters and the amazing music by Ben Folds. A classic in my eyes.",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This film is predictable. That is the main problem. But besides for that, it is a pretty good watch. The humor is spot-on, the characters are very good, and of course, the sentimentality. It is a very sentimental film, definitely. In fact, it has a very emotional 'Family of Me' opening, which is to me the most sentimental opening to any Dreamworks film, more than How to train your dragon, or others. Hammy is my favorite character, and Carell adds a lot of hyperactive flair to the squirrel, so he was one of the best parts of the film overall.\nYes, I think this is a bit underrated. While it may be predictable, this movie didn't deserve to be 'eh..it is okay, but not good'. No, I think it deserves more than that. A raccoon gets a home and stops being selfish? You can't hate that type of film.",
    "date": "2025-09-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Os Sem florestas não é um filme marcante, mas é muito divertido e tem uma história inovadora.",
    "date": "2025-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It’s pretty fun to watch",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is extremely funny🤣🤣🤣🤣🤣🤣🤣🤣🤣, and the story is interesting ! 👍 Go watch this movie!🔥🔥🔥🔥🔥🔥",
    "date": "2025-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I finally watched it! I've been dying to watch this movie for some reason! Its honestly one of my favorite DreamWorks movies! Its underated, hilarious like, HALOURIOS! And i had a fun time watching this! I mean the only reason i wanted to watch this movie was just to have a good time! And i did!",
    "date": "2025-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wow!!! Over the hedge is funny!!!",
    "date": "2025-06-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolute banger of a movie...",
    "date": "2025-06-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love this the Bible2. Best movie of 2006  dreamworks magnum opus besides the shrek's movie's the soundtrack is so good a must watch I",
    "date": "2025-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "LOL, 1 hour and 23 minutes of animated comedy. Rated PG for Some Rude Humor and Mild Comic Action!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $155,000,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-05-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Really funny, I love it.",
    "date": "2025-04-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Es divertida, entretenida, graciosa y con momentos para pasar el rato y su mensaje de la importancia de la familia por que ese es el verdadero camino a la buena vida",
    "date": "2025-03-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "When more just isn’t enough! This movie is extremely clever, heartfelt, sad, funny, and beautiful in so many ways than just one. Ben Folds does the soundtrack and pours his heart out in the lyrics and music. The characters are all great and unique in their own way, and all of them have a purpose in the film, while comprising the family dynamic this movie is absolutely famous for. The whole movie is super fun, very aware of its ridiculousness, and just overall a cute film.",
    "date": "2025-01-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Just remembering this movie makes me wanna be little again.",
    "date": "2024-12-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The Verminator carries this movie (/j it's pretty good all-around)",
    "date": "2024-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very funny move. I enjoyed the plot and the animation was really good for the year that it came out (2006). Clearly one of the better dreamwork movies unlike turbo",
    "date": "2024-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The movie is so funny that if I took a shot for every time I laughed I would be unalive",
    "date": "2024-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "One of the most underrated DreamWorks movies",
    "date": "2024-09-20"
  }
]