[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Well-composed document, no holds barred.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Heartbreaking. Also chilling seeing how calmly Grace's murderer lied and disposed of her body. Terrible victim shaming in so many sexual assault/abuse cases where the perpetrator claims the victim wanted rough or bondage sex. Lies lies lies and so interesting seeing real police interview clips showing the unravelling of the killer's lies. Credit to the NZ police and shame on those social media trolls blaming the victim.\nThis documentary humanised just one case showing a young lady from a loving family living her life travelling and exploring, she should have been safe, so sad",
    "date": "2025-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This gruelling movie is made up almost entirely of cut-and-paste clips from Auckland CCTV and Police interviews which are not acknowledged anywhere. Neither in the movie or in the credits.\nCredit where credit is due.\n\nSome \"writers\" are named at the end. Which bits did they write?\n\nThere is not sufficient warning at the beginning to viewers of the content or advice to those who could be affected by the film. \"Mature audiences\" is not enough Netflix.\n\nThere is nothing at the end of the film for people deeply affected by viewing it to contact groups who specialise in providing support or other action. It gives the appearance of being screened before being completed. Shameful Netflix.",
    "date": "2024-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Not sure why it's called, \"The Lie\". The lie that the convicted tells is what leads the police quicker to his further questioning and arrest, even though it's implied at the start that a lie could be the thing that stymies the efforts of police to find missing persons. Furthermore, there's not just one lie but many. Anyway, this is a very dry, dull and thoroughly unimaginitive documentry, that has some questionable angles to its messages. It's also deeply depressing. Check it out!",
    "date": "2024-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I can’t stop thinking about it.",
    "date": "2024-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "As a woman who has used dating apps, this chilled me to the bone. Cold. Ordinary. Horrible. The use of CCTV footage was masterful in solving the crime and in this documentary. Without giving anything away, the courtroom scenes also chilled me to the bone. Lawyers questioning women like that? Unbelievably cruel.",
    "date": "2024-09-02"
  }
]