[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 01 hour, 51 minutes, and 13 seconds!!!!!!!!!!!!!!!!!!!!!!!! Rated PG-13 for Language, Crude and Sexual Content, Some Drug References and Violence!!!!!!!!!!!!!!! The USA grossed over $77,200,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Should have left Kevin Fart in the locker and thrown away the key. He is unfunny rude loud and crass. I don't know why hokeywood lines him.",
    "date": "2024-12-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Another Kevin Hart disaster!\nThis movie tried too hard and Kevin Hart was at the center of it all.\nUsually like Kevin Hart movies but the last few movies have been disappointing, Night School is one of the worst.",
    "date": "2024-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I hate my lecturer for making me watch this movie. It's clear they didn't write any jokes and they were just ad-libbing.",
    "date": "2024-05-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It was horrible dumb boring and the comedy was weak.",
    "date": "2024-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "That movie is so funny! Tiffany Haddish is so hilarious, especially with the leprechaun joke! Although I’m over the movie now.",
    "date": "2024-02-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Hilarious. I don't know why I waited too long to watch this movie but I enjoyed almost every minute of it.",
    "date": "2024-02-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Nice Comedy movie watch it before you go to school",
    "date": "2023-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Kevin Hart’s and Tiffany Haddish‘s chemistry was excellent in this movie.There are alot of funny moments in this movie that will make you laugh.You’ll have a good time with it",
    "date": "2023-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Some good laughter yet no depth.",
    "date": "2023-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Not the worst movie but not good. Funny moments and better than Get Hard, but lacking depth",
    "date": "2022-12-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I love Kevin and Tiffany...but not even they could save such a bad script.  Even with middle of the road expectations I was disappointed.  I felt every second of that LONG run time. The trailer made me think Tiffany and Kev could save it...the movie said:  THATS A LIE!",
    "date": "2022-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "First of all, this is a very funny movie, I laughed a lot, and some moments became inside jokes for me and my family, so yeah, I liked it, but in a overall, it's not a good movie. It's stupid and that's why it's funny and all, but it's so dumb. It was a weird experience.",
    "date": "2022-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Ages 13 and older!!!!!!!!!!!!!! The funniest 01 hour: and 51 minutes ever!!!!!!!!!!!!!!!!!! Starring Kevin Hart, Rob Riggle, and Tiffany Haddish!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2022-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "One thing that is left in my mind after watching this movie is that there's nothing like I'm too old for anything. You can pursue your dreams even after you retired. The movie is mainly about a man who dropped out of school due to the difficulties he has when studying. However, he have a successful career of selling barbecue grills and a hot girlfriend. Even so, an explosion from the grill when he proposed his girlfriend lead him to the lost of his shop. He found a new job which is perfect for him. Since the company wouldn't accept him if he didn't pass the GED, he had no choice but to go to school and take the GED test. He joined the night school and his study partners were all the people who decided to retake the GED exam at certain ages. The movie continues to show how they passed the exam and how the lead actor didn't give up till he passed. This movie contains different kind of genres like comedy, drama and romance. It would have been a family movie without the sexual related jokes. Definitely a great movie but not much a fan of it.",
    "date": "2022-05-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Night School movie is a pretty good comedy movie but there is a lot of sexual talks. So it will not be able to watch kids under 14. Kevin is a successful worker at BBQ restaurant. He get a good amount of salary because of his marketing skills. At the start of the movie, an unfortunate accident happened at Kevin while he was proposing his girlfriend megalyn. As Kevin lose his job, he had to attend the school to get GED. He attended at the Night School class that was teached by Tiffany. The movie got comedy, romance, hardworking. Kevin knew that he has dyslexia while he was attending night school. Tiffany and Kevin try so hard to get Kevin GED. At the last Kevin got GED and he was having a happily life again. This is a pretty nice movie for people who is trying to give up. I recommend to watch this movie while you are chilling but not recommend for kids who are under 14. You can see how Kevin try to get GED and you all wish to have a teacher like Tiffany.",
    "date": "2022-05-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "If only seen the trailer, but damn dyslexia and dyscalculia don't make you stupid. \nI have both and dsypraxia and a load of other labels. I have 2 masters degrees and i was top of my class. In one class i got the highest grade in a class of 200 students. The topic was qualitative data collection and analysis.",
    "date": "2022-01-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "O tipo de comédia com a qual eu não tenho a menor paciência, geralmente entediante, exagerado, com piadinha totalmente sem graça, esse até tem umas piadinhas interessantes, mas no geral foi tudo irrelevante...",
    "date": "2022-01-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Fun way to pass an hour and a half with a few laugh out loud moment.",
    "date": "2021-12-15"
  }
]