[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie was terrible, and that's being generous.\nQuality actors wasted on a bad script that dragged on with Topher whining for 90 minutes. And, none of the characters was particularly likeable. This is the first movie to receive a one-star rating from me in years.",
    "date": "2025-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Ill admit that the story had potential, but the attempt at this film was horrible. Nobody seemed to even bother to lookup how airplanes work, and 99% of the film takes place in an airplane.\nThey couldn't even bother to film a truck in front of a motel, it was all cgi. And the cg was not even high school quality.",
    "date": "2025-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Was Mel Gibson drunk when he directed this mess? Did Michelle Dockery have like a week or two off between Downton films? Was Mark Wahlberg high? Where has Topher Grace been hiding? After this mess, he's likely in Witness Protection! Just a silly, unbelievable movie.",
    "date": "2025-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I thought this was great, much better than the critics reviews would make you think Mel Gibson is a consistently good storyteller, so I didn't expect a total turkey. Lots of twists, good performances, nice ending, and thank goodness it's just 90 minutes. Can we have more shorter movies, please?",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I almost didn't watch it because of the bad \"expert\" reviews well I'm so glad I did proving the experts don't know everything. I've always liked Marky Mark but he's much better as a good guy. Topher Grace was exceptional in this, especially the last 35 minutes or so. The ending was amazing with a couple twists. Give it a look, ignore the experts.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "What an embarrassment this movie is. The dialog is horrendous. The acting is terrible.  The CGI looks fake as all heck. It looked like they even used CGI for simple scenes like a car parked in a snowy lot.  The dialog says the plane is at 1000 feet, but the scene shows it at 30 feet. The dialog says the plane is out of fuel and the engines have stopped, but then they land the plane and show the engines running at high power. This is a Mel Gibson movie? Mel, please, you directed this one on a Zoom call.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This film provided an unflinching look at how limited Wahlberg's \"acting\" ability really is—He was terrible as a cartoonishly sadistic hitman. The plot is rice paper thin, the writing is dreck, and that plane would have folded like a paper napkin when it struck the ridge. \n\nAwful, predictable, stupid film.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is a typical no talent Mark movie.   If you just want just a brain dead movie with no thinking.  Then this is it.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was a great movie!   Deserves way better than it's rated on Rotten Tomatoes.  Highly intense and had me on the edge of my seat.    A thrill ride.   I highly recommend",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "One of the worst movies I've seen ever. The writing was terrible , the plot predictable. Not surprised with Mel Gibson and Marky Mark were apart of it. He needs to stick to the funny dad movies.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "So bad. Bad acting and outrageously unbelievable.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Pretty bad at times. I wish they would have checked for errors. While Mark was unconscious, you see him open his eyes when being dragged. You see him moving his hands while unconscious at times too.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Uh... Well... Michelle Dockery is attractive. Topher is a clear choice for typecast eccentric, nerdy guy (Predators). Any 1 of 100,000 C-List actors could have played Wahlberg's role, even Ted. It was ok. A one-time watch only and literally.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "What an in-credible piece of garbage. Implausibility after implausibility. You have to suspend everything you know to be real to enjoy this film.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Don’t waste your time.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "So embarrassed for Michelle Dockery, Mark Wahlburg and Topher Grace.  Hope the paychecks were worth it. Bad acting, writing and finished product. Ugh.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Worst Wahlberg movie I've seen. So disappointed that Mel Gibson and Mark Wahlberg teamed up for such a terrible movie. Don't waste your time!",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Wahlberg is not the worst actor,but he tries very hard to be in this painful movie.\nAnd the fact the 'agent' does such a sloppy job of securing him is sadly not funny.\nAnd as mentioned in other reviews,the dialog is painful.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Truly terrible. Unbelievable, wooden acting. Derivative and needlessly disturbing. Mel Gibson never fails to disappoint.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Had high hopes for Wahlberg, but even he couldn’t save this movie from the horrible script. And the acting was subpar by all. Would not recommend",
    "date": "2025-11-29"
  }
]