[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I'm shocked at how good this movie is. This is a tightly told story that doesn't waist time. Dylan O'Brien brings some serious acting and shows he has what it takes to be an action star as well.",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Have no idea why people dont like this movie. Dont get me wrong the final act is kinda meh as the villains revenge doesn't make a whole lot of sense but aside from that one flaw this movie is fantastic",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1 hour and 51 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated R for Language, Brief Nudity, Some Torture and Strong Violence Throughout!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $36,200,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The opening scene got my attention but then the movie fell off with poor action, plot, and characters especially the main protagonist hes good at everything, takes no damage, and has no development throught the whole movie",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Its a great movie...",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love this movie...",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The critics once again prove their ineptness.. they are so wrong on this one. I was surprised how much I enjoyed this movie.. The main character was perfect for this role as a young modern real-world agent. I can't believe there are no sequels or a TV series - a huge missed opportunity!",
    "date": "2025-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The movie starts kinda ok but it all goes down hill ones the main plot starts. The supposedly smart and competent people make the most stupid decisions that it becomes painfull to watch. The last act of the movie cpuld be good, I wouldn't know I stopped watching after about an hour.",
    "date": "2025-06-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it. Wish it had a sequel or turned into a miniseries like Jack Ryan etc.",
    "date": "2025-05-04"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "One of the worst movies I've ever seen. A dumb, incoherent story that can't be saved by especial effects in action parts. Just a bunch of noise and a waste of anything you paid to watch.",
    "date": "2025-03-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Underrated. Could have used some more plot explanations and detail, but a solid action movie.",
    "date": "2025-02-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Creo que se ahorraron todo el presupuesto para la exploración final.\nNo le encontré absolutamente nada que me haya enganchado de la película, demasiado aburrida y en los primeros 15 minutos terminaron con la trama principal, que es la venganza de su pareja.\nLo que sí me llega a gustar es la actuación de Dylan O'Brein, que a pesar de ser un personaje demasiado molesto tiene una personalidad única.",
    "date": "2025-02-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "American assassin is about a man named Mitch rapp . He is with his girlfriend and they are vacationing  and spending time on the beach . However that comes to an end when a group of terrorists show up and they start shooting people at the beach . Mitch ends up being one of the few survivors and when he goes looking for his girlfriend  she's dead . A year or two later he's recruited to a secret agency and he ends up working for the agency full time . But first he's got to go through training before ending up  on the field saving peoples lives , finding out secret information and getting the bad guys killed or capturing the bad guys .  Daniel O'Brien does a good job at portraying Mitch rapp and Micheal Keaton as his man boss does train him well  and does seem to beleible boss . Also the lady in the film ( sanaa  lathan ) does a decent job as the other boss . The plot of the movie could've been worked on a bit more though. Overall this was a good action movie that doesn't get enough credit or love .  But it's not on the level of Terminator 2 at all . 3 out of 5 \n\nParents guide/ Christian perspective \nViolence : heavy. Lots of punching and kicking . Terriorts shoot and kill innocent people. Scenes where a dead body is found in the trunk of a car .  Mitch rapp shoots at bad guys and they shoot back .  Chase science where he goes through a woman's house and is chasing the bad guy . I believe he jumps out the window . \nLanguage :moderate. 1 JC word , 4 or 5 gds . Use of the f word , s word and possibly hell and damn said a few times and 1 or 2 sobs . \nNudity : light. 1 woman gets out of the shower her breasts are briefly visible . \nDrugs : none",
    "date": "2025-01-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie has nothing to do with the book series and is incredibly disappointing.",
    "date": "2025-01-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Critics were wrong - this movie was a great watch with a great cast and action scenes. Included cool creative scenes in operative training with a Michael Keaton mentor. Would recommend!",
    "date": "2024-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Critics missed it on this one. Fun ride with a solid ending.",
    "date": "2024-12-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Has a cool ending. Sacrifices a lot of intelligence to get there. Characters aren’t well built and not relatable.",
    "date": "2024-12-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I read critic reviews before I saw this film and it took a while before I decided to watch it. Critics take themselves so seriously. 34% on the Tomatometer. Are you kidding? American Assassin was a 'Greatest Hits' of this genre. Keaton is fantastic as is Dylan O'Brien. The ending is unexpected - action is great and like most Hollywood Films they create many script short cuts and yes some of it is ridiculous.  The critics hate it but who cares for a film like American Assassin.  2 boxes of Popcorn - 2 or 3 beers and pause it when you go to the bathroom. I actually liked American Assassin a lot.",
    "date": "2024-12-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Ultra macho man revenge fantasy fodder for the MAGA class: It's ridiculously unsophisticated and unrealistic.  The dialogue and the progression of events are often hard to swallow and even harder to stomach.  Any number of aging heroes would have made sense for this movie... Chuck Norris, Steven Seagal, Jean Claude Van Dame.... but how they got Michael Keaton involved is beyond me. But, it was the only reason I gave the generically titled movie a try.",
    "date": "2024-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Saw this movie yesterday and cant belive i have never seen it.. Great Movie.. Great performance and Story.. The nuke ending was brutal.",
    "date": "2024-10-30"
  }
]