[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Cochina, asquerosa, con cosas tan inapropiadas que no voy a escribirlas, da pena ajena, fomenta idiotez extrema y por favor nunca la veas (te volverá tarado y sacrificarás parte del sentido común el cuál lamentablemente escasea en la sociedad, el cuál debemos salvar porque para nada conviene que hayan porquerías, son malas).",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Really unique movie that fits into the category of \"not being for kids, but still has a teddy bear\". I thought it was pretty good, but it's surprisingly forgettable. I mean, no one talks about this movie anymore. You should definitely see it though.",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I didn't like the ending. It felt as if the scriptwriter wanted Lori to follow his orders instead of letting the character that he created choose a path for itself.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Movie was funny as hell. I loved it!",
    "date": "2025-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I went into this expecting something just lame, it's comedy doesn't always hit but it's definitely great",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Muito engraçado realmente para se rir alto, e um tom emocionante no final bem legal.",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Hilarious laugh out loud comedy.",
    "date": "2025-10-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "ted ted ted ted ted ted",
    "date": "2025-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny comedy movie, it’s funny and hilarious",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's a very interesting and entertaining film, and although it contains adult content, it manages to entertain most viewers, as it draws attention to how something as childish as a teddy bear can lead to scenes of drugs or violence.",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "From my point of view, it's a very entertaining film for the viewer, but one negative point is that there's a lot of profanity. It also contains some explicit scenes, but otherwise, it's a very entertaining film with some very funny scenes. Carlos Jimenez",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "In my opinion, the film is a bit absurd or if you watch it with your family it will make you a bit uncomfortable, but this doesn't mean that it's not quite funny. I'm not going to deny that the movie is vulgar or has inappropriate content, But as I said before, it's quite funny if we look at it from another perspective.  \n\n~Kevin",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love this movie, it's a classic that's too good but I still think that the inappropriate content and vocabulary where vulgarity predominates should be moderated, the audience can often be underage and it can take away the sense of humor from the movie and make it uncomfortable.",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "As with 99% of comedies, I didn't laugh at all the jokes, and found some of them dumb and/or gross.  But I did laugh quite a bit, and I could definitely relate (I'm Jewish, I loved Flash Gordon and that Queen soundtrack as a kid, and I think we all went through a pot smoking phase.)  PS Memo to Seth MacFarlane - great minds think alike :D  Not only did he cast personal fav Mila Kunis as the leading lady here, he chose her blonde alter ego Amanda Seyfried for the sequel!",
    "date": "2025-05-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Started off with a BANG, and ended with a fizzle. I blame the writers.",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Ted is a cinematic masterpiece worth watching.",
    "date": "2025-05-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "On the downward swing of comedy movies after peaking with tropic thunder and superbad. Seems like a live action episode of family guy",
    "date": "2025-04-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A pretty funny and entertaining buddy comedy that rises above its dated cliches with enough solid gags and good chemistry between Mark Wahlberg & Seth MacFarlane.",
    "date": "2025-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This will become a benchmark classic for all the right reasons. Hilariously funny. Cast is just amazing in character, very good cinematography and a tall story that is cleverly and convolutedly told. Easy to believe it is the biggest original R-rated comedy ever. Seth did good here",
    "date": "2025-04-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This film has probably been a yearly rewatch for me for a few years now and it still always manages to make me smile and laugh",
    "date": "2025-04-03"
  }
]