[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie has proven itself to be rewatchable and delivers on all the right levels. I only wish it would get a sequel.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "After 15 minutes I gave up. This clearly was not going to be my thing. Bad acting and fantasy cos play drama. Watched on Amazon Prime before giving up.",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Nobody knows what they are on about, if it was a movie about anime ladies in school uniforms they would be about it. Film was pretty good would say 5/10 only because i never played warcraft and half these nerds who reviewed it prolly did, and all of them use an avatar thats slim and in skimpy clothes while really they are sweating in their mums basement. Give it a chance, battle los angeles is worse",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Greetings from Lithuania.\n\n\"Warcraft\" (2016) is a one OK / nice movie to see it in a movie theater for those who didn't play the games and couldn't spell one of many bizarre names of characters in this movie (I'm one of those). Special effects were good, nothing groundbreaking, but good. The weakest part of this movie for me was Travis Fimmel acting. That has to be one of the most uninspiring performances (which should have been inspiring) in big budget movies ever - he just went trough all movie with one face expression - even when something very dramatic happened - he was just staring at the screen, with no emotions visible. They need to re- cast the main actor in a sequels, if there will be any. And sorry Paula Patton, almost every time you went on screen with that ultra-bizarre looking haircut and make-up, i started to smile. The story was quite OK - like i said i only played one of the very first games, so all the characters for me were unknown, and many of them remained unknown after the movie. As not a fan i can say, this movie won't be as much impressive to see it at home, so if you want to spend 2 hours and see some OK flick on Friday evening, \"Warcraft\" is for you, but don't expect to be blown away. \n\nOverall, \"Warcraft\" is nicely paced movie, which at running time 2 hours made me to watch at my watch only once - and it was in a scene were some mags were fighting. Performances were between low and OK - better cast highly recommended for sequels (although there was one very short cameo - i won't spoil anything, but this great actor / actress should have been more on screen - it's the biggest star of this movie for sure). \"Warcraft\" is a one nice flick to see it once on a big screen, and for home media - extended version is recommended (if there will be one), because the strange thing but this movie wasn't predictable overall, and there even were some glimpses for a great, epic movie, but on it's running time 2 hours the story didn't had enough room i guess. So - it's a OK flick for those who haven't play the games, and it wasn't as bad as critics said.",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Despite its flaws, this was a pretty good movie.  I’ve watched it multiple times.  I so wish they would make a sequel to this.  As someone who played the original games, it definitely transported me back to my childhood.  A must watch for sci-fi fans.",
    "date": "2025-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "How did the mythica movie series truly get higher reviews this warcraft. This was a great movie. Everyone seems to be judging it off the video game. We cant be doing that. Warcraft had much better fight scenes and cgi then mythica yet it was reviewed very biased. What a shame on this so called professional critics. We need a second warcraft movie sooner then later. MUST WATCH IF YOU ARE INTO MYTHICAL FANTASY. Worth every minute",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "“Warcraft” is your run-of-the-mill fantasy/adventure/war film. It wasn’t my cup of tea per se, but certainly not as bad as people are making it out to be.",
    "date": "2025-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I don’t know that this movie has got so many negative reviews. It’s actually very good. Make your own minds up",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Very impressive animation and CGI, but unfortunately the boring characters and uninspired story leaves us an utterly forgettable experience.",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Seems to be confusion between the \"critics\"?, most are criticizing based on the game Warcraft and this \"adaptation\" to movie. Oh well, each to his own hey. But this is a good movie, solid script, great cinematography. Duncan Jones did a good job directing. Whole stellar cast excels convincingly in character. Lots of action, intrigue, twists and adventure thrown into this magical mystical story. Highly entertaining, time passes quickly with this one",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 2 hours and 3 minutes!!!!!!!!!!! Rated PG-13 for Intense Fantasy Violence!!!!!!!!!!!! The USA grossed over $47,200,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I dont care who says this movie is bad I think its great.. is it the best? heck no but its definitely entertaining...",
    "date": "2025-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I'm a WoW player and I loved it even though they compressed a lot of the game's canon, but with all the WoW lore it's impossible to put it all in a single movie. There should have been many more and I'm still waiting for them.",
    "date": "2025-04-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A genuinely solid movie & pretty decent adaptation of the early WoW storylines that deserved to get its own trilogy, but was undone by pretentious critics & studio interference.",
    "date": "2025-04-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Im a fan of WC1 & 2, but this was a horrible movie. War craft? More like boring dialog craft. Even the game had some humor. Daboo!! The film had none of that. I wanted more war, better music like from the games, and less boring character building.",
    "date": "2025-04-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Um bom filme, mesmo para quem nunca jogou World of Warcraft",
    "date": "2025-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I don't think it's the best adaptation for the video game, but overall, I had fun watching it, and the visuals held true to the game. I definitely recommend it for fantasy fans.",
    "date": "2025-03-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I was so uninterested, I fell asleep -- even though I paid to go and was not tired/fatigued.",
    "date": "2025-03-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I don’t know if it s that bad acting or the bad CGI but I couldn’t get invested in this movie",
    "date": "2025-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thought this was a great movie, you don’t need to be a fan of the game to fully understand the movie. I really wish they would make another movie because the film series has a lot of potential.",
    "date": "2025-02-17"
  }
]