[
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Aside from Scott’s strong direction and the solid cinematography (also with some great soundtrack), the screenplay is very messy. It tries to weave the story it’s adapting with ideas that contradict themselves, leaving the film confused about what it’s actually trying to say. As a result, the drama and the characters’ struggles fall flat, the plot feels bland, and it's ideas lack cohesion.",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Though the movie was entertaining, it was entertaining for all the wrong reasons. It’s impressive how bad it was. It strayed so far from the Bible, it was almost disrespectful to the faith. Some parts of the movie looked like a direct copy of Prince of Egypt, while others were entirely fabricated. The director seemed to have this obsession with making everything seem logical, that it completely ignored the spiritual aspect that is crucial to the movie. How can you make a biblical movie and then barely mention God? Speaking of God, the portrayal of Him was so wrong—it didn’t capture who God is at all. It just seemed like a creepy, mysterious kid; I didn’t even realize that was supposed to be God until later. One good part of the movie was the plagues even though the crocodile scene was so far off.",
    "date": "2025-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "What a masterpiece! While some parts of the movie don't stick to the original \"script\" a.k.a. The Bible, is still a wonderful movie!",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I enjoyed the film, but it was kind of depressing. The special effects with the plagues was decent., Watch it if you're bored and have nothing to do.,",
    "date": "2025-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was brillantly made. It gave me the feeling of my grandmother talking about the stories within the Bible. To see a man giving God 100% of his Faith, was beautifully created. It gave you the feel as if you were on the journey with them.",
    "date": "2025-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom.",
    "date": "2025-06-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Way better than the credit it is given. Yes the story is already known, but the world building, drama and action are all pretty good. As is the telling. I think the director walked into a minefield of a topic that would offend many, and the perception of this film has suffered as such.",
    "date": "2025-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is the best bible-based movie I have ever seen.  The writers made a very good story out of the available biblical chunks and pieces.  Visuals were outstanding and the dialogue was very well done.",
    "date": "2025-04-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I absolutely loved this movie. I am truly baffled by the negative reviews. I found it to be relatively fast-paced, with stunning cinematography and superb acting.",
    "date": "2025-04-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing movie. Again, it's a MOVIE, forget the facts and \"original\" story, this is Hollywood folks, treat it as such. Great entertainment, amazing cast and excellent cinematography, very well written and directed, it's Ridley Scott, surely it will be .... Epic scenery, all in all an excellent movie",
    "date": "2025-03-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thought this movie was incredible! The visuals were beautiful and the story was intense and compelling. I highly recommend it!",
    "date": "2025-03-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Well, I have to ask  .    Where is the staff?   It's a question that begs a response from Ridly Scott.  Did he not read then bible at all?   Christian Bale is not convincing at all.  It also brings up another question...  why did this movie even make to the theater...?",
    "date": "2025-03-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A complete misfire by Ridley Scott. It's amazing how he's so incredibly consistent throughout the eras with making masterpieces followed by complete misfires. So I can't really sayy I'm surprised. I've seen this story done tons of times from cheesy religious shorts, cartoons, and big budget epics that are some of the best films ever made about one of the greatest stories ever told in the history of humanity. So it's amazign how badly this misfires. The acting is just not good at all. Bale is one of the worst things. He's miscast and also just terrible as Moses. He's wooden, unlikeable, has no charm, and is taking things WAY too serious and going full tryhard mode. Moses is painted as a bumbling wizard almost who advocates for violence. Not a humble beacon for God's wonders good and bad. I do not believe for a second this person would have 400K people follow him. They made him into Malcom X instead of MLK basically. His chemistry with Ramsey is nonexistant. Everyone else is super forgettable or like Ramsey just as wooden and emotionless. The music is super boring and forgettable as well. The editing I will say is ok. This doesn't do anything ridiculously out of place and hits all the beats the Book of Genesis is supposed too. But it is missing so much and misfires on key moments in terms of delivery. A big reason why the cinematography isn't good. The first few minutes are pretty good actually but it just slowly loses life and direction quality goes down. Half the time it's so dark and dull you can barely see. The camerawork is super basic at times, the special effects are just ok and don't evoke any sense of wonder. It feels like it's trying to be so gritty and raw but it never focuses on the characters of Moses and Ramsey. We never really see them interact at all when Moses returns, we barely see Moses interact with his family, when he meets his wife it's done so sloppy, and the few interactions that are here are so lifeless and dull. Than there is the fact certain scenes are just done so badly. When the tree burns and Moses becomes God's chosen leader...Yeah have it dark and dull and have our hero covered in a mud pool like Dennis Hopper in Super Maroi Bros. The plagues that befall Egypt are done so sloppy as well and feel like they just happen. Making God into a whiny moody child was a terrible decision that they never really explain. Finally, the Red Sea...the most ICONIC moment in the film...is done so...nonchalant it's almost amazing. Like it parts and you don't even notice it...how...how in the world in whatever God you believe in's namedo you do that so....forgettably?!?! Like I somehow didn't even notice it parted. This all leads to terrible pacing. The Prince of Egypt did this an hour shorter and did so much more. The Ten Commandments was even longer and accomplished so much the entire way. This was a slog the entire way. This also can't figure out if Moses or God is the main focus because I swear it feels like Moses is an afterthought for the major bulk of the middle too. Skip this and watch any other Book of Genesis adaptation.",
    "date": "2025-01-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Anglo saxons are the ruling elite while the indigenes are made to play the slaves and lower classes. Whitewashing 101",
    "date": "2024-12-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not bad, could’ve been better. The performances were good.",
    "date": "2024-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Exodus Gods and Kings isn't going to be enjoyed by the faithful OR anyone else.  The filmmakers forgot that they needed to tell a story.  Nothing happens for a good reason.   We don't get any historical background.  We don't get secondary characters to care about.  We don't get adventure.  You'll spend most of this movie hoping it will end soon.",
    "date": "2024-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Under-rated Epic. Writing this from 2024, it is sad to see how we took these movies for granted.\nCompared to modern Epics rife with politically-correct BS, it is refreshing to watch a movie who's sole concern is epic visuals, story, and character development.\nLooking back/in retrospect it is clear that     our expectations have become so high because we have been gifted fantastic movies like this one in the past.",
    "date": "2024-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "One of Ridley Scott's biggest misfires, Exodus: Gods and Kings is full of gorgeous imagery and epic production values, but white-washing and uninspired writing make this biblical epic forgettable. If you just want spectacle, you can do worse, but outside of the visuals, cinematography and musical score, Exodus is a bland mess.",
    "date": "2024-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This film, like many modern films of today, tries to appeal to everyone, and in doing so does not appeal to anyone. It is too secular to feel religious, but too religious to feel secular, and when no one wins, everyone loses.",
    "date": "2024-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "An excellent take on the biblical book of Exodus. Of particular interest is Mose's struggles with God. It takes liberties with the Book, but if you're interested in a closer interpretation, there's always the Charlton Heston version 😁.  And the special effects are stunning.",
    "date": "2024-07-12"
  }
]