[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Is it crazy that I actually liked this one over the original and 3rd one?",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "5.7/10 — \"Mediocre\"/\"Passable\"",
    "date": "2025-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's weird the animation is way way more crisp and looks way better but everything else is a bit of a step down. The humor is solid and retains that slapstick and dumb over the top of the first. And to its credit this does have quite a bit of character development and a new setting. Alex's parents are good and the rip off Baldwin Scar isn't bad. But there really isn't much in the way of memorable new characters. Marty's copies I feel like don't even count. And the other Hippo (aka Puss N Hippo) is alright I guess. This actually tries to give arcs to each of the core 4 also. But the major flaw here is it feels like all 4 of them and the Penguins fixing the plane are all completely different stories that don't really tie together at all until the end in a very very loose sense. The whole romance feels completely distracting and outside of the core story of Alex and his family, these plots all feel like episodes that belong on a 30 minute TV episode. Not a feature film. That's something the first did better despite this having more development, keeping the core group together and never feeling jumpy. This is still very much a comedy as the first was also and very light on core plot. But it does retain a lot of what made the first work, gets solid laughs, and you do get development though uneven. Anyone who is a fan of the director, any voice actors here, or loved the first should check this out. Very easy going stuff but not as good as the first.",
    "date": "2025-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "By all means, it’s a (somewhat) superior sequel to the first Madagascar! Just as funnier as before! 🦁🦓🦛🦒",
    "date": "2025-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's a movie with a good plot!",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I think that this film was not intended to be serious but the intro was serious so idk \nMoto moto is weird \nThe romance makes no sense \nThe plot is everywhere \nNothing makes sense \nBut not awful",
    "date": "2025-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The truth is that Madagascar 2 is a very good animated sequel and with a budget of 150 million dollars it managed to collect $603,900,354 worldwide, being a box office success.",
    "date": "2025-07-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wow!!! Madagascar 2 is funny!!!",
    "date": "2025-06-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolute banger of a movie...",
    "date": "2025-06-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Il secondo miglior film di Madagascar",
    "date": "2025-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "LOL, 1 hour and 28 minutes of animated comedy. Rated PG for Some Mild Crude Humor!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-05-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Will-i-am ruined it for me...",
    "date": "2025-05-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This animated sequel was pretty good. Ben Stiller, Chris Rock, David Schwimmer, Jada Pinkett Smith, Sacha Baron Cohen, Cedric the Entertainer, Berine Mac, Alec Baldwin, and the rest of the cast did a pretty good job in this movie. The story of the movie was kind of entertaining and humorous. It's about returning to your family and what's it's like to live in the wild. If you haven't seen this movie yet, you might enjoy it. It wasn't as good as the first one, but it's still worth it.",
    "date": "2025-05-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "There have been far worse animation sequels. For the most part this is both fast paced and fun. Watched on Netflix.",
    "date": "2025-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Pra mim e melhor que o primeiro 9/10",
    "date": "2025-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This was definitely better than the first one. The grandmas the best.",
    "date": "2025-03-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Easily better than the first in so many possible ways.",
    "date": "2025-03-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "An improvement to the original and this time the plot is actually noticeable but some elements of the movie concern me",
    "date": "2025-03-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "esta si es chistosa, entretenida e icónica",
    "date": "2025-02-24"
  }
]