[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Embark on this masterpiece of drama and end up completely different from how you started. Capable of making us genuinely smile and bringing us happiness through the compassion with which everything was made, Sing Sing is such a precious and magical delight that it goes beyond the screen, guiding us through a space where people with immense hearts live. Here, Colman Domingo is a tree bearing valuable fruit of power and humanity, capable of moving mountains with his performance. The story ranges from overcoming adversity to friendship, and wherever it goes, it does everything very well and masterfully.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I just finished watching Sing Sing, and when the credits rolled, I couldn’t help but be absolutely blown away by the outstanding performances in this movie. The way it shows how theatre can be an escape from the cruel reality we live in really hit me. It’s so relatable, especially for people who use art as a way to cope, and I think Sing Sing portrayed that in a way that really gets under your skin.\n\nColeman Domingo. What a performance. The highlight for me was his \"crash out\" scene – this moment where a character who’s been putting up a front but is clearly hurting inside finally breaks. He was phenomenal. He played the role so well, and honestly, he deserved to win the Oscar, never mind just the nomination.\n\nEmotionally, I didn’t cry, but my stomach definitely dropped at certain points, especially during and after the scenes where Divine G is talking with Mike Mike in their prison cells. Those moments really stayed with me.\nI wouldn’t say I was deeply obsessed with the story, but I was definitely engaged. I was really interested in the way they portrayed the characters and the inner struggles you could see them facing. It felt relatable in a lot of ways. I love theatre too – I’m currently in the ensemble of a play called The Love of the Three Oranges – so it was especially interesting to see how they prepared for their play while still weaving in the characters’ emotional turmoil.\n\nThe thing I loved the most was definitely the acting. Everyone brought so much authenticity to their roles. It definitely got carried by the performances for sure. I was blown away -  like blown away. There wasn’t a single weak link in the cast; every character felt lived-in, layered, and real. You could see so much emotion in the smallest details: the way they carried themselves, the way they listened to each other, the pauses, the tension in their faces. It never felt like people \"acting in a movie\" -  it felt like you were watching real people trying to survive their circumstances and find some kind of freedom through theatre. The performances are honestly the main reason this film hits as hard as it does.\n\nI don’t really have a big criticism, to be honest. These types of movies aren’t usually the ones I go for, but I still watched it, and I’m really glad I did. I wouldn’t rewatch it, but that’s more about my personal taste than the quality of the film.",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the most beatiful poems to freedom and expression. An ode to acting itslef. A must emotional film with an amazing soundtrack!",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Coleman Domingo stars as an inmate who discovers acting as a way to cope with his incarceration at Sing Sing maximum security prison.  Domingo and the cast give Oscar-worthy performances that will restore your faith in humanity, wherever it exists.",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Dedicatedly performed humane portrait and appreciative tribute to the functional arts of redemption that insightfully establishes how therapeutic theater could potentially be, soulfully elevated with utter respect to the foundational craft by another of Colman Domingo’s stellar showcase. (B+)",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "An engaging film, although somewhat overrated.  Coleman Domingo, once again, proves that he one of the best actors in the business today.",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing acting, strong story. I loved the director character, his directing and exercises reminded me of when I studied theater.",
    "date": "2025-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Left me in a puddle of tears. Colman Domingo is a force of nature and the authenticity and rawness of the cast (most of whom are playing themselves), especially Clarence “Divine Eye” Maclin, made me viscerally feel the element of hope in the hopelessness - something needed so much in times like these. Already one of my favorite movies, period.",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Beautiful movie. What I found made this movie even more beautiful and special was that most of the actors, outside of Brent and Divine Eye, were actual inmates at Sing Sing",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A very emotional and heavy watch. Deals with the emotional turmoil one can go through in prison, as well as the struggle to be yourself in a world that demands you be serious and hard. Mind-blowing it took till the end of the movie to realize that the other actors in the movie were all real criminals who had since bettered themselves and been released. That being said it is tough to empathize for people who did terrible crimes. The main character, sure since he is presumably innocent, but the others are all in there because of the terrible things they did. Bit of the human struggle I guess.",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "On its face, this movie is really well done thanks to the star power of Domingo. But it’s the reveal at the end that makes the setting, the story, the scenes, the monologues that much more powerful. (94%)",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "An ensemble making up of formerly incarcerated men who are alumni of Rehabilitation Through the Arts (RTA) program at Sing Sing Maximum Security Prison and based on an Esquire article The Sing Sing Follies written by John H Richardson, this prison drama about men escaping the vicissitudes of penitentiary horrors and personal traumas in the therapy of theatrical make-believe uplifts downtrodden spirits in its own exquisite nuances.",
    "date": "2025-06-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Inspired by a true story, it shows how art serves as an expression and an outlet. The highlight is the realistic style in which it was filmed.",
    "date": "2025-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "1.75 hours of success!!!!!!!!!!!!! Rated R for Language!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Based on real-life situations!!!!!!!!!!!!!!!!!!! The USA grossed over $1,200,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A solid if sometimes clunky telling of an important story. As remarkable as Colman Domingo is here, the real life convict-actors deserve the real attention.",
    "date": "2025-05-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of my top films of 2024. It should have gotten more awards recognition. Beautiful and moving, amazing score by Bryce Dessner, and incredible performances, especially since many of the actors actually participated in the Rehabilitation through the Arts program. It will have you in tears.",
    "date": "2025-05-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Intense, striking and beautiful film.",
    "date": "2025-05-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Em meio a grandes produções que dominaram a temporada de premiações, Sing Sing despontou como uma das maiores surpresas do ano, não apenas por seu conteúdo sensível, mas pela forma como foi concebido. Com produção da A24 e protagonismo de Colman Domingo, o filme chamou atenção logo no início da corrida por estatuetas, mas o que realmente o torna especial é seu elenco majoritariamente formado por ex-detentos sem qualquer experiência prévia em atuação — uma escolha que traz para a tela um tipo de autenticidade rara, quase palpável.\n\nDirigido por Greg Kwedar, que até então só havia comandado um longa e alguns curtas, o projeto poderia facilmente ter sido subestimado. No entanto, com um roteiro sutil e profundamente humano, Sing Sing se ergue como uma poderosa reflexão sobre a liberdade — não a física, mas aquela que se encontra na arte, nos vínculos emocionais e na capacidade de sonhar mesmo quando tudo parece perdido.\n\nColman Domingo, em mais uma atuação marcante após Rustin, prova porque é um dos intérpretes mais talentosos de sua geração. Sua performance aqui vai além do domínio técnico; ele confere alma ao personagem, traduzindo com precisão o conflito interno, a fragilidade e a força contidas em um homem que encontrou no teatro uma forma de resgatar sua própria identidade. É especialmente no arco final, quando a história atinge seus momentos mais emocionais, que Domingo entrega cenas de partir o coração, sem jamais escorregar para o melodrama.\n\nSurpreendente também é Clarence Maclin, que faz sua estreia como ator com uma segurança impressionante. Seu personagem, recluso e cheio de camadas, rapidamente se torna um dos pontos altos do filme. Ele carrega uma ternura silenciosa que aos poucos conquista o espectador, e a química entre ele e Domingo é essencial para o envolvimento emocional da trama. A relação entre os dois representa, em essência, o poder da empatia, do apoio mútuo e da reconstrução pessoal.\n\nO roteiro, inspirado em fatos reais, aposta em uma narrativa sem grandes reviravoltas ou picos de tensão. Isso pode até desagradar quem espera por um drama carcerário mais intenso ou por cenas que explorem o lado violento da prisão. Mas Sing Sing segue um caminho diferente: aqui, a escolha é pelo cotidiano, pelo detalhe, pelos gestos simples que ganham um valor imensurável quando vividos entre grades. Em vez da violência, temos a poesia. Em vez do desespero, o esforço de encontrar dignidade e propósito através do programa de reabilitação por meio das artes (RTA), em funcionamento em uma prisão de segurança máxima de Nova York.\n\nA beleza do filme está em justamente não querer ser uma grande lição de moral. Ele não impõe sua mensagem, apenas a sugere com delicadeza. Cenas que, à primeira vista, parecem banais — como cortar a grama ou receber um abraço — ganham um peso simbólico enorme dentro desse contexto. Porque é justamente aí que o filme mostra sua força: na capacidade de revelar como pequenas experiências do cotidiano, que passam despercebidas por muitos de nós, podem ser tudo o que um ser humano privado de liberdade deseja.\n\nA direção de Greg Kwedar, embora discreta, é eficiente ao permitir que os personagens e suas emoções conduzam a narrativa. E a fotografia de Pat Scola, que já havia feito um trabalho primoroso em Pig e Um Lugar Silencioso: Dia Um, acentua essa dualidade constante entre opressão e esperança, entre as sombras da prisão e a luz que surge nos ensaios teatrais, nos sorrisos tímidos, nos olhares de cumplicidade.\n\nÉ fato que, diante de outros concorrentes nas premiações, Sing Sing talvez não tenha a mesma força em termos de impacto narrativo ou inovação formal. Mas sua importância está justamente na proposta: retratar o poder transformador da arte, especialmente o teatro, como uma ferramenta de autoconhecimento, aceitação e reintegração social. Isso por si só já faz dele um filme necessário.\n\nSing Sing é um drama silencioso, mas que grita por humanidade. É uma obra que nos lembra que ninguém deve ser definido apenas por seus erros, e que a arte pode ser a chave para reconstruir vidas. Um filme que, embora pequeno em escala, é imenso em sensibilidade e relevância.",
    "date": "2025-05-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I was surprised when I found out the actors (with the exception of Domingo, of course) were the real prisoners... Nice job!! And maybe that's why the movie feels more intimate",
    "date": "2025-05-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Possibly the most touching movie I’ve seen in a long time. Nothing beats vulnerable men supporting each other.",
    "date": "2025-05-02"
  }
]