[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A beautiful story about what can happen if we survive suffering and loss. I cried more than once. I loved the characters, especially Carmen.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I was honestly surprised at the low score this movie received from \"professional reviewers.\"\nIt has a lot of heart, and especially Mark Wahlberg did a fantastic job of portraying the life of a man whose tenacity, force of will, and sheer determination is truly something to be admired.\nI'm not fan of soppy, overdramatic movies that tries its best to win some kind of award, so I'm glad to report that this wasn't that.\nJust a very inspiring story, told really well.\nProbably the best movie I've seen in a long-long time.\nAlso, my thanks to the filmographer/editor/whoever, who didn't give this the soul-murdering blue-green-grey Netflix colour palette. Much appreciated.",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Such a lovely little film. Great message, engaging, well acted. Not sure why those critics didn't like it. Perhaps it's general rough-around-the-edges wholesomeness offended them.",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Father Stu has little to show besides Mark Wahlberg’s impressive performance. The fact-based story is touching but not nearly as inspiring as it’s been painted out to be. Sure, there are some qualities worthy of admiration in Stu, and the movie tries to highlight them as best they could, but it’s hard to overlook the Hollywood flair lurking in the drama.",
    "date": "2025-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Mark Walberg was the perfect choice for this film, portraying father Stuart Long and his rise from a lost and hardened sinner to a true and faithful ambassador of Christ. Father Stu is a 5 star movie, that is guaranteed to move mountains and melt the hardest of hearts ❤️🙏🙌",
    "date": "2025-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The film starts off intensely by showcasing the troubled relationship between father and son, marked by excessive pressure. Early on, the death of the brother occurs—it wasn’t clear to me whether he was the older or younger one, but that didn’t affect my experience.\n\nMark Wahlberg plays Stu, an aggressive man who finds his light in fighting. However, a health issue prevents him from continuing in sports, leading him to pursue an acting career. Amid struggles and conflicts, he meets a woman and decides he wants to marry her.\n\nThen comes the second major obstacle in his life: he gets hit by a car. This event changes everything because it is at this moment that he finds God. From that point on, Stu gives up everything, including marriage, to follow a new purpose.\n\nThe third challenge arises with a disease that initially affects his hands but gradually takes over his entire body. Even as he progressively loses his ability to move, Stu remains steadfast in his faith and purpose, making his journey even more inspiring.\n\nThe film’s direction ties everything together emotionally, showing how the people he clashed with eventually support him and how, in a blessed way, he manages to reunite his family.\n\nMark Wahlberg Gives His All\nHe fully immerses himself in Father Stu’s transformation, both emotionally and physically.\n\nHis physical change throughout the film is shocking—if it was achieved through special effects, it’s incredibly well done. But if it was the result of the actor’s dedication, he deserves more than just applause.\n\nHe conveys each phase of the character’s life with 100% commitment.\n\nMel Gibson Is Also Excellent!\nHe plays Stu’s father, a tough man filled with resentment.\n\nThe way his performance evolves—from a distant and harsh figure to someone vulnerable and redeemed—adds even more emotional weight to the narrative.\n\nThe Film Moved Me—It Made Me Cry\nFather Stu was someone who, despite all the hardships, showed that every person has their own battle, mission, and cross to bear.\n\nAnd, as Chico Xavier said—aligning with my Spiritist beliefs:\n\n\"Wherever the name of God is spoken, good can be done.\"\n\n\"We are human beings having a spiritual experience. And we are spirits having a human experience. - Father Stu",
    "date": "2025-03-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Critics mostly dislike religious stories and anything with Mel Gibson.  Sad that the movie industry gatekeepers hate on any movie with some religious heart.\n\nThis is an undeniably good, not great film.  Wahlberg and Gibson are great and the journey of Stu is a story of redemption and reconnecting with family after tragedy.\n\nMost Americans will enjoy it.",
    "date": "2025-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was not a perfect movie, but it is quite stunning.    It's beautifully made, cinematography and music.   The performances were fantastic- I really didn't know Mark Wahlberg had it in him.   He changes so beautifully throughout the film.   Mel Gibson was a joy to see again, it was a great role for him.    I see that the film might be slightly too long, and it may meander a bit- but finishing this film is worth it.    I'm not a religious person, but I was in true tears.    Emotional, spiritual, uplifting, and very funny.",
    "date": "2025-02-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Critics hating a movie about faith with Mark Wahlberg and Mel Gibson. Shocking. \n\nIt was a great movie with a beautiful story. Couldn't make it through this one without tears. It was very well acted and fearless in its' message. \n\nA lot of faith based movies can be so poorly done and this one was excellent. The cast was great, Wahlberg really stepped out of his comfort zone here, and Gibson is riveting as always. \n\nIt was a tough watch and I think it's a one and done for me but I just came upstairs while my wife was watching it (3rd time) and felt compelled to write a review. Here's to hoping we can get more faith based movies that aren't the equivalent of lifetime specials.",
    "date": "2025-02-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the must beautiful movies I’ve watched. Gets you thinking about the moral of the story. \nCritics are wrong in this one, biased opinion. Movies nowadays are not good enough for Oscar nominees, and movies like this one deserve a watch and awards for the authenticity and message. \nRecommended 100%",
    "date": "2025-02-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I always Ignore the critics reviews and Follow the audience reviews.  And for this movie The critics got it totally wrong.  I'm so glad I went with the audience review again.  If Mark Wahlberg reads this, PLEASE PLEASE PLEASE make more movies like this.  Those artsy etherial movies that are up for Oscars these days are garbage.  We need more of these real life honest stories of people who are bringing a positive influence and showing what being the best of yourself can do for everyone.",
    "date": "2025-01-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Enjoyed the movie, especially because it was based on a true story.  They did the best they could in a compact time to tell the story.  Still told a good story.  God Bless them.  Took my Son and my Son's friend.",
    "date": "2025-01-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is the worst writing I have ever experienced in a film. Grate cast good story to go on but who ever wrote this is not qualified! I could not get through the film because the writing sounded like a narcissistic girl who likes to hear herself talk. Horrible writing it ruined the film and several of my friends said the same they couldn't watch the entire film because it was so bad. What a shame",
    "date": "2024-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a good movie! Critics are biased on this one.",
    "date": "2024-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie is so good in so many ways. Mark Wahlberg delivers in this story that will pull at your heart. Mel Gibson was awesome as well.",
    "date": "2024-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Just rewatched it two years later and had to write a review. It’s amusing and enthralling",
    "date": "2024-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The movie itself is well made. Maybe story development lacks a bit but in general is a good formative assessment of a life with purpose (even when we do not like it or understand it).",
    "date": "2024-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I simply did not like this movie.  I kept waiting for something to start driving the plot but it never really happened and I didn’t like the sound (music) or look (too many close-ups) of it while waiting for something to drive the plot. The fact that the plot was based on a true story did make it intriguing enough to keep watching until the plot finally became driven by something more, other than the characters dialogue, in the final thirty minutes.  I think I see the contrast and change they were aiming for but... it just didn’t do it for me.",
    "date": "2024-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A must watch for everyone who loves good engaging and thrilling movie",
    "date": "2024-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Tiny bit slow at the start but absolutely great film with a great story. Deserves at least 75 rotten score",
    "date": "2024-07-23"
  }
]