[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It was ok it had some original aspects how ever I  feel the barrowed tactics of Silence of the Lamb kinda over played this some one said it should have got outrageous sooner . I would agree with this if we had known more of the artist story an crazed ability would have made the plot twist much better.  I definitely enjoyed the originality of the story.  Better then remakes and crap they put out in Hollywood.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very entertaining movie from the beginning to the end and has several twists that are quite pleasant for the viewer I recommend it a 100%. Do not pay attention to the reviews of the critics, you know why",
    "date": "2025-06-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie was horrible. I thought the actors would be able make this into something great, but even they couldn’t help this. I always wonder with such great actors that are known for stellar acting skills does the bad outcome then become the directors and editors fault. I was intrigued when Martin Lawrence also bombed in this movie. This was the only movie for him in 2022 so he could have done without this movie blemishing his record.",
    "date": "2025-06-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Absolute garbage. This movie has zero redeeming qualities. I guess Malkovich has gone the way of so many others...just keep working, no matter how crappy the material. I'm surprised John Cusack isn't in this. The Martin Lawrence part would've been a better fit for him. Then he & Malkovich could sleepwalking through it together.",
    "date": "2025-05-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I loved this movie 2/3 of the way thru, then liked it, by the end hated it.      It started with so much suspense and intrigue, just my kinda film. Then it bc improbable, and eventually ridiculous. I was actually embarrassed for the actors, or maybe it was their embarrassment I was feeling at having to be in the ending scenes.\nVisually seeing Nicolas Cage is almost worth watching the movie. It's one of the creepiest make-up jobs I've seen. And, he doesn't just look creepy, he'll make you cringe and ur skin crawl in the scenes at the police station. The acting was good, the script started good but went real far south.",
    "date": "2025-05-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Ok, interesting gothic story but disguised as if was a police-thriller so it appear the end from another movie. Not boring at all ... unfortunately bad produced and bad written",
    "date": "2025-04-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "'Mindcage' is a bad one! I probably didn't dislike it as much as I should've (the ending almost made that true, granted), likely due to the actors involved, but yeah... it's poor. I do feel like there is a good idea in there, the winged creations are also pretty neat; just lamely utilised.\n\nAnother positive, the only other one I have, is Melissa Roxburgh, whose performance is quite solid all the way through. I wasn't aware of Roxburgh a matter of hours ago, though her co-stars I am more than familiar with: Martin Lawrence, John Malkovich and Robert Knepper.\n\nAll three named are great in other things, in this not so much. The standout is Malkovich, albeit in a role that feels rather typical. Lawrence plays it totally straight and, although it is good to see a different acting style from him, doesn't feel right; a miscast. Knepper is OK in a bit part.",
    "date": "2025-03-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Enrredo péssimo! Tinha muito potencial no início e até achei que fosse ser incrível, mas o filme vai se perdendo. Tentou ser muitas coisas e acabou sendo nada além de um filme meia-boca.",
    "date": "2024-12-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This film aspires to be a compelling psychological thriller but falls short in several areas. Martin Lawrence's portrayal of Detective Jake Doyle often feels exaggerated, lacking the subtlety needed for the role. In contrast, Melissa Roxburgh delivers a more grounded performance as Detective Mary Kelly, providing some stability to the film.\n\nJohn Malkovich, as the incarcerated serial killer \"The Artist,\" brings his usual strong presence to the role. However, his limited screen time restricts the depth and impact of his character, leaving the audience wanting more from his performance.\n\nThe production values are modest, with certain technical aspects detracting from the viewing experience. Notably, the sound design suffers from excessive reverb in specific scenes, which diminishes the film's overall quality and gives it an unpolished feel. There is no indication that this audio effect was an intentional artistic choice by the director.\n\nWhile Mindcage has moments that hint at potential, such as its atmospheric settings and a few intriguing plot twists, these elements are overshadowed by its execution flaws. The film struggles to engage the audience fully, resulting in a viewing experience that is ultimately unsatisfying.",
    "date": "2024-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Don't waste your Time....such a bad movie...the scene of the battle in the room is so horribly done in edditing....I lost interest, but I love the acting of John M. so I continue the film...I was disappointed.",
    "date": "2024-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Horrible movie. The actors in this are usually great in other movies but suddenly seem like amateurs in this. I couldn’t even finish it.",
    "date": "2024-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is simply terrible. Netflix tricked me into watching it.",
    "date": "2024-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This film could have been beautiful, rich, and immersive. \n\nThe casting is impressive and more than competent in their craft. The writing, directing, and production however fell incredibly flat. There was no real build up, no slowly immersing yourself in the thinly veiled slices of beautiful horror-religious imagery (which I'm sure they spent a lot of time creating, and most of their budget on, which we barely had a chance to witness). \n\nIt feels rushed, unfinished, underdeveloped and just a disappointment. \n\nThe visuals wanted to aspire to the stunning worlds created by Tarsem Singh, but sadly it did not.",
    "date": "2024-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Just absolutely FULL of clichés, I feel like I’ve seen the movie a hundred times before. The main actress also feels distinctly amateur compared to her co-actors. Frankly, the camera work and style of directing didn’t work either.",
    "date": "2024-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Utter nonsense. Do no bother",
    "date": "2024-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie is like a highlights reel, it moves quickly, offering zero suspense, up to and including the ‘surprise ending’. But it failed to sustain interest or develop any of the characters with depth. Flat, superficial, and hokey Matlock gotcha. \nJust bad. Unwatchable. So beneath Malkovich.",
    "date": "2024-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love the atmosphere and the art threw the film.  Melissa and John Malkovich, also Robert Knepper were great!",
    "date": "2024-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is the WORST movie I have ever seen. I put it on because of Malkovich and I had to watch till the end to know what happened. It’s so cliche I actually laughed and the acting is so terrible it seems like it’s a parody.",
    "date": "2024-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The first half was solidly ok, but never good. The last half absolutely fell apart. They tried to go for a silent of the lambs spiritual successor, but it was a swing and a miss.",
    "date": "2024-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Absolute waste of time. poor script , even worse acting, everything was just too bad.",
    "date": "2024-11-04"
  }
]