[
  {
    "user": "Matt Brunson",
    "rating": 1.5,
    "text": "Here's one Diesel-fueled vehicle that's neither fast nor furious.",
    "date": null
  },
  {
    "user": "Jeff Beck",
    "rating": 3.0,
    "text": "The Chronicles of Riddick improves upon its predecessor in several ways, [but] still gets bogged down a little too much by its heavily-distracted middle portion... ultimately making for a sequel that almost works as a cheesy sci-fi outing.",
    "date": "2024-09-16"
  },
  {
    "user": "Brian Eggert",
    "rating": 1.0,
    "text": "Self-indulgent nonsense filled to the brim with pointless action sequences and a planet-hopping plot that seems to go nowhere.",
    "date": "2022-08-24"
  },
  {
    "user": "Mike Massie",
    "rating": null,
    "text": "The scope is grand enough to hope for a full franchise, but the plot just isn't unique enough to want to see more of Riddick's missions.",
    "date": null
  },
  {
    "user": "Leigh Paatsch",
    "rating": null,
    "text": "Storyline has severe coherence problems, but an arresting production design showcases an innovative collection of rugged CGI backdrops for Riddick's running battles.",
    "date": null
  },
  {
    "user": "Mattie Lucas",
    "rating": null,
    "text": "The script is heavy-handed and cheesy, the acting is leaden (Dench nonwithstanding), the special effects are overblown, and the costumes are truly ridiculous.",
    "date": null
  },
  {
    "user": "Dorothy Woodend",
    "rating": null,
    "text": "I've been patiently waiting for the sequel for years and now this.",
    "date": null
  },
  {
    "user": "Tim Brayton",
    "rating": null,
    "text": "Makes absolutely no sense in its theatrical cut and still feels awfully messy in Twohy's director's cut.",
    "date": null
  },
  {
    "user": "Nell Minow",
    "rating": null,
    "text": "Very violent, brainless explosion movie.",
    "date": null
  },
  {
    "user": "Felix Vasquez Jr.",
    "rating": null,
    "text": "There are many plot holes, an inappropriately overly complicated plot, and a lot of pointless aspects that never even bother to make the least bit of sense.",
    "date": null
  },
  {
    "user": "Peter Canavese",
    "rating": null,
    "text": "Vainly attempts to elevate Riddick into a mythological hero in a political-intrigue contest meant to be Dune in an action context, though it's a lot more like Stargate in a crap context. [Blu-ray]",
    "date": null
  },
  {
    "user": "Jim Lane",
    "rating": null,
    "text": "Twohy gives the film a vehement comic-book energy, and the eye-popping production design by Holger Gross is like Boris Vallejo's Greatest Hits come to life.",
    "date": null
  },
  {
    "user": "Eric Melin",
    "rating": null,
    "text": "Riddick is a loner, Dottie, a rebel. He's a simple man, like Pee-Wee Herman, who is not concerned with getting the girl. But, unlike Pee-Wee, poor Riddick doesn't even have a bicycle for companionship.",
    "date": null
  },
  {
    "user": "Todd Hertz",
    "rating": null,
    "text": "Like the heat on Crematoria, little is fleshed out. But I suppose it really doesn't matter because -- wow, isn't Riddick cool?",
    "date": null
  },
  {
    "user": "",
    "rating": null,
    "text": "The sequel baton pass at the finale is pretty nifty, but it's surely asking too much to think the filmmakers could leave us wanting more. Come to think of it, much, much less would have been best.",
    "date": null
  },
  {
    "user": "Pete Vonder Haar",
    "rating": null,
    "text": "It's been a long time since anyone bothered to create a new, big budget cinematic mythos out of scratch, and Twohy has poured a great deal of money into the look of his movie.",
    "date": null
  },
  {
    "user": "Dragan Antulov",
    "rating": null,
    "text": "The plot of THE CHRONICLES OF RIDDICK could be properly understood only after watching DVD extras.",
    "date": null
  },
  {
    "user": "Brian Juergens",
    "rating": null,
    "text": "Riddick starts the way that all great storytelling should: with a voiceover by an old British woman.",
    "date": null
  }
]