[
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Story and action sequence could be more powerful. It seems the re-make of Jean Claude Van Damn starrer Sudden Death",
    "date": "2025-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Remember Sudden Death the JCVD vehicle which was basically Die Hard in a hockey stadium. It was a solid 90s action movie as JCVD faced off against Powers Boothe.\nAlmost thirty years later someone decided to reboot it with Michael Jai White. \nNow with Michael Jai White you generally know what you're gonna get a some questionable acting and some great action scenes. \nUnfortunately this has loads of questionable acting and lacks great action sequences.\nMichael Jai White is capable of good acting as some of his straight to dvd/streaming films have shown. He was even good in a minor role in The Dark Knight, but sometimes I feel like he needs a competent director to at least get him to act.\nYet he is not even the worst actor in this film which is the gauling thing. Michael Eklund really bad and the worst one is Gary Owen, as his character suppose to be like Marv from Die Hard 2. Frankly he's just terrible.\nI really had hopes of not being disappointed as Sudden Death as a film works and a new take could work but this is just terrible. \nNot even a JCVD cameo.\nAvoid.",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Hilarious! I’ve tried to watch this three times and can’t seem to make it past 30 minutes. I can’t decide if it’s a spoof or just some truly awful casting choices. Worse acting I’ve ever seen! Worst thing Netflix has ever made. Cringe!",
    "date": "2025-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Cheap action scene. Who fight like that in real life.",
    "date": "2025-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Very bad film. Very bad actors. If you compare the film with the original where JVCD plays the main role, the original is a masterpiece against this garbage.",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Why was it filmed like superstore despite being an action? The filmography and the story felt like I was watching a 9th grade film project. It was very much filmed exactly like superstore.",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "this is the worst movie on netflix, poor acting, poor lines",
    "date": "2025-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "It’s a terrible action movie with terrible actors.",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This could easily be the stupidest thing I've ever watched.",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Truly horrendous but slightly entertaining of the fact it’s so bad that’s how I came to my one and half star rating. The comedic value comes from how bad the acting is, the predictability and the fighting scenes with Tarentino like blood scenes from people getting shot. If you want the cringiest film of the year it’s here! Haha",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Horrible, don’t do it to yourself.",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "If you're looking a perfect action movie, you're entirely at the wrong place.\nIf, you however are looking for an action movie that doesn't take itself too seriously, this is a gem.\nActing isn't the best, and some of the jokes aren't my type, but it still managed to make me giggle. The choreography is amazing and entertaining. \nOverall 3.5/5\nIf you're bored and just looking for entertainment 4.5/5",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The worst movie i ever seen don’t waste your time iam very mad 😡",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Terrible movie. 1 word to describe it ..... CRINGE",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Clunky.. badly directed and acted Die. Hard rip off",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Mannn this movie is so bad I had to create a rotten tomatoes account to tell everyone to not waste time watching it",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This film is pretty bad but laughs at itself while it’s doing it. Even the fight scenes which are well orchestrated, are punctuated with humour. Yes loads of cliches, it’s know that it wants to be die hard but can’t get close. It’s knows exactly what it is and it’s enjoyable. Great use of a classic Star Wars phrase as well…",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Terrible movie wooden acting and laughable ott fight scenes",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "so stupid, meaningless movie with bad dialogue, bad acting and lot of cliches",
    "date": "2024-05-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was good and the fight scenes were cool ig",
    "date": "2024-04-14"
  }
]