[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This officially goes into my bottom 10 of all time. The acting is awful, Jennifer Lopez is a joke. Stupid story, stupid characters, bad direction, awful film.",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Screw you people I love romcom JLo",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The critics really morning sicked on this one.\n\nIt a light hearted romp, its funny, charming, silly, couple friendly film.\n\nFor couples, its a great watch. \n\nSociology degree holders, veer away.",
    "date": "2025-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Jennifer Lopez's worst movie in 1 hour and 44 minutes!!!!!!!!!!!!!",
    "date": "2025-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Make a sequel to this already...loved this movie",
    "date": "2025-04-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Beyond predictable, corny,cheesy and anything that screams  'I knew that was gonna happen' is how I would describe it.. I love jlo...but even she couldn't make this movie worth watching...it sucked",
    "date": "2024-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I love romantic comedies and I don’t care how cheesy they can be. However, the Back Up Plan was one of the worst movies I’ve ever seen. The story line was weird and uncomfortable. Stan was disgusting. An absolute selfish jerk, void of genuine feelings. His character showed too many red flags of a narcissistic abuser and Zoe was too desperate to notice. The sequel might look something like the movie “Enough” unfortunately. Disturbing. Two thumbs down.",
    "date": "2024-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Terrible!!! Too exagerated movie.",
    "date": "2024-06-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved The Movie When The Movie Was First Released Many Years Ago, Haven't Watched Since The First Release Day\nBut I Remember",
    "date": "2024-03-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The first thing I will say about this movie is that it's not terrible. The story is interesting, the characters are good led by the always charming Jennifer Lopez. But, the guy she is with and wants and so forth is an ASSHOLE. This guy gets pissed off at her in almost every single scene, talking to her like she's an idiot. And the whole time we are supposed to be rooting for this couple to get together? Nope. Not here. I was rooting for her to see how much of an ass this guy really was, but sadly no. And then the movie ends with a really weird, out of place scene where it's some time after her babies were born and then she throws up in a garbage can and the two stare at each other with wide open eyes. Were they seriously setting this up to have a sequel? I hope it was supposed to be a joke, because it's been 11 years and no Back-Up Plan 2! Either way, the movie is okay but there are some stupid, cliched moments like a \"giving birth hurts so if the woman is yelling in a deep baritone voice then it's fucking hilarious\" scene, \"guys always can't stand hearing about female anatomy and they pass out\" scene, \"having kids is really, really hard so let's make sure the guy sees nothing but the bad side of having children\" scene, or in this case scenes. I give it a low rating for all the things mentioned, but if you remove the guy and replace him with a different actor then this movie might have been really good.",
    "date": "2023-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The actors have chemistry but the script is unbelievably bad.",
    "date": "2023-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Dumb...even for a Jennifer Lopez movie.  The music is insipid, the writing is so predictable and stupid, the acting so boring, and plot so predictable, it's almost insulting to watch.",
    "date": "2023-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Great movie, like the actors",
    "date": "2021-02-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "J-Lo was great & several minor parts were good too.  Plot about what you'd think.",
    "date": "2020-06-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A mildly entertaining rom-com from Lopez with few hilarious moments.",
    "date": "2020-03-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The Backup Plan makes Plan 9 From Outer Space look like Gone With The Wind.\nWorst movie ever but I'm stuck in lockdown and was forced to watch this never-ending string of cliches and not upset the lady I'm stuck with for who knows how long...",
    "date": "2020-03-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Embarrassing. This film is contrived, unfunny and an insult to the medium. The script is so bad. I wanted to slash my wrists while sitting through it.",
    "date": "2019-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "J. Lo gives a good performance, but she and her co star are infuriatingly unrelatable and the plot is so lazy it can't even hit the easiest beats in story structure most rom coms follow. I guess I could see an elderly mother and her middle aged daughter getting some laughs at all of the pregnancy and situational yuks.",
    "date": "2019-02-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This film was unwatchable.",
    "date": "2018-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Perfect Romantic Comedy!",
    "date": "2018-08-26"
  }
]