[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Storyline is as predictable as it is bad, movie has no grip, photography is unimpressive and actors are badly directed. The movie moves along slowly interweaved by boring punching fights and a few lousy car chases. No spark, no ideas, no talent. The only passable thing is miles davis music, but even that is intercepted rather than played.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "All the other problems with the film are real, but at least I can clearly and easily follow what happens in hand to hand fights.\n\nThey do a long shot and you can see everything clearly.\n\nWhich is a lot better than many films.\n-\n-\nIt's a bit of a b movie and it's not funny enough to make up the difference, but honestly the action is pretty good.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Looks like it was shot on an iPhone 5 and script by a 12 year old. The incar scenes are trash, no motion for car or actors and crappy green screen behind.  Movie is garbage.",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I was surprised that the movie was as good as it is. Good plot, and very good action scenes that don't overwhelm the movie. Definitely worth a watch",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Yet another exceptionally stupid movie that was written, directed, and produced by people that have the IQ of small rodents",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I actually tried to watch this three times.  Couldn't finish it.  Just not a good movie.",
    "date": "2025-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "A movie that really wants to take itself seriously but so many moments where you actually say “oh my god, you’ve got to be kidding me” out loud. Dialogue super cheesy. Predictable. So many unrealistic elements. The idea of bricklaying is completely useless in this movie. It’s not even a subplot…hard factors into the story. It’s so campy that part of me thought they have to know that and are embracing it? \n\nDecent action scenes to be fair. \n\nWithout Eckhart, this movie hurts.",
    "date": "2025-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Entertaining. Pretty good plot. A lot of fights. Unexpected ending.",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Pretty entertaining and underrated in my opinion",
    "date": "2025-05-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Not one thing good about this movie.  The action is unexceptional, the plot cliché & the plot boring.",
    "date": "2025-05-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Audio dialog mix stinks. Predictable plot. B movie.",
    "date": "2025-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Another cliche action flick. POS",
    "date": "2025-04-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Accion y espías siempre va a ser una combinación ganadora. La dosis justa de tiros, peleas y explosiones... pero la historia francamente no me pareció la gran cosa, muchos giros pero igual resulta predecible. Disfrutable pero hasta ahí nomas.",
    "date": "2025-03-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "If it wasn't for the pretty decent action sequences I would have hit STOP in the first 15 minutes. Zero plot, poor is the nicest word I could come up with fir the writing. And it boggles the mind how such notable actors could sign on for this travesty. Didn't they read the script? Or maybe they need a new Tesla.",
    "date": "2025-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Most of the first 20 audience reviews I read were not good, but yet many left scores of 2 and 3 ?  I suspect the RT score should be 10%.",
    "date": "2025-02-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What an absolute brilliant way to waste a few hours of my life! From the opening scene, until the very end, I was on the edge of my seat. I mean, have you ever- I mean ever- seen anyone so handy with a trowel? The acting may have been appalling, the fight scenes ridiculous, but the trowel left me begging for more. After the movie I jumped online to see if I could retrain as a brickie. If you want to scratch your head at the end of a movie and ask yourself, “what did I just watch” then this is the movie for you😂😂😂😂",
    "date": "2025-02-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This might just be the absolute worst movie I’ve ever seen. The dialogue was stilted and corny. The acting didn’t even rise to the level of cartoonish. The fight scenes were choreographed by an amateur modern dance troupe who thought they were in a middle school cafeteria food fight. There literally is nothing redeeming about this movie. Two hours of my life I’ll never recover. A travesty because the book actually was pretty good.",
    "date": "2025-01-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This is a bunch of stunts and poorly coordinated fight scenes which they try to make work with editing that does not work. Lots of slow motion all tied together with an incoherent  story line. I think they shot the scenes and tried edit a movie that is hot mess of bad dialogue and acting.",
    "date": "2025-01-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "There was not much good about this movie. Horrible acting, fight scenes, directing, and so on.",
    "date": "2025-01-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Eckhart had the moves of Segal and the voice of Batman. Such a terrible movie, and I really like that  guy.",
    "date": "2025-01-09"
  }
]