[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "An epic waste of time. Terrible, poorly thought-out, inconceivable plot. Characters were more like caricatures. Don’t waste your time.",
    "date": "2025-01-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie tries so hard and comes up so short.",
    "date": "2024-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Not a good movie, acting mediocre at best.",
    "date": "2024-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The SAS is such a rich subject you would imagine it difficult to make an ordinary movie about them but I'm afraid this is one. I like the lead actor but this is an appalling script with a lot of wooden acting and some appalling directing. The normally excellent Tom Wilkinson is ruined by one of the great shite American accents and it's improbable plot is matched only by its predictability.",
    "date": "2024-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "If you like American action, military, or any resemblance of realism do not watch. I could even get 10 minutes on n without turning it off. Terrible acting and very unrealistic weapon scenes and “sniper shots” right out of the gate. Do not waste your time.",
    "date": "2024-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It is really hard to understand the accents. The story was disjointed and hard to follow. With that accent they should have talked slower. I couldn't finish it, but it looked like it had potential.",
    "date": "2024-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Ruby Rose didn't do it for me in this one. She was supposed to be a cold blooded heartless killer - but it's stiff. Meh.",
    "date": "2024-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Cleverly done with battlelines that seem to be intentionally blurred in this uniquely drawn action thriller.  Though it could seem like a confusing mess to some.  I really can’t tell if it was intended to be this way or just terribly done. This could be because the lead was maybe the worst part of the entire thing, whereas his antagonist counterpart was the best.  It did, however, succeed in a unique feat as it pulled off what seemed like a 'double-turn' at some point during the middle of the film.",
    "date": "2024-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Although many reviews said the movie was average to worse, it somehow worked out for me. The plot itself was really interesting. How dangerous the world can be when governments hire mercenaries to carry out the dirty job!",
    "date": "2024-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's Under Siege 2 on roids!!! If you like action with tons of gun fights, mercenaries gone rogue, and dirty politicians then this movie is for you! I",
    "date": "2024-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The  Colonel,SAS commander,has a working class,London accent.Very unlikely. One or two good action scenes but a poor depiction of Britains top fighting force.",
    "date": "2024-06-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The Black Swans, (a private military company) is hired by SAS commander George Clements to clear a small village in the Republic of Georgia to make way for a gas pipeline. Well the Black Swans not only clears the village, they massacre the entire village. But they are unknowingly video taped and A Red Notice is issued by Interpol for the leaders of the group, William Lewis and his adult children Grace and Olly are charged with crimes against humanity. \n   In order to cover up for the government involvement, Clements puts out a kill order on the Black Swans leaders and the SAS seizes their headquarters and kills William. Grace and Olly escape and immediately plan to avenge their father.\n  \"This isn't about money, its revenge\" - Tom\n   Grace now leads the Black Swans and they hijack a train going to Paris and hold the passengers ransom against the British government. The plan is to blow up the gas pipe network when the train is deep inside the Channel Tunnel. \n  \"If you don't pay us I'm going to destroy this tunnel and everyone in it\" - Grace\n  \"If she exposes what we've done this is a very big problem for me. Get down there and kill her\" - Prime Minister\n   Now what they didn't count on is a SAS officer, Tom Buckingham (Sam Heughan) being onboard the train. Tom escapes off the train and contacts and warns his friend who is also a SAS agent but he has been bought out by Clements and sends a rescue team into a trap. So Tom is on his own against Grace and the Black Swans.\n   This is a OK thriller with really good actors and lots of action, but it looks more like a TV movie. Still worth the watch.\n Cast - Sam Heughan, Ruby Rose,  Andy Serkis, Tom Wilkonson",
    "date": "2023-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A common problem these days.  Some old stuff recycled.  At least it's a British production instead of an American one",
    "date": "2023-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "An above average thriller. The beginning is slow but the train portions are tense. And the best set piece is at the end. It's really character-driven but won't win any more awards for originality.",
    "date": "2023-04-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Excellent movie with extreme twists.",
    "date": "2022-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This movie was difficult to watch. SAS: Red Notice is beautiful to look at, but the plot has so many holes and conveniences that it's hard to ignore. Even more difficult is to criticize without commenting on plot elements. So, if you want to avoid spoilers, know that I recommend the movie to those who like old-fashioned action movies, where a single bad boy gets one with everything and everyone. If you care about the plot, you won't be satisfied. From here, I cannot continue this review without criticizing plot elements.\n\n**Spoiler warning: From this point forward, I will discuss important plot elements.**\n\nIn the first few minutes of SAS: Red Notice, we hear narration about psychopathy. We hear that psychopaths are incapable of love, but they can learn. Psychopathy is a widely discussed topic even today, but I'll let that narration slide. But the narration is important because it is the theme of the film.\n\nThe film introduces us to Black Swans, mercenaries. They destroy an entire village to prove they are the bad guys but end up being filmed by a child with a cell phone, which could expose the British Government's involvement. First, the movie takes place in the 2020 or 2021, digital media era. In what world do these mercenaries live where they assume no one has a smartphone in their hands. Still, either these mercenaries are too good, or I don't know, but I think it's very unlikely that mercenaries like the ones in the movie exist these days, considering how quickly information travels. But out of pity for the plot, this can slide too.\n\nSo the movie shows us the good guy: Tom. He is a psychopath, according to the film. No, that's not clear and won't be clear until near the end of the movie, but it was obvious to me from the start. With a narration about psychopathy, the way Tom behaves, and the butler's description of how his grandmother loved his grandfather, it was more than obvious that Tom is a psychopath. This will be explored at the end of the movie, of course.\n\nThe Black Swans are the worst mercenaries of all. Not only must they live in the last century, but they hide in the enemy's backyard, and assume the government won't frame them to get rid of exposure. In less than half an hour, they are tracked down by the SAS, the unit where Tom works.\n\nDespite this being a film about active corruption, this element is little explored in the film. The movie focuses more on how Tom is going to save everyone from the train. Save them from the Channel Tunnel train. After being hunted down, the remaining Black Swans decide on a final plan to hijack a Channel Tunnel bullet train. Their plan is to incite terrorist suicide, but really what they want is money and killing innocents in retaliation. Tom coincidentally is on board the hijacked train along with his girlfriend Sophie, a nurse.\n\nTom sneaks out of sight of the Swans, who have tunnel vision. Tom, under the train, decides to open the plumbing in one of the toilets to get on the train and, wow, his girlfriend is in the same toilet, who knew! So their plan is for Tom to save the little girl who was with Sophie in the bathroom but leave Sophie to the Swans to think that Tom took the little girl by force. What a stupid plan. Considering what Tom and Sophie have seen so far, it's obvious that this will end up with Sophie dead, but wrong: for some reason, Grace, leader of the Swans, psychopath, who has so far killed mercilessly, decides to leave Sophie alive, you know, to continue the plot.\n\nMuch of the film is about Tom sneaking Swans out while the SAS avoids entering out of fear. Here I even understand SAS; in hostage situations, the police are usually passive for the sake of the hostages. But for the sake of the film, the police agree to prepare an entire escape scenario for the bandits in exchange for the freedom of the hostages. I've never seen this happen in reality.\n\nThe Swans' real plan is to escape through a natural gas pipeline using carts. It's interesting, but it seems so dangerous to me if you consider that one spark and everything goes up in the air.\n\nSo Tom kills most of the Swans and we're ready for the final battle against Grace. The fight is OK, but then it comes to the point where Tom, being a psychopath, is put to the test. Grace says that she understands him because she is one too and that Tom would make a great Swan. Maybe it would even be interesting if Tom decided to join Grace, but no. He even seems moved, but his will to kill her is stronger.\n\nTom asks Sophie to marry him, but she says no because he is a psychopath. He cries, and she says she will marry him because, if he cried, it means he really loves her. Sigh. The film ends with Tom dying to kill more, with Sophie supporting him as if it were a new adventure.\n\nI can't stand films like this. If you want a classic action movie with a lot of gibberish with a macho hero, this movie is for you. I prefer something smarter.",
    "date": "2022-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This could have been a great movie. Yes there's lots of action but what you wind up rooting for is a corrupt government and corrupt system. Good action snd could have been a great plot. The good guys might not have lost but they didn't really win either.",
    "date": "2022-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Story is intriguing and fresh. Lots of moving pieces of which not much missed. Great cast and visuals. Contradictory behaviours of characters seems to take away the joy a bit. But this movie potent enough to keep the audience attention and focus with it till the end.",
    "date": "2022-04-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "It was great - would like a sequel!",
    "date": "2022-04-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Too long and ridiculous amount of violence - must've used several tankers of fake blood",
    "date": "2022-03-01"
  }
]