[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "O filme é incrível do começo ao fim e consegue prender a atenção de quem assiste. Cenas de luta e de ação muito boas. O final do filme podia ter sido muito melhor e mais envolvente. A garota poderia ter continuado nos caminhos da Kate. Poderia ter tido um salto no tempo de uns 10/15 anos e mostrado a garota lutando e sendo como a Kate foi, como forma de terminar o filme de uma forma que pudesse honrar a morte dela e assim pra mim o filme seria 5 estrelas. O filme é excelente e fizeram esse final tão sem graça …",
    "date": "2025-09-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This film is your typical double-hard assassin movie.\n\nWell made - I like the lead and supporting cast - plus it looks good, is watchable, but ultimately is generic and predictably unoriginal. The plot will have no surprises, and will be the least interesting aspect, but it won't offend you too much either. Maybe as a slightly older person, I have seen too many movies like this to be involved and excited by it. Were I half my age, with less experience of such film, I might have better things to say. As it stands, if you like this kind of assassin getting revenge movie, you'll have a good time. Just do not expect anything new here.",
    "date": "2025-06-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I do not and will never see Mary Elizabeth Winstead as a bad azz assassin. She will forever remind me of Ramona Flowers in Scott Pilgrim vs The World. Basically the premise of \"Kate\" is the same as the Jason Statham movie \"Crank\".",
    "date": "2025-05-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The beginning was good, suddenly it becomes a none sense movie, she is about to die and still fighting. I was able to see 3 mistakes where you can see the is fake punches or kicks, that is disappointing",
    "date": "2025-02-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Badass in every way, entertaining, lots of action and cool music.",
    "date": "2025-01-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The blend is unique in this visually sharp action thrill ride that follows the D.O.A. trope used in films, with different twists and dynamics that work well.  Side characters were underdeveloped.",
    "date": "2024-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Actin movie, lots of killing, over the top, entertaining.\n\nBad reviews are from people who liked Twilight and the Acolyte.",
    "date": "2024-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It’s a good, brainless, revenge action plot. I enjoyed it!",
    "date": "2024-05-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Really enjoyed it! I also read in a youtube comments that it follows the narrative style of Kabuki, a classical form of Japanese theater told in five acts. Pacted with action! 🔫",
    "date": "2024-03-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "not one but multiple stabbing",
    "date": "2024-02-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "much much better than these reviews deserves. action with great acting",
    "date": "2024-01-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "What is the main plot for most 1980s & early 1990s action films, revenge & \"Kate\" is exactly that. \nThink \"24 Hours To Live\" (2017) and \"D.O.A.\" (1950/1988) where our protagonist has a short time left to live & so begins the blood soaked brutal violent journey through the neon lighted streets of Japan.\nIt avoids my main criticism of most modern action films & that's the up close camera with too many cuts, but the action in \"Kate\" allows you to see each punch, shot and stab allowing the bloody action to flow. One of the main reasons this worked is down to the performance from Mary Elizabeth Winstead, who looks like she's been doing action films for years.",
    "date": "2023-12-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "doesn't do anything new, but what it does, it does it very well.",
    "date": "2023-12-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Mary is amazing \nHer face just conveys so much\nBeautifully made \nJohn Wicks and a Kill Bill that goes darker and deeper simpler\nAnd there's a Woody\nHer Face\nThank You Mary",
    "date": "2023-12-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Brutal, down to earth, great action sequences, good acting.",
    "date": "2023-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not very original, derivate of numerous other films but not in a cool homage way.",
    "date": "2023-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I give the movie, Kate half a star. With that rating, I can only muster a one-word comment - why?\n\nIf I ever discover the answer, perhaps my rating will drop another half.",
    "date": "2023-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "One of my favorite genre's is dangerous women, being wronged getting revenge so this supposedly right in my wheelhouse.  But really it has to be within some kind of realm of conceivability.  Radiation poisoning with only 24 hours to work with, layer upon layer of underlings to overcome.  All the fights outnumbered at every turn.  Twists and turns in the end to navigate barely being able to move. Too many second breaths after looking down for the count.\n50 minutes left and she can barely function, pulling out teeth, brused, blood everywhere. \nNope, too over the top.  More like a poor imitation of Hulk Hogan down for the count but at the last minute reviving to win the match and beat the bad guy.  But wait she did exactly the same thing. Ostensibly shot, presumed dead, the cliche gasp for breath and resurrection for one hour just long enough to get the job done.\n15 minutes in was there anyone that had not figured out Woody's character was not what he seemed to be?  \nThey go too far with the action, blood a gore and I blame super hero movies and video games. Everything way too over the top, to bloody, too many dead bodies, the hero taking too many gun shots and wounds and in this one radiation poisoning to boot. No one has the courage to write a good script, keep the action in the context of the script and let the story have depth. They think more carnage will innoculate them from a lack of interest so this is what passes for and action movie now.\nAn absolutely ridiculous movie that interesting twists at the end got drowned out by all the blood and guts washing over the screen.",
    "date": "2023-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "KATE follows the basic recipe of the revenge genre, but avoiding the stereotype where the protagonist is almost always male.\nThe action sequences are good and some camera games were excellent, bringing even more dynamism to the fights.\nThe highlight of the film is undoubtedly Mary Elizabeth Winstead's performance as the protagonist.\nIt's the kind of movie that you start watching with no expectations and at the end you end up glad you gave it a chance.\nI recommend.",
    "date": "2023-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Really really really even when at 2/3 part of the movie Ive already know who was the real guilty. The movie it's awesome. And this lady actress it is really perfect for the movie. She got all the stars and the Oriental lady also. The scene actions are really very well directed",
    "date": "2023-05-23"
  }
]