[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thought it was great, a perfect blend of family drama and ghostbusting, plus the lore was cool and the CGI looked good",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Great effects, but it has so many bad aspects like the really overcrowded cast, the main villain just gets destroyed really easily and the fight itself just looks like a Fortnite event. I am a fan of the originals, it pleases me, it's not a hard watch, but it's too much. But i give extra credit for the Harold Ramis homage. It was really beautiful.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I actually enjoy this iteration of ghostbusters more than the reboot one, for me vastly more entertaining and better development in the villain. Also much more heart and development of the main cast. For me this is the real reboot of ghostbuster and I look forward foe the next installment to complete this really good reboot trilogy.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Una muy mala película. No tiene menos nota por la nostalgia de los originales, y la coña con Goser.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Ghostbusters: Frozen Empire sacrifices plot for fan service. Yes, it’s fun to see the cameos and to hear the characters say the thing, but the filmmakers should have spent more time developing a good story. The script makes people act out of character, just so the plot can advance, and requires that the audience turn a blind eye to logic and reason. I can’t hate this movie, though, because it’s still a love letter to the Ghostbuster franchise, there is fun to be had, and there are some impressive visual effects. However, much like Ghostbusters II, this lackluster sequel falls short of its predecessor.",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Ghostbusters: Frozen Empire might have been my favorite in the series. It was goofy, action packed fun with a creepy villain, a lot of characters, and Easter eggs from previous films.",
    "date": "2025-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Certainly a fun film. I believe that the Ghostbusters franchise has plenty of potential. And while it certainly isn’t better than the original two it doesn’t do anything bad enough to make it horrible. Though the big bad villain concept is getting boring and the final confrontation felt boring. Afterlife also didn’t need a sequel it felt like it wrapped up the holes left from Ghostbusters 2 not having a sequel.",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Good start... good characters... good story..great legacy continues.... loved it.. I wish norw people would of supported this film... Sony tried to stay loyal and do the right story.  Paul rudd is great the kids are great. I hope we can see more but probably not only made 202mil in theater...",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Love the ghostbusters franchise.",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Some fun callbacks and cameos, though the plot felt a bit weak. Still, Paul Rudd fits perfectly into this world.",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "After life was not bad… was looking forward to this one… it’s awful.  It wasn’t eerie or scary at all, Ghostbusters works when it’s creepy and scary and the crew cracks jokes, not when you have day time ghosts and silly CGI, and no storyline.  They gave us a wizard? Who cares. They gave us OG busters that didn’t do anything… they gave us a storyline about committing suicide to be a ghost and have a relationship with another ghost?!?!?  My kids didn’t care for it, they liked afterlife but this one was so dumb.  They could have nailed it… who reviews these movies?!?",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "It's sitting at 81% on here! 😂 Further proof, if any more was needed that RT has been invaded by the TIk Tok generation. Who wouldn't know good cinema if it slapped them in the face!",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Thought it was very enjoyable and a good time",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Did they forget that Ghostbusters is a comedy?",
    "date": "2025-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Is it a perfect movie? Of course not. Does it have the spirit of the franchise(not including the 2016 mockery)? It sure does. Mostly, it feels like a live action episode of The Real Ghostbusters. Right up that alley. Phoebe gets into more trouble due to her inability to connect with the living. Callie and Gary are a more solid couple with Gary experiencing the ups and downs of parenthood. Trevor is in that awkward late teen phase. Not quite an adult, but not a child anymore. Winston has expanded the research of Ghostbusters into several branches. Ray, with the help of Podcast, now has a YouTube channel. Everything gets weirder when a brass orb is brought into Ray's book shop. See it for more.",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This movie is just ok ..not bad by any means \nI do like the nostalgia it has",
    "date": "2025-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The \"Critics\"/🤓 don't know there talking about, its an amazing movie!",
    "date": "2025-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 55 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $112,700,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The worldwide gross is $201,967,521.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Eh…it’s a decent stand alone film, but only if you know nothing of the 2 other Ghostbuster films. By itself, it’s mildly enjoyable. As part of the series, it’s a crowbar trying to squeeze in with 2 other great stories.",
    "date": "2025-07-06"
  }
]