[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Maybe not right now, but give it like 10 years. This movie is so wild it genuinely feels like Adult Swim broke into Nickelodeon at 3 a.m. and nobody noticed. It’s chaotic, unhinged, and weirdly charming in the best way.\nThe real tragedy is that people aren’t turning every scene into memes. Like… hello? How is the internet sleeping on this?",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "When I first heard about this movie, I was so excited for it to come out on August 2nd, 2024. If you are confused, the WHOLE movie got leaked on Twitter(X). Anyways, I saw this movie on the day it came out, me and my parents were on a trip to Canada, I was watching this on the way there and I gotta’ say I was not impressed, but didn’t HATE it. Things I like about the movie: decent animation, good acting, entertaining, I like the introduction to Sandy’s family. Dislikes: plot was slow at times, too many characters, there were some unnecessary elements in there. That’s all, by the way I LOVE SpongeBob, I have been watching it since I was 3.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I know it isn't that good, but I kind of enjoyed watching it, felt a little too fast paced, honestly do not recommend this movie for others, but for me, ehh, I guess I liked it",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "THIS MOVIE IS HOT GARBAGE! I don’t know what it is about this movie but it is just terrible by all means! the acting is bad, poor camera work, and just watch the other SpongeBob movies.",
    "date": "2025-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Can't recommend it..",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie is CRAP, unlike the other three SpongeBob movies that are really cool, this one is CRAP FROM HELL, MADE BY THE DEVIL",
    "date": "2025-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Um filme Sem coração e roteiro, Aqui vemos a decadência do Bob esponja, junto com um filme sem criatividade, vazio e grotesco",
    "date": "2025-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Never has a movie felt so rushed and yet took so long to end. This movie is so boring and the jokes aren’t very funny. I never thought that a movie with SpongeBob would be my least favorite movie.",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The worst movie of all time, wtf was this???",
    "date": "2025-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "No no no like why does this exist",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This movie was… really bad! As a Spongebob fan, I’m sad to say that this was so disappointing, although the film is for kids, I don’t suggest you wasting your time on this trash",
    "date": "2025-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is just SOOO WRONG",
    "date": "2025-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "La película no es la mejor de la franquicia o siquiera la mas mediocre, pero creo que su CGI y su guión es muy buena creo que tuvo muy buenas vistas.",
    "date": "2025-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "A perfect movie for brainrots and differently abled people",
    "date": "2025-06-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Honestly for a Sandy spinoff movie, this was… kind of terrible.",
    "date": "2025-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "not even worth a 1 star,plus it's WAY off the spongebob lore.",
    "date": "2025-05-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Why is the rating so low? This movie is so amazing",
    "date": "2025-05-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The whole movie was boring, weird, not funny, and in my opinion it doesn't even deserve the title of a 'SpongeBob' Movie. You're better of watching paint dry for the whole 1h 22m for the running time of this waste of time movie.",
    "date": "2025-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I can't fail it because I was laughing a good bit. Some points because it was funny, others because of how bad it was. Toddlers will prolly find it very enjoyable.",
    "date": "2025-04-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The most made-for-TV feature outing yet, Saving Bikini Bottom: The Sandy Cheeks Movie is nuts to think this is the direction SpongeBob and company should be going.",
    "date": "2025-04-18"
  }
]