[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A star studded cast that somehow doesn't make up for its lacking writing, but with that said, it should be noted that I did enjoy this movie. It came out mid Covid era, and offered a bit of escapism, with some laughs sprinkled throughout. Also the score must receive a mention, Michael Andrews really brought it home, along with a Kim Wilde song, giving you a  sort of \"Breakfast Club\" feeling. Fun 6/10",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It’s a slow start, but the film actually gets pretty funny and in the end, pretty hilarious . A bit of fun if you’re in the mood for something silly. 4 stars!",
    "date": "2025-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Quirky, disconnected, wry humor that can be easily blamed on the British.  Definitely borne out of the pandemic...hell, it might even be the actual documentary from its own plot.",
    "date": "2025-05-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I can't tell if the shitty effects and the shitty acting are on purpose or if it's satire. Only good bit in this movie is Pedro Pascal, although I stopped the movie about half an hour in. Top many things going on and just not a good story in general",
    "date": "2025-04-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme ruim, o roteiro é fraco, as cenas são ruins, o elenco é mais ou menos, e ninguém ajuda a melhorar a porra do filme, a história é fraca, e o filme coloca cenas de dinossauro todo fudidos com humanos, eu não recomendo esse porra de filme vai toma no cu.",
    "date": "2025-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Watched about 20 minutes before I realized this was just boring nasty \"humor.\"",
    "date": "2025-03-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Just caught this on Netflix. Funny, goofy humor. It's everything how I imagined Hollywood was/is. The reference to a Tom Cruise movie being filmed at same time, Hilarious. The fact that the actual world was terrified of everyone dying... and that Hollywood would make it a top priority to get Cliff Beasts 6 out for distribution",
    "date": "2025-02-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Grasped satire over its conveying message only to be met with tiresome groans over aimless jokes resulting unsatisfactory that cements the poor stretch of their ideas, thus becoming a familiar directorial low whilst squandering a talented ensemble. (C-)",
    "date": "2025-01-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "neat concept. some good messages in it. was ultimately disappointingly personally. made me cry",
    "date": "2024-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "not funny! Not a scene. I really tried hard. Those massive talents, do they only work for the money, or do they read scripts as well?",
    "date": "2024-02-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A real disappointment, especially since there's so much one could actually satirize here. Apatow settles for a kind of cowardly laziness where he sort of remakes \"Tropic Thunder\" without any of that movie's edge or humor.",
    "date": "2024-02-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This is a dumb movie, but it knows it's dumb.  I laughed, but I like silly stuff.  I can understand why other people didn't like it.",
    "date": "2024-02-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "About a half hour too long ,but still enjoyable",
    "date": "2024-02-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Very few jokes and lots of pointless dance sequences make this hard to watch. A surprisingly good cast for such an unfunny turkey.",
    "date": "2024-01-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A completely humorless mess despite the talent.",
    "date": "2023-12-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I thought this movie was going to be funny but by 20 min into the movie I wanted it to be over already.  Seriously, I kept wondering what was the plot. It wasn't funny enough to just remain pointless for the duration. It was stupid. What a disappointment.",
    "date": "2023-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Shorter and with more dancing",
    "date": "2023-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "How can you not love a movie with flammable nuts?",
    "date": "2023-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I liked it. It's one of those stupid movies like Sharknado or Epic movie, I like those kind of movies. It wasn't funny but it was fun and idea was good.",
    "date": "2023-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Admittedly the only reason I watched this movie is because I love everything Pedro Pascal has done, well apparently I love everything he's done besides this movie. It's filled to the brim with cringey and just outright bad jokes. The only redeemable part of the movie was Deeter and Howie. I heard it was bad, but genuinely wasn't expecting it to be THIS bad. Just skip this one,  it's not worth it.",
    "date": "2023-07-22"
  }
]