[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I like \"bad movies\" because they are fun to watch. This movie was boring, cringe, and not fun at all to watch. It's just a terrible movie. Don't watch it.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Turn brain off and eat popcorn.  It looks good, has a good cast, and stuff goes boom a lot.  Don't treat it as any more than that and you will be fine... like that Hugh Jackman Van Helsing flick.  That all said, the story wasn't very gripping, and there way too many subplots.  What about his kid (that is very rarely in the film)?  His rivalry with Ares?  Love interest?  Fellow half brother?  Zeus and his brother/father issues?  I could go on but there are so many of these threads that are never satisfactorily addressed, but each could have made its own flick.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1 hour and 39 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated PG-13 for Intense Sequences of Fantasy Action and Intense Sequences of Fantasy Violence!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $83,600,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "While it suffered from the same flaws as the first one, I still really enjoyed the movie. It had a lot of great action sequences and it was really fun to watch. I definitely recommend it for fantasy and mythology fans!",
    "date": "2025-06-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "These Clash of the Titans sequences are very predictable and pathetic, they want to focus on just entire CGI scenarios and leave the great story aside. Rating 3.0",
    "date": "2025-06-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I think the last 10 minutes were written by an illiterate 2nd grader as part of a school project.",
    "date": "2025-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "While not a great movie the special effects and make up were solid. There was good acting anad engaging characters but the movie pointed out that wars a dirty things that leave winner and loser in need of a good scrubbing.",
    "date": "2025-06-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Wrath of the Titans is bigger, bolder, and more emotionally resonant than its predecessor, delivering a powerful gut punch. Where the first film held back, this sequel goes for the jugular. Perseus is a more fully realized character, Ares proves to be a far more formidable and ruthless villain than Hades, and Kronos emerges as a standout movie monster - picture a walking volcano. The film's biggest, and possibly only, failing is that Kronos isn't given enough screen time.",
    "date": "2025-05-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Again, even the second part felt very rushed, they could have made the story so much better...",
    "date": "2025-05-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "A big improvement on Sinbad the Sailor which was astounding when I was a kid (several decades ago) but yeah, the dialogue and writing in particular are sub-par - it's too bad - quite a lot of wasted talent.",
    "date": "2025-02-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Simply don't get the hate for these films. This and it's predecessor Clash of the Titans (which I slightly preferred of the two) are both high quality sword and sandal movies with excellent special effects, good acting from the star studded cast and are obviously based upon epic tales. Ignore the haters who I suspect many of which have never actually really watched either of them and enjoy both of these quality movies.",
    "date": "2025-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Yeap, It was a movie....",
    "date": "2024-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "In the first scene we see a gravestone that is engraved with English text. ENGLISH!!! Actually, this is the very moment when we all should leave.",
    "date": "2024-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The special effects are definitely an improvement; however, \"Wrath of the Titans\" never improves upon its predecessor and fails to live up to many of the promises its title and premise would suggest. Much like the previous film, this installment turns a concept that should be an absolute joyride into a predictable, below-average fantasy movie and never really much else.",
    "date": "2024-05-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "3.25 stars.  Great special effects that I wish could see in 3D.  The mythology here starts before the gods began & demigods end up saving the world.",
    "date": "2024-03-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I'm split on this one! In some ways I kinda prefer 'Wrath of the Titans' to its predecessor, though in other ways it is a downgrade.\n\nMy positives include the pacing and the use of 'the gods', with both - in my opinion - better done in this 2012 film when compared to the 2010 original. The shorter run time helps, while Liam Neeson and Ralph Fiennes are far better utilised this time.\n\nMy negatives include the story and (one or two) new cast/characters. The plot didn't really hold my attention very well, at a number of moments I felt my mind drift away from what was occurring onscreen. I wasn't bored or anything, though I could feel myself lose interest immediately after a scene that promised more than it delivered. As for the latter, Rosamund Pike and Édgar Ramírez are disappointing additions.\n\nWith that said, Bill Nighy is a newcomer here and he actually entertained me - probably my standout character from this sequel. Toby Kebbell is a solid newbie too, to be honest. Elsewhere, Ramin Djawadi is missed on music but Javier Navarrete does a perfectly fine job in fairness.\n\nNaturally, I can only speak for myself and to me this is an average, if admittedly forgettable, flick - nought worse.",
    "date": "2023-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I enjoyed it, I think its over hated.",
    "date": "2023-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "How do you kill Zeus(Liam Neeson) with a sandstorm?\nHow can you do a remake based on 3d when the 3d is the worst thing of it?",
    "date": "2023-06-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Wrath of the Titans showcases one epic sequence revolving Zeus and Hades; the rest is a dull affair that is easily forgotten within the hour.",
    "date": "2023-05-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "While Wrath of the Titans has many problems to pick away at, it does play its cards better than Clash in most areas, the action, effects and plot are far better this time around. For all it's worth, Wrath of the Titans isn't much of a good movie, but it works as a good sequel.",
    "date": "2023-04-02"
  }
]