[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "So much great never seen footage to see here. What really blew me away was how well they cast the movie Selena.  We all know JLo killed it as Selena but here you’ll discover all the actors did an incredible job playing the family, her husband etc. - because you get to see and listen to these people in this documentary. The actors in the film were like perfect doubles they even sound like them when they speak - superb casting and this documentary confirms what an amazing job they did on that film. This is definitely a great tribute to Selena’s life.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing... Just amazing. I smiled, cried and laughed. She is so beautiful 😭 we love Selena ❤️",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Selena y Los Dinos: A Family’s Legacy is a 2025 documentary that turned out to be a surprisingly well-rounded and heartfelt experience. It’s not flashy or overly dramatic, but it does exactly what a documentary about Selena should do—take you through her life, her roots, her music, and her family history with honesty and respect. It follows her story in a way that feels intimate, allowing viewers to not only hear from the people closest to her but also see pieces of her past that remind us just how extraordinary her presence was.\n\nThe director deserves real credit for the way everything is assembled. There’s a sense of care in every moment, almost as if they understood the responsibility of telling Selena’s story correctly. Instead of rushing through her timeline or drowning the film in unnecessary dramatization, the direction leans onto authenticity. You learn not just the public figure Selena was, but the internal chaos she faced and how the world failed to protect her. It paints a clear picture of a bright young woman who deserved peace but was thrown into a storm.\n\nThe documentary’s structure is also commendable. The screenplay feels carefully mapped out, making sure viewers see not only Selena’s talent but her vulnerability, her dreams, and the tragic reality that cut her life short. Everything is woven together with intention—her upbringing, her rise, her challenges, and ultimately her legacy. You walk away feeling not only informed but emotionally connected to the life she lived and the one she never had the chance to fully explore.\n\nThe emotional balance is handled well, too. While the documentary is respectful in tone, it doesn’t shy away from the darker edges of her story. It allows you to feel the loss without making the experience unbearably heavy. It also does a wonderful job showcasing how loved she still is today, how her family continues to honor her, and how fans worldwide still cherish her voice and spirit. That ongoing impact is one of the most powerful elements of the entire film.\n\nFrom a production standpoint, everything flows smoothly. The archival footage, interviews, and narrative storytelling all come together in a cohesive way. It’s the type of documentary that doesn’t feel like it’s trying too hard—it simply allows Selena’s life to speak for itself. And that simplicity is part of what makes it work so well. You feel like you’re watching the real story, not a dramatized reenactment of her legacy.\n\nOverall, Selena y Los Dinos: A Family’s Legacy is a very well-done documentary—thoughtful, respectful, and surprisingly moving. It celebrates who Selena was, what she accomplished, and what we lost when she was taken from the world far too soon. I genuinely enjoyed it and found it engaging from start to finish. For anyone who loves Selena, music documentaries, or simply wants to understand the impact she left behind, this one is absolutely worth watching.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "What I appreciated most about this documentary is that the focus was on Selena's life. Who she was, what crafted her, the family dynamic, the music. It showed her human side and celebrated her contributions to an era. Most other things I've watched about her ate surrounded around her accomplishments and untimely death. The attention seems to shift to the tragedy and the woman who brought an end to this rising star. But, in this film, they speak very little of the sad ending and more about the beauty before it.",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Tell my why why does she look so unhappy and tries to be happy it's so crazy how her husband knew in the interview he said she put a smile on her face no matter what and she voiced and voiced she wanted to do clothing and make clothes and jewelry she loved singing but it wasn't what she wanted it's what she had to do to support her family and for money knowing her parents didn't have a job and she felt like it was something she needed to do to support her parents and siblings but not her passion clothing was her passion her face was so sad 😭 so sad",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Uplifting and heartfelt. As a new Selena fan, it was nice to see a film about her life and passion not the drama. Well put together ⭐️⭐️⭐️⭐️⭐️",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was very well put together documentary that I enjoyed watching as a Selena fan. Very much enjoyed seeing Chris Perez with Selena‘s family. She is still very missed and continues to be loved by many and that can be seen in this movie. I think I may have enjoyed this documentary more than the Selena movie that features J Lo as Selena. There was just so much more footage of the real Selena and it was nice..",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Really great documentary that’s well put together!",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It’s the best movie ever",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "THIS IS HANDS DOWN THE BEST SELENA MOVIE/DOCUMENTARY EVER MADE NOT ONLY BECAUSE IT WAS VERY WELL MADE BUT BECAUSE IT ONLY MENTIONED THE DISGUSTING SWINE DEMON THAT KILLED HER ONLY ONCE. \n\nMy heart breaks whenever I watch anything about Selena. She was only 23, She had her whole life ahead of her. She was just about to break the barrier and really skyrocket when she was senselessly taken.\nWhenever I think about what she was about to achieve and how she was taken, a knot forms in the pit of my heart and stomach. It makes me so angry. My heart fills up with rage, hatred, anger, sadness, heartbreak and everything negative all at once. I can’t even begin to fathom just how much harder it is for the family. \nI’m glad they’re keeping her memory alive still with the museum but I can’t help but wonder if that’s making things harder for them. For example, if I was in their position I would constantly live in the past. I wouldn’t be able to move forward especially while running a museum of the past. I would forever be stuck on march 31, 1995. Not sure If that makes sense. \nAnother thing I think about is Chris! I think they were soulmates and meant to be together.  I feel like they would’ve been together if she was still here. I wish she was still here. I wish we could’ve seen where she would take her music to & how much more famous she would be. \nGod bless her family & loved ones and may her beautiful soul rest in peace.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it! Brought back lots of memories of my youth and listening to Selena. Film was well made.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Lovely to see new Selena footage. Her aura alone makes this worth to watch",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I never knew much about Selena, but boy did I miss that boat! What a great surprise. She was on her way past madonna , with way more obstacles to hurdle!",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Had a wonderful time watching! It was great seeing the actual family talk about what went down.",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A must watch for fans! The rare footage is amazing and gives the viewer a stronger a sense of who Selena, the person, not the pop star was. A heartbreaking yet wonderful documentary.",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent documentary. The footage from the time and the interviews with the family in current day were perfectly married together. Director Isabel Castro really did Selena justice with this one.",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wow, just wow. What a beautiful life story of their humble beginnings, and oh my, her voice and energy still transpires through any screen to the point of chills. What an emotional ending to a TRUE STAR! RIP SELENA 4 EVER!",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The new Selena y Los Dinos documentary is incredible. I loved how beautifully they told her story, with so much respect, detail, and rare footage I had never seen before. It truly brings Selena’s magic back to life. I loved it — and I’d watch it a thousand times more. 🌹💜",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One thing about Selena is that Her music was absolutely great to listen to, and the creativity and performances she gave. She's always the best Tejano singer the world has ever seen.",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing documentary, focused on Selena's life and career as it should be, without giving unnecessary spotlight to the person who murdered her. Makes me miss her and I've never even met her.",
    "date": "2025-11-18"
  }
]