[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Could not stop watching. Everyone needs to realize this story took place before social media was popular like it is in today’s age.  Catfishing was not a known term back then like it is now. Do I think she was a bit delusional? Yes, but I see why. They did not include all of the details in the documentary! I can 100% see how she fell for it. The 60 different profiles, her talking to so many other people, the baby wearing the clothes she picked out, the cousin bringing her a shirt and saying she talked to Bobby, “Bobby” talking to her family, and the thought probably never even occurred to her she could be getting catfished, because who could be so cruel. The cousin needs to be in jail or some sort of punishment bc wtf?? Why even do that",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I'm annoyed at how many one star reviews are based solely on the victim being naive and gullible.  The documentary itself was great.  Had me curious and anxious for large portions of it.  It certainly could have been shorter but one star? C'mon.",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Although a good twist in the story it felt stretched out. The issue with stretching it out is that you feel less sympathy for the victim.",
    "date": "2025-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I’m upset I wasted my time watching this. This movie should have been a short film.",
    "date": "2025-01-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Unbelievable 😍 can't believe it",
    "date": "2024-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This lady is unbelievably delusional. It’s hard to even watch how absorbed she became in an internet relationship. She allowed this “person” to control her and she quit her job for him. What a dummy.",
    "date": "2024-12-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Netflix's 'Sweet Bobby: My Catfish Nightmare' is an in depth look and one of the UK's most elaborate catfish cons.\n\nSYNOPSIS: 'A woman's online courtship takes an unsettling turn when her romantic interest harbors a dark secret and sinister motives, leading to a harrowing ordeal.'\n\nThe story is, frankly, so crazy, that I found myself wondering how Kirat, who comes across as an intelligent woman, could be so gullible and foolish to be sucked in like she was.\n\nThe con is so intricate and complex that hearing Kirat and the other talking heads explain it is totally rivetting.\n\nA story for modern times and shows how technology can corrupt absolutely.\n\nA great watch.\n\n7/10",
    "date": "2024-12-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The utter stupidity of this woman is incredible and a laugh riot.A different spin on the catfish story.Kirat has a cousin who played a cruel joke on her.But the fact that she had fell for it for so long makes her unsympathetic.Its a mildly interesting documentary but drags with her Facebook obsession, which after the first two years, anyone not so desperate would figure out is going to end badly.",
    "date": "2024-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Sweet Bobby on Netflix offers an intriguing premise, but its execution falters due to weak character dynamics. The lead characters fail to engage the audience, with one coming across as unlikable and frustratingly naive. The storyline stretches believability, especially with the decision to get engaged before ever meeting Bobby in person. While the show attempts to explore complex emotions and online relationships, it ultimately struggles to make viewers connect or care about its protagonists. Poor.",
    "date": "2024-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Okay, the plot had me sitting there with my mouth open! Didn't expect that.\nI think it was a very good documentary. I would've loved if they would've emphasised more on the \"pressure to be married and meet societal standards\". I believe this played a way bigger role than mentioned and which made her very desperate to find the love of her life. Also the gifting part, the baby clothes and that the catfisher never asked for money, just her time, made it way more believable imo.\nThey could've added a mental health professional, in order to understand better what happend in Kirats mind and to understand her on psychological level because she seems like a very intelligent person.",
    "date": "2024-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Victim was far too gullible IMO",
    "date": "2024-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Crazy story, but even crazier to think it took 9 years for the victim to figure out what was going on. A bit frustrating to be honest.",
    "date": "2024-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Only 82 minutes, but still felt unnecessarily long, and sadly, the victim's gullibility was more shocking than the complexity of the catfish.",
    "date": "2024-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Thought this was a good documentary. Did wonder how she let it go on for so long without meeting him. Worth a watch.",
    "date": "2024-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Credit to the lady for telling her story, but this documentary was deadly dull. One half hour would have been plenty for this story.",
    "date": "2024-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Hard to feel sympathy for someone so extraordinarily stupid. Hard to take the documentary seriously. Bit ridiculous. Watched on Netflix.",
    "date": "2024-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Kirat wants her 9 years back and I want my hour and 22 minutes back. Maybe if this story was told prior to 2012; before MTV took us on countless cautionary tales with Nev and Max. Maybe if it was before that I could feel some sort of compassion for this woman. Unfortunately, it’s 2024 and it’s asking a lot of the modern viewer to believe that this woman’s desperation could render her completely blind, deaf, and dumb to the red flags, banners, and billboards flashing in her face. As such, the climactic reveal was not climactic at all. By the time the viewer reaches this point there is about 10 minutes left in the documentary and there is no doubt who it is. Don’t get cat fished by this documentary. Go take a walk instead.",
    "date": "2024-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Nothing new and not really entertaining at all.",
    "date": "2024-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Well made documentary, interesting and well worth a watch",
    "date": "2024-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Sweet Bobby: My Catfish Nightmare - 8/10. I think its fairly easy to brush off this story and say “why didn’t the person clue in to the fact they never showed their face?” Or, “how could she have not known for nearly 10 years?” Or, “how can someone be so naive and oblivious to the signs?” To that I say: its easier said than done. I felt empathy for this person, and I know how the same internet that the catfisher used to play with her life, would be the same internet that might be critical of her story. After watching this doc, I felt sick to my stomach, and felt depressed. Its a tough story to share, and one that I’m glad that they shared. The idea of catfishing is a disturbing concept: why the hell would one do this action and deed? What is really the point? The sad thing is, the person preyed on this individual’s situation of wanting a partner, of finding love post a bad relationship. And for some people in love, they just want to feel being loved and being cared for. The sad thing is, it seems like this person brushed all of the red flags aside just to feel that happiness and love. And its unfortunate that the person lost a portion of their life due to this, but I’m glad that they have taken the situation and are doing things to right the wrongs that were done against her. Its disturbing what some might do to others, and I just hope that everyone finds peace and solace out of this situation. Good doc, but one that will make you feel perplexed and sad by the end",
    "date": "2024-10-19"
  }
]