[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 2 hours and 6 minutes!!!!!!!!!!!!!!!!!!!!! Rated PG-13 for Violence, Sexual/Suggestive References and Language!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "With We Have A Ghost, Landon further cements himself as a contemporary horror master who knows how to craft smart and entertaining stories that appeal to all ages.",
    "date": "2025-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "My family enjoyed this movie and felt it was better than its rating. It’s fun, and the story is moving.",
    "date": "2025-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Narcissist father who like being violent and cheating on his wife, his golden child overly aggressive son and the spineless enabler mother all beat up on in one way or another the only decent human being in their family. Who told Netflix this was enjoyable content?",
    "date": "2025-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie has 90s vibes and I had so much fun watching it. I'm not sure why there are so many scrooges bashing a kids movie, but this gave me a serious sense of nostalgia for silly, entertaining movies from my childhood.\n\nLoved the cast, the friendship between \"Ernest\"and Kevin was adorable. This movie is goofy, and audiences need to be okay with that to enjoy it because it's a blast to watch.",
    "date": "2025-05-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Some fun ideas, encased in poorly thought out drama that constantly leaves the watcher (over the age of 12) saying, \"Wait, what? That's not... huh?\" And that's if you have a solid understanding of what's happening.\nTerrible movie and yet for some stupid reason at the end you'll find your eyes misty.\nWe Have a Ghost is a terrible movie, with solid cast, some good ideas, and a would-be interesting plot, were it not for the cast, the bad ideas, and the uninteresting plot.",
    "date": "2025-03-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I really enjoyed this movie! When it said comedy, I was expecting a spoof type thing but it wasn't that at all, which I liked. It had moments of laughs. It also had emotional moments and I teared up at the end. It was sweet and I was surprised at how much we were able to connect with the ghost character when he can't even speak. Shows what an amazing actor he is!",
    "date": "2025-03-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Entretenimiento familiar puro y duro, con buenos momentos de comedia y emotivos, historia simple y bastante flashera (o no, con lo raras que son las redes sociales no se si es tan distópica la sobre reacción que se muestra) pero con un lindo mensaje final. Admito que la disfrute mas de lo que esperaba, grata sorpresa.",
    "date": "2025-02-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie will surprise you. The amazing young lead Jahi Di'Allo Winston is the entire heart and soul of this movie. Almost everyone around him is either crazy, or batshit crazy, except for his best friend: the ghost.",
    "date": "2024-12-31"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Awful. Bad actors. The dad character was insufferable. The plot is not very well written, hard to follow. So stupid.",
    "date": "2024-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Honestly had high hopes for this movie but the writing just.. wasn’t there. Cliche and a little tacky.",
    "date": "2024-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "There are portions where the plot is lazy and not thought out by the writers. There are portions that are funny and even heartfelt. But overall, there were clearly too many directions the writers wanted to go that caused this movie to be way too long and not very good. \n\nThe CIA aspect was so unnecessary, lazy, and took the story down a poorly executed “Stranger Things” road. \n\nShould you watch it? If you’re looking for a ‘family friendly-ish’ movie during the halloween season and you’ve already watched all the classics, sure. But, you’re not missing anything.",
    "date": "2024-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The reviews are very polarized - I'll admit I had no expectations for this, but it was surprisingly sweet. That David Harbour can express so much emotion without dialogue is impressive. And Kevin brought such sweetness to the role. Did not expect to have such heavy feels from a random Netflix watch - if you like a bit of \"horror\", comedy, but are also a sap like me - give it a shot",
    "date": "2024-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is gonna be one of those every October/Halloween movies for me. The feels, tha laughs, etc. I guess it go downvotes cuz they hated on Ted Cruz, but the man did it to himself. \n\nTig... I wish she was in more of this.\n\nDefinitely vibes with things like Hocus Pocus for sure.",
    "date": "2024-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I don't know why this movie is rated so poorly! I enjoyed it, because it was such an original horror comedy with a big heart. David Harbor's performance was exceptional as Ernest the ghost, even though he doesn't speak. I laughed, I was on the edge of my seat, and I teared up at the end. It's not award-worthy, but I was entertained. The young actors who played Kevin and Joy were particularly impressive. I recommend it!",
    "date": "2024-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Didn't like this movie at all. Very unenjoyable.",
    "date": "2024-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing movie! Definitely watch!",
    "date": "2024-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A very wholesome movie, I really enjoyed it with my mother",
    "date": "2024-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I don't like when social media is presented in movies like this, feels cheap in a way.",
    "date": "2024-06-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It’s cute abs heartfelt.   Its not really a horror movie but more a movie for the whole family :)",
    "date": "2024-06-09"
  }
]