[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "If you value facts and backed by scientific method avoid this.\nit's just conjectures presented as truths.",
    "date": "2025-05-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fantastic. Why would pre-historic hominids drag their dead far underground, through tight, dark passages that are almost inaccessible even now? And what can we really understand about them by sifting through their remains? The science, the excavation methods, the personalities involved, the challenges interpreting what's found are all very well presented, I thought.",
    "date": "2024-05-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A tad dramatized and one of the guys was ultra cheesy/cringey each time he was on camera. It was alright.",
    "date": "2023-12-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Entertainment not exposition; confronting the various perspectives countering this endeavor would have lent it more credibility. Overall, sad to see the compromise of scientific method and critique/collaboration/consensus of the scientific community for the sake of entertainment.  Ironically, it may have had more \"entertainment\" value if it did.",
    "date": "2023-12-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was a great experience, to think there was a species capable of using fire and burying their dead with trinkets in one location 200,000 years before humans is just amazing. Just goes to show us that we're not as wise in our historical knowledge as we thought.",
    "date": "2023-12-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it! It's enthralling, fascinating and all these beautiful women and men who dare to think and study our past are quite frankly inspiring",
    "date": "2023-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "*Spoilers warning* \nVery interesting, however it could have used more expert analysis from scientists other than the two or three archaeologists featured in the show. As another reviewer said, everything sort of sounded like conjecture. How did they know that what they were looking at was the remains of a \nfire? How did they know that the tiny piece of bone they were holding up was probably that of an antelope ( some specific animal - I think they said antelope). I'm not a scientist, but it seemed like a very small piece to be able to determine what sort of animal it was from. And the object that look like a tool, that was very cool, but again- how about some input from other scientists from around the world as to whether that is really a tool or not. If it is such a huge, important finding, surely they could find someone else to comment about it. That goes for the carvings on the wall. They gave some evidence that these might be artwork, but sounded unsure. More like \"Wow, it really does look like artwork, isn't that amazing?\" Rather than a more scientific discussion. Another problem was the lengthy discussions about what the findings meant in terms of what kind of life these ancient people (?)had. The fact that they went to such pains to bury their dead, prompts the scientists to say that they must have loved each other very much and cared for each other. Perhaps they even had belief in an afterlife since they buried their dead so carefully; and also buried one body with a tool (possibly), which could mean they thought their loved one might use the tool in the afterlife.  Okay, maybe. But there are probably other explanations for why they buried their dead or why there was a tool buried with the body. They should have discussed those possibilities as well. Much of the show was taken up by animated sections, which portrayed these people going about their daily lives, burying the dead, walking off hand in hand into the sunshine outside of the cave. Much time was spent talking about the personal connection they must have had to each other, how humanlike they were in terms of how much they cared for one another, etc. It really was over the top. I mean, the scientists had some interesting findings, but they really just took massive leaps in their conclusions about what it meant. Also, towards the end, they spent way too much time going on about the emotional experience of one of the scientists. We were told many, many times-at least 10-that this man had never planned to enter the burial chamber. But then, we are told he had \"slimmed down\" and decided to attempt to get himself through the narrow passageway that led to the burial chamber. We see his struggle to get through the narrow passageway. We see his emotional reaction once he gets to the chamber. Then we see his emotional reaction when he gets back up and shares his experience with the other scientists. We see the tears in his eyes. He talks about how meaningful it was to him. Many shots of him talking about how important this experience is to him. It was just too much. We want to know about the scientific findings, not the deep emotional feelings this man has about going to see the chamber. I'd recommend for the fascinating things they did find, but I was just left wanting more substance.",
    "date": "2023-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Everything about this documentary is beautiful: the subject matter, the storytelling, the science, the animation, the music and the empathetic handling of our long deceased cousins. This is the kind of TV I wait for.",
    "date": "2023-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It is not a scientific expedition, unfortunately. I was extremely disappointed by all the presumptions, by the lack of proper handling of an ancient site, by the presumptuous unscientific conclusions followed by the euphoric burst of emotions and by the hint of a religion. The feel here is that Berger has a predetermined script and narrative, and is manipulating the evidence to fit adequately.",
    "date": "2023-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The setting and the revelations it intends to bring up are very interesting, but the overall thing feels rushed. It does not invest enough into convincing the audience.   It's like the authors tried to purposedly avoid the \"scientific details\", instead stressing the emotional journey of the discoverers, as if in 20 year's time we'd appreciate the lives of those involved in a different light. A boring light.",
    "date": "2023-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "These findings could be revolutionary. I think most people with engrained stories in their heads about humans will want to discount this movie and science.  I think as long as the science continues, the data will tell the story, and hopefully help humans get over their preconceived stories of our pasts, and be open to new stories.  It might do us good.  Great work, congrats on your findings, hope you get the scientific backing to support this.  Thank you",
    "date": "2023-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Life long fan of human civilization and evolutionary development. This \"documentary\" takes archaeological evidence and then creates a fanatastical story that defies the logic of of an animal brain. If you take out the child like fantasies of the narrator you are left with a storybook of wonder. Stick to the facts guys and edit out the absurd emotion and you are left with an interesting story that touches the absurd",
    "date": "2023-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I didn't care that they took some liberties on the professor's story, it still made me question the meaning of being human and our interconnectedness with other species. worthy watch.",
    "date": "2023-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This documentary conveys speculation as fact.",
    "date": "2023-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I am more than sure the book was interesting but from a science perspective this was a 20 minute news article on a cave full of ancient human remains turned into social studied blathering for 94 minutes. The religious babble at the end made it eye rollingly bad. It is made for the general public not people with a science background.",
    "date": "2023-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Bravo!! Who's the genius at Netflix that commissioned this? As a \"scientific documentary\" it's sketchy at best. Here's why. Doesn't seem necessarily to be burial. The \"hominids\" could have just fallen into a very deep narrow \"chute\", in a dark cave and were probably unable to climb out. The filmmakers themselves needed a ladder to get out and headlamps, ropes, harnesses. The skeletons found weren't necessarily  buried by someone. If you left literally anything in any cave for 300,000 years it would end up covered in a lot of dust. Probably buried completely. \nThe archelogy is easy to pic holes in and I am no expert BUT the psychology is the thing to watch here and it is fascinating. \n\nScience it's not. The film IS so much more.  It is a Blair Witchy-esq -Tiger King slow-motion psychological car crash. A deep dive exploration of mass hysteria and mass delusion. An incredible study into how the mind works and how a group can be driven to pursue Netflix celebrity to a point far past reality. At the point in the film where \"cave art\" is discovered, watch the facial expressions of the junior archaeologists. Its same as the reaction to the Emperors New Clothes. A new genre. Bravo Netflix!! Outstanding.!!",
    "date": "2023-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Disappointed. Lee Burger had the chance to share one of the greatest scientific discoveries with the world but instead made a very unflattering opinion piece with to much speculation it reeks of reality tv. Gives scientific communication a bad name.",
    "date": "2023-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The best part of the movie is discovering the bones. The worst part - everything else. The archeologists should have a geologist. The idea of the Naledi climbing through the chute to bury their dead is ludicrous. All fields of study should work together to truly understand how the landscape was during The Middle Paleolithic.",
    "date": "2023-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent, I really liked it, during all documentary i did not look at my phone a single time...this is a good sign of a good movie/documentary :)\nThe story is beautiful and really make us ask questions about our origins, culture and beliefs...\nThe scientists we follow are touching.\nReally good documentary.",
    "date": "2023-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wow! Well composed documentary with unbelievable findings. Can't wait to have more scientific data to back this up. Always interesting to get new discoveries about ancient history.",
    "date": "2023-07-21"
  }
]