[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Quite enjoyable big critter movie loosely based on a video game. Fun with lots of action. Popcorn movie. Special effects are pretty  decent. Faces paced and a great cast make up for a Ludacris plot and a so-so screenplay.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Rampage (2018) is a very confusing story, things happen very quickly and there is no in-depth development in the central part. The very bad script doesn't help at all, the only thing the direction speeds up is the very questionable CGI and a lot of destruction.",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "It’s very similar to Godzilla x Kong: The New Empire. It’s very goofy, and that’s all it’s trying to be, and every scene with the monsters is a gem.",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "De las películas de monstruos de ficción, de lo mejor",
    "date": "2025-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "é um filme muito bom, com varias reviravoltas e com um desfecho incrível. o humor é ótimo, faz voce rir e se emocionar, mas achei a comedia empregada até nas horas que nao eram necessarias. os efeitos especiais e producao sao incríveis, e apesar das contas, é um filme que vale muito a pena assistir. recomendo!!",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Filme mais ou menos, o roteiro é fraco, as cenas são mais ou menos, a história é fraca, o elenco é mais ou menos, mas ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Es buena la actuación de la roca fue muy buena y los co-protagonistas igual me recuerda mucho a un videjuego que jugaba de chico de peleas lo unico que no me gusto es que hay partes de la película que siento que va muy lento.",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It’s one of the best action movies. The animals are well animated, and George, the white gorilla, is one of the animals that wins the hearts of many, including mine. Even though it’s not very well known, it’s highly recommended.\n\nMelannie Duran Mora.",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It’s no masterpiece by ANY means, but “Rampage (2018)” is an enjoyable popcorn flick in all the right ways.\n\nThe CG is way better than what I was expecting and definitely enhances the experience when the monsters go on their titular tirade. It’s basically a big-budget Syfy Original movie, or even a modern-day Showa or Heisei Era Godzilla movie. It’s incredibly stupid, but just stupid enough to still enjoy the ride. It’s the kind of movie that I’d like to call “delightfully stupid.”\n\nDwayne Johnson is a fairly decent lead actor for this kind of movie and he’s well aware of what kind of movie he signed on for here. Even when the monsters aren’t on screen, Dwayne Johnson manages to keep things entertaining long enough until it’s time to shake things up with some cheesy kaiju action.\n\nI’ve never played any of the original games it’s based on, but on its own merit, “Rampage: The Movie” is a moderately entertaining movie that’s serviceable to those looking for some cheap thrills or for having a giant monster movie marathon.",
    "date": "2025-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very entertaining, lots of action, guns, bombs, monsters, the whole nine yards. Great CGI and cinematography. Well done to WETA Digital and all other VFX companies involved, very detailed iteration. Whole cast also great in character. The \"mindless\", ridiculous\" and \"boring\" scores from critics are irrelevant, aren't all movies like that? It's a MOVIE!, I enjoyed it a lot",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Unrated gem, fun and my type of cinema with giant monsters and destruction, best computer games movie too, shame not being a direct sequel...",
    "date": "2025-06-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A surprisingly fun video game movie. Was actually pretty funny, and peaked my interest for it's runtime",
    "date": "2025-06-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie is a just a dumb fun watch.\nand i like that a lot",
    "date": "2025-06-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Should have been released free on YouTube as a short.",
    "date": "2025-04-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "It's a movie based on a game from the 80s. They have improved when it comes to making movies based on video games.",
    "date": "2025-02-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A great Dwayne Johnson action movie that is based off one of my favorite arcade games. The movie had lots of fun comedic scenes as well as great action sequences. The movie felt very influenced by movies such as Jurassic World and King Kong and Godzilla but still stood out. I actually learned a lot about CRISPR in my biology class and so a lot of it felt very familiar and not confusing. Definitely one of my favorite Rock movies.",
    "date": "2025-02-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Good movie overall, would recommend to just about everyone.",
    "date": "2025-02-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The monster designs are creative and so are the mutations like Ralph gaining quill projectiles and the ability to glide!.That was a really creative choice on their part!.it’s the perfect movie if you are bored and want to experience some monster chaos my only complaint is the monsters were not as destructive to a respectable level the only major destruction was the tower they climbed maybe if there were more tanks and helicopters for them to toy with the chaos could be more enjoyable\nBut overall it is a solid movie",
    "date": "2025-01-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "condensed dosage of action with THE ROCK himself",
    "date": "2025-01-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is an exceptional action-packed experience that's absolutely worth watching multiple times. Dwayne Johnson is the ideal choice for portraying such a dynamic character.",
    "date": "2025-01-24"
  }
]