[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is so good because it actually has heart and spirit, something a lot of action comedies forget about.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I never saw the original, but I liked both of them a lot",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A smart, affectionate satire of '80s nostalgia and teen movie tropes, 21 Jump Street offers rowdy mainstream comedy with a surprisingly satisfying bite.",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "absolutely amazing and hilarious",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This proves that not all reboots are doomed.\n\nInstead of trying to copy the original, it flips the concept into a self-aware, fast-paced comedy that pokes fun at buddy cop clichés, high school stereotypes, and itself. Jonah Hill and Channing Tatum’s chemistry is the heart of the film.. Hill brings sharp wit while Tatum surprises with strong comedic timing. Add Ice Cube’s perfectly intimidating (yet hilarious) captain and a clever script full of relentless jokes, and you’ve got a comedy that doesn’t just work.. it thrives. It may not be a deep story, but it delivers exactly what it promises: smartly stupid fun that still holds up years later.",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny and relatable, I have not seen the original so hard to connect, but I liked that some heavy themes such as bullying were engaged in a lighthearted way but still with a lesson. The soundtrack is also electrifying and enchanting.",
    "date": "2025-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A surprisingly sharp film that mixes several genres together - and then subverts them all.",
    "date": "2025-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Okay, I haven't watched this movie in a long time, but I remember absolutely loving it at the time. I watched some reviews and recaps of this film to refresh myself for a review. There really is a special place in my heart for 21 Jump Street. I wasn't sure when I watched it if I would find it very funny, but it shocked me by being absolutely hilarious!",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I laughed…a lot…and this film proved Channing Tatum has great comedic talent.",
    "date": "2025-07-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour, 49 minutes, and 45 seconds!!!!!!! Rated R for Drug Material, Crude and Sexual Content, Pervasive Language, Some Violence and Teen Drinking!!!!!!!!! The worldwide gross is $201,585,556.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!! Filmed on: March 16th, 2012, in color, for theaters, home media, streaming and television!!!!!!!!!!!!!!!! Copyright 2012-2025 by Amazon MGM Studios!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Definitely one of the funniest movies I have ever seen absolute gold",
    "date": "2025-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Love love this movie. I have seen it so many times but I still laugh so much every time!",
    "date": "2025-05-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Probably the lamest movie I've ever seen, but still I laughed my ass off.",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "really funny movie, really changed my mood",
    "date": "2025-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A fun flick full of laughs.",
    "date": "2025-04-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Peak comedy, blast every time.",
    "date": "2025-04-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fun watch. Lots of silly jokes, lots of complicated innuendo, action, twists and turns. Very well put together, the whole cast excels in character. Superb in just about every way",
    "date": "2025-04-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Big fan of the self deprecating, 4th wall breaking jokes thrown in. Really like the cast and the plot is good enough for what it is.",
    "date": "2025-02-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This is a comedy made by people who got the joke. This kind of derivative movie based on an old TV show can easily be predictable and boring. Instead, Ice Cube brought it all together poking fun at the premise immediately. The characters are silly, but the movie is good with breaking the 4th wall, and making fun of itself. From the other cops, the teachers, the other students, and the plot regarding the drugs; everything was dumb, but in the best kind of fun way.\n\nOverall, this is a movie I can watch every few years and laugh along with and at the whole way through.",
    "date": "2025-02-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Very funny. Loved every second!",
    "date": "2025-01-26"
  }
]