[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I really liked it, Emily Blunt is perfect as always  and Chris too, pretty solid movie",
    "date": "2025-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I found this movie very entertaining and informative. We've known for years that big Pharma caters to, brides and pay doctors in accepting their drugs and writing prescriptions for them.\n\nBelieve me, I've seen plenty of drug companies rent out an entire theatre and give doctors all kinds of perks. Trips, money and incredible expensive items.\n\nIn addition, character played by Emily Blunt is spot on in appearance and demeanor. Drug reps strut like peacocks into these doctor offices to tout their goods. I've even heard them joking and flirting when in the next room It's all a game and the patients are the guinea pigs. I wouldn't trust the FDA as far as I could throw them.",
    "date": "2025-03-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Fun! And yet thought-provoking. A good look at greed in the pharmaceutical industry and medical ethics.",
    "date": "2025-03-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A good watch that is well acted and tells a compelling story of greed.",
    "date": "2025-02-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I've reviewed other source materials on what happened and this film was true to life. I recommend watching this movie with no skepticism to what it depicts and the viewer will both be entertained and learn something.",
    "date": "2024-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It has some Erin Brokovich vibes, but fentanyl being peddled is the struggling single-mom goal.",
    "date": "2024-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It’s a mix of The Big Short and The Wolf of Wall Street, but not as accomplished as either. The difference here is that the unlike the peddlers of penny stocks and junk loans, both of which are bullshit all the way down, good intentions were at the heart of pushing Lonafen on doctors. The pharma company makes money, the doctors make money, and the patients have their pain relieved, win-win-win. Unsurprisingly, once the system gets rolling (and by rolling, I mean the company goes public) there is no incentive but profit and the powers that be jettison their mission for the eternal chase of the almighty dollar — a perfect analogy to those who chase that initial ecstasy of opiates. The rise and fall of the company is shown through the eyes of Liza (Emily Blunt), in an as rags-to-riches story as you can get. Sure, it’s predictable, but it’s also entertaining and has solid performances from Blount, Catherine O’Hara, Chris Evans, Andy Garcia, and Amit Shah. Chloe Colman feels like the child actor of 2023 and will always play the child of a biracial couple. The RT critics’ is an abysmal (23), which just isn’t right. This is a good movie with a message that you likely didn’t need any convincing of its message in the first place — profit and healthcare sometimes cause problems — but is enjoyable nonetheless.",
    "date": "2024-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Convincing acting, entertaining, plenty of eye-candy.  Enjoyed the script too.",
    "date": "2024-10-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "*Pain Hustlers* had all the makings of a hit with a cast like Chris Evans, Emily Blunt, and Catherine O'Hara, so I was excited going in. However, the film turned out to be a major letdown. Emily Blunt shines and really carries the movie, but it’s hard to overlook the messy editing and strange pacing. Scenes drag on when they shouldn't, and others that need more depth are rushed. The tone had potential, but David Yates’ vision here feels confused. It’s like a cheap knockoff of *The Wolf of Wall Street* or *The Big Short*, without the spark. Despite some standout moments, the story doesn’t captivate, and I found myself bored for most of it. Overall, it’s a missed opportunity with a cast that deserves better. 2.5 stars.",
    "date": "2024-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Overall I enjoyed it, acting performance is really good especially Emily Blunt. Storytelling could be better though. Feels unfocused. The topic is interesting and showing dark side of America.",
    "date": "2024-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "'The Wolf of Wall Street' this is not.",
    "date": "2024-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "There were some lulls in the storytelling with Emily Blunt doing a fantastic job. Her range on camera is exceptional. Seeing this depiction of the opioid crisis really made me think what's really going on out there.",
    "date": "2024-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It was good.  Interesting topic, very good acting----not something I'm going to yell for everyone to see---but I am picky and if I didn't turn it off it means it is pretty great.",
    "date": "2024-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I really enjoyed this film.  Acting was great especially by Emily who played the role very well.",
    "date": "2024-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I thought this film was terrific. I am literally staggered  to hear the reviews of one better films I have seen in a while. I applaud the whole cast .",
    "date": "2024-06-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Que filme!!! Envolvente, impactante! A realidade das mães que fazem tudo por seus filhos!",
    "date": "2024-05-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I'm not a very big Emily Blunt fan and have always thought she was kind of fake but a somewhat ok/decent actress! This doesn't mean I don't think she pick's great project's to do like Sicario and Merry Poppins which were both huge hits! Pain Hustler's just wasn't as great or completely terrible or even good but not great or awesome either! If that makes sense!?",
    "date": "2024-04-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A fictional story, but closely relatet do reality. Worth the time.",
    "date": "2024-04-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Buena película, buen ritmo que cuenta una historia interesante basada en hechos reales. Seguro que por el tema que trata podría haber sido mas cruda y dramática aunque también podría haber terminado cayendo en lo morboso, no hizo ninguna de las 2 cosas quedándose en un punto medio del que sale bastante airosa.",
    "date": "2024-04-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "PAIN HUSTLERS depicts the loosely fact-based tale of Insys Therapeutics and the early years of the opioid crisis, combining elements of self-made success story, corporate biopic and crime drama to create a thoroughly entertaining film that engages larger social issues while remaining grounded in the experience of compelling characters. The skillfully-balanced telling neither sensationalizes the everyday tragedy of the emerging opioid crisis nor demonizes the perpetuators, allowing for a nuanced and insightful depiction of a complex and uniquely American problem. The abysmal RT critic's consensus rating is truly baffling here.",
    "date": "2024-03-31"
  }
]