[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Interesante pelicula",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Filmaço, o legal é as reviravoltas que ele dá, os envolvidos que surpreendem mas o mais interessante é a forma que as histórias vão se interligando, vale a pena o play!",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "6-7/10. Putting stars a but higher.",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Don’t Say a Word is one of those early 2000s thrillers that grabs you by the collar and refuses to let go. It’s powerful, tense, and emotionally layered, even with a few uneven moments sprinkled throughout. What keeps it alive and engaging, though, is the strength of its performances — particularly Michael Douglas, who once again proves that no matter the genre, he brings authority and authenticity to every frame. He anchors the film with a commanding presence, giving it the gravitas it needs to stay gripping from start to finish.\n\nThe movie doesn’t waste much time pulling you into its dark and desperate atmosphere. Yes, there are moments that drag or make you think the story’s starting to lose steam, but then the tension snaps right back with an intense sequence or emotional payoff that reels you in again. It’s this balance between quiet unease and explosive energy that keeps Don’t Say a Word from ever feeling dull.\n\nBrittany Murphy is absolutely unforgettable here. Watching her performance is bittersweet — it’s a haunting reminder of the raw, undeniable talent she had and how much further her career could’ve gone had her life not been cut short. Her portrayal brings such depth, fragility, and unpredictability that she becomes the emotional core of the film. Every time she’s on screen, she completely owns it.\n\nFrom a technical standpoint, the direction is sharp and deliberate. You can tell the director and assistant director worked closely to keep the tension tight and the pacing under control. While the screenplay has a few hiccups — occasionally leaning into predictable dialogue or slightly overexplained plot points — the team behind the camera manages to smooth most of it out through smart editing and emotional focus.\n\nWhat really stands out about Don’t Say a Word is how well it blends psychological tension with genuine human emotion. It’s not just about solving a mystery or surviving a crisis; it’s about the personal stakes, the fear, and the lengths people will go to protect what they love.\n\nIn the end, it’s a gripping and well-executed thriller that still holds up today. Michael Douglas delivers a powerhouse performance, and Brittany Murphy shines as a haunting reminder of a career gone too soon. It’s not perfect, but it’s emotional, intense, and incredibly memorable — a film that proves sometimes great acting can elevate even the simplest story into something special.",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "such a wonderful mysterious and thrilling movie. Excellent story and excellent performance. All the way movie wouldn't let you bore. I highly recommend it",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Awesome movie for a lazy night. Michael Douglas steals the show but his co stars are every bit as enjoyable. Loved the story and the flow and the pace. Well done.",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I rewatched \"Don't Say a Word\" and was surprised by how well it holds up. The thriller's pacing remains tight, and Michael Douglas and Sean Bean's performances still pack a punch.",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great Halloween flick.  I didn't follow the plotting to the end, but loved the visuals.",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Reminiscent of the classic way of making a movie. Lots of suspense, mystery, drama, and intrigue. Excellent performances from whole cast, all very convincing in character. Very memorable and highly recommended. Ignore all the snippy reviews.",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Good story. Good acting. Just watched it for the first time. It was very clean compared to current movies Michael Douglas was also in his mid 50s when he did this movie and looked great. He didn’t appear to have plastic surgery which is a refreshing change from what we watch today.",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Brilliant! Reminds of the classic way of making a movie, like \"according to the book\". Very well written and directed. Great cinematography. Lots of suspense, mystery, drama, intrigue and twists. Amazing performances from whole cast, all very convincing in character. Very memorable and highly recommended",
    "date": "2025-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "While Don’t Say a Word boasts a decent plot and gripping performances from Michael Douglas and the late Brittany Murphy, the story doesn’t quite reach the heights of a standout thriller. The direction veers off course, preventing the film from fully realizing its potential suspenseful storyline.\n\nGrading: C+",
    "date": "2025-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, o elenco é fraco, e ninguém ajuda a melhorar o filme, a história é fraca, os personagens sao fracos, e o filme deveria ter cenas bem melhores e relevantes para fazer o filme ser bom.",
    "date": "2025-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A doctor daughter has been kidnapped and now the kidnappers demand the doctor figure out the secret from the mind of a young traumatized girl that will make the kidnappers extremely rich.",
    "date": "2024-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "My better half and I both agree it was great movie. Her and I stand with the 49 % who felt the same way. Will recommend to our circle of friends and family.",
    "date": "2024-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best acting they made it seem so real an very interesting i wasn’t expecting such an amazing twist an special Britney Murphy 👑💓💓",
    "date": "2024-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Daring! New Movie! The most interesting thing is the question \"what if psychiatrists are for prisons?\". Also would like to add that there was allot of potential in the cast. Thriller/Action drama, mystery, thriller, so it was a mystery mystery but it was also a psychiatric movie.",
    "date": "2024-06-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Looks like it was made for Michael Douglas... come to think of it, every movie Michael Douglas is in looks like it was tailor-made for him. Maybe he just makes the story his own. Anyway, typical movie for its time. It was made in a time when you could always get exactly what you expected.",
    "date": "2024-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This looks like a film. Like a traditional film, nice grain, high contrast, pretty and analogue! The star though are the characters. They are well drawn, acted and interesting. It's not just the story that drives this, it is the motivation of the characters. The pace is good with each moment adding to the overall experience building up and keeping your attention. It is thrilling and engaging but I feel that even though I enjoyed it I will probably forget it in six months. Which is possibly a good thing as I could enjoy it again in the future.",
    "date": "2023-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The cast does a great job but this script is ridiculous.",
    "date": "2023-09-25"
  }
]