[
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I think the movie would be good if it was a original with own characters because there to much to compare to the old monster high \n\nSpoilers\nThe thing that I find sooooo dumb is that clawden didn't change to a human for the witch metal because she was the only one that can touch it and quick question does the end mean we will have a storaleen ? \n:3 only asking",
    "date": "2025-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I'm back to say. Why. Why another one.\nG1 is WAYYY better and people did not complain this much over a monster high movie. \nCharacters. Bad. Storyline NOT the original monster high story. This isn't the monster high people remember or know from when they were little. \nI've seen people on tiktok with better monster high costumes and make up. I like the hair for venus but otherwise catty noir? WHY SHE LOOK like that she doesnt look like an icon anymore. Some characters are messed up and some actually improved. But thats 50/50.\nMovie. STOP MAKING THEM. go back to animating the G1 dolls. Please. I miss the originals",
    "date": "2025-02-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Love monster High 2 y quisiera what premiere one and ending part 3",
    "date": "2024-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wow , such a great movie to watch I'd have seen this one and the first one multiple times. And I'd have to say that they are so amazing I really enjoyed watching them , everyone did a fantastic job and I'm giving them a highest review to 5 stars .⭐  Way to go",
    "date": "2024-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "That’s an hour and a half I’ll never get back.\n\nI don’t know how anyone could enjoy this.\n\nI’m not an actor, but I’m happy to give any acting lessons to the cast if need be.\n\nTa.",
    "date": "2024-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The first one is definitely favourite, better songs and script. This movie was great too, it's just the first one has a special place in my heart.",
    "date": "2024-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "J'ai adoré le deuxième film,les costumes,les effets spéciaux, l'amitié des filles,il a était incroyable 😍.",
    "date": "2024-05-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Sorry for writing a bad review, but I honestly feel like Monster High 1 was so much better than the second movie. The characters didn't even look the same in this movie, which was really disappointing for me. However, if you didn't watch the first Monster High movie, it wasn't bad. It has a good message in an off sort of way. I thought the plot was weird, but that's maybe because I loved the first movie soooooooo much!!! You should watch it and decide for yourself",
    "date": "2024-03-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie to watch with the kiddos!",
    "date": "2024-01-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie was a terrible excuse for a movie.this opinion might be biased as I grew up on the original monster high movies but when watching this movie with my little sister I was disgusted but only have they left the plot of the original movie but changed the personalities. This movie has ruined my childhood!!!",
    "date": "2024-01-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love the movie it and they act it great, the story is awesome I love it",
    "date": "2023-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Es horrible las canciones son malas solo 2 buenas y Frankie es gringe Clawdeen es aburrida y las pelea es decente y post créditos es buena Draculara es plana y el humor es pésimo la villana es predecible y Toraile no aporta nada su ropa se ve bien es un 3.3 de 10",
    "date": "2023-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The movie is clearly assumes at a kids target, early teen, the plot is simple yet nice, the songs are good and the musical parts are never too long, do it is ok even for those people who didn't really love musical. Overall it's a good movie.",
    "date": "2023-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "amazing movie and perfect plot .. well almost ! the movie had alot of plot holes and characters that should've had more screentime like Draculara for say she deserved more screentime since she was the main focus of the movie and I don't like how they cutt her big fighting scene but proceeded to talk about it, maybe it was because of budget but I hope this is changed in the third !",
    "date": "2023-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fabulous!!! What a fantastic series! We absolutely loved the first one and the second one was great fun too! So cool to have more realistic effects!",
    "date": "2023-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I think Paramount got the message about how bad the first film was graphics and story wise, because Monster High 2 is a huge improvement from its first film with the addition of new characters, better visual effects, fun soundtrack and a new original story that will inspire viewers of all ages who watch it.",
    "date": "2023-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Esta Película me gusto más de lo que esperaba me gusto mucho más que la primera parte la música es increíble los Efectos especiales están bien para ser una película para la TV dijo no es Marvel pero están muy bien las actuaciones de Miia Harris, Nayah Damasen y Ceci Balagot son muy buenas lo único que no me gusto fue una escena en particular que Incluye un chiste de pedos creo que no era necesario incluirla pero de ahí en fuera muy bien espero con ansias Monster High 3",
    "date": "2023-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "My review is on behalf of the kids in my household. This is NOT a critic review or anything close to it. My kids are 8 and 9x2. They absolutely loved the movie and already watched it 3 times through since it came onto Paramount +. They stated that they love all the characters, outfits, makeup, story, and music. Our wallets are ready to buy whatever dolls release from Monster High 2 and we are all looking forward to the 3rd movie!",
    "date": "2023-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Stakes feel higher here. Plot twists you don't expect. Leaves room for more story telling while filling in gaps from the previous movie. Songs in the first one hit better than these but it's not a complete miss. Caught myself doing little foot taps and sways when listening to the songs. Overall solid 8/10 compared to movie one which I rate a 7/10 . Definitely would like to see a third installment to this series. LOVED the cliffhanger.",
    "date": "2023-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "lets start lest get evrything out of the way when high school musical came in 2006 it open pop era genre musical  the trillogy was greatly recived by audiences and crtics but when Descendants came in 2015 it open Disney muscial universe with it havinga trilogy that was mostly fine but amazing story and music zombies 1 and 2 where find 3 was for me disspoiment and for Monster high 2022 i was not ready for it but loved it my sister loved it story of how half breed can fit at monster high was fine the villian great expose but watching the sequel this October 5 2023 it was meh it has become musical  fatigue and it has come to this they are using chessy songs or movements we already seen before the story is not intresting and i had to leave my couch to do other things for awhile the witch lady tesse at the post credits of the first now is boring so when they make a third film it will be meh so what killed this musical era was Zombie 2 and 3 with movements for me boring worst first film best top 10 but the sequels bad so Monster High 2 for me Meh 5/10 at best what is the budget maybe $10 Million or $5 Million so it could Flop drastically like loud hallowen on sept 30 big flop of all nick",
    "date": "2023-10-09"
  }
]