[
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "It was kind of a more mature romcom, with two effective leads. However, the threads of the story did not in any way tie together. I could provide examples, but it’s nearly every backstory and narrative feature in the film. None of it made sense. Nice scenery.",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "One of the reasons I love this movie. Is it the leading lady was not a raving beauty and she had a few pounds here and there, but she was a real woman! Great story if you're a romantic!",
    "date": "2025-06-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Easy to digest, satisfying romcom with some decent laughs. With nowdays unavoidable pinch of L gb tQ content at the end.",
    "date": "2024-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Real and relatable. The journey of a woman through life’s very real and raw challenges. Giving hope to many. Made me want to quit my job, life in the city and move to a stable overlooking breathtaking water.",
    "date": "2024-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Eu adoro essas comédias românticas simplesinhas e água com açúcar, leve e deixa nosso coração quentinho... Trilha sonora deliciosamente perfeita enquanto nos maravilhamos com uma paisagens estupenda (a bela Croácia), uma mulher madura que de um dia para o outro decide deixar tudo para trás em busca da herança de sua mãe, e descobre que vai muito além de apenas bens materiais, ela redescobre sobre a paixão, o tesão, o amor à vida e o amor a si própria... Tudo muito gostosinho de desfrutar...",
    "date": "2024-04-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Faraway is a very good, honest, serious movie about lifes ups and downs... A heartwarming, and funny movie 🤣.. one of the best comedy dramas, I have seen for a while ..",
    "date": "2024-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Honestly ... I loved it. My soul feels happy and hopeful and: Naomi Krauss - you have a new fan!",
    "date": "2024-03-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "An offbeat, thoroughly enjoyable romantic comedy. For adults. Not a teen movie.",
    "date": "2024-03-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's like a cross between a cheap romantic comedy and a spanish telenovella. There are a few decent laughs along the way, but it is ultimately not a memorable film outside of the general showcasing of Croatia and how undoubtedly everyone watching this film is thinking about how nice it would be to escape everything and go to a place where you can sit and stare at the sea from your fancy, simple cliff barn/house thing and forget the awfulness of the world around you. It's pretty predictable. But charming none the less. I'd say put it on if you are ready to read and don't mind some simple escapism.",
    "date": "2024-01-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Charming, low key, and unpretentious. A story of friendship, love and starting over but with consequences",
    "date": "2023-12-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The movie was deep in sentimentality and humour in a ying yang vibe. I was deeply touched by the singing Croatians - they produced an harmonious sound that captured the essence of the emotions displayed in the film. Emotions ranging from orgasmic joy to immense sadness.",
    "date": "2023-12-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Decent rom com. I enjoyed it a lot. Maybe because of the location...I am from Dalmatian coast. And I too hit on foreign tourists... I was so called \"Seagull\"....or \"Galeb\" in Croatian. Oh, the stories I could tell... Some could be turned into great films...",
    "date": "2023-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I enjoyed this movie. The plot isn't groundbreaking by any means. But if you're looking for a RomCom for people of a certain age (like me) this movie hits the spot.\nA perfect Wednesday night flick.",
    "date": "2023-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Quite a pleasant couple of hours of middle aged woman rom-com Croatian-German escapism with beautiful scenery. Not stupid! Recommended.",
    "date": "2023-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Minha opinião: Um filme que te leva para a Grécia, lembrando o filme \"Mama Mia\" com Meryl Streep, mas apenas lembra, pois este filme não é um musical. Conta  estoria de Zeynap que é casada, tem 1 filha adolecente Fia, esposo e o pai que moram todos juntos. O marido tem um restaurante e bem no dia do enterro da mãe de Zeynap ele não aparece pois esta dando atenção a sua nova empregada. A filha toda rebelde com mãe, sem a respeita la. E seu pai todo ranzinza que não ouve oque a filha fala ou faz. No testamento sua mãe deixou uma casa na Grécia e como ela tava de saco cheio ela deixa tudo e vai. Chegando la percebe que tem alguém que mora lá Josip. E ele havia vendido a casa para a mãe dela. Então com a chegada dela, ele arma uma barraca do lado da casa, onde diz que ali é seu terreno. E assim começa um relacionamento todo atrapalhado onde Josip é o faz tudo no vilarejo. E com um inicio conturbado acabam fazendo \"aquilo\" e quem pega ela na cama? Sua filha rebelde e então vem o pai dela com o sogro também para casa e vem o irmão de Josip além de galanteador Conrad além de outros vizinhos. O barraco esta armado.\nRoteiro e enredo já conhecido e estamos cansados de ver. A diferença aqui são os atores que são bem cativantes e que prende a atenção do expectador. Parabéns por fazer do sempre, bem feito.\nVale apena assistir? Sim para dar aquela risada leve.\nNota: 7",
    "date": "2023-06-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Terrible, does not add anything, a waste of time",
    "date": "2023-05-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Delightful escape to beautiful Croatia. Romance, comedy, mother- daughter connection.  Both my husband and I liked it a lot!",
    "date": "2023-04-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "PREDICTABLE!! The beautiful scenery was the best part. It kinda reminded me of Mama Mia with the ocean vistas and the rundown house but that’s where it ended. Meh",
    "date": "2023-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's definitely a movie you've seen before but the storyline is executed so well that it feels familiar and comforting, rather than redundant and derivative. Similarly, the male lead is a character archetype reminiscent of the male lead in Bridesmaids but when it's performed so brilliantly do you really care? This is just pure fun and escapist fare that isn't trying to be anything more than that —which is a gift in itself. Download it for your next plane ride and relax.",
    "date": "2023-03-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wonderful, warm, hopeful.  Not to be missed by those of us of a certain age.",
    "date": "2023-03-21"
  }
]