[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The 2004 'Mean Girls' holds a very special place in my heart and I enjoyed the nods that 'Do Revenge' made to it (along with a few other classic teen movies!). Some details of the plot were rushed and lacking in terms of credibility, which was a shame. A more condensed timeline may have helped give a better sense of the intensity of the friendships... as it stands I just didn't really believe any of them. That said, it was fun and unexpected with a cracking sound track - I think Regina George would approve!",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "High budget movie with pretty naive aspects to it. Production was good, loved the outfits! Writing was lacking some... details I guess. Sometimes it felt like screenwriters could've done a better job. But what really saved the movie is the plot twist which took place after a hour of watching. It was so unexpected, like BANG! And the tables immediately turned. No disrespect to Austin (who played Max) but I think that it would be better if creators picked another actor for this role, just my opinion...",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "“This movie is fueled by climate denialism, making it fundamentally rotten. Its content is nothing more than personal revenge wrapped in a fake sense of coolness, while mocking issues that are crucial to the world. In Do Revenge, instead of showing teenagers as thoughtful or socially aware, the film paints them as so consumed by petty revenge games that they even turn climate change activism into a joke. When the youth of today are meant to be the front line in addressing the climate crisis, reducing activism to a punchline is not just irresponsible—it’s harmful. Worse, these shallow and vengeful characters risk becoming false role models for kids, normalizing cruelty and trivializing global issues. Movies like this shouldn’t just be criticized—they should be banned for the damage they do to young minds and the seriousness of the issues they mock.”",
    "date": "2025-09-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A mashup of Mean Girls, Heathers, She’s All That, and probably a few other teen movies - as long as you go with the flow, it’s a fun ride. \u2028What I liked about it was that no one from the lead characters was a good person. They were all extremely flawed and problematic. \u2028It’s definitely not funny like Mean Girls and the writing is not as sharp, but it was a frothy fun flick.",
    "date": "2025-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "your typical teen revenge movie",
    "date": "2025-06-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "There are a million movies similar to The Justice League. But that's the thing: all of these million movies only \"look\" like The Justice League, but they don't \"be\" The Justice League. It's an innovative movie, with beautiful performances that are great to watch, as well as perfect costumes and elegant visuals that are enough to overshadow any plot holes or mistakes that it ends up making at times. A good, very good movie, perfect to watch with a group of friends.",
    "date": "2025-04-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "No, it was cool. It was cool. The build up to the twist. I feel like could’ve been a whole lot better but I kind of see it coming, but I still was in town so you know the end and the double twist was kind of predictable but still enjoy still pretty good movie.",
    "date": "2025-03-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It's personally offensive to me that this movie is rated so highly because I found about 2 minutes of it likable and the rest--meaning TWO more hours--was absolute garbage. There's no reason a teen comedy should drag on for over 2 hours even if it's good. And those 2 minutes were all Sophie Turner.\n\nThe movie is filled with unlikable one-dimensional characters who have really learned nothing by the end of the movie. Seriously, I did not like or care about a single one of the characters. It borrows heavily from classic 90s and 2000s teen movies such as Mean Girls, John Tucker Must Die, Cruel Intentions, and Clueless, but only marginally adds its own spin. And I would rather watch ANY of those movies over Do Revenge.",
    "date": "2025-01-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best movie ever , love this !!!!",
    "date": "2024-12-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Plot has a lot of promise but I felt alienated by the indulgent, fantasy-like portrayal of the high school senior experience. Barbie-esque scenes throughout. Very divorced from reality. Fear it could negatively impact impressionable high school students who are already having to navigate their challenging coming-of-age landscape.  Impressed by Camila Mendes' performance. Maya Hawke's acting was a turn-off though. The two British actors appeared misplaced in the film (felt Sophie Turner overplayed every \"angry-english\" scene she was in).",
    "date": "2024-12-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A fast-paced teen comedy with a great big twist.",
    "date": "2024-12-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "So much better than the typical high school teen movies, freaking loved it. And there costumes were lit💖",
    "date": "2024-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it, the premise of the movie is not the greatest, but the execution and acting more than made up for it. Both leads bounce off each other creating great humour together with beautiful locaitons make it for a great viewing experience.",
    "date": "2024-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I have no earthly idea why this is rated so high; it is one of the worst and nonsensical movies I have seen in years. A complete waste of time.",
    "date": "2024-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Almost stopped watching halfway through because it became repetitive, but the plot twist!!!\nWatch the movie until the end and you will be amazed!",
    "date": "2024-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It's fresh and it combines different concepts in one movie its cool but the end is such a bummer",
    "date": "2024-04-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "One of my all time favourite movies, it’s so underrated, it has all the good parts for a high school movie, comedy, romance, drama and I mean a LOT of drama, a very steady solid plot and a super satisfying ending. More people should watch this",
    "date": "2024-03-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Heathers, Mean Girls, Do Revenge!",
    "date": "2024-03-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Strangers on a Train, except they're mean girls. In the grand tradition of '90s teen reimaginings of Shakespeare, George Bernard Shaw, and Pierre Choderlos de Laclos.",
    "date": "2024-02-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Yesss! This movie was such a slayyyy. Exactly what I wanted to see at midnight. 10/10. Wish the ending was a little less rushed but I loved the twists",
    "date": "2023-11-05"
  }
]