[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Fun. Stupid. Thanksgiving.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Yahtzee!!",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's perfect for the time of year and it has a good plot.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Decent slasher flick with a couple really inventive scenes. Bad, obnoxious teen characters really drag it down.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was so much fun for a thanksgiving horror movie the bloody and gore was really fun I enjoyed the story I cant wait to see the sequel",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Wasn't expecting much going into this film since it was something I was only putting on for thematic purposes but found myself pleasantly surprised. I did have some problems with it such as a telegraphed Chekhov's Skill and red herrings being a bit too blatant but overall, Thanksgiving is a surprisingly fun slasher film. Characters who don't exist solely as cannon fodder for the main antagonist, a genuinely good villain who comes up with some memorably disturbing death scenes* (and is willing to feed a cat before he resumes unaliving people) and quite a few funny moments. And yes, the most disturbing scene in a film about a Thanksgiving killer was the Black Friday prologue since, as exaggerated as it might be, I am well aware of how riots such as these have panned out in real life. And I've gotta give a film credit for at least trying to give some of the killer's victims a fighting chance, as the film finds the right balance between making him an effective threat but not having him overpowered. For instance, he finds out that tranquilliser darts don't affect everyone exactly the same way, even if all it does is merely postpone the inevitable. Yep, with how enjoyable this film is, even feeling at times more like an homage to the Scream and Scream-type horror flicks of the '90s than to '80s slashers, it's safe to say that Thanksgiving is no turkey...I'll see myself out.\n*don't show this film to Armie Hammer! One specific scene might turn him on!",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Of course I had to see this movie, because Grindhouse inspired it. However, it took me a long time to finally watch it, and when I finally did, I was really disappointed. The beginning was terrible, but I think the worst part was that it was set in modern times-- namely with phones and social media. All that teen lingo they used, and all the iphone things ruined it. Could have been much cooler. And no, this did not capture or feel like Grindhouse.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Was very entertaining.   That store stamped scene was crazy.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Definitely one of Eli Roths best movies. I enjoyed the storyline and how it plays out until the end. Definitely a great who done it, uped with horror and gore. But Roth knows how to use the terms of it. He’s a greater director and can’t wait to see what he does next. This year, there will be no leftovers!!!",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Entertaining with a decent, but not difficult twist, Thanksgiving leaves you mildly satisfied with a bit of room for more... Kind of like a big mac meal, its not that filling but at least you're not starving.",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Nice to have a new original horror movie that keeps you guessing throughout the whole movie.",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Could have been better if Diddy was in this.",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I laughed. It was an all around good time",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Nothing new here. Not sure of the purpose of this movie. Maybe McDreamy needed a paycheck",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Poor acting and unrealistic murder scenes. Not the worst thing I have watched but I would not recommend.",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "If it is fall and you want to watch a fall horror movie this is the one you should watch (then 2nd place would be “Blood Rage”). “Thanksgiving is the perfect horror movie to watch for Thanksgiving. The kills are amazing, gruesome, and gory not to spoil, but I will just say that on kill is really close to what you do to a turkey on Thanksgiving. The story is great, it and a lot like “Scream” and “I Know What You Did Last Summer” just taking place on and around thanksgiving. So if you like those movies and/or just who-done-it movies in general you will enjoy this movie a lot. The reveal is good the killer was not even close to who I was expecting. The motive is also good and surprising and I did not expect the killer’s motive to be what it was. This is a great movie to watch in November and on Thanksgiving.",
    "date": "2025-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "My type of slasher. THANKFUL for the solid death scenes and twist at the ending. One you can definitely sit and be invested in from start to finish. Love Eli Roth’s creativity and premise of the entire film. Some decisions are stupid, just like in every who is the killer movie . It will keep you guessing; and to always remember, to “be careful who you trust”.",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Decent slasher kept me interested and entertained did not see that twist coming but not the best acting some of it was kind of cheesy would be open to seeing a sequel",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Definitely a very scary movie",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a very good horror movie.",
    "date": "2025-10-17"
  }
]