[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Ok i have to admit that this is a very funny movie.",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I don’t know why every review is so low, this was genuinely a fun watch.",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Worst movie I have ever seen. Do NOT waste your time. I would rather cut off my right arm and sacrifice my first born as opposed to watching this joke of a movie again. This movie took years off my life. Watch at your own risk.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "some parts are trying to make this work.\n\nsome are trying to sink it.\n\nthe latter won.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "é engracado, uma historia bem feita. producao nao tao impressionante, mas a rebel wilson me faz rir até sem fazer nada. elenco ótimo, enredo aceitável. é bom!",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "by no means is this the best movie ever, but it was a fun watch.",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Love it - late comer to this but really enjoyed it. \n\nFelt a little too long for a silly comedy, hence why I dropped half a star. Cast are brilliant!",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "worse version of several other good high school movies. it didn't work.",
    "date": "2025-06-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The movie's layout was very clean and I loved it. The ending was kind of predictable but it was very good.",
    "date": "2025-05-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I am always searching for a movie that is light, funny & not soul draining. I thought this movie was funny, making fun of the cool kids, not cool kids and the adults along the way. I enjoyed it. I think Rebel Wilson is funny & she played the 17 year old mind in the 37 year old body great. I'm not a critic, just a 67 year old searching for funny  movies.",
    "date": "2025-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Dear God, what an uninteresting movie and such noticeably bad acting. I'm sure that doing anything else for two hours would be better than wasting time on this film.",
    "date": "2025-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Senior Year is a lighthearted, entertaining comedy that blends high school nostalgia with a modern twist. Starring Rebel Wilson as a woman who wakes up from a coma 20 years after a cheerleading accident and returns to finish her senior year, the film is filled with over-the-top humor and heartfelt moments. Wilson delivers her signature comedic energy, making the film a fun watch. While the plot can be predictable and a bit cheesy, its feel-good tone and themes of personal growth and second chances keep it enjoyable.",
    "date": "2025-02-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Esse foi de longe o pior filme que eu assisti na minha vida inteira, e olha que assisti em 2022, e estamos em 2025. Ainda não encontrei nenhum filme pior. \nQuando decidi assistir, estava ansiosa para ver, porque prometia uma nostalgia aos anos 90 (época em que fui adolescente), e todo o clichê de escola de ensino médio e adolescentes, bem \"sessão da tarde\" no Brasil. \nMe decepcionei com a qualidade do filme. Péssimo, horroroso, mal escrito.\nA Rebel Wilson totalmente sem graça, não tinha nenhum sal, não tinha uma piada que de fato fizesse rir.\nEu não recomendo nem para o meu pior inimigo.",
    "date": "2025-02-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "IT IS JUST A WHOLSESOME MOVIE",
    "date": "2024-12-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "When it's funny, it's laugh-out-loud hilarious. When it's not, it's really, incredibly not. Still, the cast puts in their all (especially Rebel Wilson) and it's surprisingly heartwarming at times.",
    "date": "2024-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I loved it and thought it was hilarious, I loved the coma idea of it! Rebel Wilson is hilarious",
    "date": "2024-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Its no brainer movie. Dont think or expect too much and just enjoy the ride. \n\nI love how this movie have a meaning that popularity doesnt mean much, and \"perfect life\" is just illusion (the cab scene). What matter the most is people who love us, and the adventures along the way.\n\nIts fun comedy, love the dancing routine..",
    "date": "2024-03-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It was a decent, fun film for an evening that we had nothing planned. There is some vulgar jokes that were not necessary. The movie provided a couple of chuckles while we were watching it. The 90's soundtrack WAS GREAT. The thing is with movies such as this...the script is pretty predictable.",
    "date": "2024-03-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Senior Year\n\nIn this movie, Stephanie Conway (portrayed by Rebel Wilson), a beloved high school senior aspiring to be prom queen, falls into a coma due to a scheme orchestrated by her nemesis. Two decades later, she emerges from her coma and resolves to complete her senior year.\n\nSenior Year taps into 2000s nostalgia and benefits greatly from Rebel Wilson's comedic prowess. However, it falls short in depth. While the plot shows potential, it quickly feels underdeveloped. The stark contrast between young and older Stephanie is puzzling, as she ages physically but not mentally, seemingly played for laughs.\n\nThe numerous characters here don't elevate the story, and they're not always fully utilised. The ending is rushed, and leaves loose ends; the fate of some characters remains unknown, case in point Tiffany and Blaine.\n\nUltimately, Senior Year is a tropey and predictable flick but it also has its golden moments that help make it tolerable.\n\n5.5/10",
    "date": "2024-02-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This was unadulterated drivel \nWoke and inclusive vomit - give it a miss",
    "date": "2024-01-03"
  }
]