[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I found this movie good and enjoyable , let's be honest so called expert critics giving bad review doesn't mean that a movie is bad all the time. You have to watch it and decide for yourselves. Sometimes critics being over critical about a movie is like cutting a sapling cause its giving no value at that point of time and we miss out on a tree that gives many values someday. \nWatch and decide for yourselves.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was great. The people who say oh it wasn’t a good adaptation they’re whack and they don’t know what they’re talking about and probably know nothing about the video game.",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Good action but the story lacks depth. This could of been much better",
    "date": "2025-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "when a third of the budget goes to your lead actor, let's just say don't expect a masterpiece. monotonous acting and 0 character development. i have played the games and they are way more enjoyable and charming than this slop. i love that in this world you can be paid 40 million dollars to produce a performance like this. what a time to be alive",
    "date": "2025-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The reviews are not the greatest but nor are the movies that have good reviews end up being soooo .... all I gotta say is for what they could work worth because of a video game series they did a great job",
    "date": "2025-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1 hour and 56 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated PG-13 for Intense Sequences of Action, Brief Strong Language, Intense Sequences of Violence and Thematic Elements!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $54,600,000.00!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Does not follow the source material well at all. It was difficult to understand what was going on, and the acting was mediocre at best.",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I loved this AC movie, the action sequences are top notch it should of been more involved about the past instead of the modern day like the games why I think it failed at the reviews still don’t think it’s nowhere as bad as the ratings is, I always wonder what the sequel would of been. as true fan this movie definitely deserves more praise guess casual viewers just don’t get it.",
    "date": "2025-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "One of the better video game-to-film adaptations. Too bad they decided to focus on the weakest parts of the games themselves. More time was needed during the Spanish Inquisition Animus sequences.",
    "date": "2025-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Good: The concept of making an Assassins Creed movie \nBad: The movie they released",
    "date": "2025-06-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "He falls into the collective sin that if he doesn't like me, neither do I. It's good, a real action blockbuster, and you don't need to know anything about the game. CALM DOWN, FREAKS!",
    "date": "2025-06-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I don't understand why this is hated. It's got great action, compelling characters and a good story.",
    "date": "2025-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very good action scenes, almost like in the game. In short, it fulfills the objective of a movie: having a good time watching an action movie.",
    "date": "2025-04-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Despite its visual flare, the story made no sense to me, and it felt really disconnected from the games. This movie can definitely be avoided, whether you're an Assassin's Creed fan or not.",
    "date": "2025-04-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The only thing wrong with this film is that they had to try and tell an entire Assassins Creed story in under 2 hours. I wish they would have used a limited series for it. That being said, I liked the movie a lot.",
    "date": "2025-04-14"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "For a film made from a computer game, it started pretty strongly - and went well up to about 2/3 of the way through. The \"Apple of Eden contains the key to free will\" plotline was always total bollocks, but the action sequences and some sub-plots (father/son, father/daughter, potential being realised) were not bad. Then the ending was so gob-smackingly awful: the assassins... assassinated everyone in about 2 minutes and the film just ended. Game over.",
    "date": "2025-04-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "No. Rewrite this, please. I am not even familiar with the video game, but my son chose the film because he knew about the video game. They probably would have written a more interesting story if they had just stayed in the past.",
    "date": "2025-04-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I think this movie got more hate than it deserved. It had an interesting storyline that aligned with the video games (story-wise), even though Templars vs Assassins isn't hard to emulate. It practically could have been a Desmond Miles story, if he was related to a Spanish Assassin. The movie definitely had a Brotherhood or Unity feel to it, with Cal being surrounded by Assassin's either in the past or at the Abstergo building.\n\nThe actors did an excellent job stepping into their roles. The characters were fleshed out and Cal had good character development over the course of the movie. I will say, Marion/Sofia didn't need to stand next to the Animus the whole time like a cheerleader \"oh, do it. jump. roll.\" It was awkward to watch and again, gave nothing to the story. We could take those parts out and nothing would change, or we could just have her debrief Cal after he exits the Animus for the same effect. \n\nBut, with every good, there must be bad. There wasn't much of a reason to make the Animus into a giant claw. It was purely there for aesthetics, because the video game does perfectly well integrating the Bleeding Effect without having to watch the present-day character act everything out. It looked cool for aesthetics, but was pointless for the story. \nAt times, it seemed as if the characters were mumbling, which doesn't add to the story at all. Such as, in the end, the last time we see Aguilar is when he stares at the ceiling and mumbles under his breath with no translation. \n\nOverall, I give the movie 4/5 stars. I would like to see another Assassin's Creed game that overall aligns more closely to the games or if they made a sequel and used the feedback to make it better.",
    "date": "2025-03-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The beginning is fine - as time goes on, the video games become more fascinating and interesting, even the worst ones in the series.",
    "date": "2025-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I wish it was half as good as one of their games. Good idea, mediocre to poor execution.",
    "date": "2025-03-23"
  }
]