[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It’s a very lovely movie!!! I was glued to the screen the entire time it was so fun and interesting and the fact that it teaches you about union and about creatures in today’s world was awesome!! It was amazing I’m not usually a watch show type of person but this took the cake 100%! I would definitely watch more movies like this one. I watched it November 2025 I noticed it came about 2012 and it was still very interesting. It was touching especially during certain parts and tears came to my eyes. I loved it lol would definitely recommend 10/10",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I really like it! It's not a cinematic masterpiece but i used to watch it when i was a young teen. Its nostalgic",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It's bad. I love how they as loosely as possible try to tie this into the 2008 movie. Besides Sean being in it, it has nothing in common at all with the 2008 movie. The music is ok, the aciting isn't good, the cinematography is terrible, the editing isn't good, and the pacing is horrific. Guzman is just degrading himself here as the comedic relief and is terribly unfunny. Hudgens is alright but just the forgettable love interest. Everyone else is just subpar. The Rock is just once again playing himself and the same character he is in every film. It's the most surface level character stuff and half the time it's just plot expose. The 3D special effects are just as bad as the 08' one and look laughably bad. Major strike for that. At best the direction is basic and worst it's a green screen CGI fest that looks like a video game more than a movie. Than it starts jumping around between Guzman, Hutchinson/Hudgens, and the Rock during the escape. The worst part about this though honestly is the insane amount of dumb farfetched moments this throws at you nonstop. It's literally as bad as Rise of Skywalker at points. How does the 140 year old submarine still work? The Rock in jeans and a t shirt throwing a spear at a giant CGI shark. Conspiracy theory opening to setup getting to the island. It's literally insane. This is just mindless insanity and action thrills nonstop with little downtime. At least the 08' one was better executed and had much less farfetched stuff in it. Which is saying a lot because it still had farfetched moments for thrills. Skip this. It just devolves into mindless fare.",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A bit slow and sluggish, ridiculous bits of logic less events such as totally accepting and being able to fly a giant bee,  slow story development.  I enjoyed the actors but the screenplay seemed a bit thin and boring.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This movie is good but some reasons were kinda off on me but this movie with giants were cool, other then that its a good movie.",
    "date": "2025-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I really liked this one too but I wish’s it lined up better with the first one. He was supposed to go with his uncle.. they better be making a third one for that book now. I kind of LOVE these movies.",
    "date": "2025-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Not as much fun as the first one with this cast, but still a fun watch.",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love this movie!!!!!!!!!!!! The USA grossed over $103,800,000.00!!!!!!!!!!!!!!!!!!!!!!! With a worldwide gross of $335,288,576.00!!!!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Absolutely garbage formula movie",
    "date": "2025-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Journey to The Mysterious Island. It has a lots of plot holes and is one of those rare gems of a \"hey it didn't turn out like they intended, but they way it did turn out was better\" films. You could also say \"so bad its good,\" but I don't think the movie is actually bad. When I wasn't laughing at a plot hole, the film provided some good jokes.",
    "date": "2025-02-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "it was okay, the cgi was a letdown for me. it was remarkably noticeable throughout the film, especially when they’re flying on bees. additionally the storyline was empty and vague. however, it is a good time killer if you’re looking for mere entretainment, but if you’re after meaningful movies, a watch of this piece is not worth it.",
    "date": "2025-01-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Liked this film as a kid",
    "date": "2024-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It’s as entertaining as all the other adventure movies that follow exactly the same formula, although this one is a bit too ridiculous to take seriously.",
    "date": "2024-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Not as good as the first one tbh",
    "date": "2024-05-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Johnson looks bored, Hutcherson is trying his best, Hudgens has barely anything to work with, Guzmán has absolutely nothing to work with and Caine has no idea what he's doing in \"Journey 2: The Mysterious Island\", a lousy adventure film with no direction or understanding of what it's supposed to be.",
    "date": "2024-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Meh it passed the time so true",
    "date": "2024-03-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "No puedo creer que odié más la actuación de Vanessa Hudgens que el CGI de esta película",
    "date": "2024-02-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This movie had nice visuals/SFX. The Rock delivers the same Cappola performance which was just sad to see.",
    "date": "2024-02-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "pretty exciting stuff! its great for the whole family to enjoy the visuals are vibrant, lush and outstanding and you gotta see it in 3D just for the spectacle involving giant lizards, giant birds, centipedes, spiders and bees theres some interesting family dynamics goin on here however brief it is Vanessa Hudgens is awesome as always and Josh Hutcherson gets to become his own the action sequences are shot phenomenonally, too I think the script could have been tightened a little more but the kids will certainly enjoy the mindless, CGI fest and adventure-esque feel and Luiz Guzman is hilarious as comic relief I think the ending was a bit of a downfall though cause its making me worry how they're gonna tackle the next story by Jules Verne who knows....",
    "date": "2024-02-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "dumbest movie I've ever seen, CGI is terrible and the plot makes no sense... no point in watching",
    "date": "2024-01-20"
  }
]