[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Don’t waste your time on this movie. More than half the movie the females were screaming. No real connection or some sort of relationship was made with the characters from a viewers pov. Dialogue was horrible and what makes it worse was they had some smart parts of the movie then ruined it by the stupidity. They knew the sharks was blind so obviously it can only rely on its hearing; why would you have them screaming every time they see the sharks. Other than that the jump scares were decent.",
    "date": "2025-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1 hour and 29 minutes!!!!!!!!!!!!!!!!! Rated PG-13 for Creature Related Violence, Brief Rude Gestures, Some Bloody Images and Terror!!!!!!!!!!!!!!!!!!!!! The USA grossed over $22,300,000.00!!!!!!!!!!!!!!!!!!!!!!! Filmed on location of the coast of the United Kingdom and dubbed and subtitled in a studio in the United States of America!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Absolutely horrible, dark, murky, boring",
    "date": "2025-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Johannes Robert’s brings great concepts for cinemas, but his writing and directing need improvement. While 47 Meters Down: Uncaged continues to have decent ideas such as underwater cave exploration and a claustrophobia theme, it’s difficult to trust the film due to its unlikable characters and its reliance on clichéd horror silliness.\n\nGrading: D",
    "date": "2025-02-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The most boring movie I’ve ever watched. Ruined my night.",
    "date": "2025-02-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Not sure how this has a reasonable rating as it’s D Grade, predictable and poorly acted. The underwater shots are mostly unwatchable. I don’t think the Director understands how underwater currents work. The last 15 minutes are truly terrible. The great white sharks must have blunt teeth. Poor",
    "date": "2025-01-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Already couldn’t get past the mediocre heights of the first movie. This is an inept shark thriller that isn’t so bad it’s good",
    "date": "2024-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A very intense movie, i don't like shark movies but this one surprised me",
    "date": "2024-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "ok. Some unrealistic and cheesy scenes. It's worth a watch and not bad for just another shark attack movie.",
    "date": "2024-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Pretty good I’m afraid of deep deep water",
    "date": "2024-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best movie I've seen in a long time. Easily one of the classics.....It's like the Goonies and Jaws III got married and had a baby. 10/10 nwould recommend. A rollercoaster of emotions. CGI was out of this world.",
    "date": "2024-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent scary and intense",
    "date": "2024-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Firstly, they did Grant SO DIRTY like he was in the middle of a motivational speech and the shark was having NONE of it. I like the characters but they were SO stupid and come on if you know the shark relies on sound why are you screaming like you WANT to be murdered. Couple of jumpscares but not so many that it felt the movie relied on it.",
    "date": "2024-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "had some good jumpscares but omg thr dumb decisions be crazy and why would the sharks even be acting like that???",
    "date": "2024-05-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I have not watched the first movie and I just watched this one I have to say it wasn't the worst movie but there were somethings I didn't like about this. For instance, we had no time to emotionally connect with the characters and all the girls were a pain to watch. Also, there was way too much screaming every time they saw a shark they just had to scream. Just be quiet so the sharks don't attack you and try saving some oxygen by not hyperventilating every time you think you'll never escape or if someone dies. Plus there were some people who I think didn't deserve to die. Like that guy who was minding his own business listening to music or that one girls father however, ALEXA, she can die in a hole she was annoying as hell and got all of the girls into this mess. Then there's that one girl who was selfish and decided to climb on the rope will Alexa was on it   and then screwed everyone over by knocking down the ascender, good thing she died. I'm not sure if ben should've died because I kind of skipped like the first ten minutes of the movie because I got bored of it. Those two girls at the end of the movie those people were honestly not that bad because the blonde one was so loyal she jumped in to the water to save her friend and she went in first when they heard music, not to mention she was at the front of the group the entire time she was the best of the group. Then there's that other one I think her name is Mia I didn't really notice her doing anything so that probably means she wasn't annoying so It's a good thing they didn't kill her off. Finally who has a swimming pool at the front entrance of a school.",
    "date": "2024-05-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I liked this movie (but keep in mind I wasn’t sober. ) I found that me and m freinds enjoyed it as more of a comedy. Do with this info what you will",
    "date": "2024-04-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Truly appalling. The first film had more than a little something about it. This is just base brainless garbage. A complete waste of 80 minutes. Go and watch Gregory Peck in Moby Dick for some sophistication and entertainment.",
    "date": "2024-04-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Has its flaws but I enjoyed this movie very much, the kills were nice but the slowmos were a bit too much.\n\noverall I very much enjoyed this movie",
    "date": "2024-03-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "While the preface of the movie could've been good (high school students going on a scary dive encountering sharks) it was such a cheesy movie where the underwater scenes and acting was so unrealistic that it was hard to relate to any characters. E.g when they witnessed friends/family die they screamed but then barely acted upset or shocked.",
    "date": "2024-03-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I genuinely hated that I opted to watch half of this movie.",
    "date": "2024-03-02"
  }
]