[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Dumb and funny fam jam",
    "date": "2025-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This movie was defmitely not the best of 2023, not close to the best comedies out there, but it was enjoyable. This is a perfect family movie. No nudity or anything like that.\n\nA good movie these days is a rare thing, especially comedies.\n\nIts obviously low budget but that's why I rated it only a 3. A lot of room for improvement here and a bit goofy. But it kept me entertained all the way through, and that's what matters.\n\nThere's just one issue which I don't get it, maybe a plot hole towards the end, I don't want to give spoilers but that didn't make sense. Otherwise very good comedy. But I guess sometimes you just have to realize its a movie, just to have fun, and not think so seriously about it.\n\nActing was alright, pace was fantastic, never a dull moment",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 35 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated R for Sexual Material, Language Throughout, Brief Drug Use and Violence!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "this movie is very stupid. the kind of stupid i love. it's one of my comfort movies. it's the only movie i've ever watched twice in the same day.\n\nif you don't like adam devine, skip it. fantastic cast, and stupid-fun story.\n\nmy favorite bit is the disdain ellen and pierce have for adam the entire movie.",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Had to bail 15 minutes in.  Just couldn’t bear to watch it any more.  Adam DeVine’s slapstick acting belongs in the Charlie Chaplin era.  I don’t think I’ve ever watched a movie where his character doesn’t irritate me, even small parts.  He is not leading man material.  Pathetic puerile vulgar sex jokes and innuendo.  Just lazy script writing, which is the weakest element of this movie.  Not much better from Richard Kind’s character.  I selected this because I hoped Pierce Brosnan would be in a reasonable movie but alas, no.  I feel sorry for him.  The critics rating (22%) is about right, and only for those that like this genre.",
    "date": "2025-03-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The Out-Laws is good for a few chuckles, but not much more.",
    "date": "2025-02-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Contained some good laughs. As a comedy, fan I thoroughly enjoyed it. Worth a watch if you are looking for something fun.",
    "date": "2025-02-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I expected a better movie from Happy Madison and Adam Sandler, but this one was disappointing. It was packed with awkward moments, unfunny sexual jokes, unnecessary slurs, and a dull storyline. The dynamic between the clueless nice guy (Owen Browning) and the tough in-law (Pierce Brosnan) felt forced and ineffective.",
    "date": "2025-02-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "tired of ex-strippers painted up as pirates in the 1700s in movies anymore...but guess thats all they can get in Hollyweird anymore..",
    "date": "2025-01-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "its a wanna be braking bad",
    "date": "2024-12-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Filme: Meus Sogros Tão pro Crime\t\t\t \nElenco: @nina @piercebrosnanofficial Ellen Barkin, @adamdevine @laurenlapkus @poornagraphy @michael_rooker @realrichardkind \nModelo: #comédia #trash #ação\nDuração: 1h 35m\tAno: 2023\nMinha opinião: O excesso do ator Adam DeVine na sua atuação exagerada estragou. Ou derrepente na escolha do protagonista errou. E também não ferou aquela química entre Nina e Adam é casal que não convence. Como no caso de Pai em Dose Dupla onde tem a química. A atuação boa esta com Ellen e Pierce que vemos a química entre eles. Acredito que  fosse outro ator no lugar de Adam o filme poderia dar certo. Pois o roteiro e enredo não são ruim. Owen (Adam) esta vivendo com Parker (Nina), ele trabalha como gerente de banco. E chega o dia que Owen vai conhecer os pais de Parker; Lilly (Ellen) e Billy (Pierce) que na verdade são ladrões de banco. E assim eles assaltam o banco do genro. Mas uma antiga amiga do casal esta atrás deles Rehan (Poorna) uma atriz desconhecida da grande maioria, que faz o seu papel de mafiosa. E onde para Billy se livrar Rehar precisará da ajuda do genro. Kkkkk então a confusão esta feita, mas como disse com exageros de Owen. \nVale apena assistir? Se não tiver outra opção, mas não tiver mesmo. \nNota: 3",
    "date": "2024-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The Out-Laws is an absolutely hilarious action-comedy. An unlikely goody-goody bank manager working with some of the biggest bank robbers to retrieve what’s most important to him.  An amazing watch if you’re wanting a good laugh",
    "date": "2024-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Truly bad. Why does Levine over act?  A different lead could have made it watchable..I wanted to like it but he just drives me crazy with the stupid comments every scene.  Just bad.",
    "date": "2024-10-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "\"The Out-Laws\" features a charming cast led by Adam Devine and Pierce Brosnan, whose performances provide a delightful distraction from the film's predictable plot. With very low expectations going in, I found it to be surprisingly decent—though it still falls short of true comedic brilliance. The humor didn't land as much as it should have for a comedy, leaving me chuckling only occasionally. The film feels soulless and lacks the creativity to offer anything new or memorable. While it serves as mindless entertainment, it's nothing more than that. Despite my initial apprehensions, it's not as bad as I expected, but I wish it had more depth and laughter. Overall, \"The Out-Laws\" is a watchable romp, but it’s a far cry from being a standout comedy.",
    "date": "2024-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "watch full amazing movie online on https://glamcinema.com/",
    "date": "2024-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This was so bad. Terrible script and the main actor made this so cringey. Ruined it for everyone else.",
    "date": "2024-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Enjoyable, silly comedy with some funny dialogues and brisk action.  I know most top critics were very critical of the movie but I thought it provided decent entertainment and this movie was better than a lot of other comedy/action films",
    "date": "2024-09-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This could of been a much better film if they cast someone other than Adam DeVine.  He lost it for me on this film.",
    "date": "2024-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "We’ve seen the basic plot often, this only excels at being vastly more absurd and ridiculous than all the rest.",
    "date": "2024-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Good story, bad actors and bad directors.",
    "date": "2024-08-24"
  }
]