[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A seriously underrated western. It's a tight, lean, action-filled epic of the gritty, dusty, deadly nasty and mostly mythical old west. Stone is on fire and Crowe brings his gladiatorial panache to bear. The rest of the cast is equally stellar.",
    "date": "2025-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A fun cheesy western that takes itself a little too seriously but it adds to the charm.",
    "date": "2025-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Filme: Rápida e Morta\t\t\t\tAssistido: 29-7-25\nElenco: @sharonstone @genehackmanofficial @leonardodicaprio @russellcrowe @officiallancehenriksen @silverthroat @tobinbellofficial @oliviamburnette @garysiniseofficial \nModelo: #faroeste #western #ação\nDuração: 1h 47m\tAno: 1995\nMinha opinião: Um filme de western com a musa Sharon Stone (Ellen) e temos um hall de estrelas, ver Leonardo Di Caprio adolecente (Kid), Russel Crowe (Cort), Lance Henriksen (Ace), Gary Sinise (Delegado). Em uma cidade dominada por Herod (Hackman) e seu bando. E agora tem uma competição do gatilho mais rápido e vários cowboys estão na cidade para participar e ao vencedor ganhará uma bolada. Mas temos 2 pessoas que estão por outro motivo Cort esta como refém de HErod e forçado a participar e Ellen que esta por vingança. Para se vingar de Herod que no passado quando ela era uma criança viu seus pais serem mortos por Herod. E para sua vingança ela se tornou uma pistoleira. E assim a competição começa e os principais, vão vencendo. Até chegar um dia onde pai e filho irão duelar e estamos falando de Herod e Kid, e Herod nem seu próprio filho polpa. Até chegar na última disputa entre Herod e Ellen. E ela conta toda estória da vingança e quem vence? Não foi dos melhores faroeste e também a interpretação de Stone. Mas as atuações de Caprio, Hackman e Russel são boas.\nVale apena assistir? sim, para ver estas estrelas.\nNota: 7",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I had no idea this was supposed to be a comedy. It's all gimmicky camera angles and effects. It doesn't matter how bad you hate someone, he's not going to scream after you fire the gun, while the bullet is coming toward them. It's not going to hit him so hard he does a backflip.",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This film is unrealistic. I mean this is based on the old west, but the villian Herrod would NEVER be able to run a town like that. As far as gunfighters, I just feel that eventually people would be fed up with Herrod and shoot him. I know I would.",
    "date": "2025-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A fun show.  This is kind of a go to movie for me when I’m not really sure of what I wanna watch. It’s the kind of movie you can watch over and over.  It entertains and you don’t have to think about it so if you’re tired, this is a good one to put on.",
    "date": "2025-07-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I first saw this film 35 years ago in theaters and thought it was just okay. Rewatching it last night on TV, I found it downright dull. The casting is top-notch—Sharon Stone, Gene Hackman, Russell Crowe, and a young Leonardo DiCaprio—but the weak script wastes them, cramming in too many underdeveloped characters. The cinematography has style, but showy gimmicks (like unnecessary slow-mo paired with cheesy zoom effects) undercut its impact. The premise—a female gunslinger in a male-dominated revenge tale—had real potential, but instead of depth or tension, we get a repetitive shootout competition. A more fitting title? The Tasteless and the Dull.",
    "date": "2025-06-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Great western!! Liked it the moment I seen it. And Gene Hackman as the villain is great.\nIt's like a spaghetti western in a way but with a Sam Raimi twist to it and I love it. And I hate this word but it's very underrated.",
    "date": "2025-05-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love this movie. I could watch it 20 times and still enjoy it. A superb cast with excellent direction by Sam Raimi. Everything worked for me.",
    "date": "2025-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This movie has such a cool premise for a western. Basically, a town sets up a March Madness style bracket of dueling gunfights. It is such a dumb idea; I can't help but love it. This is then executed with a diverse cast of colorful characters that make each showdown memorable. This is helped by an all-time great cast. Hackman, DiCaprio, Crowe, Stone, Henriksen and Keith David are all actors that bring real life to every role they play. Combining the premise with the characters is Sam Rami's signature visual style. This leads to some crazy camera movements and kinetic energy that makes the movie never dull.",
    "date": "2025-04-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Enjoyed it very much. Probably Hackman's finest \"badass\" role. Great cast, very good cinematography. Enjoyed watching it, a couple of times ...",
    "date": "2025-03-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Stylish but dumb. Oscar winners acting very well and a supporting cast of snarling stereotypes who you know will get knocked off lone by one leaving a very stupid, improbably but stylish ending. Entertaining enough but with those stars and the budget involved, it amounts to little more than a check-your-brains-at-the-door time waster",
    "date": "2025-03-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The movie has great actors and is good fun but more importantly, Sharon Stone launched the career of Leonardo DiCaprio by paying his salary herself and on top postponed start of shooting to get Russel Crowe on board and had a big influence on his career as well. So this movie is just Iconic.",
    "date": "2025-02-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Enjoyable play on a Western! The premise of a week-long competition of quickdraw duels is great, and Gene Hackman, always fantastic, plays a terrific villain. Raimi does a lot of interesting, nontraditional shots and effects with the shooting (including some wildly long dolly zooms, which is pretty fun). A very young DiCaprio and a young Russel Crowe are pretty awesome characters, too, and Keith David's performance as an itinerant duelist is terrific.",
    "date": "2025-01-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Underrated classic; but not a by the numbers drama so the critics, as usual disliked it.  Which, quite simply, tells you who really doesn’t have a grip on film.",
    "date": "2025-01-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Pritty simple forward story, but still full of good acting, funny lines and good badass quotes. Definitely worth watching.",
    "date": "2025-01-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The Quick and the Dead is a fun western filled with interesting characters and warm slice of justice.",
    "date": "2025-01-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This is a \"must see\" movie! So, see it.",
    "date": "2025-01-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thought it was a great, fun flick. I don't understand why it got such bad reviews. A classic shoot em up.",
    "date": "2024-12-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great western!! Cast of characters excellent. It is a shoot it out western. Very entertaining!!😀🇺🇸",
    "date": "2024-11-23"
  }
]