[
  {
    "user": "Ezequiel Boetti",
    "rating": 2.0,
    "text": "... A calculated and sloppy production, a sort of satire on action movies that clashes against the same logic it poses. [Full review in Spanish]",
    "date": "2023-06-07"
  },
  {
    "user": "Brian Eggert",
    "rating": 0.5,
    "text": "Anyone not accustomed to seeing Lautner transform into a badly rendered werewolf should keep a safe distance.",
    "date": "2023-03-07"
  },
  {
    "user": "Dennis Schwartz",
    "rating": null,
    "text": "A time-waster.",
    "date": "2023-02-17"
  },
  {
    "user": "Richard Propes",
    "rating": null,
    "text": "Are pouting and flexing emotions?",
    "date": null
  },
  {
    "user": "Abbie Bernstein",
    "rating": null,
    "text": "It is an entertaining thriller that lets Lautner show he looks good as a young action hero, and as such, it accomplishes its mission.",
    "date": null
  },
  {
    "user": "Margherita Pellegrino",
    "rating": null,
    "text": "Astute viewers will find themselves unhappily wondering what the point is of hiring great, experienced actors like Sigourney Weaver, Maria Bello, Alfred Molina and Jason Isaacs, only to then award them such a diminutive screen time.",
    "date": null
  },
  {
    "user": "Debbie Baldwin",
    "rating": null,
    "text": "Unfortunately, there are many, many more reasons to skip it, the overriding reason being the leading man, Taylor Lautner-a hunky Neanderthal with the acting range of a dial tone.",
    "date": null
  },
  {
    "user": "Johnny Gayzmonic",
    "rating": null,
    "text": "A film that's not only brain-dead, but also treats the audience as if it's equally as stupid. It shows as much contempt for its characters as it does for its viewers.",
    "date": null
  },
  {
    "user": "Anna Smith",
    "rating": null,
    "text": "Abduction does little for Twilight's Taylor Lautner as he becomes a fish-out-of-water in this Bourne Identity-mirroring movie.",
    "date": null
  },
  {
    "user": "Will Leitch",
    "rating": null,
    "text": "By the end of \"Abduction,\" it's even becoming difficult for supporting actors like Sigourney Weaver and Alfred Molina to keep from laughing at the lunacy unfolding.",
    "date": null
  },
  {
    "user": "Ben Kendrick",
    "rating": null,
    "text": "Lautner fans will enjoy five separate occasions where the star takes off his shirt but, for fans of worthwhile trips to the theater, Abduction is hard to recommend.",
    "date": null
  },
  {
    "user": "Kristal Cooper",
    "rating": null,
    "text": "Card-carrying members of Team Jacob may approve, but Abduction won't help turn Lautner into the action star he clearly aspires to be.",
    "date": null
  },
  {
    "user": "Jeff Beck",
    "rating": null,
    "text": "In the end, we're left with a semi-interesting story that was poorly executed and poorly thought out with a bad lead performance that merely exemplifies the weaknesses of the script.",
    "date": null
  },
  {
    "user": "Michael Dequina",
    "rating": null,
    "text": "The jury's still out on Lautner's leading man future.",
    "date": null
  },
  {
    "user": "R.L. Shaffer",
    "rating": null,
    "text": "Even subtracting Taylor Lautner's mechanical performance, Abduction is an illogical train wreck riddled with messy direction, bad editing, tired action and plot holes galore.",
    "date": null
  },
  {
    "user": "John Beifuss",
    "rating": null,
    "text": "Lautner is a distracting screen presence; he's like a living Mort Drucker caricature or a 'motion capture' animated avatar of himself. Even so, he deserves better than this.",
    "date": null
  },
  {
    "user": "Brian Gibson",
    "rating": null,
    "text": "Boring fugitive action-flick meets insipid teen romance. Well before the movie shows any hint of ending, you'll hope for a quick abduction, by any means, from the cineplex.",
    "date": null
  },
  {
    "user": "Jim Schembri",
    "rating": null,
    "text": "The holes in the film's twist-filled story are often so big you could almost squeeze Lautner's sex appeal through them.",
    "date": null
  },
  {
    "user": "Sam Bathe",
    "rating": null,
    "text": "At not a single point in this movie is anyone abducted.",
    "date": null
  }
]