[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "What could have been a great historical account was let down by a cloying emotional script",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This film was by far one of Mr. Tyler's best films! From the cast to the details of their emotions. lIt's one thing to act but to feel but it's completely different when it actually moves you. The rotten reviews come from those critics that have dust on their baseboards but if you visit their home you sneeze uncontrollably. They lack real vision but are full of opinions. This movie is my favorite of all time! Mr. Tyler I know your mama is beyond proud for the production this film.",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Daytime TV budget, high school theater group level acting. Corny dialog.  This movie was absolute dog water. I mean very bad.",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Such an amazing watch! Historical (which warms my heart as a history graduate) but also captivating. The entire casts performance, you could tell meant more than words to portray such an incredible story! \nIf you want a story that inspires as well as entertains, this film is certainly for you.",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I don’t know how I only just heard of this movie. In my opinion, its ratings don’t reflect the movie itself. It was very well made, and taught me something from the past that I had no idea about. I’m glad I’ve seen it, and would definitely watch it again. I recommend watching it if you’ve got a movie night on your radar.",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Almost didn't watch movie because of title 6888. Great movie. Great casting. Loved inguinity and itelligence of women on how they figured out the difficult mail. Much of the issues could have been averted if Gov't/Military standardized communication by understanding the the variables of communicating during war. Some similarities still prevalent today.",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Dragged a bit, but honored a facet of women's history that deserves its day.",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely brilliant film!!!",
    "date": "2025-09-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A very inspirational movie! This is a must see movie.",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Its about a sorting and delivering mail... there's some other boring side plots, but sorting and delivering mail",
    "date": "2025-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Written and directed by a team with an imagination of how they think a war movie is done, with no care on actual facts. Built and run more on emotion then actual military procedures. \n\nThe story was lost in the schmaltz.",
    "date": "2025-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The Six Triple Eight is the story of the only black Women's Army Corps to serve in the European theater during WWII. It was a compelling story, enhanced by a touching interracial love story. Some critics did not feel as if it was dramatic enough, and did not like the love story. However, if you like Pearl Harbor or Titanic, chances are you will like this film. On the other hand, if you prefer more gritty, realistic historical dramas, such as Saving Private Ryan, you may not like this film.  In other words, if prefer your  history lessons wrapped up with some romantic tension, you will like this Tyler Perry drama. Recommended.",
    "date": "2025-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a great movie. The script is good, the acting is good and the production is good. I highlt recommend it.",
    "date": "2025-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Fantastic movie that (finally!) recognises this battalion of female soldiers who, with a phenomenal amount of grit and resilience, proved so many mysogynistic bigots/racists wrong when they are given a mission with an intent for them to fail. \n\nWhilst I would have preferred less focus on the romance suggested in this movie (which may or may not be fictional), it does not take away from the real story, which is that these women did something the army thought to be unachievable, and rose above every bit of adversity deliberately (and sometimes cruelly) thrown at them - in almost half the time they were given. The actors in the main roles were amazing, particularly Kerry Washington, Ebony Obsidian and Dean Norris (who played his character so well, he made me despise him!).",
    "date": "2025-06-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's not bad for what it's worth but I questions if a 2 hour film was the best way to do something like this rather than a 1 hour documentary. The problem is the editing is just alright and story wise it's just very unfocused. We bounce around between multiple subplots. Romances, racial tensions, bombs, individual stories, and the core sorting mail plot all feel very scattered. It feels like it's telling the events that happened but not in a cohesive manner. The cinematography is alright. Some scenes look better than others and Perry's direction is decent here. Some scenes are very melodramatic, over the top, repetitive and there are some that do a decent job of character drama. The production value is pretty good but the whole thing has like what I can only describe as like a borderline hallmark Channel vibe to it. Which isn't a bad thing but it makes it feel out of place when we go for serious racial subjects or dark scenes. Everything else though is half decent. Everyone is trying here but the characters do all blend in a bit and it gets a bit hard to keep track of everyone besides the Lt Col. And I do like the subject manner. You know we see how many WWII flicks of D-Day, Pearl Harbor, Stalingrad, and Iwo Jima but I can't tell you of many where a unique subject like this is covered. It is a interesting perspective and the end homage was sweet and the best part to the ladies of the unit. But it feels like the racial parts are very on the nose, get repetitive, and add on the unfocused subplots and it just gets a bit boring honestly. But again it's still not half bad just because it's such a unique subject manner. Anyone who wants to see a unique WWII subject manner or is a fan of any actors in this may want to check this out.",
    "date": "2025-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing, powerful, rewarding and memorable! This was a great watch. To see the elevation of women and how driven we are is extraordinary to watch. Black women are powerful and relentless! Absolutely loved it! If you haven’t seen it, definitely check this masterpiece out! From the director to the actors…stunning work 🙌🏽",
    "date": "2025-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I kept waiting for something to happen, it never eventuated. There's a feeling of trying so hard to be warm and meaningful, but just missing the mark consistently.",
    "date": "2025-06-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love history and I love women's history. This film is based on a true story. I know a film isn't a documentary but anything like this that shines a light on a piece of important black women's history is worth seeing just to make you think. You can do the research afterwards. \n\nPlus it's a good film telling an uplifting story. I was recommended it by a friend and I will pass on the favour. Just because the film critics didn't like it very much, well, ignore them and watch this film.",
    "date": "2025-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Horrible! This is a fantastic story. Too bad it was told so badly in this film",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Eine Gruppe von schwarzen Frauen bekommen endlich einen Auftrag. Die Soldatinnen haben mit Sexismus und Rassismus zu kämpfen. Ihnen wird nicht zugetraut in der Armee zu arbeiten und zu dienen. Doch sie erhalten einen Auftrag. Sie sollen die Post die an Soldaten adressiert übermitteln. Die Briefe sind von Familienangehörigen der Soldaten, die natürlich auch Angst haben, dass ihre liebsten Tod sind. Die Frauen bekommen, dafür zwischen 6 und 9 Monaten Zeit. Dafür das sie 17 Millionen Briefe sortieren und ausliefern.\n\nDer Film erzählt eine Geschichte, welche mir und wahrscheinlich auch vielen in Deutschland oder sogar auf der ganzen Welt nicht bekannt ist. Wie der Film einen die Herausforderungen dieser schweren Aufgabe zeigt und wie diese gelöst werden ist einfach nur überragend. Außerdem gibt es noch eine emotionale Geschichte der Hauptcharakterin, die einen Berührt. Der Song Journey wurde für einen Oscar nominiert als bester Filmsong und hätte den gewinnen müssen. Da dieser Song sehr schön und emotional ist und auch perfekt zur Situation passt.\n\nEin Film den man gesehen haben muss, um Heldinnen zu feiern und gedenken die nicht so bekannt sind.\n\nEin Film den man gesehen haben muss, um Heldinnen zu feiern und gedenken die nicht so bekannt sind.der Soldaten, die natürlich auch Angst haben, dass ihre Liebsten Tod sind. Die Frauen bekommen, dafür zwischen 6 und 9 Monaten Zeit. Dafür das sie 17 Millionen Briefe sortieren und ausliefern.\n\nDer Film erzählt eine Geschichte, welche mir und warscheinlich auch vielen in Deutschland oder sogar auf der ganzen Welt nicht bekannt ist. Wie der Film einen die Herausforderungen dieser schweren Aufgabe zeigt und wie diese gelöst werden ist einfach nur überragend. Außerdem gibt es noch eine emotionale Geschichte der Hauptcharakterin, die einen Berührt. Der Song Journey wurde für einen Oscar nomminiert als bester Filmsong und hätte den gewinnen müssen. Da dieser Song sehr schön und emotional ist und auch perfekt zur Situation passt.\n\nEin Film den man gesehen haben muss, um Heldinnen zu feiern und gedenken die nicht so bekannt sind.\n\n8/10",
    "date": "2025-04-29"
  }
]