[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "How does this have such a low score, it was a really good movie. Well directed and great acting.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Really enjoyable film... I was hooked from the start",
    "date": "2024-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A fierce-looking gentleman steals the hearts of a fatherless boy and his single mother. From that sentence alone, one can conclude that there may be something missing. And indeed, something was, in fact, missing. Considering the film was made eleven years ago, many elements of this story age poorly, including but not limited to the dependency the story has on the strength of masculinity. All the major beats of Labor Day are directly played by Frank (Josh Brolin), and repeatedly the audience is stuffed with the idea that true salvation will occur for Henry (Gattlin Griffiith) and Adele (Kate Winslet) only after a man saves them. In fact, there doesn’t even seem an established law that the savior must be Frank. Any man that will protect Adele’s shattered existence and teach Henry how to better play baseball can be this story’s hero. Honestly, the film suffers most from a flatness that has been associated with the archetypal damsel-in-distress narrative that we have all interacted with so many times before, but for Reitman’s version - we’ve added a son for the man to save as well. \n\tThere wasn’t too much that Kate Winslet or Josh Brolin could change, considering how the film was written, but they both express a mutual pain that is the sole responsibility of any emotional depth found. Both actors try their best to ignite a sense of urgency at times of high stress, while they navigate stark, strange shifts into romantic, scenes of sentimentality. The clunkiness of Frank and Adele’s relationship set choppy waters for these two stars to stay afloat, but I really did appreciate their chemistry at intimate scenes of consolation. One of the strongest scenes in the entire film is when Adele attempts to drive to the pharmacy, and rather than Frank ignoring her distinct stress, he gives her the floor to tell her history about losing control of her body - and ultimately her life. \n\tAll in all, this film proves that strong performances can’t save work that fails to… well, feel. I don’t believe that Henry’s life is saved by his interactions over one labor day weekend with a good guy, and I don’t appreciate the suggestion that Adele’s life is only worth her relationship with that same, good guy.",
    "date": "2024-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Ok so obviously this movie is horrible it just gets 3 stars for being hilarious. Kate Winslet is a sex starved single mom who is taken hostage by a sexy prison escapee. He immediately starts doing dad stuff around the house. Manly stuff that Kate couldn't possibly accomplish with her delicate hands like fixing the deck and her car and teaching the kid how to throw a baseball. He shows her how to do several things from behind including batting a baseball and sensually mixing a peach pie. They bang and the kid listens and also gets horny?? The kid is having like sex dreams about other kids and is scared of it. It's all so weird and clearly the wet dream of a middle aged woman turned into a script",
    "date": "2024-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Don't know what the negative reviews are about, great film.",
    "date": "2024-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I absolutely loved this film. The three lead characters were outstanding and there was wonderful chemistry between Kate Winslet and Josh Brolin. It was definitely not a thriller, nor did it try to be. It was just a beautiful love story.",
    "date": "2024-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The critics are very unfair but expected from US critics. Americans expects criminals to act as criminals, not as nice and responsible persons. The story is very good and Kate Winslet is brilliant in her role. But that is no surprise. I think that she and Cate Blanchett are the best actresses in the world. On third place I put Susan Sarandon.",
    "date": "2024-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "From the front cover and other visual promotional material, you could be forgiven for thinking that this is some sort of romantic drama.  And you’d probably be right.  Sort of.  It’s a romantic drama that is masquerading as a crime film.\n\nJosh Brolin plays an escaped convict who holds Kate Winslet (and her son) hostage while his wounds heal. It sounds like the plot of a thriller, but it isn’t.  There’s never really enough tension to make it particularly thrilling.  Amazingly, the two leads fall in love and this is the story of their coming together.\n\nAnd that’s about it.  There really isn’t that much else to it.  There are a few minor sub-plots surrounding the other people in the town and whether they’ll discover they have an escaped prisoner in their midst.  Again, this area is never truly explored and doesn’t add much to the story.\nTherefore, it’s pretty much a straight love story about how two mismatched people find each other in odd circumstances.\n\nI read online that this is a ‘women’s film’ (primarily).  Possibly, but it’s well-acted enough to be engaging to both sexes.  It’s certainly not fast-paced, so it’s probably best you prepare yourself for a slow burner with a pretty straight-forward plot.  It’s nearly two hours, too, so it never feels like it’s flying by.\n\nI enjoyed it, however, despite the excellent performances and beautiful scenery, I’m not sure I could be bothered to sit through it again.  It’s such a simply story that I feel I’ll probably remember everything about it for a long time to come (largely because there isn’t too much to it!).\n\nNice, but slow.  You have been warned.",
    "date": "2024-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Another great movie where you can't trust the RT rating. It's a great story with great actors. Give it a shot, I was not disappointed.",
    "date": "2024-03-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This is one of those \"it only happens in the movies\" movies that strains credibility to the brink of hilarity. An escaped convict teaches a divorcee and her son how to make a peach pie, and all their lives will be changed forever. 🙄. I've never used an emoji in a review before. This is a first. Anyway, this is a dreary, visually unappealing movie that almost feels like a stage play that was opened up for the cinematic landscape. Every single actor here appears to be on tranquilizers - I've never seen a film with such sleepy performances. Winslet in particular is a disappointment. Her performance is just bad posture and physical tics. It's almost like the movie is playing on the wrong speed - like when you'd slow down an Olivia Newton-John record and make her sound like Lou Rawls. The film is awkwardly interspersed with flashbacks that feel unnecessary and supporting characters who pop in out of nowhere and are completely forgotten. These are extremely talented people in front of and behind the camera, and I wish their time and energy had been used toward a more worthwhile endeavor.",
    "date": "2024-02-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I liked it. I guess that reveals me as a hopeless romantic.",
    "date": "2023-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "i just watched this in 2023-good movie but some 'really' bad acting by a few characters so 1 star off for that",
    "date": "2023-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I don't understand the low ratings. Yes, it's a bit implausible. But if you view it in the (analog) context of a 1980's, economically slow, small town, it's not such a huge reach. I was happy to suspend my disbelief in that regard, because the relationship development between the 3 main characters was so great. It's a beautiful story above the healing nature of enduring love. Not only romantic love, but the between mother and son. More importantly, it's an accurate portrayal of the destruction and pain that unrecognized and undiagnosed depression can have on individuals and their families.  Kudos to the filmmakers for the sensitive handling of a hugely relevant issue, which nevertheless does not overshadow or distract from the central story in any way.",
    "date": "2023-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's got a lot of issues but it's ok overall. The biggest issue here is the subpar editing. It feels like once Frank arrives at the house they just kind of do stuff together with no real tension to overcome mainly because Frank is a nice guy already so it doesn't feel like anything is earned. The backstory of each character is out of place as well. From learning about Adele's pregnancy problems and Frank's sporadically placed backstory it breaks the focus constantly. Second, I can't tell you if this is supposed to be a hostage thriller, a love story, or a coming of age story. The tone is all over the place despite being a slow movie the entire way. Finally the main focus it feels like should've been Adele and not Henry as his coming of age stuff and romance subplot feel completely unneeded. The music is decent but its defintely boring and forgettable at times. Everything else is just kind of ok. The shots are well framed and the setting is memorable. Brolin gives a good performance and Winslet is decent as well. Henry is just kind of ok and is boring, generic, and forgettable despite getting most of the focus. His girlfriend feels so robotic and out of place and has no charm at all with him. No little girl talks like that. Also, at the end they make some really dumb decisions despite planning so much. Why would you not lock the door, why wouldn't you ask for only half the money, why would you let Henry on the first day of school walk around and not keep track of him while he delivers a note to his Dad. He could've done that later with no return address.  It is such dumb decision making at the end by everyone. The ending is the bes part and kind of sweet though and does make up for some of the clunky moments. This needed to commit to either being a hostage thriller or a romance between Frank & Adele with Henry on the side. If your a big fan of Winslet or Brolin you may like this. Otherwise skip it.",
    "date": "2023-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Can't believe it's taking me this long to watch this movie. A deep connection between two very injured people. Love can conquer all. Heartwarming and hopeful.",
    "date": "2023-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Spoilers - This movie has come up as a recommended movie and when I saw the cast I decided that it may be just the movie for me to watch one lazy day. I'm sure I'm in the minority but I thought this was just a horrible film. The premise of an escaped convict in prison for murder (which he did commit whether intentional or not)  worming his way into the lives (via kidnapping) of a mentally shattered woman (and her son) only for them to fall in love and plan to run away together is beyond implausible and to be honest, creepy. I was hoping midway through the movie that Josh Brolin's character would get caught already. Maybe I just wasn't having the type of day for this kind of film and if I would have waited to watch it some other time I'd feel differently. Actually, no. I think that regardless of when I watched it I'd still think it was creepy.",
    "date": "2023-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "To all the overly pretentious, so called top critics that had to over think this movie and panned  it shame on them for not appreciating romantic simplicity.\nAll very simple scenes, no real violence or bad guys for that matter, wonderfully vivid scenes and a love story with a happy ending.  Winslet has few peers. Brolin delivered a powerfully gentle man and the boy linked it all with an understated yet magnificent performance. \nA simple love story that will leave you smiling.",
    "date": "2023-03-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The pace is incredibly slow and the plot is completely unbelievable, but hey, Josh Brolin and Kate Winslet are in it.  What a wasted opportunity to really say something meaningful.  Even the amazing talent they had couldn't quite save this sinking ship (see what I did there).  The film had a few shining moments of emotion, and it did leave me wanted to see more, but they could do so much better than this not-quite-a-waste-of-my-time movie.",
    "date": "2023-01-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This is a very symbolic film - it reminded me of the Terrence Malick films I've seen (The Tree of Life and Knight of Cups). I say that as there's surprisingly little dialogue at times (an off screen narrator reads the thoughts of characters at times) and a perhaps slightly heavy presence of music, mostly classical/orchestral. Plot wise, its about tension and fear - I like the slow tension that develops. Towards the end of the film, it feels rather claustrophobic and I felt it reminded me a bit perhaps of M Night Shymalan's films. I should maybe point out that this isn't your typical thriller/horror type watch - if you've seen Terrence Malick or Shymalans films then you'll have an idea of whats in store. Its a bit of a mix of the two - there's more dialogue present from about half way through the film but even so, it still felt, to me, to be about what wasn't being said, rather than what was.\n\nIts quite a thoughtful film, in that I found myself wondering what truths may be discovered about the mysterious man the film is about. Its quite good at presenting a tense atmosphere, as I say - there is an element of suspense about, although if you prefer fast paced films then this will likely be too slow and subtle for your taste, I'd have thought. Its very much a character based drama which keeps you guessing. I did get a bit muddled with some plot aspects but as I say overall I felt it was a pretty well made film and I enjoyed it.\n\nOverall, I'd say its worth a watch though, definitely.",
    "date": "2022-09-03"
  }
]