[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Extraction II falls squarely into the category of unnecessary sequels that are still watchable. The kind of movie that works as a time-killer but doesn’t offer much in the way of depth.\nThe story picks up right where the prequel left off. Tyler Rake basically comes back from the dead for another mission: to rescue—or rather, extract—his ex-sister-in-law from a prison run by the Nagazi, a powerful Georgian crime syndicate.\nThe plot follows the usual formula for this genre: force the protagonist into a situation that dredges up pieces of his past, trying to build an emotional connection to the external chaos unfolding around him. Extraction II is easy to follow and even easier to predict. What saves it are the action scenes and the cast.\nOne standout moment in Act One features a 21-minute continuous shot. It’s surreal to watch—intense, gripping, and technically impressive. A technique that gained fame after showing up in John Wick 3 (or was it 2?).\nThe actors themselves are top-tier professionals. Nothing to complain about there.\nOverall, Extraction II is fine for casual viewing, the kind of film that doesn’t tax your brain with complications or nuance. A smooth ride that feels tailor-made for a Sunday evening of mental decay. Acceptable.",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Probably the worst nonsense I have ever watched. Half way I realized that life is really to short to spend another 45 minutes with this.",
    "date": "2025-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Un scénario pour donner l’excuse à Chris Hemsworth de tabasser pleins de méchants. L’action est satisfaisante sans pour autant être du grand cinéma. J’ai apprécié découvrir l’histoire de Tyler et les raisons qui le pousse à sauver cette famille, cela amène un côté encore plus touchant au personnage.",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Gonna be honest, I was a bit worried about this one. Haven't seen the first film in over a year, and was worried I'd feel lost while watching. And I wasn't. Covered enough ground from the first one, and we endured a great journey with Tyler Rake. Great action, awesome choreography, and visually appealing. Fun story too. I wish we had a little bit more character development tho. Excited to see where we go from here.",
    "date": "2025-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A greater improvement on its predecessor, Extraction 2 continues the thrilling action.",
    "date": "2025-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Dumb waste of time - for dumb and dumber only (videogamers included).",
    "date": "2025-06-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Once again, this follow-up continues its preceding attempt of revitalizing the genre through sequential exhilaration across unseen proportions and stakes as circumstantial depth to further drive the expected adrenaline to the next level. (B+)",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It’s a 2 hour COD cutscene but with more CG.",
    "date": "2025-04-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Somehow they made one even better than the first one. Studios should learn lessons from this and John Wick. Chris Hemsworth is awesome. \nThe torch has been passed from Stallone and Schwarzenegger to Hemsworth and Reeves.",
    "date": "2025-04-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It is rare to find a sequel that is better than the first movie! Especially when the first film is really good!",
    "date": "2025-03-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Extraction 2 delivers what it promises on face value i.e., some thrilling and visceral action set pieces. Unlike its predecessor, it tries to have a bigger plot but honestly fails at doing so. Still an engaging watch for action fans.",
    "date": "2025-02-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I thought in the first movie it was his daughter who died. But in Extraction 2 he talks about a son.",
    "date": "2025-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love this military roles suits Chris Hemsworth",
    "date": "2025-02-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Extremely well made, and with a heart, the overall experience of Extraction 2 is a good one. The action is clearly video game inspired. The angle, pace, and brutal the combat is straight from Call of Duty or Battlefield. THe characters are super-human - which is a shame. This movie could be so much better if the action were dialed back just slightly. Think Die Hard - but hanging from helicopters, one armed slinging around of bodies while hanging from a collapsing building, getting shot 10 times. It just is not believable. My suspension of disbelief goes out the window. \n\nRegardless, I enjoyed this one. It would have been better to end with a real ending.  I think going for 3 is a big mistake, but we shall see.",
    "date": "2025-01-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Its action is just as excessive as the first movie, but its grand production and cinematography keep it exciting throughout.",
    "date": "2025-01-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "One small group of people, 3 I think, without any scripted superhuman power, fight dozens and dozens of highly armed bad guys including a helicopter, and win, suffering only but a deep scratch.  I fail to comprehend the entertainment value of these types movies.",
    "date": "2024-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "\"Extraction 2\" is an action thriller master class. The movie boasts one of the most impressive action set pieces of all-time. It consists of a 22-minute action barrage simulated to look like one long tracking shot. Surely some CGI was used in the scene, but it is fairly seamless, and is used to enhance the action. In the same way an animated fight needs to capitalize on its medium to make action as exciting as seeing real people, the special effects here raise the stakes and give the action a bit extra flare. The scene has bullets being fired, car crashes, helicopters brutal hand to hand combat and people on fire. It is a joy to watch, and fascinating just to study how they did it. It is a worthy step up from the \"oner\" from the previous movie. It is a two-edged sword having such an awesome action sequence so early on. It may get the audience hooked, but consequently each action scene does feel lesser than the previous. That being said, all action scenes are all well done, and have an excellent variety so that the audience is never bored.\n\nThe positives don't end with the action and the technicals. The movie takes place immediately after the events of the previous. This left our hero, Tyler Rake, in a precarious situation. Our hero is battered, bruised and broken. It would have been easy to skip to our hero back at full power and ready to fight. But the movie goes through the effort to show his rehabilitation efforts. It is a little thing that goes a long way. In the previous movie it was fun to see Tyler mow through a bunch of 14-year old soldiers. But in this movie, he does feel more vulnerable, thus making all the action more exciting for the viewer. At times the plot armor of the main characters does get in the way. Certain things that would kill lesser characters, doesn't kill our heroes because they're the main characters.\n\nAnother little detail that goes far is the development of our villains. The exposition is done in a quick effective, but the montage does help us understand their motivation and character. They are truly despicable, and you root for their downfall.\n\nSadly, they aren't the only characters that we find annoying in the story. There are certain characters that make such stupid decisions they drive the audience crazy. We understand the motivation, but it still leads to extra frustration.\n\nAll in all, this was a really good action movie. If this was the last one, this is good note to leave off on. But if they keep making sequels as good as this one...keep raking them in.",
    "date": "2024-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Chris Hemsworth is just very watchable in this role. Quite entertaining, very rare netflix sequel W. More fun than the original. Watch it with certain expectations and just have fun.",
    "date": "2024-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It was quite entertaining. The action and blood bath was fun, and the story felt more fleshed out than the first one. Again, action is why you are here, but decently good to where I would recommend it for any action lovers or someone who likes thriller films. Do i feel like the story should have made some more sense and some things just happened to move the story for no reason, yeah I feel that, but I can look behind that and it's a good watch just for the action.",
    "date": "2024-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "both were good but the first one was a stand out and really set it up",
    "date": "2024-10-01"
  }
]