[
  {
    "user": "M.N. Miller",
    "rating": 2.0,
    "text": "If you take away The Aftermath’s post-war Reconstruction of Germany’s setting, what you have is a lonely housewife having an affair with a pool boy, and a lonely couple in desperate need of a premium cable subscription.",
    "date": "2022-08-19"
  },
  {
    "user": "Milana Vujkov",
    "rating": 2.0,
    "text": "It does not bode well for a story of a tumultuous affair if the only performance with conviction, in a love triangle, is given by the betrayed husband.",
    "date": "2021-07-30"
  },
  {
    "user": "Cassidy Olsen",
    "rating": 2.5,
    "text": "The Aftermath is far from a great film, so deeply mired in genre conventions that playing a period piece drinking game while watching would have you in an ambulance within the first half-hour. But it's much too fun to get angry about.",
    "date": "2021-03-08"
  },
  {
    "user": "Richard Crouse",
    "rating": 2.0,
    "text": "An interesting canvas on which to paint this story but unfortunately the love story feels torn from the pages of a not-so-steamy Harlequin Romance.",
    "date": "2021-03-04"
  },
  {
    "user": "Nicole Ackman",
    "rating": 4.0,
    "text": "The issues with the plot and characterization can somewhat be overlooked due to the solid acting work.",
    "date": "2021-01-31"
  },
  {
    "user": "Candice McMillan",
    "rating": null,
    "text": "The film ... is stretched too thin by its many sensibilities, thereby doing none of them very well. It's a period piece trapped in a love triangle with a last minute makeover as a war thriller.",
    "date": "2021-01-28"
  },
  {
    "user": "Charles Koplinski",
    "rating": 3.0,
    "text": "This proves to be a probing look at the impact of the choices we make with a conclusion that goes against the grain.",
    "date": "2020-11-17"
  },
  {
    "user": "Stephen A. Russell",
    "rating": 3.5,
    "text": "Directed by James Kent (Testament of Youth), it's an unabashed melodrama about the fractured loyalties and illogical tendencies of broken people. And that's why we loved it.",
    "date": "2020-08-16"
  },
  {
    "user": "Tom Beasley",
    "rating": 2.0,
    "text": "There's no denying that's a sweeping, handsome movie, but its heart is almost entirely empty.",
    "date": "2020-08-15"
  },
  {
    "user": "Matt Cipolla",
    "rating": 2.0,
    "text": "The intentions are clear, but they're too stilted to rise above unintentional parody.",
    "date": "2020-07-27"
  },
  {
    "user": "Steven Prokopy",
    "rating": 2.5,
    "text": "There are no bad performances in The Aftermath; the film's biggest issues exist in its contrived and familiar screenplay.",
    "date": "2020-07-21"
  },
  {
    "user": "Dan Scully",
    "rating": null,
    "text": "[A] murky, boring movie that doesn't earn the loose moral lens through which it has chosen to frame the story.",
    "date": "2020-03-18"
  },
  {
    "user": "Andrea Gronvall",
    "rating": null,
    "text": "Knightley's character is - hello! - more sympathetic and sensual than in the novel, while Clarke's is more one-dimensional, to the point of caricature.",
    "date": "2020-02-21"
  },
  {
    "user": "Doris Toumarkine",
    "rating": null,
    "text": "[It] tightly grips viewers to a bitter (maybe sweet) denouement with a final frames resolution that, upon reflection, strikes as entirely appropriate.",
    "date": "2020-02-11"
  },
  {
    "user": "Jeff York",
    "rating": null,
    "text": "[T]his film focuses on a parent who's lost a child and their attempt to overcome the trauma and rejoin society as a functioning human being. That may not be all that sexy, but it makes for a very moving two hours at the Cineplex.",
    "date": "2019-10-21"
  },
  {
    "user": "Craig Mathieson",
    "rating": 2.0,
    "text": "What happens rarely feels deeply engaged, instead adhering to what expectation demands from a story where two beautiful actors begin as adversaries and become romantically intertwined.",
    "date": "2019-10-14"
  },
  {
    "user": "Christy Lemire",
    "rating": null,
    "text": "It does not achieve the emotional resonance that it's looking for, but Keira Knightly does wear some great dresses.",
    "date": "2019-09-23"
  },
  {
    "user": "Allison Rose",
    "rating": 2.5,
    "text": "Unfortunately, the script is lackluster at best which makes the film more of a morose and morbid reminder of one of the worst wars in world history.",
    "date": "2019-07-02"
  },
  {
    "user": "Joe Nolan",
    "rating": null,
    "text": "The acting in The Aftermath is strong across the board, but the script and editing both fail the performers.",
    "date": "2019-06-17"
  },
  {
    "user": "Israel Acosta Aroche",
    "rating": 5.5,
    "text": "It's a shame that despite being based on a novel by Rhidian Brook, the material feels wasted on film. [Full Review in Spanish]",
    "date": "2019-05-30"
  }
]