[
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Shockingly slow heist movie in which you will be asleep before they get anywhere near a vault. Oceans 11 is like the pinnacle of a hiest movie and this is just the complete opposite. You could cut the movie down to 1hour and nothing would change.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Haven’t seen it.  Doubt I will.  Maybe I’m too much of a \"whiny b*tch.\"",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Christian Gudegast's sequel \"Den of Thieves: Pantera\" ditches the tone of its predecessor, the sleaziness & where the line begins to blur between what we perceive as the heroes & villains. Gudegast direction leaves American soil behind to take the next heist to the European continent for a creative heist team up. \n\nThe opening heist in Belgium is just a teaser for what is coming. The preparation to hit the World Diamond Centre in France which is worth every minute as once it starts, it's carefully executed & heart pounding tension on top of being treated to a solid car chase & shootout sequence on route to the Italian border.\n\nGerard Butler returns as Big Nick & he still has his sleazy side like he's on edge to rip your throat out.",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The film certainly had potential, given the high expectations set by the previous installment. While the cinematography was undeniably stunning, showcasing breathtaking landscapes, it failed to captivate on a deeper level.",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Filme: Covil de Ladrões 2\t\t\t\tAssistido: 20-10-25\nElenco: @gerardbutler @evinahmad @cirly_gane @osheajacksonjr @nazmiyeoral @meadow.williams \nModelo: #policial #ação\nDuração: 2h 10m \tAno: 2025\nMinha opinião: O 1º filme é de 2018 onde é vimos uma grande tensão e adrenalina. Neste 2º filme tem o desafio de superar o 1º, porém isso não ocorreu. Esta geração de atores de ação ja estão em baixa; Nicolas Cage, Liam Neeson, Segal, Mark Wahlberg, Mel Gibson,.... e  temos Butler. E este filme é uma mostra disso. Um que traz de volta Donnie (O’Shea) que após roubar um banco com os diamantes de um mafioso, quer usar para um roubo maior, para isso sua quadrilha formada de policiais corruptos, aparece Big (Butler) dizendo que havia virado a casaca e entra na quadrilha. Na hora do roubo, as coisas dão mais ou menos certas, bem na hora da fuga, parte da quadrilha é alvejada pela máfia e quando fogem são pegos pela polícia na fronteira. E na verdade Big, estava infiltrado para capturar os policiais corruptos. \nVale a pena assistir?: Se não tiver outra opção.\nNota: 4",
    "date": "2025-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Greetings from Lithuania.\n\n\"Den of Thieves: Pantera\" (2025) is a sequel to a heist action thriller \"Den of Thieves\". This is a sequel that i never thought they will be making, but i guess first film was a mild success. This time around it takes place in France and we do get to see two characters from a first film of course. I didn't liked this film as much as first one - that film was better in nearly every way, while wasn't great one either. \"Pantera\" isn't bad film by any means, but it wasn't just very interesting. Pacing was so so, and the whole third act while fun to watch was a bit to much convoluted for me taste. Acting was just OK for this material, nothing to write home about.\n\nOverall, \"Den of Thieves: Pantera\" is a let down in comparison with previous film, but it isn't the worst sequel out there by far either. It is mildly entertaining and i liked the premise, but execution wasn't very good.",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Enjoyed it a lot. It lacks the focused dedication and seriousness of the first one, but it is masterclass nonetheless. Great cast all convincing in character. Good cinematography and very well written and brought to screen. Lots of action, twists, charm, charisma, mystery and drama. Very entertaining",
    "date": "2025-10-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It is a very different movie but still quite enjoyable",
    "date": "2025-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Simply worth the watch. Feels familiar but still new enough to keep your attention. Shines when the action kicks in, which is spread out across several sets and scenes throughout the movie. Relax and have fun watching it.",
    "date": "2025-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Fun exciting movie.  Very entertaining!!!",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Not even near good as the first one but it was kinda good",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It was a good movie. I went to see it because I really liked the first movie but it wasn’t as good as the first one.",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 02 hours, 24 minutes, and 16 seconds!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $35,600,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated R for Pervasive Language, Drug Use, Sexual References and Some Violence!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-09-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Como se nota cuando hacen una secuela por hacerla...\n\n\nEsta esta secuela casi todo pasa porque si, el robo de los diamantes en el principio nunca sabemos quien da esa información, casi todo lo que pasa durante el gran robo pasa sin mayor explicación con una planeación que apenas se mostro, el personaje de Donnie es todo lo contrario al de la entrega anterior ya que aquí lo calculador y astuto no se ve, este Nick queriendo ser malo y bueno a la vez... un desastre.",
    "date": "2025-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Whilst this sequel is by no means original, it is definitely worth a watch and delivers a decent amount of action, suspense (particularly during the major heist scenes) and complexity, as Nick juggles his job responsibilities with relationships. \n\nSome reviews have mentioned subtitles are needed in some scenes, but they were there in all the scenes when we watched this, so I suggest checking yours settings for those parts of scenes they are required (the majority of the movie is in English).",
    "date": "2025-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Good way to start off 2025, but 50 aura points lost because some scenes need subtitles.",
    "date": "2025-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie is terrible. The first one was superior in every way. Don’t waste your time, especially if you liked the first one because this ruins it.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Not as good as the original, but still the entertaining action sequel it was hoped to be.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Didn't pack as much punch as the first, but I guess sequels have to be a little more light-hearted. The heist going relatively smoothly was a nice change.",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Big Nick chases mastermind thief who escaped to Europe to the French Riviera for more thieving and violence. Much less than volume one.",
    "date": "2025-08-18"
  }
]