[
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Not a Wes Miller success. Bland and very rushed to finish. Whole cast seems a bit dazed and confused as to what is expected from them. Vague storyline with lots of holes, millions of bullets disappearing in the ether, oh you know, regular low budget Hollywood jargon. Not really anything that stands out, even cinematography is sub par and looks like visual effects were done on my first IBM XT computer. A farrago",
    "date": "2025-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It was interesting for a while, then it became boring.",
    "date": "2024-12-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I wasn't expecting much and I ended up liking it quite a bit. A movie that I suppose is low budget, bringing out all the good things about action movies and police movies. Highly recommended",
    "date": "2024-03-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Just another support film for Bruce. Too bad and not the way to go out for a great actor",
    "date": "2024-01-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "After killing a drug syndicate member while protecting a parolee, Connor Connolly has one day to pay two million dollars he doesn't have to Tyrone Pettis.\n\nHe is forced to ask his old military ops crew, led by Brice Mason, to come together and somehow get the money before Connor loses everyone he loves.....\n\nWhat you have here is another case of great cast, average film. Kevin 'Sorry I thought you were the other one' Dillon is the lead here, and for people who have. Little common sense on here will already know that Willis isn't predominant in this film, and due to his health issues, nothing more will be said in this review about him.\n\nBut it was fantastic to see Leon in this as the bad guy, channelling his performance in Cliffhanger to wonderful effect. And there's the always reliable Frank Grillo in it foe a few scenes to make the film feel a little more shines.\n\nBut it's use another mundane story somebody doing wrong to a crime lord ad having to pat them back in droves, or his pregnant wife will be killed, even though Leon tells people off for smoking around her.\n\nAdd a pound shop Davi's Schwimmer and you are left with a film that feels like 12 Rounds, but much longer.\n\nAnd the effects team must have dared each other, as there is some of the poorest green screen ever committed to film.\n\nSo it's not terrible, just terribly average...",
    "date": "2023-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Terrible. Acting, story, dialog. I’m not a stickler when it comes to run and gun movies, but this was just bad.",
    "date": "2022-12-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Man. This shoot em up, dirty cop, turf war movie is pretty hard to watch. Willis is playing the crooked chief. Pregnant girl gets kidnapped. Weird timer comes on screen. Fast forward an hour of bad fake blood and everyone's on a plane together to Mexico.",
    "date": "2022-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Clase B pero con ganas. Tiene sus cositas: efectos claramente de bajo presupuesto, slow motion en las escenas de accion que jamás entendí a que venían, giros en la historia que no tienen ningún sentido.. sin embargo, y a pesar de eso, dentro de todo entretiene y termina siendo medianamente decente.",
    "date": "2022-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Don’t waste your time!! This movie is all over the place and is just plain bad. From the terrible backgrounds out of the windows of the moving cars to people trying to kill each other suddenly becoming best friends, it just doesn’t make sense!! The cast seems solid but 10 minutes in you realize you made a bad choice. I like Bruce Willis but this movie died hard.",
    "date": "2022-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Does rotten tomatoes have a glitch? You rate this almost 90% but then the VAST MAJORITY of reviews are all 1 to 3 stars?\n\nThis movie was awful. Absolutely awful. The lines were cheesy and illogical. The cinematography felt like a really talented high schooler (no joke). The plot is non sensical, and even the acting ... Kevin Dillon comes across like his character on entourage where he can't act to save his life. Except, he's actually really trying\n\nJust astounded at how bad this was",
    "date": "2022-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie is SO BAD, I actually made the decision, after all these years, to create a Rotten Tomatoes account, to warn people about it. The plot, acting, cheap action sequences that couldn't even be fixed with CGI. Probably another production with cheap money from that country which cannot be mentioned. The only positive is that it was filmed in the US, and hopefully the Mississippi community benefited somehow. Fun fact.... The director Wes Miller is also credited as \"C-Camera Operator\" in the credits. WTF.",
    "date": "2022-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I am a HUGE fan of Frank Grillo but he couldn't save this movie. I almost didn't make it 2 minutes in. The camera terrible, sound track terrible, and the storyline was stupid. This was like a D- version of Heat alot of gun battles but stupid. I'm surprised the main actors didn't force the director to change some of the ridiculous gun battles.",
    "date": "2022-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Terrible film, poor special effect and lazy finishing (could see the camera man in the tv at one point) give it a miss!",
    "date": "2022-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Music to loud in parts can't hear the people talking",
    "date": "2022-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Another Willis bomb! He seems to have alot of these!",
    "date": "2022-06-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "You look at the audience score and it showed me 91%.. then I went to read the reviews.. almost none of them gave more than 3 stars.. I wonder how this website calculate the score? Hmm.. by money donated by these studios?",
    "date": "2022-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "What a heck was this?",
    "date": "2022-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Horrible acting and Directing. How can ex military gunmen loaded to bear with Automatic weapons and a thousand rounds of ammunition miss targets 20 yards away.",
    "date": "2022-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not great but at least not awful. \"Forgettable\" is the only word that comes to mind. Decent background noise.",
    "date": "2022-04-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Be warned. Not a good film. It’s a Johnny Drama movie with Grillo cut in. And Bruce just getting a pay check. Bad.",
    "date": "2022-04-05"
  }
]