[
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "movie was full predictable, you can tell the end after 30 min of viewing. i watched it at night and literally i was about to sleep... i was hoping to see some good vampire/werewolf vs. vampire fight in the end but all i got was max. 15 secs of crap (trailer almost have all the imp scenes).\n\nand most SUCKing thing in the movie was Kristen Stewart's acting, her face remain emotionless in the entire movie... widening eyes and opening mouth cant make you a good actor.\n\nWATCH TRAILER INSTEAD OF MOVIE.... its free and you can have more fun because they have added all the thrilling action in trailer.",
    "date": "2025-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Favorite movie scene when the wolves jump over the rock during the fight! So awesome.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Good to see it a second time! It made me realize that there were no emotional depth to the characters except the proposal scene. Made me feel nostalgic.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "For readers of the book this is a good adaption of the film as the book to my point of view is not as good as new moon so this film is not as great either to it as well. Overall, good film to enjoy for fans of series.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Bella's feelings. I have to admire how Stephenie and the filmmakers ruthlessly focus on Bella's feelings, and the love trianble between Bella, Edward, and Jacob. No matter how complex or interesting the other subplots may be, they do not allow that to distract us from what is important: Settling the emotional conflict of an angsty teenager. Bella's feelings for Edward and Jacob cannot allow minor distractions like the slaughter of dozens of Democrat voters, or the personal losses of close friends, or the revelation that her new friends are all serial killers. \n\nThe dialogue is cringy. Bella bursts into a self-centered rants about how special she is. She expresses her desire to be undead, and she claims to love the guy she friend-zoned, and friend-zones the guy she loved. All without any empathy for the bloodshed and mayhem going on in the background. \n\nIn this film, we do learn that Bella's feelings are not influenced so much by necrophilia or bestiality as they are by how 'warm' Jacob is versus how 'cold' Edward is. It is the conflict between a rural life of quiet domestic bliss versus a cosmolitan life of travel and adventure. \n\nAccepting the premise that the story is about a teenage girl's feelings and puppy loves set in a fantasy world with vampires and werewolves, no one watching the film can complain that the plot sucks or the dialogue is consistent with teenagers. \n\nAs for Charlie: I literally remember having the same conversations with my daughters. Right down to the stupid dialogue. Watching it now with my baby daughter - now 32 - going through baby's first divorce - it was all we could do to not bust a gut laughing and/or groaning out loud at the cringy dialogue. \n\nExcellent execution. Great acting. Brilliant technical effects. But. Nothing can fix the stupid plot. \n\nAnd that's fine. That's what we paid for. It's entertainment folks.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I think too many people hate on this movie and don't see how crucial it was to the overarching story. I love this movie.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "yes, watch it on the big screen!",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 02 hours, 04 minutes, and 00 seconds!!!!!!!!!!!!!!!!!!! Ages 13 and older!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The worldwide gross is $738,996,258.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Filmed on: June 30th, 2010, in color for theaters, home media, streaming and television!!!!!!!!!!!!!!!!",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Genuinely how does this have a 60% from the audience...",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "“It’s a thrilling, entertaining little vampire rom flick that surprised me deeply. Lots happening this time around, more backstories that fleshed out the side characters in a way that made them more enduring and tangible, even more so than the main affair - still even that had more meat to bite on this time around; her unstable friendship with her childhood friend that can’t control his transformation, her rekindling relationship with her partner, her aging, her graduating and choosing a normal life or the life that’s being presented for her  (and the consequence of losing her normalcy and those in it) and her dire circumstances involving a vampire and her thirst for revenge on her and her entire family with a clan of her own. The music by Howard Shore is somewhat memorable, not as strong as the other composers. The soundtrack is amazing and Chris Slade’s art style in this, steers the franchise to a more grittier direction.”",
    "date": "2025-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Probably the best of the franchise: it has a clear idea of where it's going.",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "15 years old At the time this was the best installment directed by David Slade who’s known for action as well as horror It definitely suited better with critics after all the issues they brought up with ‘New Moon’ Even the fact the filmmakers have the actors become self aware of what they’re in adds much needed fun The same cast members are back with a few new additions like Xavier Samuel, Jodelle Ferland, Julia Jones, and most notably Bryce Dallas Howard replacing Rachelle LaFevre Here we find Bella wrestling with the decision that will eclipse everything in her life; she can be with Edward forever or remain human like everyone else Meanwhile Vittoria is still hunting her avenging the death of her beloved James, she’s constantly toying with the Cullens and the wolf clan running back and forth in their territory Bella’s also coming up on graduation deciding what to do for the rest of her life But Vittoria is building an army of newborn vampires to wipe out her and the Cullens protecting her with newborn Riley leading I’m happy they brought in some fight scenes even if it did feel more sluggish this time plus a lot of the hokey dialogue is still present These newer characters I enjoy though and i love the score by Howard Shore The part that is well-done the most involves the scene where Jacob and Edward are just sitting down talking to one another, it’s actually good cause they’re both picking each other’s brains You get a sense of what they would be like if they actually got along Plus it’s a breath of fresh air the other side characters like Jasper and Rosalie are given backstories, you feel like you know these people a bit more Bella is making the ultimate decision here ; choosing to stay immortal losing everyone else over time or becoming eternal being with Edward forever Almost everyone around her is advising her choices to be the ones made for her and not just for others It’s her primal dream of being desired making the choice being who she should be and already is when before she was stumbling feeling abnormal The story has more personal sacrifice, romance, introspection, tantalizing relationships, the promise of eternal love, the notion of following tradition plus inner conflicts of the undead with adolescent longing As I said before Slade thankfully ups the action in this for the male crowd mainly the final confrontation at the end Plus the film pokes fun at itself on occasion since many viewers are already in on it being more competent ‘Eclipse’ is a step up although still plagued by minor issues Thankfully this sets up the next two final movies ending on a higher, more satisfying note",
    "date": "2025-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Ts is pure shi",
    "date": "2025-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Omg is the only thing in my mind that and how hot the cast is",
    "date": "2025-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "El director deveria o tiene una obsesión con que sus personajes hombres no usen camisa??",
    "date": "2025-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Eclipse, the third installment in the Twilight Saga, continues to build upon the franchise with stronger world-building, new characters, and deeper lore. As a fan of the series, I appreciated how the film pushed the story forward while maintaining the emotional tone and atmosphere that fans had come to expect from Twilight and New Moon. It’s a creatively structured film that delivers some memorable moments and introduces both iconic heroes and villains to the cinematic universe.\n\nFrom a storytelling perspective, Eclipse succeeds in deepening the mythology and setting the stage for the larger conflicts to come. The ongoing love triangle and the brewing war with the newborn vampires kept the narrative engaging and gave audiences plenty to anticipate.\n\nThat said, my biggest criticism remains the same across the series: Kristen Stewart’s performance as Bella. I don’t believe she brought much life or depth to the character, and her delivery felt flat compared to the more dynamic performances of Robert Pattinson (Edward), Taylor Lautner (Jacob), and the rest of the Cullen family. In my opinion, it’s their performances that carried the film and gave emotional weight to scenes she was in.\n\nAnother major disappointment was the recasting of Victoria. The original actress, Rachelle Lefevre, brought a fierce presence to the role, and her replacement just didn’t live up to that standard. The new Victoria lacked the intensity and fear factor needed to make the character compelling—she came off more like a generic villain than a real threat. The recasting felt like a misstep that weakened the emotional payoff of the plot.\n\nDespite these flaws, Eclipse is still a solid installment. It keeps fans engaged, expands the universe in meaningful ways, and maintains the momentum of the franchise. I recommend it, especially for those who’ve been following the saga. It may not be perfect, but it does enough to keep audiences invested and eager for what comes next.",
    "date": "2025-06-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "i think i liked the movie and it didnt bore me.....everything was ok but i felt it was bad encouraging the idea that the heroin would kiss someone on purpose and the hero would still be ok with it? and marriage.... the rest was good tho... (you cant sell a kiss to people you dont love in a way?)",
    "date": "2025-05-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "ECLIPSE is a clear improvement, offering a more layered backstory and greater depth. The two male leads are obnoxious but fully lean into it, while Stewart commands the role, despite the distracting wig.",
    "date": "2025-03-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was amazing to be able to watch it again on the big screen!",
    "date": "2025-02-20"
  }
]