[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The movie would be better if it had some better acting, wasn't so cliché, and had better music. The biddly diddly ohohoh was extremely annoying. The actors trying to come off as tough, weren't, because the dialogue wasn't great. No one had a \"grill\" back then, nor did they talk like modern day \"thugs\", or dance around with blue body paint, and almost naked except some jewels strategically placed. There was some good action in spots, and a couple good actors, so I gave an extra star for that.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I couldn't get through 30 minutes of this. I love westerns but this seems to try to be a modernized western. Its just too much.",
    "date": "2025-10-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The Harder They Fall — Where Blood Drowns Out Water\n\nThe Harder They Fall is more than a stylish Black Western—it’s a meditation on legacy, vengeance, and the fragility of sacred institutions. At its core, the film suggests a brutal truth: blood is thicker than water, and in this world, water—symbolized by faith, community, and redemption—is often powerless to cleanse the stains left by blood.\n\nThe church, a traditional symbol of sanctuary, appears repeatedly in the backdrop of shootouts and confessions. But it doesn’t save anyone. It doesn’t intervene. It’s just another building in a town built by Black hands, now torn apart by Black pain. In this narrative, the church is water—present, but unable to quench the fire of generational trauma.\n\nNat Love’s final act of killing Rufus Buck, his own brother, is the ultimate proof that blood ties don’t always bind—they can suffocate. Rufus spared Nat as a child, branded him with pain, and built a town that could’ve been a haven. But the sins of the past were too heavy. Nat’s bullet wasn’t just revenge—it was a rejection of a legacy too twisted to redeem.\n\nThis film doesn’t offer clean morality or triumphant justice. It offers a lament. A warning. A mirror. It asks: What happens when blood becomes the only truth we honor, and water—the institutions meant to heal—is left to evaporate in the heat of our rage?",
    "date": "2025-09-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Wonderful cinematography with a masterful score. Charming and witty characters with some memorable performances, especially from the lead. However, that being said, there were some fairly cringey scenes of singing that hardly lived up to their intended mark and some dialog that should have been left on the paper screenplays instead of making it through to the script. You could sence that the actors felt uncomfortable. Thus making us viewers uncomfortable as well.",
    "date": "2025-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "What a wasted opportunity. I could only stand this movie for about 30 minutes it was so stupid.",
    "date": "2025-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great film ...great setting... great story line and some of the greatest actors in film today! Action pack throughout.  And much different than the typical western films in the past.",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Really enjoyed it. Love the cast and it was great seeing a. All black cast of a Western Movie.",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The movie had a great cast with great characters and the style and soundtrack were awesome. The story was great revenge story with a fun twist at the end.",
    "date": "2025-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A powerful and unforgettable movie, a true masterpiece about revenge.",
    "date": "2025-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The acting is great with some of the actors and others it is so forced and poorly acted  wooden and contrived, the screen play at times is cringe worthy. It is overly stylistic at times and is 30 minutes too long, sections you just want to fast forward through. The action is pretty good.  It was \nok and I fear the movie will not age well.",
    "date": "2025-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 2 hours and 17 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated R for Strong Violence and Language!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "If it wasn't for the atrocious choice of music which ruined this movie, it would be for the terrible pacing and generic story.\n\nNot surprised this is another Netflix slop on the road of endless Netflix sloppery.\n\nThe incredible cast deserved so much better.",
    "date": "2025-06-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Tiros bombas e murros nas trombas num western muito alternativo",
    "date": "2025-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is completely horrible acting. As far as westerns concerned, this is only giving credit because it’s a black Western. You hear the F bomb in every single sentence. More like modern day Black people trying to make a point. There is nothing that is truthful about this western movie concerning American in the 1880s. As I said, Horrible acting and everything is FSF that,",
    "date": "2025-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The movie opening with killing of a woman and child should have been enough for me but the senseless brutality as movie went on was enough for me to walk away. Maybe next time have at least one good guy in the plot.",
    "date": "2025-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It’s a pretty good movie. Great soundtrack. Script is alright. The cast is superb. Definitely not the greatest western, but a pretty fun ride.",
    "date": "2025-04-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This cast! This cast! This cast!",
    "date": "2025-04-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Had to stop watching. If you asked AI to create cheesy western dialogue it would spit these scenes out. So many great actors yet you could always tell they were acting which means bad directing. And Majors and Beetz had ZERO chemistry.",
    "date": "2025-04-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Extremely fun and entertaining. The music, cinematography, customes, and sets were incredible. Fantastic cast and great characters. This film deserved so much more attention and recognition than it got.",
    "date": "2025-04-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A fun movie about the Wild West. A light film - recommended to watch.",
    "date": "2025-03-17"
  }
]