[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Νice movie had a lot of laughs....",
    "date": "2025-01-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely A Must!!!!!!!!.....this movie was Absolutely incredible!!!!!!..BRAVO!!!!!!!!",
    "date": "2025-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A good family friendly comedy with some truely South African comedy, the content was however predictable and somewhat nonsensical.",
    "date": "2024-12-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "this movie was very funny l enjoyed it a lot",
    "date": "2024-12-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Love Kenneth Nkosi but this movie was very predictable. The comedy was mediocre. I expected it to be non stop laughter, but was disappointed. I think the plot was taken from Robbin Williams movie RV.",
    "date": "2024-12-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "As usual, Kenneth Nkosi does not disappoint. The cast delivers good performances and film is filled with good light hearted humour. Although the film does feel a bit goofy and caricature-like at times, it still delivers a clear message regarding work-life balance and family. Overall I found the film entertaining.",
    "date": "2024-12-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Horrible is my words",
    "date": "2024-12-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Una película cliché, con personajes repetitivos sobre cualquier comedia familiar solo que con personajes que caen mal y llegan a ser fastidiosos, una historia donde se deja mal parado al único que sostiene a la familia y siempre se encuentra presionado por los demás integrantes de la misma.",
    "date": "2024-12-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Funny. Reminds me a lot of a movie from 2006 called  RV with Robin Williams, basically same storyline",
    "date": "2024-12-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Disaster Holiday serves up a heartfelt slice of chaos with Kenneth Nkosi at its center, delivering a relatable portrayal of a man juggling fatherhood, corporate pressures, and the complexities of divorce. While billed as a comedy, the film gently explores deeper themes like generational sacrifice, co-parenting tensions, and the myth of work-life balance. Refreshingly, it avoids overplayed tropes of crime and corruption, instead celebrating the messy beauty of family and resilience. Silly, sincere, and surprisingly thoughtful, Disaster Holiday is the lighthearted yet meaningful escape we all need this festive season... #SAGotTalent",
    "date": "2024-12-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely stunning. The movie is so refreshing and the casts are just amazing. Loving what SA is giving us off late",
    "date": "2024-12-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This was a very well acted and very enjoyable movie. I recommend it.",
    "date": "2024-12-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Top quality South-African viewing.  Great comedy, script, and acting.  I didn't want it to end and hope to see more of this quality!",
    "date": "2024-12-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A nice family movie",
    "date": "2024-12-13"
  }
]