[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very entertaining...It does depict the true nature of our society and hope so sinister media is at turning dark moments to light. Honestly there are some hilarious parts to this documentary.",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This show is heartbreaking, but it depicts the true callousness of the entertainment industry and the corruption of the police. The way that they manipulate and rewrite every detail is unreal. They start off by praising Kai for saving 3 people and taking down a potential serial killer (who was attacking his second victim and later bragged about graping a 14 YO girl). Once he goes viral, everyone in the entertainment industry wants a piece of him. They try to glamorize the fact that he’s unhoused and repackage it as “a carefree lifestyle” while continuously making tone deaf remarks about how shocked they are that he doesn’t concern himself with names of tv hosts. The dude is literally living on the street, why would he care about anyone on tv. Then they start to flip the script about how “he’s taking advantage of the goodness of others” because he’s unhoused and sometimes people buy him food. While also flipping the narrative on him saving a woman that was being attacked to, “well sure he helped a woman but he violently attacked this poor man, that was too much.” Cause let’s be real, rarely will a man intervene in these situations to save a woman being attacked. Then the cops find his name on a piece of paper in a house of a dead guy and a train ticket for the day before and convince themselves he’s a murderer. With zero evidence. When he’s questioned he lets authorities know why he killed the man, because he was drugged and raped. They could care less and spent zero time looking into that, shocker. They flipped the whole story to now this guy is a violent unhinged man that used to care about stopping assaults to committing murder for zero reason. The kicker is when he’s in court and the judge has the audacity to say to him “you presented yourself as having this carefree lifestyle but you are a powder keg of rage.” I know every single person on this planet has seen an unhoused person, I also know that no one looks and says “damn wish I had such a carefree lifestyle, wish I could be unhoused.” What the uck. He didn’t even want to be interviewed by anyone to begin with, these people hunted him down after he saved someone and managed to make his life a million times worse all cause they wanted to make a “reality show about a happy homeless person” and show people the other side, that living on the street is actually amazing. As they all are interviewed they try to pity themselves as they twist the narrative, to poor them for just wanting to exploit this man",
    "date": "2025-04-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The documentary The Hatchet Wielding Hitchhiker tells the story of Kai, a young man who comes to the aid of a woman being attacked in the aftermath of a crime.  Charismatic and uninhibited, he quickly becomes a social media sensation…until things take an unexpected turn. A commentary on celebrity culture, the role of media, and mental health, it's an undeniably interesting viewing experience, despite the fact that it shamelessly seems to ignore the root causes of Kai's behavior. With all of the interviews compiled for the film, one would think that a mental health specialist would have been consulted to provide some insight into matters, especially over the latter half of the movie.",
    "date": "2024-01-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Even though this documentary suggests that Kai McGillvary was one of the biggest viral sensations in modern social media history, I never heard of him and his 2013 rise and fall before sitting down to watch this. It is indeed quite a story, and Kail is quite a character! At less than 90 minutes, this is a lean and efficiently made documentary that inevitably feels a bit superficial and rushed because there's not enough to time to fully delve into the story. I'm grateful it's not another one of those 3-5 episode limited series that feels overly stuffed to fill the running time. But, by contrast, the short running time makes it feel like a series of highlight clips rather than a full-fledged recollection of events. In fact, I think this movie is more successful as an indictment of how the public lionizes and alternately vilifies those in the social media spotlight. The tragedy of events feels minimized because Kai was such an unusual and beguiling character. By the end, there's a lot of unanswered questions, and one is left unsure exactly how much to believe of anything that came out of Kai's mouth. It's quite entertaining, and I won't soon forget this tragic character; however, I was left wanting more. It's an appetizer instead of a main course.",
    "date": "2024-01-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "an interesting yet disturbing  documentary showing what happens when fame is thrust upon someone.",
    "date": "2023-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The Hatchet Wielding Hitchhiker - 6.5/10. In a long assembly line like delivery of Netflix documentaries, here's another one based around the viral star saviour that helped a person out by attacking their attacker. From the lone interview he did, he catapults into fame, and soon, spirals out of it, as the once lonesome hitchhiker's life goes dark with a murder case that he is tied to. Its interesting for me to watch this because I do remember seeing the famous auto tune video of this person. But I never realized how big of a star people were trying to make him. Its a shame because though he seems genuinely like a good person, he obviously is not mentally sound. Instead of getting him help, it seemed like people were more willing to enable to man than actually give him what he needed: shelter and care. Though not a revolutionary documentary, it does a fairly decent job of focusing on the pros and pitfalls of fame.",
    "date": "2023-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Interesting documentary but not a lot of story to it, but if you didn’t follow the case, this will bring you up to speed.",
    "date": "2023-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It's fun to watch at first but too much omitted from the actual murder case. Why the suggestive comments about the victim? Why no investigation into what actually happened? So many gaps in the story and ultimately unsatisfying.",
    "date": "2023-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Interesting documentary. Kai was hailed as a hero and got sucked into the world of social media. He was manipulated but also the manipulator. People used him yet he took advantage of others. He is obviously not well but are his mental health issues organic or drug induced? How much sympathy does he deserve? The original reporter sees himself as Kai's advocate and still has difficulty reconciling the Kai he \"knew\" (did he REALLY know him?) and the one convicted of murder. Most troublesome is that the motive for the murder is Kai's (unproven) allegation of rape.  However, what is true (and supported by facts) is that he bludgeoned an elderly man to death. The victim is a footnote in this story and should not be. I hope Kai enjoys his very lengthy and well deserved prison stay.",
    "date": "2023-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Shamelessly exploitative. The shock value is derived from the actions of a person with mental illness.  Person after person commenting on what they can get out of this guy but not one person is interested to know his story or concerned for his well-being. One lady was stupid enough to claim that he's an example of how you can be happy and homeless. Netflix should be ashamed for producing this dribble. Netflix is nothing more than a modern day Barnum and Bailey Circus. Everyone come see the crazy person and be shocked.",
    "date": "2023-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Genuinely, only in America could you get 'The Hatchet Wielding Hitchhiker'.\n\nSYNOPSIS: 'This shocking documentary chronicles a happy-go-lucky nomad's ascent to viral stardom and the steep downward spiral that resulted in his imprisonment.'\n\nBeyond the ridiculous, but serious nature, of this story, this is a deep dive look into instant and viral fame in America. Things can go wrong and inevitably do. It's a cautionary tale and is something that should be learnt from for the future.\n\nThe slight irony with the story of Kai is that even now, he still finds himself still part of the pop culture cycle. And this documentary forms part of that.\n\nIt's a compelling, yet scary story in places, because Kai's life could've been so different had his formative years been very different. His life nurtured a very disturbed and angry young man who also suffered with mental health issues.\n\nIt's a wild but ultimately sad story.\n\n8/10",
    "date": "2023-05-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This true crime documentary was thoroughly bizarre, filled with twists that I truly still don't understand. We may not understand everything that goes through the mind of \"Kai\" the hitchhiker, but one thing's for certain -- the media will play into any story that sells before they know the facts. For me, this was one of my biggest takeaways from the Netflix original.",
    "date": "2023-03-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I have easily watched this at least 10 times. So fascinating regardless of the sad ending. It's THAT good.",
    "date": "2023-03-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This movie felt like a hit piece on the subject. Much of the movie was narrative made of video montage and first-person accounts, but very little engagement with the subject, especially during and after his arrest and conviction. I feel no more informed or convinced about the facts of his case after watching the documentary. It does have a garbled message about the problems with social media, but that's about it.",
    "date": "2023-03-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Wrong person in the wrong place at the wrong time.Summary of how the mainstream media uncontrollably turns a person with problems into a phenomenon.The crucial part of the documentary is the way in which people try to take advantage of Kai even though they know how out of control he is.The so-called regret they experienced afterwards is not believable at all.I especially liked two parts.The first is what the victim's neighbors said about the media.The second was Kai's question at the time of questioning whether the state of New Jersey still had the death penalty.In short, the media's desire to make stupid and dangerous people famous must stop.",
    "date": "2023-03-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Interesting story which I haven't heard of prior to watching this movie, but I enjoyed how we are introduced into it and then how the whole thing evolves. I recommend watching it + the guy is crazy (in a positive way)!",
    "date": "2023-03-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "As \"The Hatchet Wielding Hitchhiker\" (2023 release; 85 min) opens, it is \"February 1, 2013\" and there is a bizarre scene in Fresno when a deranged/racist driver goes after a black woman. The driver's passenger, a young man named Kai, intervenes and saves the woman from a very dangerous situation, while along the way wielding a hatchet against the driver. A subsequent interview with a local TV reporter causes an immediate internet sensation and puts into motion a series of unexpected developments for Kai... At this point we are 10 minutes into the documentary.\n\nCouple of comments: this is the latest documentary from director Colette Camden (\"The Rise of the Anti-Vaxx Movement\"). Here Camden looks back as the meteoric rise and subsequent equally fast fall of the internet sensation that was Kai Lawrence, a seemingly happy-go-lucky 'cool dude', oozing with charm. Then it turns out that there is much more to this guy... Let me state upfront that I had never heard of this guy before. But as the documentary makes clear, for a while after the infamous TV interview, he was hotter than hot, and pursued by many different people, all eager to cash in on this new internet sensation. All claim to be simply \"rooting for this young man\" but in reality all have other motives as well. This is not to excuse Kai's behavior of course. It absolutely blows the mind that the events relayed in the documentary played out over a period of not even 4 months. In the end, this human interest story makes for okay viewing but really nothing more than that.\n\n\"The Hatchet Wielding Hitchhiker\" premiered on Netflix earlier this week, and Netflix recommended it to me based on my viewing habits. I just saw it last night and this makes for quick viewing. If you are interested in a human interest story involving the quick rose and even faster fall of an internet sensation, I'd readily suggest you check this out and draw your own conclusion.",
    "date": "2023-02-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Compelling and hugely watchable. I was hooked from the start. This is a smash, smash, smash hit. The guy is crazy, but you do feel sorry for him as he appears vulnerable.",
    "date": "2023-01-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This documentary is a good one!",
    "date": "2023-01-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's worth watching for sure.",
    "date": "2023-01-24"
  }
]