[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1 hour and 49 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated PG-13 for Language, Intense Sequences of Violence and Some Suggestive Material!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $10,100,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Visually stunning, but the story made me wish I had not watched it.",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "La pelicula muestra a un personaje muy especifico, aunque eso no es malo, simplemente le da una identidad dificil de igualar a la pelicula, por otro lado, la pelicula es una buena ancla argumentativa para el universo Valiant.",
    "date": "2025-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Being a fan of the Bloodshot comics, I was excited for the film. The only detriment to this movie is Vin Diesel, who doesn't really play Bloodshot, but Diesel plays Diesel as Bloodshot. The rest of the cast are phenomenal, the effects are great and the story is fantastic yet the main character is terribly flawed. The trademark pale white skin and red eyes only made a slight appearance, not to mention Bloodshot has hair. One might look to Jason David Frank who played a good version in the Ninjak vs the Valiant Universe youtube shorts. Diesel just was not it, and it really held down the film from being amazing.",
    "date": "2025-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Bloodshot (2020) has been a superhero movie with a Terminator feel, but unfortunately this doesn't work with its lazy and messy script, it tries to start and please with action scenes.",
    "date": "2025-06-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "For 2020: to my knowledge I had no idea this was based on a comic book the movie for as dumb and generic as can be Vin Diesel still has that charisma to carry it Ray Garrison is a military soldier who's just come home to spend time with his wife, like most superheroes he unfortunately goes through some trauma he's captured and his wife is killed in front of him because he couldn't divulge information about the mission some time later he wakes up in a cybernetics lab brought back from the dead turns out he was injected with nanites (mircoscopic robots) that live in his bloodstream that repair damaged cells but also make him stronger, faster, and more alert he gets a second chance to make the world better but his sole focus is going after the man who murdered his wife the thing is though it may not be the whole truth; the lab is known for making artificial limbs for handicap but also excels in state-of-the-art simulations a bigger conspiracy is then unfolded for Ray to find out the truth the action is pretty sweet, the music is nicely composed, I admire the setup, Eiza Gonzalez is pretty likable as KT who wants to help Ray but she's on a tight leash it's more stylish than deep, more dumb than intelligent but still fun in all its ridiculousness",
    "date": "2025-03-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Brilliant movie with great story.",
    "date": "2025-01-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Enjoyable enough action flick, but my god did they have some kind of hard stop limit on the runtime? Not enough left in the budget to even vaguely explain a few of what I would think are the most important underlying plot elements? Just as many holes as there were in Vin Diesel but hey, entertaining",
    "date": "2024-12-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Elicits emphathy for the main character.  Lots of action.  Interesting concept.  Nice plot twist.",
    "date": "2024-06-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I was hesitant out of the gate.  Sci-fi seemed to unreal.  But as the story developed, I enjoyed the dynamics between the protagonist and antagonist.  And as always, the better ideals win out.  Nice ending.  I would recommend this flick.  Be patient, the story will develop!!",
    "date": "2024-05-31"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A waste of film.  If you don't require a plot, only explosions & fighting, this might be for you.  I enjoy a good action film but this is in no way watchable.",
    "date": "2024-04-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It was entertaining... I can't say it was bad but something tells me a lot of these reviews came from Sony and Vin diesals many rotten tomato account. Lots of exclamation points to end a comment sort of thing. But I liked the movie for what it is. It's not bad",
    "date": "2024-03-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Not good by any means but a fun watch.",
    "date": "2024-03-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's about 20% comic accurate. Which is a detriment because the comics are better than this movie. The antagonists introduced in the movie are pretty decent. They would fit well in the 90s continuity if they existed in the books. That is high praise. The execution of bringing Bloodshot to life is conflicting... on a technical level, it's great. Appeasing a Valiant comic fan, it falls short. \nIt's still enjoyable as just an action film.",
    "date": "2024-02-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Fun movie, honestly better than expected. Brings back the old fast paced action movie. Little character development, which does knock down the rating because there is loose ends and  somethings that don't make sense.  Would love to see a sequel that gives more back story and overall development.",
    "date": "2024-02-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Basic but fun Vin Diesel action film.",
    "date": "2024-02-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Started out thought this was going to be really bad but the story developed. A bit too much slow motion in the scenes, but overall satisfying movie and it gets you in and out in just the right amount of time.",
    "date": "2024-01-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I don't know who and when convinced Vin Diesel that he knows how to act, but someone should really stop him. This movie is a fairy tale for young children in the range of an average cartoon.",
    "date": "2023-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Great premise and some great acting, but the story is both predictable and spends too long on the wrong details. Disappointing, considering it had a lot of potential.",
    "date": "2023-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "buena cinta de accion y ciencia ficcion con una trama aceptable que podria ser desarrollada de mejor manera,y unos efectos especiales que en algunas partes parecen de una pelicula barata, respecto a la accion las escenas de pelea pudieron ser mejores,personajes mal utilizados y un guion a conveniencia en resumen una muy buena idea con mucho potencial,una trama buena pero un guion un poco malo o desechable simplemente un guion olvidable y con mucho cliches",
    "date": "2023-10-28"
  }
]