[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The movie accomplished what it set out to do; it was entertaining throughout",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best Action and Comedy movies I’ve ever seen, Great Casting too and story line, I’m hoping for part 2",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "So many people taking this movie seriously.  It's completely absurdist & had to be a blast making it.  Obviously borrowed things from other movies but used them satirically.  Love it.",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The premise is simple, but the characters carry this movie. Brian Tyree Henry's \"Lemon\" is especially memorable.",
    "date": "2025-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Every second with Aaron Taylor-Johnson and Brian Tyree Henry is genuinely hilarious.",
    "date": "2025-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie is absolute rubbish! Violence after violence! No wonder people are so violent dorks! That’s because of this one movie (and other similar production) DOWN WITH VIOLENCE!!",
    "date": "2025-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Leitch helms his action with clarity and impact, creating a beautiful thrill ride that could have been a trainwreck, but entertains to the end of the line",
    "date": "2025-10-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Hell yeah. My boy Brad Pitt.",
    "date": "2025-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Hell Yeah.",
    "date": "2025-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Very entertaining movie plenty of action and comedy. I found Brad Pitt hysterical. The ending does drag a little bit but overall I really liked this movie 9.5/10.",
    "date": "2025-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Leitch helms his action with clarity and impact, creating a beautifully nonsensical thrill ride that could have been a trainwreck, but entertains to the end of the line.",
    "date": "2025-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Bullet Train is turbulent and chaotic but a thrilling ride nonetheless. Its illogical, blood-soaked premise may derail some, but others might find charm in its memorable cameos, wild hairstyles, and magnetic characters.",
    "date": "2025-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Incredible movie, well paced, fun plot. Every time you watch it you notice something new that makes the movie all that much better",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Bullet Train is turbulent and chaotic but a thrilling ride nonetheless. Its illogical, blood-soaked premise may derail some, but others might find charm in its memorable cameos, wild hairstyles, and magnetic characters.",
    "date": "2025-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Bullet Train employs David Leitch's maximalist style in a purposefully silly narrative driven by frenetic action and distinct humor. Every second with Aaron Taylor-Johnson and Brian Tyree Henry is genuinely hilarious.",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is probably the best movie I have ever seen, it has amazing plot twists and fight scenes, theres no boring characters and they always find a way to make the bad parts good again.",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Honestly really liked it but is lwk crazy",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Highly entertaining.",
    "date": "2025-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "boring. not a big fan but good action",
    "date": "2025-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": ";-; it sucks ass i made me bomb my essay",
    "date": "2025-09-08"
  }
]