[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Rating: 6/10\n\nA breezy, star-studded romantic comedy surviving on lead chemistry and gorgeous settings.\n\nHighlights\n- Great Chemistry: Adam Sandler and Jennifer Aniston bring genuine charm.\n- Beautiful Setting: Hawaii scenery provides excellent visual escapism.\n- Fun Cast: Nicole Kidman and child actors deliver amusing performances.\n\nCriticisms\n- Absurd Plot: Convoluted story requires massive suspension of disbelief.\n- Hit-or-Miss Humor: Some jokes land, others feel grating or dated.\n- Distracting Product Placement: Blatant branding takes away from the film.\n\nVerdict\nA lighthearted, scenic distraction elevated by its leads. Recommended for fans of Sandler and Aniston seeking a low-stakes, entertaining watch.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Just Go With It is a hilarious and crude, but romantic Sandler movie.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour, 56 minutes, and 45 seconds!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated PG-13 for Frequent Crude/Sexual Content, Brief Drug References, Language and Partial Nudity!!!!!!!!!!!!!!!! The USA grossed over $103,000,000.00!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Easy to watch and silly.",
    "date": "2025-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A simple movie, plot is predictable, jokes are not the funniest, a watchable movie tho.",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Love it. Watch it on tv every time we catch it. Just good fun. A fave.",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It's pretty cliche. I could already see where the plot was going for the first 20 minutes of the movie and the ending felt pretty rushed and unsolved. It's not the worst movie I've ever seen, but it's far from the best🤷",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I love Adam Sandler movies and I’m a huge fan of Friends. With that being said this is neither one of their best projects or even close to being that. Each had a few good jokes here and there but overall the movie was boring and I was wishing I had “50 First Dates” or “Happy Gilmore” on instead. The romance aspect saved the movie with the ending being a pretty good way of wrapping everything up. Overall I probably would not watch it again.",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "que furrequunha mais gostoso de se assistir. não entregam atuação, não entregam música, não entregam grande roteiro, mas entregam farofa e farofa é gostoso.",
    "date": "2025-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely brilliant movie, the humor is very fun and there's a lot of it. \nStory and acting is also great",
    "date": "2025-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Just Go With It is a timeless entertainment for any ages of audience.",
    "date": "2025-05-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This film has a very interesting and unusual plot. It stars some of Hollywood's most famous and popular actors. The storyline really got me hooked. I've watched this movie many times, and every time it's like the first time. I always watch in one breath. It is impossible to look away from the TV screen. This is my favorite comedy. Everyone should watch this movie at least once in their life.",
    "date": "2025-05-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Puede ser predecible, pero las risas y los giros a la trama nunca fallan, excelente película de mis favoritas en comedia.",
    "date": "2025-04-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Although the first 10 minutes are completely unbearable, the rest of movie is actually comedic gold.",
    "date": "2025-03-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Filme legalzinho, o roteiro é bacana, o filme tem cenas boas, a história é bacana, o elenco é bacana e alguns ajudam a melhorar o filme, e os personagens sao bons, e gostei da química entre o adam Sandler junto com a jennifer aniston, com tudo isso, eu recomendo esse filme.",
    "date": "2025-03-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Classic Adam Sandler bad movie.",
    "date": "2025-03-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Comedies rarely score over 6/10 or over 60% but as far as easy going, pleasant-to-watch comedies go I rate it a 9 as one of my go-to comedies. Jennifer Aniston and Adam Sandler make a fantastic duo with their timing and I hope they continue making films together!",
    "date": "2025-03-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "watched this rom-com a hundred times\nlove it\nnothing sophisticated and challenging but cute and funny\nJennifer Anderson never hurt nobody!!",
    "date": "2025-03-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "No es mi favorito pero tiene un final feliz",
    "date": "2025-03-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This movie is a slapstick rom-com but I've actually seen it a few times, mostly while cleaning the house or cooking. I find it quite entertaining and the romance between Jennifer Aniston and Adam Sandler is actually quite sweet. It helps that a lot of it takes place in beautiful Hawaii, and I think that is my main reason for watching it again.",
    "date": "2025-02-24"
  }
]