[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Ignore all the paid for positive reviews, this is without doubt one of the worst, most boring, awful films I've ever had misfortune to sit through. There is no option here to give it a minus score. We kept thinking it'll get better and it never did. The finale was the most lack lustre, lazy, terrible ending to any film ever. Total RUBBISH!",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "90/100 - probably the best Netflix movie I’ve seen",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely enjoyed the whole movie!",
    "date": "2025-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "If you're looking for a straight forward action movie with some heart then this is it.",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Saw the trailer info. Thought they might have possibly made a modern remake of First Blood using a black actor. Show started with potential than quickly fell on its face. Dragged on forever waiting for some action. Acting was fine, plot was a complete let down. Hollywood pansies writing military mentality. The ending made absolutely no sense at all. Going within seconds from being hunted to the death by corrupt cops, to giving them escorts to the hospital. And that's where it ends. WTF!!!!",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "To be truthful i was very bored the entire movie.\nYou give it a chance and hope that somewhere in the middle there's gonna be a turn of events, a plot twist, something, but no. The movie is about a guy Terry who's trying to do the right thing by exposing the corrupted law enforcement in a small town. My thing is this, this is an action movie, but there was no action basically. Everything felt monotonish and like a drag. I liked the acting, the production was okay. Aaron Pierre was very impressively pulling out stunts and tricks during the fighting scenes, but it didn't saved the movie unfortunately. The movie was unnecessarily\nlong.",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Te engancha desde el inicio y te mantienen en constante tensión, tiene buenas escenas de acción y es muy satisfactoria de ver.",
    "date": "2025-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "“Rebel Ridge” is a crafty, complex, and rigidly intense thriller, ripe with the stink of systemic rot and the desperate measures that rot creates.",
    "date": "2025-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Awful. Just completely awful. Acting is not believable at all and the story line is so bland and boring. Poorly directed and action sequences are corny. Don’t watch this movie.",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Keeps you on the edge of your damn couch",
    "date": "2025-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A good action movie to watch",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Just watched Rebel Ridge and I gotta say, solid 3.5 stars from me. I only hit play because it was recommended and Aaron Pierre’s in it—since he’s gonna be Green Lantern soon, I was curious. Honestly, dude carries this movie. He’s got that intensity and quiet strength that makes you go, yeah, this guy can be John Stewart. Also, super pleasant surprise seeing AnnaSophia Robb pop up—she was one of my childhood crushes, so that was a little bonus.\n\nThe movie nails the “hate the cops from the jump” vibe and really leans into the injustice theme. It’s not the action-packed Netflix thrill ride they sold it as—it’s way more drama-thriller—but the drama is so raw and believable it works. The acting across the board is excellent, and the impact is heavy. Only real knock? The pacing’s a bit rough, could’ve used tighter editing. Still, if they make a sequel, I’m in.",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Only three times have I watched a movie and wished someone had paid me for the time I wasted watching it. Rebel Ridge (2024) is one of those films.\n\nI could tell the actors were trying their best with the material they were given; however, the script and direction are missing any genuine human element. It ultimately lacks soul.",
    "date": "2025-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "First hour is a good short story.\n\nFollowing 65% goes totally off the rails into hollywood-try-to-shock-you trashland.\n\nGiven a 4.5 on Ebert.com. Fading that #",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Don Johnson’s terrific performance is failed by a goofy, unbelievable plot that reeks of political correctness.  Do yourself a favor & watch First Blood.  Its much more entertaining & satisfying. Stallone got it right.",
    "date": "2025-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Rebel Ridge is an intense Netflix thriller that delivers on action and spectacle. From the start, the film hooks the audience with sharp pacing and explosive sequences that rarely let up. The action scenes are executed with precision, creating the kind of pulse-pounding moments that keep viewers on the edge of their seat.\n\nWhile the story doesn’t break new ground, the movie makes up for it with its sheer energy and captivating set pieces. The performances complement the high-octane tone, giving the audience someone to root for amid all the chaos.\n\nOverall, Rebel Ridge is an entertaining ride that proves Netflix can still churn out an adrenaline-filled crowd-pleaser. If you’re in the mood for non-stop action and suspense, this film is worth the watch.",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Great story amazing cast that really pulls you in specially the intense scenes.",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Jeremy Saulnier's best work yet!",
    "date": "2025-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "First Blood 2025\nExcept it values acting over gunfire.",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Certainly won’t win any awards but entertains just the same.",
    "date": "2025-08-11"
  }
]