[
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The movie ends up being a worse version of Die Hard by having boring action sequences and feeling more like a PG-13 film than an R-rated film. Daisy Ridley did the best that she was given.",
    "date": "2025-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Brilliant! Well directed by Martin Campbell. Very well written and brought to screen. Good cinematography and visually stunning. Great story with all the relative elements required, lots of suspense, drama, dilemma, twists and action. Great cast all very convincing in character. Memorable",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Tried way too hard to incorporate a bunch of modern day ethical and moral situations.  Blah blah blah",
    "date": "2025-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Felt like a story we’ve seen done better before—a case of the wrong person in the wrong place at the wrong time. It tries to capture that “Die Hard” kind of tension but never quite gets there. While there are a few solid moments, the film overall doesn’t leave much of a lasting impression.",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Two directors for this mess? The first five minutes were enough for me.",
    "date": "2025-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Not much action. A weak plot and a plodding script. Not recommended.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Watched because Clive was in it. We he died after 5 minutes lost interest.",
    "date": "2025-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "You know what? What a banger! Good quality, amazing actors like stupidly good actors! Actions a mix of die hard 1 and taken.  It’s something wholesome, where a hero is not straight up good, but for family she steps up.\n\nDon’t buy into the critics, they know jack about movies!",
    "date": "2025-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Cleaner aims to fuse classic skyscraper set action thrills with contemporary eco politics, but ends up a missed opportunity. Daisy Ridley’s ex soldier turned window cleaner faces armed eco-terrorists holding her autistic brother hostage, yet the script sidelines her for much of the runtime, diluting the tension. Despite flashes of suspense and solid performances, weak dialogue, underused setting, and flat pacing leave this as a conventional, forgettable actioner....",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I was hoping for something with a bit more action - instead those scenes seemed to be far and few in between. Combine that with a typical hostage story where the tough unsuspecting female saves the day and that just makes for all kinds of subpar acting and endless cliches in this less than memorable picture.",
    "date": "2025-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Think \"Die Hard\" if Bruce Willis was a window cleaner.  The \"wrong place at the right time\" trope has been done to death, and \"Cleaner\" did not bring anything new to the table.  Instead relying on tried and true to make a movie that feels all too familiar.",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Cleaner is the latest action movie from Director Martin Campbell and acrtress Daisy Ridley which is a disappointment. The film starts off like it will be a pretty good movie, only to quickly fall into the dull cliche type of movie. The move asks the audience to really suspend a lot of realism and buy into their ludicrous plot. I’m not sure why Daisy Ridley even signed up for this movie even though she has already shown she can be an action star. Clive Owen is rarely used in this film and one has to think was he originally supposed to be in more of it. The action is not thrilling and not believable at all. The only saving grace is Daisy Ridley still gives it her all even when those around her are not. Cleaner gets a low 2 star out of 5 rating from me.",
    "date": "2025-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I didn't know what to expect with this movie, but I enjoyed it very much. I think the story was great and reminded me of Die Hard. It keeps you invested and I give it a solid B+",
    "date": "2025-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Beautiful girl.  Choosing to not use her strengths in her favor. \n\nDecent movie, But not the movie for her. \n\nGood luck Daisy, you're going to need it.",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Plot makes zero sense.",
    "date": "2025-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Moderately good.  I call it an ironing movie. Something to kinda watch while ironing. Not terrible, definate C+",
    "date": "2025-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Didn't these assholes ever hear of \"Die hard\". Daisy is no Bruce Willis. Predictable plot. Horrible acting.",
    "date": "2025-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Bad Die Hard remake.  Petite lady wins the day whilst making snide remarks about companies not paying for maternity leave and adult autistic brother requiring her care.  Do window-cleaners work at night?  In the UK they do?  Basically, girl boss fantasy - if you enjoy that kind of movie.",
    "date": "2025-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Mediocre premise with mediocre execution",
    "date": "2025-06-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It’s a mess. From the beginning you just want to skip through the story because it’s I’ll-written. The characters are cliches gathered together and unlikely scenarios one after another. Everything is just so forcefully put together.",
    "date": "2025-06-28"
  }
]