[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Matilda becomes a disturbingly effective tale of a child battling a world ruled by monstrous adults. The film’s cheerful colours only deepen the unease, turning every scene into something slightly uncanny.\n\nMiss Trunchbull is a genuine horror villain—towering, sadistic, and atmosphere-warping in every appearance. Matilda’s telekinesis, instead of feeling whimsical, plays like a quiet haunting: objects moving with eerie calm, hinting at power born from neglect and fear.\n\nWhat elevates it is the contrast between darkness and hope. Matilda’s final victory feels like a classic horror triumph, where the smallest, quietest character outlasts the monster.\n\nStrange, unsettling, and unexpectedly powerful—Matilda works shockingly well as a child-centered horror tale.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I’ve watched this 50 times",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Filme bacana, o roteiro é bacaninha, as cenas são bacanas, a história é bacaninha, o elenco é bacaninha, e poucos ajudam  a melhorar o filme, os personagens são bacaninhas, o filme tem cenas bacanas mas forçou um pouco com esse negócio de super poderes da matilda, e também ela não deveria ajudar o próprio pai adotivo que xingava ela, maltratava ela, dos policiais, isso que ela falou que só ajudou o pai para mudar ele, mas no final ele continuou do mesmo jeito, com tudo isso, eu recomendo esse filme.",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Delightful movie. Kids will love it!",
    "date": "2025-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "in my top 10 favorite movies of all time.",
    "date": "2025-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "All Time Classic. It's a shame this wasn't well received in 96'. It's difficult looking back to really understand why but sometimes gems like this fall through the cracks. It's a shame because man it would've been amazing too see what DeVito could do more of behind the camera. This is easily is crowning acheivement as a director. Fantastic direction in this. I love all the wide shots, how we see things from the view of a child, and how it changes as Matilda stands up for what's right representing her arc. Just first rate all around. Amazing cinematography and incredible practical effects that hold up remarkably well. Matilda is easily the best thing about this and is so charming, quirky, likeable, and good person beyond her years. Miss Honey is awesome too. Everyone else is really good too. This is basically if someone literally took the idea of Carrie and made it into a fantasy family comedy. It weaves effortlessly between being comedic, wholesome, and scary at times too. Just enough where it should'nt terrify little ones. DeVitos narration is excellent too and gives it more of a fairy tale feel as well. Wholesome, charming, and very original this is something everyone should give a watch once.",
    "date": "2025-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I think it’s a movie with a very powerful lesson, because even though a child may be small and young, that doesn’t mean they aren’t strong, wise, or able to take care of themselves. I also believe it teaches parents to pay more attention to their children\nDanna reina 1001",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "My most favourite movie ever",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is my favorite movie, because it makes us see that we are capable of doing anything and many times we limit ourselves to doing them because we believe that we are not capable of doing it and well seeing that the girl was always so alone and yet she continued and continued with her life until she finally found someone who really loved her.  \nLaura Malagon",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 33 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $33,100,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Filmed in 1996 in color!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Starring Mara Wilson as Matilda Wormwood, Pam Ferris as Miss Trunchbull, Rhea Perlman as Zinnia Wormwood and Danny DeVito as Harry Wormwood!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! And Embeth Davidtz as Jenny Honey!!!!!!!!!!!!!!! And Brian Levinson as the main couple's evil son, who is Matilda's brother Michael Wormwood!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "To this day, Danny DeVito's Matilda remains a hilarious, heart-warming, and eye-popping family film that is one of the best Roald Dahl adaptions.",
    "date": "2025-06-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Ms. Trunchbull is one of the most fricked up people ever",
    "date": "2025-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Matilda is a hilarious movie! and that's what makes it so enjoyable and great! all the characters are pretty SOLID, and the villain was SCARY and EVIL. I don't have much left to say. this movie is definitely worth watching. the only flaw I have with this movie is I really wished the film could be a bit longer. but still, this is a very good movie in my opinion. overall, 9/10.",
    "date": "2025-04-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is such and amazing classic! One of the best family movies ever!!!",
    "date": "2025-03-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "another childhood movie of mine that i would always watch but lowkey got sick of the plot eventually",
    "date": "2025-03-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "They used the song \"Send Me On My Way,\" twice in the movie. Once, in the beginning while Matilda is making herself pancakes for breakfast, and again, in the end, during the montage with Matilda and Ms. Honey playing together. It disgusts me.",
    "date": "2025-03-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I first watched this movie in preschool and barely remembered it so I now wanted to rewatch it as an adult. This is a very creative and unique movie that is very good for kids, particularly for younger girls. Pam Ferris gives and incredible performance and Danny Devito as the director gave the movie a different and artistic flavor as well. This movie teaches pretty decent values to children overall, and who would’ve thought that a hiding and running sequence throughout a big home could’ve been shot, edited, and executed so tense yet so rich with entertainment?! Sure some parts of the movie are silly and ridiculous, but it can’t beat out its charm!",
    "date": "2025-02-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This is quite a heartwarming film/movie about an adolescent girl who was given birth by a family who wasn’t great and didn’t take her to start school, but once they did, she was taken to a school whose headmaster was a cruel, grumpy woman who physically punished children since there were no laws against it.\nBut the ending is very fulfilling, with Mrs. Honey becoming Matilda's parent/caretaker through adoption, as well as the school's new headmaster.",
    "date": "2025-02-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Matilda is hands-down one of the best family movies of all time. It has good lessons, great characters, and even better writing and direction. It was my favourite movie as a child, and it will forever have a special place in my heart.",
    "date": "2025-01-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It's not a good movie",
    "date": "2024-12-24"
  }
]