[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I thoroughly enjoyed it with my kids. I’m actually surprised by the negative reviews. The humour was cheeky… some good jokes for the kids and adults to enjoy.",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Great when you want to watch something of low quality!",
    "date": "2025-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Its cute. Definitely not the Dr. Dolittle I grew up with, but very cute with cute animal characters.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Had an interesting premise, however the addition in the later half of the movie of the dragon plot line could have been left out",
    "date": "2025-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I've seen this movie twice. The first time was a disappointment since it was post Avengers hype expecting a lot of action and less of a journey. I think the way RDJ's voice sounded also made it an annoying movie.\n\nRewatching it in 2025 in Netflix after watching a lot of b-tier movies pre MCU and other slow paced movies, RDJ's Dolittle is actually quite a good movie.",
    "date": "2025-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é ruim pra caralho, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This movie is pretty good, but not as good as the original Dr Dolittle",
    "date": "2025-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It was a really fun and goofy movie. Really enjoyed it. The jokes were good, some felt cringe. The visuals of the animals were awesome.",
    "date": "2025-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I thought the movie was cute and funny. The accent RDJ did was throwing me off though because it was so bad.",
    "date": "2025-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "while not my favorite it was a fun movie and it gets too much hate. if you have kids they would probably enjoy it, or if you just want a fun movie.",
    "date": "2025-06-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 40 minutes!!!!!!!!!!!!!!! The USA grossed over $77,000,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "You might think I am giving this movie a way to high rating for what it is but I watched it after endgame, and I think I am giving it a higher rating because it hold a special place in my heart since I saw it with my dad in theaters and it will always hold a special place in my heart.",
    "date": "2025-04-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Esta película es tan buena que mi mujer no podía tener hijos y la puse mientras follaba y ahora tengo quintillizos.",
    "date": "2025-03-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "\"To the tower with him.\"",
    "date": "2025-02-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Dolittle, featuring Robert Downey Jr. and Tom Holland, falls into that category of films that you didn’t necessarily ask for. While it’s not a terrible movie and provides some entertainment for the younger audience, it ultimately lacks the compelling nature that would make it a must-see. This new iteration diverges significantly from the original Dr. Dolittle films starring Eddie Murphy, taking a fresh but ultimately disappointing path with Robert Downey Jr. at the helm.\n\nIn my opinion, the screenplay felt a bit rough around the edges, riddled with issues that could have been addressed with some thoughtful revisions. It reminds me of the importance of collaboration between directors and screenwriters. If a director feels hesitant to challenge a screenplay that doesn’t resonate, it can lead to a disjointed final product. Everyone involved is there to contribute their expertise, and if a scene doesn’t work, it’s crucial to address it—even if that means a rewrite.\n\nPersonally, I found the abundance of animals and unnecessary world-building to detract from the narrative. The story strayed so far from the essence of the original film that it felt like a missed opportunity for a fresh adaptation that could have built on the beloved storylines. The original films set a high bar, and this attempt sadly fell short.\n\nWith an impressive ensemble cast that includes Emma Thompson, Rami Malek, John Cena, Tom Holland, Craig Robinson, Tommy Colette, Kumail Nanjiani, and Selena Gomez, one might expect audiences to flock to this film. However, the reality is that even with such star power, characters still need to be well-written. Even if their roles are minor, giving them moments that matter can elevate the film, rather than making them feel like mere background players.",
    "date": "2025-01-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I actually liked this. It’s a movie that you just switch off your brain and enjoy it as a light hearted romp. Don’t think too much about it.",
    "date": "2024-12-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Not bad. But the original is better.",
    "date": "2024-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Was on the movie with my family and we all enjoyed it! :P",
    "date": "2024-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It wasn’t good, but people hate on it a bit too much",
    "date": "2024-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Great cast and effects wasted on a pathetically bad script",
    "date": "2024-06-16"
  }
]