[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Great movie that kept my attention. Well acted and well written.",
    "date": "2025-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I made an account to review this movie. I hope nothing like this ever gets created again. The historical intrigue of this story is entirely lost in horrific writing, bad acting, and poor and isolating cinematography. What a waste of all resources this film had available. The characters are unlikeable dog abusers, the script is a 12 year old attempting drama, and there is simply no suspense or tension in the entire film. By the halfway mark I was cheering for the ice or a bear to off these terrible pieces of garbage unlikeable British pirates pretending to be Danish. This movie made me angry at it. It truly sucked to experience. Joe Cole should fight to keep this off his career list as it makes him look untalented. Charles Dance's performance was the best because it was only a few seconds for the director to ruin.",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Some beautiful shots and solid acting in this survival movie. However, it is getting pretty slow and some scenes are overly stretched at times.",
    "date": "2024-01-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "There's some good acting and great scenery in this true story of polar exploration, but ultimately the film lacks atmosphere and story is presented with little sense of genuine risk or danger.",
    "date": "2023-12-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie with a straight-up plot, which leaves out all the detracting gratuitous distractions that many of today's shows/movies put in (to 'kiss the ring') and distract from the plot. It could not have been a lot of fun shooting a movie in a sheer freezing climate. Take it from one who spent 3 years up North where one's extremeties can freeze in a very, very  short time.",
    "date": "2023-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely stunning story. So refreshing. Worthwhile watching. Outstanding performances of the main characters.",
    "date": "2023-04-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I don't want to give any spoilers away so I'll just say that the way they've handled certain aspects of this picture are brilliant. Be patient with this movie as it develops in ways unexpected but totally rewarding",
    "date": "2023-04-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I am not usually one to watch these types of true life stories. However I decided to watch it and it turned out to be quite a pleasant surprise. The human will to survive and the connection people have between each other during times of struggle was remarkably portrayed. I thoroughly enjoyed every moment.",
    "date": "2023-04-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "My wife and l liked this a lot.  It 's a solid, fact-based, man-against-nature story - not sure why all the mediocre reviews but it was exactly what we were looking for and expected. Acting, plot, setting, cinematography, all excellent. Reading the audience reviews, apparently some viewers got frustrated in the second half.  But it was based on an autobiography and all the events rang true under such dire circumstances. I'd recommend it.",
    "date": "2022-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A movie that is actually historically accurate, but once again would've been better off as a 30 min documentary.",
    "date": "2022-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A beautiful, understated movie with relatable characters, stunning cinematography and great storytelling. The critics trashing this film just have no original ideas and clearly never spent any significant time alone... in the Arctic. In response to someone's comments, I LOVE dogs. But the needs of the survival made me buy their sacrifice.",
    "date": "2022-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Based on a true story from a time long passed, The lead characters have gritty scenes as time goes by. I really rooted for the 2 main characters. Any show where i root for the main characters makes the show compelling.",
    "date": "2022-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Tecnicamente la storia è raccontata bene, senza esagerazioni o eroismi inutili.\nD'altro canto, manca un po' di emozione e di avventura; il viaggio intrapreso dai due protagonisti non è chiaro, serviva una mappa multimediale per capire i loro spostamenti e la loro posizione.\nNel finale, la parte meno adatta al racconto cinematografico, si perde sprint e ci si limita a raccontare un delirio da allucinazioni dei più comuni.\nPeccato non aver lasciato il minimo spazio ai compagni di avventura e alle motivazioni per cui hanno costruito la baracca e poi abbandonato tutto; avrebbe dato più varietà al racconto.",
    "date": "2022-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Aquela biografia que amamos sim ou com certeza... Nem precisa de muito, neve e biografia já deixam meu S2 em êxtase, muito bem produzido, com aquele drama sofrido de congelamento e fome, boas atuações, pessoas com um sonho e muita determinação, convence, e vence, ótimo filme...",
    "date": "2022-06-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Against the Ice makes for a tense and suspenseful viewing experience but not a very enjoyable one. The cinematography was beautiful though.",
    "date": "2022-06-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Against the ice successfully reach beyond many horizons and frozen lands to revive all the aspects of two explorers surviving harsh nature. Evey dialogue every bit of acting was essentially perfect and heartwarming. It's definitely a worth every second.",
    "date": "2022-06-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Special Effects: 1,0/Sound Effects: 1,0/Acting: 0,5/Story: 1,0",
    "date": "2022-05-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A very easy watching adventure film with good visuals. Not sure why people are rating it so badly. If you are expecting more of a an action film like the grey, this isn't isn't. Just expect a relaxing educational film and you won't be disappointed.",
    "date": "2022-04-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thought this film was fantastic. Enjoyed it from start to finish. The mechanic made the film. He remained upbeat throughout their ordeal and he was what kept the captain going even during his insanity. It's the perfect balance of thrills, from the sledge going over a precipice to the dreaded polar bear",
    "date": "2022-04-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Roughing the elements.  So back in 1909, a crew of Danes set on an exploration mission.  They have to prove that the northern part of Greenland is not separated by a river to disprove the United States' claim to the land.  This is about a captain (Nikolaj Coster-Waldau) and a volunteer mechanic (Joe Cole) who trek a great distance to recover some lost evidence from a previous expedition.  This will be the equivalent of walking from Moscow to Rome looking for a stack of stones.  Now I was looking for a movie to watch on a random day off that I had.  Netflix is good for that, and they routinely have new material in their library that you never knew existed.  The only thing I knew about Against the Ice is that it starred Nikolaj Coster-Waldau (aka Jaime Lannister), so I decided to roll the dice.  It's a mixed bag, but I ultimately think you can find a better survival movie for your valuable time.  Now it's not like I was watching this with crossed arms and a stiff upper lip.  I wanted to be on board with this.  I was with it at the beginning, and I felt like it gets off to a promising start.  The story doesn't waste a lot of time messing around, and it isn't long before these two are breaking from the group and hitting the tundra.  In fact, I would even go so far to say that this story goes harder than it needs to.  It's the top of the 20th century we are talking about here, so the way to traverse Greenland is via sled dog.  They give you a foreboding warning before the journey gets going that this journey isn't likely to go well for the canines, and it ends up about as you expect.  This could be a potential trigger for dog lovers, even though the very worst all happens offscreen.  The biggest problem with Against the Ice is that these two characters that you're spending all your time with aren't that deep.  You have the closed-off alpha male and the naive inexperienced guy, and they are pretty much playing types.  It's almost exclusively surface level, and I'm sorry but pining for girls isn't a compelling enough reason for me to connect with the leads.  I think that Cole and Coster-Waldau are both doing as their directed, but I still found myself craving more rounded performances.  I was with Against the Ice when these two are journeying.  There is constant peril, and even though they aren't deep characters, I was engaged in what would happen, if only for dogs.  I got very bored and restless in the third act, and I think that is a design flaw in the story.  It is just garden variety characters-going-stir-crazy, and it is frankly quite dull.  It spoiled any goodwill I had toward the film as a whole, and it made me unwilling to overlook other shortcomings.",
    "date": "2022-04-12"
  }
]