[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Electric from start to finish. Massive flexes by Theron and Hardy. An absolute great time at the movies!",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Probably one of the greatest action films ever made with a score that makes you want to speed down the highway this is an instant classic that true movie fans will cherish for years to come",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Didn’t think I would like it but very well scripted movie!",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Crazy it pulled a 97. I have the movie poster. It wasn't as interesting watching it a second time, but still great.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It deserved those 6 Oscars and I can see why it earned them. This was a thrill ride packed with action and psychological horror as well which I was surprised by. The movie also had great camera angles and beautiful visuals.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Believable, terrifying, and never lets you go.",
    "date": "2025-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The amazing camera work and editing doesn’t get talked about enough",
    "date": "2025-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Mad Max was not a franchise I had grown up with or had any kind of emotional connection to but after watching Fury Road at the behest of a friend who loved the series, I was immediately enamored with the sunny apocalyptic world. With beautifully unique character designs, a strong visual style and some wonderfully insane characters, Mad Max Fury Road is engaging from start to finish. \n\nThe world presented here is vibrant and full of life, with rich lore and characters whose roles feel both clearly defined and intriguingly ambiguous, leaving room for interpretation and mystery. This is primarily due to the fact that this movie, for the better, does not hold back — it jumps right in as if this world was living long before us and will continue to live on long after we stop watching. It keeps the pace of the film mostly brisk and entertaining at all times. The characters and setting also have a flair to them that not many other post-apocalyptic films usually have — from the bright orange sandy dunes and crisp blue skies that serve as the backdrop to most of the film, to the ornate character designs that pop out in every scene. From the silver mouthed war boys, to the absolutely unnecessary (but totally necessary) Doof warrior who plays a guitar that spews out fire and whose singular role is to play loud chaotic music during battle. Immortan Joe has this guy in the middle of the action to play hype music and that detail encapsulates the energy of the film. Our protagonists are great and I do love them… individually, but they do not work off of each other very well. Two stoic leads do allow a lot of space for everyone else to be wacky or over the top and that is admittedly done well but it’s hard to buy their relationship or even their partnership in any meaningful way. While I do love the universe and the colorful cast of characters that inhabit it, it does unfortunately all serve a story that is a bit underbaked — its not necessarily bad as the moment to moment is fun and engaging but the story does fall a little flat especially compared to how high everything else flies. \n\nMad Max has one of my favorite worlds in film, its fun cast of characters and positively insane setting littered with great action and engrossing details are easy to get lost in. The story and the relationship between our leads could both be more fleshed out but despite this, Mad Max Fury Road is a world absolutely worth visiting.",
    "date": "2025-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Action masterpiece, breathtaking scenes, didnt realized the time going through, 2 hours passed in 2 minutes.",
    "date": "2025-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "George Miller is the GOD of post-apocalyptic road action movies PERIOD.",
    "date": "2025-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "PHENOMENAL! Great cast, spectacular performances, cinematography is spectacular! I highly recommend it",
    "date": "2025-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Meeeeedioooooooooocre!",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Good movie. Worth the watch.",
    "date": "2025-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The best action movie of 21st century!",
    "date": "2025-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It's bleh, had to watch this for an English Assignment once and had to write a comparitive review of it alongside Terminator II: Judgement Day. Suffice to say, the pick of favourites was obvious. The way these characters were developed was horrible. I genuinely could not care if the War Rig crashed, burned, and Furiosa, Max and the wives all died. It is entirely a movie built on shock factor and edging-of-the-seat-ism. I enjoyed the CGI, enjoyed the cool concepts for wasteland villains (those mountain bikers were wicked), but hated how little I cared for the plot or the characters. Watch if you like DOOM or similar topics that exist mostly to satisfy the primal urge to destroy.",
    "date": "2025-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Film is unwatchably bad and dumb.  As a life long original Mad Max fan from childhood, I scored a WB preview in 2015.  My thrill soon turned into utter confusion and disappointment with the instant destruction of Max's car and his capture.  This film treats us to extremely bewildering timelines, really unexplained character behaviors and unrealistic actions and implausible resources. For instance, wasting hundreds of gallons of water or hundreds of rounds of scarce ammunition.  Or ripping the top of the engine off while it's driving and while standing on the hood, is absurd.  Or vehicles that do impossible maneuvers (which require armies of professional mechanics and new parts on hand to produce these stunts and keep the vehicles running).  The plot is silly.  The girl boss angle has not aged well.   The CGI (which we were lied to about) is not very good.  Hardy is a great actor but no replacement for Gibson.  The villains are unconvincing.  I just really did not like this film and can't even get thru it a 2nd time.",
    "date": "2025-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Third time watching and I get more out of it every time",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The best action movie that you'll ever get to witness",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Brilliant action film.",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Just watch \"Road warrior\". It's the same movie just more over the top and less story....",
    "date": "2025-08-10"
  }
]