[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Good.  I think Butler is a terrific actor, but it seems that everything he does involves massive body counts.  But then, I look through Netflix and that seems to be almost everything coming out these days.  Action, post apocalypse, dystopian, blah, blah, blah. This one is slightly better in that the protagonist isn’t immune to it, but I wish they’d make more movies without all the blood and gore and with some intellect.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I read some whiny comments about suspending disbelief, implausible plot, whine, whine, whine. But strap in, fasten your safety belt, lock and load your AK47, and hang on for dear life. It’s gonna be a bumpy ride…Above all, do what the Captain says and you just might make it home.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Little to complain about, action left and right, hard to predict at every scene, very well done!",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "(CASTELLANO) Gerard Butler repite en lo que mejor sabe hacer: un thriller de acción donde la lógica pasa a un segundo plano. El piloto no pretende ser realista ni falta que le hace. Tiene escenas imposibles y situaciones que rozan lo absurdo, pero cumple con lo esencial: mantenerte atento durante casi dos horas con un ritmo ágil y varias secuencias potentes.\n\nEl verdadero punto fuerte está en Butler, que vuelve a demostrar por qué sigue funcionando como héroe de acción a la vieja usanza. Junto a él, Mike Colter aporta la solidez necesaria para que el dúo mantenga el interés incluso cuando el guion se apoya en clichés ya conocidos. La química entre ambos logra elevar un material que, en otras manos, podría haberse sentido mucho más plano.\n\nLa dirección de Jean-François Richet apuesta por una acción trepidante y clara, sin adornos innecesarios. Aunque algunas situaciones se resuelven de forma demasiado fácil, el pulso narrativo es firme y consigue que el espectador no pierda nunca la atención. Por momentos recuerda a aquellas películas de videoclub de los ochenta, donde lo importante era el espectáculo y no la credibilidad.\n\nAquí no hay que buscar giros profundos ni grandes innovaciones. El piloto es cine de \"fast food\": rápido, contundente y fácil de olvidar, pero eficaz en lo que propone. Explosiones, peleas y suspense, con espacio de sobra para disfrutar sin complicaciones.\n\nEn definitiva, puede que no deje huella ni cambie la percepción del género, pero consigue lo que se propone: ofrecer evasión y acción al estilo Butler. Y, en ese sentido, cumple con creces.\n\n(ENGLISH) Gerard Butler returns to what he does best: an action thriller where logic takes a back seat. The Pilot doesn’t aim for realism, nor does it need to. It’s full of impossible scenes and over-the-top moments, but it delivers on its promise: keeping you engaged for nearly two hours with a brisk pace and plenty of intense sequences.\n\nThe real strength lies in Butler, once again proving why he still works so well as an old-school action hero. Alongside him, Mike Colter brings the solidity needed to keep things interesting, even when the script leans on clichés we’ve seen countless times. Their chemistry elevates material that, in other hands, might have felt much flatter.\n\nJean-François Richet directs with fast, straightforward action and no unnecessary frills. Some situations may resolve a bit too easily, but the narrative pulse is strong enough to never lose the viewer. At times, it recalls those 1980s video-club action flicks, where spectacle mattered more than credibility.\n\nThis isn’t about deep twists or innovation. The Pilot is \"fast food\" cinema: quick, straightforward, easy to forget, but effective at what it offers. Explosions, fights, and suspense, with plenty of room for uncomplicated fun.\n\nUltimately, it may not leave a lasting mark or change perceptions of the genre, but it delivers what it sets out to: escapism and action, Butler-style. And in that sense, it works perfectly.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Nobody had a cell-phone? Well thats just not true, multiple people were recording themselves but not a soul mentioned why they couldn't call anybody. The officer died mysteriously and the prisoner is chillen. The pilot didn't care much, like \"hey man lets get this action movie rolling\". Come on into the woods with me and ill walk ahead of ya completely trusting. lol I had a hard time with this one, its been 15 years but i doubt an IRL pilot isn't suspicious about the cop being dead. Gerard Butler is a picture perfect pilot is about the top of the 2 stars. Well he did have a firearm, i guess i can see the situational perspective besides for Gerard being known as a badazz.",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "What's all the hype about this movie? I turned it off after 35 (!) minutes because absolutely nothing had happened by then. For me, it's the most boring movie I've seen in years.",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Dumb. Just so dumb. I can't believe they made money on this.",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "B list in all the wrong ways",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This was an okay movie for what it was.  Didn't really \"wow\" me.  I found it all too convenient that out of all places, they just so happen to crash land in the one place where a rebel leader is apparently very hungry for tourists to kill.\n\nI can't say more, as I don't want to spoil, but this movie follows a typical trope that is a bit old.",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Corny in the worst parts but enjoyable enough",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Early in the film, the pilot decided to leave the cockpit and check on the passengers during turbulence and unknown weather conditions. Aviation law requires pilots to be in control of the aircraft during such conditions. \nThe film fails to capture the insurance and legal implications of such actions and instead takes a turn for a sub-par action plot. Beyond mediocre.",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A perfect thriller on all aspects. This time I really can't understand the complaints from some of the critics. Not one boring minute here.",
    "date": "2025-10-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "If you liked earlier Gerard Butler action films you'll like him in this role too, but if you are looking for a love story or a though-provoking film stay away.  This one is action--and well-done action.  Butler carries the film, and I found it to be wonderfully entertaining.",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Its a movie that doesn't loose the grip, its interesting and inspite of all the adversity situations it is belivable. This movie puts many blockbusters on its pocket. Its Great Fun! Well done.",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This was like Captain Philips mixed with any plane crash film with the action ramped way up",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "An entertaining action movie with characters you actually want to root for. Definitely better than most of the junk coming out these days. I can't help by laugh at the fun police complaining about issues like violence and realism. What do they expect from a popcorn flick?",
    "date": "2025-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Entertaining and fun!",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Terrible movie.  casting was weak and the script was worse.  So unrealistic in so many ways",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This was one of the dumbest movies I’ve ever seen, but it had a man getting shot by a Barrett .50 Cal through a car’s engine block so it gets a pass. Great dumb action flick to laugh at and laugh with. Watch with friends.",
    "date": "2025-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This is a little predictable, but still much more fun than I thought I would get watching this one.",
    "date": "2025-08-11"
  }
]