[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I thought this was a fantastic horror/thriller movie! I don't understand the bad reviews at all??  I really enjoyed it from start to finish!\nJust realized I am referring to a different movie that takes place in France Catacombs.. LOL.. Same Title just different movie.  Fyi",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The sight of this ridiculous looking 'babe' (with her artificially inflated lips and her artificially inflated breasts) at the helm of a boat no less is the most ludicrous thing I've seen in quite some time and I can't believe the British are capable of it.  So, in order to watch the movie (waiting hopefully for her to drown which I doubt is going to happen), I have to not look at her because watching her pinning her shoulders back to an unnatural degree in order to make her breasts stick out even more makes me sick and watching an entire movie without looking at one of the characters is not easy.  There should be \"booby\" prizes for this sort of thing !",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I mean it was ok, a storm was coming but then it’s just forgotten, it wasn’t even heavy on shark attacks which would have made movie really interesting if she was trying to survive with a broken ship after the results of storm.",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Entertaining enough throughout, but it fizzled out towards the end. If the shark was high on cocaine, they all would’ve been safe because it wouldn’t want to eat anything for a while. Plot hole!",
    "date": "2025-02-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Watch this mainly for the shark attack footage, which is surprisingly well done for a low budget movie. The first half of the movie is slow, but the second half grabs your attention, especially when the villains arrive and the shark action picks up. As for the sentimental and human interest part of the plot, it’s banal and uninteresting but doesn’t take too much screen time, so you can ignore it. The female lead is more eye-candy than actress, but good acting is not the strong suit of this film anyway.",
    "date": "2024-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "this movie makes me wish i was blind.",
    "date": "2024-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The most Un Sharkey shark film ... When the shark finally arrives it's all a bit flat took to long to get started was all very predictable .",
    "date": "2024-06-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Terrible, bad acting and absolutely poor writing. Lines are said very lazily with no effort.",
    "date": "2024-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Worst movie ever. Absolutely terrible. Acting part is worst I have ever seen. Hallmark even does better.",
    "date": "2024-03-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "One of the worst movies you will ever see. The main actress has in no way acted or been trained as an actor. She was god awful.",
    "date": "2024-02-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Acting was shameful.  Production was trash.  It's like they were trying to make a bad movie.",
    "date": "2024-02-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great popcorn movie! Acting was fine and Not as bad as weirdo movie critics are saying. Lead actress was eye candy that should be expected and appreciated in a shark movie! Enough scares and suspense to get the job done and then some.",
    "date": "2024-02-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "3 and Half a stars because I don't like the Kardashians at all but this movie had the wish version of Kim.  Seriously the Florida coke shark? Super boring and a total waste of time. But give I'll props for no major American actors because I'm done with them and their bs platforms. So I guess keep doin what you do.",
    "date": "2024-02-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Watching this movie was pure comedy. Must say that the director has a talent for picking out the worst ‘actors' one can find. Very entertaining",
    "date": "2024-02-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Fast paced, to the point, exciting. Quick thriller with a simple story, pretty scenery, and pretty good acting. Don't  read the plot, just watch it! Cast is good and believable and Madelina and Ed are great. It's not Jaws, but fun and exciting to watch.",
    "date": "2024-02-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I think even the shark in the film was overacted.",
    "date": "2024-02-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The main actress was awful. So unauthentic, stale, icy acting. She really needs to find another career.  Impossible to watch and I love shark movies.",
    "date": "2024-02-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The main actor Westwick's performance is embarrassing, his facial expressions are ridiculous, only good thing about the movie is location",
    "date": "2024-02-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Absolute waste of time. The acting by Madalina Diana Ghenea was atrocious and her storyline was just stupid and boring. CGI embarrassing and to top it off they're sailing with a Grenadian (Caribbean \"Gren-ay-da) flag yet at times it's pronounced Grenada (Spain \"Gren-arda) writers do your research. Absolute waste of time I can't believe movies could've made this badly in 2023",
    "date": "2024-02-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I couldn't keep watching more than 30min, shitty acting, protagonist poses in every scene, shark is just simply fake and bad dialogues 👎🏻",
    "date": "2024-02-04"
  }
]