[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Partisan politics literally, straight out of the gates, in the first scene with the opening credits.  Enough with this decisive trash.\n\nOther than that, it's another Liam Nelson movie about not messing with his family.",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Would not say \"intense\", but I sure do not get the 12% rating???? Not THAT bad, surely? Script a bit dull, story okay, directing also okay. Action scenes a bit under par. Overall Neeson and Quinn saves the day. Nice that it was made Down Under",
    "date": "2025-06-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I was a big fan before he made them comments. So I can't leave a fair write view on his movie. (sorry)",
    "date": "2025-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "1.75 hours of action!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated PG-13 for Language, Action and Strong Violence!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Terrible film. Liam Neeson basically plays the same role in every film he is in and mostly they are good however this one is not, it's terrible. Nothing exciting about it, the 'villain' was predictable, as was everything else in this film. If it was a film in the taken franchise it would taken 132, meaning its 132 times worse than taken as we know sequels are typically a let down and by the time any franchise reaches 132 films in the series they would be unwatchable due to the lack of twists and turns in a film which is all about twists and turns. Don't waste your time watching this",
    "date": "2025-03-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Terrible script, terrible acting-worst Neeson movie I have ever seen.",
    "date": "2025-03-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Absolute garbage. Don't recommend it.",
    "date": "2025-03-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This movie had so much potential. Studios have to stop casting Liam Neeson to do more than just blow up stuff. He is not good at emotional acting. This movie was not what I wanted it to be, it could have been so much more. I do recommend this movie though just for the fact that this movie has a payoff.",
    "date": "2025-02-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Yet another entry on Mr. Neeson's portfolio where he is playing some old-time skillful shadow agent that just wants to retire. Review is done, thank you for reading. \n\nOK, right, jokes aside, Blacklight is indeed the same ol’ Neeson formula: veteran military-grade person wants to stop doing what he is doing to (pick one) live life/spend time with family/stop doing bad stuff — you get the point. But, of course, retiring is going to be hard because of (pick one) double-crossing/that one last mission/him himself reluctant to quit — you get the point. If that is your jam, Blacklight works for you. \n\nNow, long dead are the days of Taken where Mr. Neeson was at his peak. Besides some quite acceptable shootouts, most of his characters nowadays avoid going physical with someone probably for obvious age reasons. Every movie he stars, we are sure we are going to see Boomer just getting too old to keep doing this sh**. \n\nHowever, that simplistic formula works for a lot of people. If that is the kind of poison you like to chug, chug along. \n\nThe development of the story is fair, but then the ending happens to quickly. I figure the over-the-top high-profile premise was too hard to wrap up in under 2 hours, so what we get is abrupt non-sense, an ending that would never, ever happen in real life, considering not only the characters involved, but also their motivations. \n\nIf you are looking for depth, then you are in the wrong place. In here, you will only find the usual action flick with shallow plot and a bunch of nonsense from these types of movies.",
    "date": "2024-12-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I'm a Liam Neeson fan, so I enjoyed this, but objectively speaking, it was a run of the mill conspiracy/action film. The supporting cast was fine, the filming in Australia did somehow show through - though I'm no DC expert, there was this sense of its not being there.",
    "date": "2024-12-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Yeah, Neeson's movies always involve him overcoming impossible odds, but he usually picks better scripts than this.  If you think \"The FBI is murdering innocent civilians!\" \"Yeah, that's messed up,\" qualifies as decent dialogue then go ahead, knock yourself out.  That's the level of quality in the plot you can expect as well.",
    "date": "2024-12-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Neeson is an interesting actor. Since 2008's \"Taken\" became a huge success, Neeson has redefined his career as an action tough guy...at age 56. Now here we are 14 years later and Neeson is still getting up to kill the bad guys. In this film, Liam is really starting to show his age. There are chase scenes in which his character bails out part way through because he's winded. The man he's chasing jumps a fence and Liam gives a look like \"They are not paying me enough to climb fences.\" At least then didn't do like \"Taken 3\" and take 17 cuts to jump the fence. And his character is written more age appropriate than his last colab with Mark Williams \"Honest Thief\". In the former, Neeson was playing a man trying to settle down and get married. In this film, Neeson is wanting to spend more time with his granddaughter.\n\nAnyway, enough about Liam Neeson's age. The set up for the film doesn't make too much sense. In a film like \"Transporter\" Statham plays a wheelman for criminal operations. Neeson's job in this film is to help relocate undercover agents who have had their cover blown or go in too deep. Seems like a very specific task that would only pop up once in a while.\n\nIt may seem like I am focusing on all the wrong things for this review, well that is becuase this movie focuses on all the wrong things. This movie is a bore. The characters aren't interesting, and the story isn't unique. The action ranges from OK to sloppy. The dialogue is actually pretty good, very natural. It made the characters feel very grounded and human.\n\nWhat keeps this movie from being completely forgettable is the ending. It is memorable but not in a good way. It feels like they ran out of budget and just had to wrap things up as quick as possib.",
    "date": "2024-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It's a club sandwich of tropes, cliches, plot holes, one-dimensional characters, and stilted writing. It's terrible.",
    "date": "2024-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Who knew Liam Neesom would do a money grab. The story is crap, the editing is criminal and the acting is non-existent. Not even satisfying as mindless entertainment because you feel dumber after watching.",
    "date": "2024-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A typical Liam Neeson action film, with car chases, gun & fist fights.",
    "date": "2024-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "While on it's face it's just another Liam Neeson actioner, it is one of his better ones. It doesn't have much staying power, but if you're hungry for this kind of action flick, it'll hit the spot.",
    "date": "2024-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Liam Neeson could do little to save this movie. The storytelling and dialogue were below par, resulting in weak plot, clichés and wooden acting. Its a shame when other aspects of the production were quite good (camera work, stunts, Liam). With better direction this could have been quite entertaining.",
    "date": "2024-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Skip this one. Very bad writing, and well below average camerawork, even Liam Neeson couldn't bring this movie to life. He plays a 60 year old badass secret agent guy beating up and shooting young world class secret agents. Movie is plagued by \"wtf\" moments by characters and most of the decisions they make are questionable at best, and completely incomprehensible at worst. \n\nShoehorned a \"happy ending\" because why not. This movie wants to be taken seriously but it does nothing even remotely serious.",
    "date": "2024-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "You have seen it before from Liam nothing new here. There is no twist ending but fine car chases, gun fights and action. He is showing his age but over all a good time. It is pretty straight forward and sometime that is enough.",
    "date": "2024-04-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "If you're looking for some action it's a good time.  \nSure the storyline has been done in some form or another a million times. Still a good choice for a night in. Get your popcorn and enjoy.",
    "date": "2024-04-17"
  }
]