[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "È un'esperienza totale che premia la pazienza del pubblico con una ricchezza tematica e una maestria tecnica che raramente si incontrano nel genere.\n Non è solo il miglior film di fantascienza dell'anno; è la prova che la narrazione adulta e ambiziosa può ancora trovare il suo posto negli studios di Hollywood.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "In-cre-di-ble!! They stayed true.. that's the most important.. but also great performances and perfect artistic interpretation",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of my favourite movies. It's visually stunning, has a great storyline and has great acting from the main character. If you like sci-fi films, you'll love this. You'll need to watch the prequel (Dune part one) to fully understand this film. The first film isn't nearly as good as part two, but it does set the story up and I would recommend watching both. Overall 10/10",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Dune: Part Two is the second installment in Denis Villeneuve’s adaptation of the iconic sci-fi saga, continuing Paul Atreides’ journey with the Fremen as he rises toward a destiny that both empowers and terrifies him. The film deepens the political and spiritual conflict surrounding Paul, as he embraces the path before him while Chani fears the consequences of what he is becoming.\n\nThe character development in this chapter is excellent. Paul battles the idea of an inevitable future, trying to hold onto what makes him human while learning to harness the power of the desert. Lady Jessica becomes even more strategically influential, pushing the narrative of Paul as the prophesied Lisan al Gaib and amplifying the dangerous expectations placed on him.\n\nThe supporting cast shines. Austin Butler delivers a chilling and twisted performance as Feyd Rautha, making him an unforgettable antagonist. Javier Bardem adds both weight and conviction in his role, portraying unwavering faith in Paul’s rise.\n\nVisually, the film is breathtaking. The scale of the battles, the detail in the world building, and the stunning cinematography create a universe that is easy to get lost in. The visual effects elevate every scene, making the vast deserts and colossal sandworms feel incredibly real.\n\nBut the true standout of the film is Timothee Chalamet. His portrayal of Paul Atreides captures both the power he is gaining and the internal fear of what that power may turn him into. He brings a depth and emotional complexity that perfectly anchors the story.\n\nDune: Part Two is a gripping and visually spectacular experience that keeps you invested from start to finish. It is an outstanding continuation of the saga and a thrilling cinematic achievement.\n\n97/100",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "وايت ريزيدنس التجمع الخامس يقدم نموذجاً متكاملاً للسكن العصري في القاهرة الجديدة، ويجمع بين الموقع المتميز والتصميم الحديث والخدمات التي تمنح السكان تجربة معيشية راقية ومستقرة.\nhttps://aqarsky.com/projects/%d9%88%d8%a7%d9%8a%d8%aa-%d8%b1%d9%8a%d8%b2%d9%8a%d8%af%d9%86%d8%b3-%d8%a7%d9%84%d8%aa%d8%ac%d9%85%d8%b9-%d8%a7%d9%84%d8%ae%d8%a7%d9%85%d8%b3/",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Dune: Part Two is MASTERFUL filmmaking on an epic scale. Denis Villeneuve marries gripping character development to vast, sweeping cinematic visuals.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "3/5 since the saga is not over yet, but the film was incredible.",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Epic film, the cinematography was some of the best I have ever seen. incredibly gripping throughout. My girlfriend hated it but shes not writing this review so who cares!",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best movie of all time",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A visually majestic, thematically dense continuation that solidifies Dune as one of modern cinema’s most ambitious sci-fi sagas. While slightly uneven in its emotional rhythm, Part Two is an immersive, awe-inspiring experience that rewards patience and attention.",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Even better than the first one. If Timothée Chalamet wasn't a super star in Hollywood before this, he is now a one. Almost a perfect movie in my opinion.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What more can be said.  They took a impossible task that for the most part was faithful to the original material and where they deviated from the source matter it was just better.  There was one character gender change that will make it hard for a future movie in the book series and unless they do a complete rewrite they will have to change the gender of the character back.  Still a great movie and that issue will be a future writer's problem.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I haven't been this invested into a movie since I saw the Last Samurai in theaters. So good.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Va preso in considerazione che tutti i riti sacri risultano spesso inutili e dopo un po' noiosi, ma tralasciando ciò, Villenueve continua a sorprenderci dal punto di vista estetico e anche da quello dell'immaginario fantascientifico",
    "date": "2025-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "There were some visually spectacular scenes but overall, I found it over long and annoying.\nI have read the Dune books many times beginning in my childhood and I am extremely familiar with the series.\nI don’t think I am capable of enjoying a screenplay version of the Dune series.  This director’s translation isn’t any better than any other.  I expect the Dune 3 film will be truly awful.",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A BLOATED UNEVEN MESS OF A FILM, THAT BARELY RESEMBLES IT'S SOURCE MATERIAL. VAPID SET PIECES DOTTED HERE AND THERE ON A FILM-SCAPE OF GORGEOUS BUT UNDER POPULATED DESERT LANDS, DO LITTLE TO EXCUSE THE UTTER EMPTINESS OF THIS ADAPTATION. BY THE END IT STILL LEAVES THE MAJORITY OF THE BOOKS THEMES AND FACTIONS, POLITICS AND WORLD UNEXPLORED. IT IS SHALLOW AS THE PUDDLE IS SHALLOW, DIRTY AND USELESS.",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I now believe in Lisan Al Gaib. To this day, the BEST in-cinema experience I’ve ever had",
    "date": "2025-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "As I said before, the first part was just a prologue to a big something in the making and here we go! \n\nThis is a well-crafted movie👌\n\nIt goes without saying that the narrative is intersecting with a lot of islamic beliefs in a suspicious way; Lisan Al-Gaib, Muad’Dib, Mahdi, Fedaykin, the way of Sujud, women chadors and even the Atreides & Arrakis has something to do with the Maturidis & Iraq. If Edward Said still with us, he would have a lot to say! I found that very unpleasant and that's why the rating.",
    "date": "2025-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "O filme perfeito não exis-",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Simply art, a well-cared-for 90s-style film with a good plot, excellent special effects, a visual and auditory marvel.",
    "date": "2025-10-10"
  }
]