[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "very funny and entertaining",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A great cast, lots of laughs from good and lame jokes with some interesting twists. \nGal, Dwayne and Ryan work together well and if you don’t take the movie too seriously it’s a great piece of fun.",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Perfect example of how hollywood is so dominated by a single group that these movies just suck and are repetitive bullshit with shitty plots and the same shitty actors",
    "date": "2025-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I managed to watch the whole movie, but was sickly sweet and unbearably corny, the usual output from Hollywood these days when they to make slick films,",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It was a funny and amusing movie to watch. However the story lack of something to catch the audience. The acting of the protagonists carries the movie in my opinion. Overall it is a good movie to watch in a Sunday. and i love Dwanye Johnson",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The Rock did his job solid. Ryan Reynolds tho, does he have anything further to offer? Hes played the same character over and over again since Waiting. Even Deapool is just the Waiting character. I didnt believe him in character because I really see him as a  one note actor. I'd love to see him try and do a movie thats not that same character. Was a cute movie over all. Just disappointed in Reynolds.",
    "date": "2025-10-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Listen this is an alright movie, the plot twist is weird, but overall acting pretty good and story",
    "date": "2025-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Critics got this completely wrong. Good fun, great cast!",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Get about 5 minutes in and you realize this is not a serious movie. I realized it during the scaffolding sequence at the beginning of the movie, its just so unrealistic its pretty funny, plus the intended humor isn't that bad either",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It was a bit slow here and there, thin plot but a good amount of humor that it's worth a watch. Ryan Reynolds saves the day.",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Predictable, bad acting, cant ryan reynolds stop playing the same character, hes got some some range, but in the past 15 years hes been playing the same one. Gadot was good in this one and that says a lot, the rock boring. The storyline very basic, you kinda know what will happen",
    "date": "2025-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "a good plot twisttttt",
    "date": "2025-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny, full of action and just the right movie when you want to Netflix-and-chill without thinking too much. \nGal Gadot is absolutely gorgeous!!",
    "date": "2025-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Maybe peak Netflix blockbuster. That's not saying much, but it was entertaining enough whereas most of these are just formulaic, factory produced junk.",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Persuaded to watch it with a friend and all the witticism from Reynolds didn’t make up for the tacky story.  But it does keep you somewhat entertained, but it was juvenile.  I employed them visiting many places, but I still didn’t feel like I was there, but rather a set.  Saw on Netflix.",
    "date": "2025-07-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Red Notice is exactly the type of movie I thought it would be. It's not doing anything new but the film has some exciting action scenes, some fun chemistry between Reynolds and Johnson and was just an all around good time. It's not gonna go down in history as one of the greatest movies ever and that's okay.",
    "date": "2025-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Definitely one of the bigger plot twisted movies loved it",
    "date": "2025-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's not bad. It's pretty solidly made all around. Reynolds & Johnson got good chemistry. Reminds me of Johnson with Statham in the F&F movies. The dialouge is pretty witty with some good jokes and very light hearted and self aware which helps. Gadot's even pretty good too and fun. It can still be a bit expose heavy at certain times with explaining things though. The fights ar fun, creative, and got a good mix of CGI & practical. Smetimes the CGI looks bad but it's used in creative ways. The directions pretty good and it's a colorful film to look at with lots of great locations to. It's filled with twists and turns and moves very fast the entire way. If there is one big strike here it's the plot. The plot makes perfect sense and isn't hard to follow. But it's so farfetched and reminds me of the Now You See Me movies where it really pushes the boundry of what is plausible and what isn't. So many plot twists that it almost takes you out of things unless you mindlessly just accept it. This is why it can be expose heavy because after every twist it has to stop and explain why the twist worked with either expose or Usual Suspects flashbacks. It's not easy to see it at all coming and there really isn't any signs. It's the only major strike that holds it back from being good. If they do do the sequel this baits than hopefully they streamline things a bit. It's a cool mix of adventure, action, and a heist thriller. It just needed to not get so convuluted and over the top with it's twists and turns. Anyone though who is a fan of any actors in this or the director may wanna check it out still. Or if want a unique heist adventure flick with some flaws.",
    "date": "2025-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Two actors who can only play a single role that is now just incredibly boring. TheRock as a detective/policeman who can do everything and knows everything and who has contracts written in that he can't lose a fight kills everything that would matter in this movie if it were done right. Reyn Reynolds in his typical role as a pipsqueak is also incredibly obsolete.",
    "date": "2025-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "“Red Notice” feels like Netflix lit a pile of cash on fire—just to watch The Rock be The Rock and Ryan Reynolds crack jokes like he’s in a blooper reel. It’s flashy, loud, and completely hollow. Sure, the sets are gorgeous and the stars are charming (and ridiculously attractive), but the plot? So predictable it hurts. I laughed, yes—but more in disbelief than delight. It’s the cinematic equivalent of junk food: mildly satisfying in the moment, instantly forgettable, and somehow still teasing a sequel. Disappointed, amused, and slightly annoyed—I guess that’s entertainment now.",
    "date": "2025-06-19"
  }
]