[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "SPOILER ALERT:\n\nI enjoyed this movie a lot, the acting was great all around but there's a big hole in the plot at the end.  So Tyler and Kassi staged Don's suicide but what happened to the woman that Don tried to suffocate but survived?   Did she not report it to the police and went along with the coverup? I seriously doubt that that's something a normal would do.  That part was never explained.",
    "date": "2025-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Good acting, Solid plot, Overall good experience. 4 stars instead of 4.5 because of the rushed and perhaps meaningless ending.",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The writing isn’t bad, it definitely had potential but between the bad acting and cinematography it was a real struggle to actually finish it.",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I wanted to like this. Well done to the casts especially Dylan. However the ending made absolutely no sense. I love a good twist but this is not!",
    "date": "2025-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Great film that shows how evil can hide in plain sight. Good performances all round",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I found this movie to be really good. Honestly, it had good moment, and showed the duality of the 2 main characters. The ending was a twist that I truly enjoyed.",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Starts off well but despite some great acting especially from Plummer this is let down by the screenplay which although subtle and avoiding genre cliches becomes totally unstuck, managing to both turn drearily predictable in details, and to stretch suspension of disbelief to unfortunate breaking point in story arc. It's a darn shame, this could have been a really great film.",
    "date": "2025-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great suspenseful twisty thriller with a great ending.",
    "date": "2025-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Had never heard of it- glad I downloaded it randomly. \nA super great movie, really good- original script. Interesting plot development. Dylan McDermott should get way more parts, always irritates me when hollywood doesn't throw more stuff at great actors. This is an easy addition to your collection.",
    "date": "2025-06-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Amazing film. Can't believe this flew under my radar for so many years. Lots of unexpected twists and faux climactic endings that had me really questioning many times where was it going. As far as the ending, I saw so many reviews raving about the movie until the real ending transpired, so I was wincing waiting for the big let down. NOT AT ALL! Spoiler Alert **** The ending was perfect. It has to be appreciated with context. This was a very tight knit and heavily religious community. If the dad were to be revealed as the Clovehitch killer, who was a pillar of the community, it would have traumatized the whole community for a generation. But importantly, it would have destroyed the son's mom and little sister. By staging his death as an accident/suicide, it spared everyone of this trauma. However, I will concede, this ending didn't bring any closure to the victims' families. But the son was looking out for his family and the community at large. It was a Faustian bargain, but I think it worked for the tone of the movie. Highly recommended.",
    "date": "2025-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Absolutely fantastic family suspense movie with a super explosive ending. I wished it ended a lot different but either way it’s an awesome movie",
    "date": "2025-05-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The acting is like watching community theater.  Bad community theater.",
    "date": "2025-04-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A murder mystery film with not a whole lot of mystery going on.",
    "date": "2025-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Feels very disjointed at times.",
    "date": "2025-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The Clovehitch Killer's pacing makes it seem more like an episode of a tv series than a movie, and its plot definitely suffers; however, its acting and feeling of suspense somewhat makes up for it.",
    "date": "2025-04-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It is a good movie. Very engaging and interesting. Predictable and does not answer all questions though.",
    "date": "2025-03-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A significantly solid look at a fictionalized version of Dennis Rader and what the reality of violent paraphilia does to the people around the offender.\n\nMuch more about the familial setting than seeing a serial offender perform repeated acts of murder, it’s unlikely to please everyone looking for the Hannibal Lecter tropes.\n\nIf you’re seeing anyone whine about (lmfao) “bigotry” against Christians in reference to this movie, you shouldn’t even waste your time explaining to them where BTK was when he sent the communications which resulted in his arrest…\n\nThese types of pasteys are too slow and gullible to bother checking accuracy prior to whining.",
    "date": "2025-03-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A decent movie with good performances and an interesting story. The movie builds the tension really well and kept my interest/attention really well. The whole religious angle of the over-religious town also adds to the storyline. I will recommend this thriller.",
    "date": "2025-03-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The film lives up to the expectations of the serial killer movie genre. The emotional turmoil experienced by a teenager upon discovering their father's heinous crimes is intense. Every actor in the movie effectively conveyed their character's role, especially Dylan McDermott. I just think it isn't original and that is my only problem. It gives you that BTK type story again and that's why I gave it three stars.",
    "date": "2025-03-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "To say the ending was awful would be an understatement, I almost had to turn it off.",
    "date": "2025-02-14"
  }
]