[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Es bastante buena, con un buen nivel siendo continuidad de la película anterior, ahora la trama se enfoca en drácula como abuelo y el hijo de Jony para darle un enfoque más infantil y tierno a la serie (sin dejar de lado intentar implementar el miedo pero sin que este se apodere de la gente, lo cual resulta coherente con la anterior entrega), es familiar, un poco reducido pero mantiene su toque de comedia, agradable para pasar el rato, con un buen mensaje de saber evolucionar y dejar de lado los prejuicios, es buena y valiosa (no perfecta, y eso no me interesa, hay que saber valorar las cosas y apreciar el esfuerzo y originalidad de las personas que brindan productos buenos como estos, detrás de todo hay bastante más que uno no ve y en cuanto te pones a pensar en eso te das cuenta de que lo que ofrecen es mejor de lo que a veces parece).",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Took a lot of what was good about the first one, made it funnier and places, but I found the main plot line less interesting and don’t like the cliche of the overprotective mother.\n\nGrade: 44",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is my favorite Hotel Transylvania movie. It’s funnier, and has more going on than its predecessor, which makes it a lot more entertaining to watch.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's Not Bad. Like there is pieces here of a good film but it just feels like multiple seperate sories going on. The first wasn't exacty the sharpest thing, but it was focused on really one thing after you strip away the antics. The voice acting and animation is all good here and up to the same quality of the first in a sense. The setting isn't as memorable though and the creativity isn't as strong as last time. But it's still there and the humor works well still. The Sony Phone product placement is a bit out of place. Music is good and pretty much the same pros and cons of the first. Everything else isn't bad. This does what a sequel is supposed to do. Add a new character, expands on ideas and existing characters, but it just can't do it in a fluid way. The jumping arund between Mavis & Johnny in Subrubia while they try and train the baby feels like two seperate stories. Which would probably still work fine enough bringing it together if it also didn't feel like the final 25 minutes felt like ANOTHER completely seperate story. The introduction of the grandfather and all feels like a completely seperate story AGAIN and feels just out of sorts introducing whole new dynamics and character so late. It works fine enough and all 3 stories pretty much go the way you thin it all will just like the first to. It makes perfect sense and does work fine enough for an above average sequel. If you like any voice actors here or are a big fan of the first than this might be worth checking out. But most would'nt miss that much here. It's still pretty harmless and for kids.",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I certainly thought it was as funny as the first one!",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It’s not as good as the first, but still pretty innocent and fun",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Not bad for a sequel. It offers more emotion to the characters, and the animation has been improved. I liked it.",
    "date": "2025-09-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Not sure if it's a hot take, but I had a lot of fun here. Haven't seen this in prolly 9 or 10 years. I've always loved this franchise, and the first one is one of my favorite animated films. And I think this is a very worthy follow up. Just tons of smiles. Don't think I've seen the 3rd and 4th films so I look forward to those.",
    "date": "2025-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "De mesmo nível ao primeiro filme, mas aqui claramente o Humor e a diversão grita mais, mas é um bom filme.",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I had a blast with this movie. Definitely recommend it",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 29 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated PG for Rude Humor, Action and Some Scary Images!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Now attractions worldwide!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "“Not bad, not bad.” —Beetlejuice grandma, 1988",
    "date": "2025-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This may be my favourite out of the Hotel Transylvania franchise. It is so exciting to move onward the story of Johnny & Mavis getting married & having a child named Dennis.\n\nFor the subplots, it was exciting for Mavis to explore the real world & meet the in-laws. And Dracula wanted to see Dennis be a vampire just like his ancestors.\n\nHowever, the jokes & meaning did get Deja vu & unoriginal with dome gross humour & never seen before Vlad finally coming across the monsters & their human relationships.",
    "date": "2025-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Why?",
    "date": "2025-03-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Best film in this series.",
    "date": "2025-03-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I turned off the adult in me and enjoyed this fun cartoon, though it was repetitious after the first one. Strange how Top Critics like it better but the audience likes it less than the first one.",
    "date": "2025-02-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A pretty charming sequel that makes up for its thinner plot with better snappier jokes and some fun new dynamics with the potentially fangless ginger grandchild. The celebrity cameos were fun, though I wish Mel Brooks’ vampire and bat-minions weren’t so rushed since they only appear for the last 10 minutes. Mavis kind of gets relegated to being the worried no-fun mom, but luckily this partially avoided when she gets to have some fun exploring California to bring out her inner tourist mania. Nick Offerman and Megan Mullaly also kill it as the Californian in-laws. It’s a pretty well-rounded sequel with a much more consistent level of quality compared to the first one.",
    "date": "2025-01-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's just characters accomplishing nothing but it's fun",
    "date": "2025-01-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Rating: 7/10. 71/100",
    "date": "2025-01-14"
  }
]