[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 29 minutes!!!!!!!!!!!!!!!!!!!!! All ages admitted!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Is a rip off of goose bumps and hocus Pocus",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very fun. Serves its purpose and its all i can ask for",
    "date": "2025-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It gives me goosebumps 2 vibes but it’s better in every way hopefully there will be a sequel",
    "date": "2025-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie started out pretty good and I was looking forward to a fun night. And then it got ridiculously stupid. Is all these monsters coming to life and chasing people and it just went on and on and on. I really don’t believe this is very good for little kids because it is pretty violent. I finally turned it off after 15 minutes of chasing monsters. It got really boring. There was no story. And they tried to put a little comedy in, which was stupid too. Not recommended.",
    "date": "2024-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Decent film for the family. Not too spooky. Similar to Hubie Halloween.",
    "date": "2024-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "*The Curse of Bridge Hollow* is a decent, if generic, Halloween family film that delivers just enough fun for a lighthearted watch. Having enjoyed Marlon Wayans in *White Chicks* and *Scary Movie*, I was curious to see him in this. While the film doesn’t capture the same charm as those earlier works, it’s still entertaining enough for a spooky movie marathon. The special effects are solid, and the acting is passable, but nothing particularly standout. Some of the jokes hit the mark, but others fall flat, adding to the overall mediocrity of the film. It's all very predictable, but I didn’t mind much—I had fun watching it. If it had been geared more toward an adult audience, it probably would have been better, but for a family-friendly Halloween film, it's enjoyable enough. Perfect for a casual watch, but not one that will stick with you.",
    "date": "2024-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The acting was pretty bad. The story was boring. I can see kids liking it but showing up in the horror section of Netflix was ridiculous.",
    "date": "2024-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "After watching 13 minutes of it, I decided not to watch any more of it. It’s boring and modern, and most definitely suited for younger children. I decided to give it ago because I’m all into spooky stuff, but I find it unrealistic and it did not live up to my expectations.",
    "date": "2024-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Marion Wayans is a guarantee for a any good movie.",
    "date": "2024-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie had me on the edge for 1:3q1 minutes. the plot is much similar to elf, and IT by stephen king. the dad definitely had a MASSIVE crush on his daughter!!!! AMAZING MUST WATCH MOVIE.",
    "date": "2024-06-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The Curse of Bridge Hollow was amazing!!!",
    "date": "2024-05-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie was good, for 5 year old kids. The storyline is super boring and the acting seemed lifeless. It just felt like this movie was about waiting until the actors said their lines. Very poor delivery. All the actors were definitely not right for this movie and script.",
    "date": "2023-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie gave me Hallmark vibes with the perfect family town and mediocre writing with a lot of plot holes and weird dialogues while also giving BIG Disney vibes. Even though, it was still fun! Perfect Halloween themed movie for the family! The adventure, the healthy family dynamic, the safe town environment, and dad bonding is something I can really appreciate.",
    "date": "2023-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "not too good of a movie, it was pretty boring and the plot is like a ripoff of ghostbusters and easily predictable",
    "date": "2023-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This is not very good. The story is really basic and unimaginative. The humour relies solely on Marlon Wayans and he is the most entertaining aspect of this film. The music is mostly good, if unimaginative. The sound design and cinematography are very forgettable. I didn't even like the editing, most of the time they just showed the person that was speaking and not the other people's reactions. The acting is average at best and the characters they are playing are exceptionally generic. The big problem is that most of the time they say their lines then wait, it's all about them delivering lines and no reactions. I blame the director on that one. The effects are actually pretty weak and unconvincing for 2022. Look at them driving the car in the establishing sequence. It looks bad! The writing and directing are pretty weak, certainly below average. It is just about engaging enough to hold my attention to the end. I will not be watching it again, please do not waste your time with a sequel unless you're going to do something wildly different with it.",
    "date": "2023-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Really good film to watch at Halloween time!",
    "date": "2023-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A really entertaining movie, only complaint is that it seems to go super fast.",
    "date": "2023-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The Curse of Bridge Hollow (2022) is a pretty cute family movie for spooky vibes around Halloween. The Fall look of this town decorated for Halloween looks great. The performances are silly enough to be entertaining. It wants to be Hocus Pocus, Goosebumps, Nightbooks, or Halloweentown, although The Curse of Bridge Hollow just is not on that level. Marlon Wayans just goes for it and cuts down skeleton football players with a chainsaw for a fun sequence. Priah Ferguson plays a great foil for Wayans, but Kelly Rowland should have gotten something to do besides bake poorly.",
    "date": "2023-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Also die Effekte waren gar nicht mal so schlecht aber die Filme werden langsam immer das gleich und der Film an sich war auch nicht spannend und erst recht nicht lustig",
    "date": "2023-07-15"
  }
]