[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It works well as a PSA for consumer awareness of possible pathogens in food. However, its portrayal carries a very obvious political bias and overlooks possible problems with the regulation they support such as the ability to provide adequate food to consumers, negative health effects of chemicals and hormones that are required to solve this problem, and the economic practicality of their proposed legislation. In my opinion, it uses the food poisoning issue to scapegoat certain corporations to support their legislation for regulation. This proposed regulation isn’t necessarily bad, but the documentary does not give a fair or unbiased look at the issue.",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Yet another documentary about how big meat lobby pressures the government on lax or non existent regulation on food safety. Cliff notes on this film. Currently. Meat and even vegetable producers can sell products with e. Coli and salmonella, legally , with no repercussions. Because bug meat does not care about your health. They care about money. E. coli is a bacteria that grows in the intestines of warm bodies organisms. Read cows and pigs and expelled via fecal matter. When this 💩 is thrown into rivers that later are used to irrigate vegetables , that’s how you get e Coli on vegetables. And on meat is kind of obvios. So going vegan, not even organic, prevents you from getting food poisoning. But , it all starts with CAFO’s and the horrible and unsanitary and Petrie dish conditions of meat factories 🍿🍿🍿🍿/5 on Netflix",
    "date": "2025-02-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Horrific information on how money made is more important to manufacturers than safe food.  Equally horrific is how only 69% of viewers found this to be a problem.  We can't let these rich corporations continue killing us!",
    "date": "2024-03-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This documentary came out in 2023. Most of the evidence that they use happened at least 10 to 20 years ago, under the Clinton and Obama administration that they seemingly praise for higher regulation yet they just made the documentary complaining that we still have a problem. I wonder how much of this was sponsored by The Who and The WEF. Seems like perfect timing when they tell the global population to eat bugs, farmers are protesting across the world, and the US government pushing for further regulatory power over all industry specifically food.",
    "date": "2024-01-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "quite interesting documentary of food problem in usa. kinda rip",
    "date": "2024-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A must watch and get inspired perhaps to grow your own food .",
    "date": "2023-12-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very meaty documentary, which surprisingly does not pull punches despite its establishment, mainstream origins.  I do wonder why Congresswoman DeLauro final pleading if the electorate to demand more of Congress - most Americans are sadly ignorant on the issue - and she is knowledgeable and powerful enough to stir a hornets nest on her own. That is not a critique but an ask.",
    "date": "2023-12-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "An important film everyone should watch!!",
    "date": "2023-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Poisoned is an aggressively mediocre documentary oversold by its evocative title. This film features some interesting (albeit low-stakes) interviews, but they're edited so manipulatively that I feel embarrassed for the filmmakers and question the veracity of the points they were pushing. \nAnd one more thing...normally I wouldn't comment on the cinematography for a documentary, but every sit-down interview in Poisoned is inexplicably filmed with a bobbing handheld camera. It gives the interviews a casual, sitcom-like feel that seems downright disrespectful toward the people being interviewed (in particular the victims and families of victims).\nThere are plenty of other fish in the sea when it comes to food safety docs, and most of them are better than this one.",
    "date": "2023-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The subject was bacterial outbreaks. The title and description made it seem a lot broader in scope. Underwhelming...",
    "date": "2023-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "30 people die annually from ecoli poisoning in the US. Why the scare?   Seems like a movie designed to promote the lawyers.",
    "date": "2023-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A must see. It's safety information. Better than sorry. The documentary gives the space  to both sides so they can defend their case… even to the point where one says you'd need to test 150 samples to get a proper result… which they do (no spoiler ahead) : seek the results for yourself while teaching it. The doc points a problem and lives the door open to people to make their choice as consumers but also to those big food companies to do better.",
    "date": "2023-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This documentary will open your eyes to the dangers that exist in the grocery store. Fascinating to watch but will make you question everything you eat. Don't watch it hungry..,",
    "date": "2023-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Netflix's docus are mostly amazing, but this one is a bit dull because says nothing new. Most ordinary citizens, or I already know these. I was hoping to see shocking, deep-inside restaurants or something like that.",
    "date": "2023-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A lot of fear mongering. If you eat anything from the store you are going to die!!!!!! There were some good and interesting points but what's the fix. I heard how we are all going to die if we eat chicken. Did small samples for testing no legitimate testing. Testing one small sample is not enough. Again how do we fix it. Telling me a problem without steps to mitigate is just whining and bitching. I see enough of that on the news. The victims is sad and I'm glad those responsible were held accountable.",
    "date": "2023-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Americans deserves better. Contrary to the spin from politicians and industry groups the US does not have the safest food production system in the world. It has one of the worst. Yet again money has influenced the outcome and Americans are dying because of it. What makes it worse is that poisonous US grown and produced food is been exported to the world.",
    "date": "2023-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Fully biased. Excellent for informational purposes. Food industry is improving every year and QC is getting better and better. Since food contamination has been an issue throughout human history, we live in a safer world than our parents used to live. The focus on a few tragedies can't paint the big picture as the movie wants to portray. Education on how to prepare foods is key.",
    "date": "2023-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Watching this made me feel poisoned. I get camera movement gives it a \"real\" feeling but this looks like the cameraman was trying to ride a unicycle and never took his hand off of the zoom.",
    "date": "2023-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "\"Poisoned\" exposes the dark side of the food industry, revealing crime, corruption, negligence and waste. This wake-up call should leave viewers rightfully angered by a system that jeopardizes their health. While the film feels hopeless at times, it highlights progress and urges consumers to pressure Congress to make needed changes. The documentary excels in explaining the American food system and the current issues being faced, backed by a captivating score, sharp editing and top-notch production. It vividly showcases the severity of the U.S. food safety crisis and humanizes victims through their poignant interviews.\n\nAs someone who follows and reports on the impact of foodborne illness, I hope \"Poisoned\" sparks crucial attention and action. The alarm has been sounded on the country's largest streaming platform. How will American consumers respond?",
    "date": "2023-08-02"
  }
]