[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Amazing action in this movie and Chris Hemsworth did good acting in this",
    "date": "2025-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I WOULD NOT CHANGE ANYTHING, I REALLY LIKE IT BECAUSE OF ALL THE ACTION, THE FIGHT SCENES AND THE STORY. ALSO THE ACTORS ARE GOOD, THE SECOND ONE IS ALSO GOOD BUT NOT AS GOOD AS THE FIRST ONE",
    "date": "2025-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Just wow!!! Kinda hard to hear dialog and that's what brings it down for me (don't care for subtitles). But seamless action, choreography, tone is what you want in a great action movie. Who watches an action movie for plot??? I want fun, death and spectacle. This movie has all 3 in spades. Hemsworth could be the next Stallone (Yes that's a compliment) if he wasn't busy spending more time with family and being a great guy in general.",
    "date": "2025-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The action on this move is amazing, the fight choreography and hand to hand combat or guns, or knives in that fact, it was an ok story, but  this is almost non stop entertainment.",
    "date": "2025-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great action movie. Watched it multiple times and it holds up as great each time you watch it",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "An amazing, action-packed movie with incredible camera angles and intense action footage.",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Only watch because of the action.",
    "date": "2025-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "John Wick'esque....kill everyone for a kid, instead of a dog!",
    "date": "2025-05-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Très bon film d'action.",
    "date": "2025-04-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This is a good movie. It has lots of action, and blood. But it can be confusing at times, because of the subtitles.",
    "date": "2025-04-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "More movies like this need to be made.",
    "date": "2025-04-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great action film - put it in your list!",
    "date": "2025-03-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very underrated and enjoyable action movie!",
    "date": "2025-03-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie. To many social justice pronoun users  putting this down. White savior comments totally dismissing Randeep Hooda. Dude was kicking ass along with Hemsworth. Golshifteh Farahani leads the team and puts in work and is a total badass. Rudhraksh Jaiswal was very good as well, he performed better then alot of the mainstream actors today. \n\nBody count is high, and you have to take it like a good ol shoot em up movie. Fight seens are great and the car chase seens were great.",
    "date": "2025-03-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Extraction was the most appropriate film for 2020. Where people were locked in their homes, it delivered exciting and thrilling action. Add to that, Chris Hemsworth was perfectly cast as Tyler.",
    "date": "2025-02-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Its not your average action movie with a hero, its more realistic.. (still a hollywood movie) and also has nicely written characters.",
    "date": "2025-02-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Initial growing reluctance eventually grows to be entertained once the captivation solidifies the grip. This action thriller is a categorical guarantee on entertaining proportions with enough adrenaline to boost past the genre’s decent genericities through agreeably spectacular sequences and Hemsworth at his probable peaked form, persuasively imprinting anticipation for more after lingering with an impressive note to further deviate from the genre’s troublesome repetition. (B+)",
    "date": "2025-02-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Solid!  Action, strong characters and acting.",
    "date": "2025-02-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It’s refreshing to stumble across an action film where the protagonist puts up a good fight and ends up getting injured in the process; this film is certainly a good example of it. Tyler struggles and sacrifices a lot to make sure his goals are met, which can’t be said for a lot of action movies, where the protagonist is overpowered and indestructible. The only thing that takes away from Extraction is the CGI, which probably would have fit seamlessly into the movie if it just had a bit more work done to it. Nevertheless, this film is worth a watch.",
    "date": "2025-02-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I was enthralled with the movie once it started! I couldn't keep my eyes off the screen! Loved the story and the action! Definitely worth watching!",
    "date": "2025-01-31"
  }
]