[
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "well picturized action scenes, but acting, story, script are worse.",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "From the very bottom of the Netflix barrel, this badly directed and edited movie also suffers from a muddled script, with a silly and unbelievable plot that is simplistic when summarized at the end, but absurd and convoluted while unfolding and riddled with disjointed flashbacks and voice-overs, One has to give the actors credit for trying to put some life into the film, but no amount of acting can overcome this fractured production. The funding came from Netflix, but was this movie actually made by professionals?",
    "date": "2024-12-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Well acted and shot, but still a supremely generic action film with no story or intrigue to back it up.",
    "date": "2024-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Heart of the Hunter (2024) is another generic Netflix action thriller except this time it's in South Africa. I liked hearing the Zulu and Xhosa languages from the strong actors, However, the story is nearly incoherent between the erratic editing and poor writing. None of the characters mattered to me and I could not describe the plot to you with a gun to my head. The direction is frustrating for the storytelling, but the action scenes are momentarily exciting. The actors try their best, but this was frustrating and ultimately boring.",
    "date": "2024-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great cinematic. Perfect",
    "date": "2024-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "In my opinion, the movie uses very good camera and audio visual equipment and the crew members and the filmmakers have played their roles very well. I really liked it.",
    "date": "2024-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This is a wrost movie in acting and screenplay and action.g. how rotten tomatoes give it 67% rating i donot understand it.",
    "date": "2024-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I liked this movie, I would have liked it better if it was a series.",
    "date": "2024-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "What the heck is happening. The film introduces multiple characters and no time to set anything up nor establish a relationship with any of these characters. There’s never a sense as to why any of this is happening and why they all do the dumbest things. That’s why it’s feels so boring and the acting and dialogue are very subpar.",
    "date": "2024-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "First time I turned off after 30 minutes being bored. Also weird the bad man of the plot carries the most Jewish name for no reason. South African acting pool must be limited, many can’t act, can’t imagine how poor the rest of this movie is",
    "date": "2024-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I truelly loved the movie. Knowing South Africa and regularly visiting the places named in the book. They could have made more of the karoo chase, but overall excellent",
    "date": "2024-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Really bad plot. Terrible effects and acting.. probably the worst thing to come out in 2024.",
    "date": "2024-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Could this production team please do more Deon Meyer books into movies!!!!!",
    "date": "2024-04-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A totally predictable storyline tarted up with some action and nice photography. Skip, unless you have ample time to waste.",
    "date": "2024-04-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie sucked. Slow and boring. I was expecting so much more.",
    "date": "2024-04-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Its a bad movie, the main problem is the actors. They have literally no feelings..",
    "date": "2024-04-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely amazing!!! Wow",
    "date": "2024-04-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Un tipo de film poco trascendente que trata de la politica interna de Sudafrica. \nDesde el comienzo me costó entender , el 90% de los actores son negros y muy parecidos entre ellos por lo cual pierdo el hilo de la trama sobre quién es quién.  Un Film Sudafricano , aurrido para quienes acostumbramos ver peliculas editadas en Estados Unidos o Europa Occidental. \nLos criticos de \"escritorio\" que se expresan con palabras soporíferas pueden estar de para bienes.",
    "date": "2024-04-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not a bad movie, but what's with all the dialogue in a foreign language with no subtitles? Todays movie makers are more concerned with form over function. Dark scenes no one can see and dialogue that goes from a whisper to a cannon shot.",
    "date": "2024-04-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "the book is incredible. the movie is... respectable.",
    "date": "2024-04-02"
  }
]