[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely love this movie and book! So wholesome and heartwarming that you wish you could watch/read it again for the first time &lt;3",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Good production quality and acting. Otherwise a complete borefest. There were a few instances with good plot movement, but there were too many long drawn out scenes of casual conversation that do not move the plot along. Had high hopes with the good reviews but left disappointed. Would recommend avoiding.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Heartfelt and Tied Together",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I LIKED IT BECAUSE IT WAS ROMANTIC AND HAD A LOT OF DRAMA WHEN THE BOYS REALIZED THE LETTERS SHE HAD WRITTEN WHEN SHE WAS YOUNGER",
    "date": "2025-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Now I know where Anyone but You got the idea for the film. What a cute and adorable teen rom com",
    "date": "2025-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I could say this is one of my favorite movies. I really love the storyline and the romance between Peter Kavinsky and Lara Jean. It’s perfect for teens sweet but not overly romantic, with just the right distance. I love everything about it.\nEvelyn Nicol Ramirez Rozo 1003",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Hello, my name is Ana Alzate. I want to say that this movie is very beautiful, it is full of feeling and makes you put yourself in the shoes of the characters. I also want to say that this movie was one of the first that I saw.",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Loved loved loved the movie! and Peter Kavinsky is such an amazing man. i need one.",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "To All the Boys I’ve Loved Before is a romantic comedy movie directed by Michael Fimognari and Susan Johnson based by the book writted by Jenny han played by Lana condor and Noah Centineo.The film tells a story of a teenage girl named Lara Jean Song Covey who write secrets love letters to her 5 crushes but one day accidentally these letters will be sent to the 5 boys but only 1 boy will read it,Peter Kavinsky a popular boy at her school,Peter will have a great idea,the 2 teenagers are going to pretend to be a couple to make jealous Peter ex girlfriend, but the more time passes, the more the feelings became real.The plot seems to be simple but still interesting,there are no special effects, but they are not needed in this kind of story. The photography is soft and colorful, which perfectly match the romantic and teenage atmosphere of the film.The acting is really believable and natural,the chemistry between Lana Condor and Noah Centineo is perfect and emotive,it shows that their acting is very well done.The script is very well written,because it show natural and authentic dialogue,It makes the story simple and cute. Honestly, It’s one of the best films I’ve ever seen,I found this movie funny and emotive,if you are someone who loves romance it’s a perfect movie for you,there are many parts (To All the Boys I’ve Loved Before 1, To All the Boys I've Loved Before 2 and To All the Boys I've Loved Before 3) so if you liked the first part you can see the others ones.",
    "date": "2025-04-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What a goddamn masterpiece.\n\nNoah Centineo and Lana Condor need to spin the block and make another romcom together. For me",
    "date": "2025-03-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "To All the Boys I've Loved Before is a rom-com that has been hugely successful and watched by many teenagers all over the world. I watched it when I was fifteen years old and, sometimes, I still watch it in my free time. \n\nThe plot and the mood of the movie is extremely sweet and romantic. The acting from the principal actors is really touching. When you watch the movie, you will feel happy, sad, betrayed and romantic. \n\nThe feeling that the characters have will be felt by you too. If I can talk about my favorite character, it is Kitty, the little sister. She's really funny and maybe, somewhat overconfident. However, without her, Lara-Jean would not have been with her lover, so I think Kitty has an important place on the movie.\n\nIf you are a person who likes all the romantic stuff that we dream of, I highly recommended seeing this beautiful movie.",
    "date": "2025-02-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is not talked about enough. It’s so good! I’ve seen it many times in the years since it’s come out and it holds up. It had a great soundtrack and I really like the Covey family dynamic (not a toxic family). Lana Condor and Anna Cathcart’s delivery is so unique and great.",
    "date": "2025-01-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "At the 1:16:06 The chess game that was played in the movie was unreal. The girl just made the illegal move and that is not even a checkmate!!! as a real fan o chess I can't put here more than a one star",
    "date": "2025-01-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved this so much - it truly changed my view on teenage love and really helped me understand more. 100% recommend, I have nothing bad to say about this movie. A work of art.",
    "date": "2024-12-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Honestly, I watched this for the first time with my family. This movie made me feel such joy that I have never felt before. The character Lara Jean truly embodies what it is like to be a teenage girl. The film is a basic idea, but one thing that makes it stand out is its relatability.",
    "date": "2024-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I watched this movie several times, and it still touches my heart. I feel like the characters are based on real people. In fact, I really see myself in Lara Jean or my mother in Margot. It might bother some watchers, but I liked the fact that it is easy to realize the movie is a book adaptation by how much time characters spend just talking. Most book adaptations cut off the considerly boring part of converstation and leave just the action, which most of the time kills the whole plot and point of the story. As someone who usually watches only 2000s \nrom-coms, mostly classics, because Netflix kind of forgot how to make good shows, yet I fell in love with this movie. Definitely Worth watching!",
    "date": "2024-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Totally a teen-fic vibe but it has so much cutesy and sweet scenes that give me a great \"escape\" romance film.",
    "date": "2024-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A movie that focuses on naive love and romantic chemistry. This is a nice anomaly from the overwhelming wave of sexually driven, low budget \"romance\" films.",
    "date": "2024-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Had me giggling. One of the best teen romances I've ever seen.",
    "date": "2024-11-01"
  }
]