[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A good slow-burning thriller with a genuine feel about it, worth a watch just for Nikolaj Coster-Waldau's performance alone.",
    "date": "2025-09-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Good locations, but the plot is full of holes. There's no depth into the protagonists' psychology, and the motivations for the crime are laughable. Good for a casual evening.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It got corny quick. Cmon arrows? At humans? Corn.",
    "date": "2025-05-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Very solid movie.  Well written & directed.  Rock solid casting and acting.  I enjoy dramas & thrillers.\n\nThe doctor would have looked banged up when he showed up in the RV.  Other than that nothing blatantly unbelievable happened.\n\nTo get such poor tomato scores from the critics makes me wonder who’s paying them.  To be honest, I doubt they even watch the whole film when their reviews are that far off.",
    "date": "2025-05-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wow, I'm pleasantly surprised. The RT critics score is only twenty something. The pacing was good and kept me guessing. I'd give it an 80% score. I considered it because it is leaving Netflix soon , thought I'd give it a try. I'm so glad I did.",
    "date": "2025-05-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Interesting, but went between some action & too slow.",
    "date": "2025-05-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Acting was substandard; the considerable injuries the two main characters sustained appeared to vanish in the following scenes; and the plot was dopey. Wallis was stale and boring, much like her role in Peaky Blinders. Zahn McClarnon was underutilized. Was hoping for quite a bit more out of this movie.",
    "date": "2025-03-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Sayang oras. Napakabagal ng kwento. Napakarami ding butas. Un killer parang lalabas lang sa ending tapos the end na.",
    "date": "2025-03-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I know there's something special about a movie when it has an extremely low critic rating and an extremely high audience rating.  It's almost like these so-called critics don't have a clue.",
    "date": "2025-03-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A very good movie, a lot of action, suspense, plot twists, keep you entertained all the time.",
    "date": "2025-01-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A genuine thriller, but lots of plot holes and loose threads. Could have used a bit more storytelling to back up the exciting pacing and decent performances.",
    "date": "2025-01-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Trust the Tomatometer- this one had potential, the director dipped the ball.",
    "date": "2024-12-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "My guess is the director refused to participate at some sex party or something and Hollywood is punishing him with bad reviews.",
    "date": "2024-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This is a very solid and engaging small, independent crime drama. The strength of the move is in the performance. In particular, Nikolaj Coster-Waldau is a very gripping as a loner whose life is broken any the disappearance of his daughter. How his daughter's disappearance ties into other disappearances of young women in the area is the question of the film. The movie is well Directed. The cinematography is good. The landscape makes for a great setting for this dark and well paced drama. The young woman who plays the Sheriff is very compelling. All the supporting cast are very good actors, despite being relative unknowns.",
    "date": "2024-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Lack of logic. The story dosent justify the serial killing.",
    "date": "2024-09-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fairly suspenseful movie. I would recommend this movie.",
    "date": "2024-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Good suspense thriller to watch unfold as it takes an unconventional path to telling the story it’s telling.",
    "date": "2024-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I honestly stopped watching after the Sheriff shot the good guy and told her brother to run. Ridiculous plot.",
    "date": "2024-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Awful. Non-realistic. Underdeveloped.",
    "date": "2024-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent movie, quite the thriller really keeps you guessing. Probably worth watching a second time.",
    "date": "2024-07-24"
  }
]