[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Better directing,production,screen writers,etc. would of given audience reviews a way better rating...Without top quality a movie can not be justified.",
    "date": "2025-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Just fun to watch for a family mocie night or a sleepover",
    "date": "2025-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing teen comedy love Jodi",
    "date": "2025-03-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "There was no point of making a sequel to an already boring movie. Not my taste. Then again, I enjoyed Countdown so I digress",
    "date": "2025-01-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Jack turned into a bigger asshole on this one.\nDon´t know how they managed to do even worst in the sequel.",
    "date": "2025-01-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Last couple of chick flicks now we have Tall Girl 2. Man, am I expecting a lot of flack for this one but you know what, I don't f**king care. I just f**king hate this f**king piece of f**king s**t movie! F**k! Yeah, I know what you all thinking. I can just hear the high school and collage students b***hing right now. \"Ugh, how can you not like this movie including the first Tall Girl movie, including the others from Netflix like The Kissing Booth, Sierra Burgess Is a Loser and He's All That and others that are not made by Netflix like Bratz the Movie and The Twilight Saga, these films are brilliant so you have to watch them again and change your opinion to positive, you poopy butt!\" Well, allow me to respond to that in the most diplomatic and nicest way I can. You are wrong. You're incorrect. Mistaken, your statements aren't true. You've taken a false hope because those movies got bad reviews. Anything franchise related such as trilogies, quadrilogies and such make it up to one. Five of those chick flicks I hate including this one. Which is why, you are slow in your head when you're younger, good student or bad student, doesn't matter, because these movies I've pointed out are garbage, any person that are related to the characters in those films makes them an a**ehole, a sl*t, a d****ebag, just down right of you. You are a fricking ***t! I know, I'm sorry for saying that but that's just like people thinking of relating characters to themselves from live action TV shows from Nickelodeon. Yes, they are some shows that I love from that channel when I was younger like the cartoon shows in general from Nickelodeon. What pains me is that they all belong to Nicktoons now and keep the live action ones in Nickelodeon forever but I'm getting off the topic by bringing it up. Jodi is a newfound fame and ambition after what she did at the end of the first movie, gets a part in the spring musical prove to be huge roadblocks in her otherwise smooth relationship with Dunkleman. She finds herself fighting her fears and dealing with anxiety attacks. After landing the lead part of Kim in ‘Bye Bye Birdie’, Jodi is bewildered, her insecurities calling to her through a voice inside her head. The rest goes on and I don't give a chocolate looking s**t about it. In all my years of getting over my past troubles in which that's what makes those movies themselves so bad is so irritatingly cringeworthy and since I've been bring those things up in my last year review as you know which one and this year, like for example, I've had my troubles back at collage years and then I won by getting my revenge and now what's not even that bad is that I have to deal with my mum like when she's bothering me in my bedroom but doesn't do that anymore because I put signs at my door that says \"p*** off\" and anything at my door in general. The worst thing I have to put up with is her cringy a**ed singing voice. Good Lord Almighty, this is cringeworthy and god-awful as f**k! It makes me want to burn everything to the ground when I hear my mum sing! It's so brain damagingly awful! And she doesn't care! I seriously don't want that to happen later on when she's thinking of going to do that in front of me at my Drama Club and wanting to join in. I'll probably kill myself if that ever happened and if those people are going to disagree with me on that topic, well, they can go f**k their mothers in their f**king ***t. Take full responsibility on my professional opinion. I just want to be on my own forever here with my friends with extreme prejudice. How long do I have to put up with her t**tiness!? Now with that out of the way, let me get to something that'll get me in flashbacks. When Jodi and Jack are on a date, things really begin to take it's toll, when the dinner date didn't work out when Jodi cracked by leaving, she starts to reconcile with Jack, but when she admits that she kissed someone else, Jack gets angry about it and they officially breaking up and Jack gets rid of the stuff that Jodi gives him. After telling you that kind of stuff about what has happened, the parts where couples are officially breaking up and no longer in love, that really takes the strain and breaks my heart in general in real life. Just like in those kinds of scenes that really brings me flashbacks, They are way, way, WAY to c**ksucking difficult to watch, and before you start your ***ting w***ebag b***hing, no, that does not mean I hate the genre itself! I like Pretty in Pink and Crossroads starring Britney Spears as I mentioned before and the others however, they're not even that good. The only chick flicks I've ever heard of that are good but never seen them are Mean Girls, 10 Things I Hate About You, Clueless and There's Something About Mary and the ones I have seen are Bridget Jones's Diary, Pretty Woman, Dirty Dancing, Titanic, Grease and Bridesmaids. So, there are some good chick flicks I actually enjoyed in my lifetime so here's that. With the exception of Tall Girl 2, some people say that it became a slight improvement over the first film of its predecessor which I totally disagree with. Yes, they're both god-awful but the sequel overall is the absolute worst in my opinion. It's just unbearable! Well, as this will be the last time I have ever going to review a bad chick flick, I think that will be enough of bad ones for today. The Twilight Saga, Bratz the Movie, The Kissing Booth, Sierra Burgess Is a Loser, He's All That and now Tall Girl. Nothing about them will get me on my suspension of disbelief. I surely wish to see some sexy scantily clad women in a chick flick. People'll doubt that'll ever happen. But as it is on those rants, I'll enjoy my time looking them, still out on the open, still having fun, still drinking my tea, still drinking my beer and still sniffing that fresh ***t. (Sniffs 2x) ┌∩┐(◣_◢)┌∩┐",
    "date": "2024-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "One was better it’s just was a bit strange how the end of the movie in one was the best part and here just watched because I watched one and I’m a tall girl",
    "date": "2024-06-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "feel bad for the actors.",
    "date": "2024-03-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Jodi tiene buen desarrollo y Stig y Fareeda son buena pareja y dan buen consejo 👍 pero Jack es insoportable y Kimmy su trama es aburrida y seguirá un mediocre película no es bueno solo maña es un 3.9 de 10",
    "date": "2023-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I thought it was ok overall and a good follow-up from the original as we see the relationships of these characters develop. I didn't care for the matching of the characters relationship as I didn't think it worked & felt forced to fit certain stigma's in today's world",
    "date": "2023-03-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Netflix presents the follow-up to the original starring Ava Michelle and Sabrina Carpenter about a teenager, Jodi in high school who's the biggest in her class...literally It made her stand out and getting constant ridicule from everyone of her peers but in the end she decided to own that special part of herself The first movie at best got middling reviews so I didn't bother with it Thankfully here the reception is much better than movie 1 Taking place right after the original Jodi now has a loving boyfriend, Jack Yet her fears and anxieties are creeping up in her even having a voice telling her what to do In a school play she meets a new guy which threatens her current relationship But Jodi learns to govern her own mind It feels like there's barely a plot going on but Ava Michelle more then carries the film I love the relationship between her sister played by Sabrina Carpenter and her parents always being her support system for life's curveballs We don't always have to have the right answers, it's okay to say I don't know, we say we're on control but in truth we don't have it entirely, everybody has some goodness in them Director Emily Ting, whatever issues people had with the last movie they do manage to fix them here Many of the players are really likable and evolve in their own ways This has more of an ensemble storyline Friendship, young love, and finding inner confidence is explored with everybody Ava Michelle is the true highlight of this being a girl that may over tower everyone but she also faces issues that attempt to do the same A cute and much better installment for fans",
    "date": "2023-02-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This move was honestly just straight up boring, the first part wasn't really bad and I honestly kind of enjoyed it. I was pumped for the second part but once I watched I just found it so cringe and boring like I said. Please don't waste your time watching this move just absolute trash and disappointing.",
    "date": "2022-05-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Credit where it's due, this film is much more tolerable than its nauseating predecessor. There's a good message, the characters aren't completely obnoxious and at least there is some character growth to an extent. However, the film is still somewhat boring and lest we forget revolves around a girl whose entire personality is that she's 6ft 1 tall.",
    "date": "2022-04-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Just like the original movie: it didn't need to be made",
    "date": "2022-04-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Should have been nominated for best picture. Best horror movie I have ever seen!",
    "date": "2022-04-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Enjoyed both original and sequel with my daughter.",
    "date": "2022-03-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Super interesting and appropriate for many different ages, not only teens",
    "date": "2022-03-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "A full star because it was self-aware that being 6 ft. is not something the audience should feel sorry for. A talented cast does not save this waste of a story.",
    "date": "2022-03-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Fun family film. Enjoyed watching it with the kids.",
    "date": "2022-03-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Horrible. Worst movie I've watched in years.",
    "date": "2022-03-10"
  }
]