[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Mike j is awesome but movie blows overall.  Gets 2 stars cause the 67 fastback",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Better than some, worse than some.",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Michael Jai White and Luke Goss are the best part in this otherwise forgettable B movie. The action scenes that are supposed to feel climactic often feel quite cheap instead, this film is very much a victim of a low budget. Now that I've watched this film once I won't watch it a second time.",
    "date": "2025-04-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Agree with comments of reviewers 2 star or less who articulate fairly well my thoughts. Mediocre action movie with predictable plot.  Ridiculous gunplay.  Protagonist with a pistol takes out dozens with automatic rifles, who stand out in the open (as does the protagonist).  Action scenes predictable, as was the script, although some of the fight choreography was athletic.",
    "date": "2025-03-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The worst thing about this film is the script. It's like a middle school play. M.J. White is way to serious for this part and doesn't fit with the story. A lot of things here are not in place.",
    "date": "2025-02-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Michael Jai White is super cool, but this is one of the worst movies I've ever seen.",
    "date": "2024-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The fighting showed up that Michael Jai is not as good as he thinks he is. It is almost comedic and covered with cgi and poor editing. Matt Goss should be good, but I cannot take him seriously in this and the dialogue is embarrassing. Badly written, some terrible acting and poor direction.",
    "date": "2024-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Who wrote this script? It is god awful.  So much doesn’t make sense. Needless narration. Many plot holes. Bartender born and raised in Slovakia then moved to Romania but has no accent. An American spy driving around Romania in a Mustang with New York plates? Whatever happened with attention to details…certainly not the director or the writers. Did the actors need a payday or something?",
    "date": "2024-06-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Wow... this movie is godawful. 3 minute set-up is OK but unremarkable.  Then it just enters the first curve too hot, blasts through the guardrail and tumbles 1000 yards down a rocky embankment. 15 minutes in, I deemed it unwatchable. DNF\n\nAnd in that first 15 min you'll get treated to terrible acting/directing, wearisome dialogue and musical score choices that make zero sense. Production quality is third-rate. MJW deserves better vehicles.",
    "date": "2024-03-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "All of these MMA type flicks are the same.  Warmed over cheesy and predictable revenge plot, poor acting and production values.  The lead isn't the worst actor on the planet... I mean for gosh sakes Arnold made his mark doing this kind of stuff, although admittedly in better vehicles.  And the fight scenes are pretty good.  But otherwise, this thing is like a mid tier Adkins flick.",
    "date": "2023-02-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Michael Jai White and Luke Gross star in the straight-to-video action-thriller The Hard Way.  When his brother is killed in Romania investigating a local crime boss, John Payne picks up where he left off, intent on getting revenge.  Both White and Gross do an excellent job handling the fight choreography, delivering some great moves.  However, the plot is extremely formulaic and is full of the usually tropes and clichés; stripper girlfriends, hidden USB drives, secret identities, etc.  And the low-budget shows in the scaled down cast and limited locations.  Still, for what it is, The Hard way is an entertaining action film that delivers some thrills.",
    "date": "2020-10-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This movie definitely has a leading duo that can really do stunts and fight scenes, but that's pretty much it. The acting is really clanky and the plot is very generic and predictable, and the CGI, when shown, is absolutely horrible. This movie is the same January action movie you've seen 10 million times over and over again. As I mentioned before, the cast can very well perform stunts, but the action sequences are sometimes filmed with hand held cam, which really takes away from the stunt work and choreography, which can be laughable at times. I laughed a lot while watching this movie, of course, where I wasn't supposed to. The opening 20 mintues are badass enough to make me sit through this entire thing. That's the one of the few redeeming qualities of this movie.",
    "date": "2020-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A crazy weak and obvious story but the leading pair actually aren't too bad. It's a shame they couldn't have been in something a little less nonsense. It had a promising start, and a solid ending, but not a lot worthwhile in between. Still, a lot better than the past few things I've seen Luke Goss in.",
    "date": "2019-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Rather embarrassing movie, the acting was forced and completely unnatural with an incredibly predictable story line. Some of the shots don’t even make sense, the action was mildly entertaining but I must reiterate how bad the acting actually is. The only was this movie can be considered good is if it’s a parade of some other action move I’ve never seen.",
    "date": "2019-03-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This story has been told a thousand times. Yet It was fun to watch. Don’t expect this film to receive any industry awards but the good guys beating the bad guys is enough for me. Lighten up on the mean spirited review and have a little fun.",
    "date": "2019-03-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie was not a B movie. It was a C- movie. In the genre of thrillers/action etc... this didn’t have ANY redeeming qualities. And I like some really crappy action films. Characters sucked, plot sucked, nothing was real and the only decent factor was Michael Jai Whites powerful asskicking. It was so unrealistic and lopsided that he did not take even one punch until the end of the film in the last scene. How was this film made? Why? Why Netflix? Why?",
    "date": "2019-03-12"
  }
]