[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Quite the fall from the original movie that offered more of a romantic-comedy to enjoy.",
    "date": "2025-10-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie sucks ass, she should've been w/ Marco not that sucker. Lmfao, cringy super cringy",
    "date": "2025-05-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I am a sucker for cringeworthy teen romance movies lol",
    "date": "2025-04-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "If u into the love and stuff it's pretty good, the way it ends is good too",
    "date": "2025-02-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I felt like I never like any of them chick flicks due to them being boring and repetitive as hell but when I finished seeing The Kissing Booth, f**k me, this is awful. (Laughs) By far one of the most garbage movies I've seen today. And now we come the second one however, this one does the same thing. Anyways let's get on with it. Moments later, Elle's senior year begins with classmates gossiping that she and Noah will soon break up. This makes her fear elevate as Noah has befriended an attractive British girl named Chloe on Instagram. Elle and Lee are planning the kissing booth again for the Charity Fair. So, he is trying to convince her to ask Marco Peña, the new transfer student dubbed the new \"Noah Flynn,\" to be one of the kissers. Beating Marco on the dancing game, she forces him to participate in the booth, the rest goes on and that's it. Now as I am watching this predicting something what's going to happen and not wanting to think myself the right answer but not really sure what was going to be and just as I am doing this it has me thinking that I'm going through The Twilight Saga and Bratz the Movie all over again. Ha! With Elle thinks Noah is cheating on her, she calls him to ask if he's alright or saying that she's alright. Or the other way right. I don't care. Everything about this movie is the same thing only at one time there's a dance competition on the stage after practising the moves. The Kissing Booth 1&2 are all god-awful and I'm up the third and last one which I think it'll be really, really awful. With everything in this entire trilogy, it makes me think of the bad times I had years ago and recently and it makes me think that I'm watching Bratz and Twilight again. Oh God, I'm not looking to the last one. Here goes nothing. Wish me luck.┌∩┐(◣_◢)┌∩┐",
    "date": "2024-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Just read the critic reviews and I think the \"critics\" forgot what high school was like. This was meant to be a funny, but poignant look at teenage angst. Teenagers' emotional development is not socially conscience and introspective; it is about each kid trying to figure out where they are in the world. I had a vaguely similar relationship to Noah & Elle. My one-year older boyfriend went to Stanford & I had to navigate senior year, and 3 years of college without him. And I was also not honest. \n\nI am a retired high school English teacher. Sex is at the forefront of each teenager's mind. The movies reflects the abundant sexual hijinks in any US high school. The movie was spot on. It was real. It was not intended to be an adult's idea of what is appropriate. If anything, the movie held back on the darker side of drinking, drugs, and sexually predatory behavior. Kudos to them for keeping the film positive.\n\nI enjoyed the sarcastic dialogue & music. I laughed out loud many times, which I rarely do in movies. \n\nI thought it was interesting that no one commented on Taylor Perez, the devastatingly handsome competitor to Jacob Elordi. He has a sexy voice, an interesting singing voice, and a sexy physicality throughout the movie. The best part of this sequel was the music/soundtrack and the dance moves of Joey & Taylor. Listening to the \"behind the scenes\" interviews of the grueling process to create the onscreen product made me admire the final dance competition scene even more. Joey & Taylor performed 99% of that scene. Doubles were only used in the final backflip & when Joey was catapulted into the air. Very impressive when most directors would have used professional dancers.\n\nThe outtakes shown at the end of the movie demonstrated the real friendship that developed among the 4 central characters. That chemistry shows when the actors deliver their lines. All of the actors commented on that aspect in media interviews.",
    "date": "2024-02-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "There is something here. Pretty unneccesary and pretty bad though.",
    "date": "2024-01-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Designs of the main characters meke no sense, and side characters are treated like a crops.",
    "date": "2023-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "More of the same in this sequel.  They've set it up for another installment with a cliff-hanger ending.",
    "date": "2021-12-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It follows the exact same cadence as the first movie which was not refreshing. By the middle of the movie you think \"We know where this is going.\" Elle is a character that is almost unredeemable by the end. However, Lee is a fun character.",
    "date": "2021-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Only good the performance of Joey King, the more than two unjustified hours of duration of The Kissing Booth 2 do not make it something recommended for the section of films for teenagers.",
    "date": "2021-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Not as enjoyable as the first one but still a cute movie. Elle's love interest Marco played by Taylor Zakhar Perez really stood out.",
    "date": "2021-06-16"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie had a very silly story",
    "date": "2021-05-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "its existence can be piled on top of reasons why humanity could be killed off",
    "date": "2021-05-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not better than the original. Repetitive stuff",
    "date": "2021-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The comedy is more tolerable while the almost-predictable twists and turns could be mesmerizing just leading up to an unnecessary sequel",
    "date": "2021-03-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "\"The kissing both\" is a teen movie, which can be seen on Netflix. The titles recalls the stand of kisses that represents the main image of the whole film, the place where the two protagonists kissed for the first time. Despite of the predictable plot, the movie is really emotional, because Noah (portrayed by the handsome Jacob Elordi) is the boy every girls wants, thanks to his inteligence, beauty, popularity at school and so on...   \nNevertheless I hope there will be a third part.",
    "date": "2021-03-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Absolutely disliked the movie. It is nothing like the book which I read first before watching the movie itself. For instance, (spoiler alert!) I don't ever remember the main characters doing the kissing booth again in the second book like they did in the movie which bothered me. Secondly, the new kid in the movie had some other name other than the name that I remember from the book. I ended up stopping watching the movie without getting through the beginning because I thought it was that bad.",
    "date": "2021-03-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "even trashier than the first one...",
    "date": "2021-02-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "\"Barraca do Beijo 2\" é raso e bobo, tanto quanto o primeiro, e com a mesma premissa de ser um filme adolescente com dramas e brigas mas no fim tudo acaba dando certo.",
    "date": "2021-01-29"
  }
]