[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "kinda boring to say the least . But a madea movie with Cora and bam never fails to make me laugh.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Cringy and low vibrational. This movie felt like a big commercial of Atlantis Hotel in Bahamas.\nThere were some funny moments but the jokes\nfelt flat most of the times.",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I didn’t like it, didn’t have any funny moments and was too slow and boring.",
    "date": "2025-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I have been watch Tyler Perry movies since I was a little girl. From Diary of a Mad Black Woman to Madea Boo. This movie feels like a step down from those. The acting is terrible, the plot is terrible, everything is just terrible. Feels like everyone was high during filming. The movie seemed so rushed. As an advent Madea fan I was so excited for this movie to come out and was filled with so much disappointment when I watched it. I even watched it a second time and it hurts even more than watching it for the first time. I kid you not a they filmed a part on a iPhone and added it in there. If someone were to want to torture me, just make me watch this movie on repeat. I gave it one star because it was funny. I hope future movies are 100x better than this one.",
    "date": "2025-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I don’t expect Oscar worthy performances when I watch Madea movies. I just don’t. This movie had some good laughs. The plot was a little messy but the point was about not judging before you know more. The cinematography was better. The actors should continue practicing the craft of acting. And Madea should continue to be a gangsta grannie that can give good advice when it counts.",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I had high expectations going into this movie considering it was a Tyler Perry movie. Although it was some comical scenes, overall the movie wasn’t good at all. The acting and quality was horrible, it honestly gave Tubi movie. As well as alot of the script didn’t match up with the scenes. SPOILER: if she knew his mom wouldn’t she have known he wasn’t cheating ? I think Tyler Perry should focus on different movies, or building actors.",
    "date": "2025-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I like Tyler Perry but This movie is AWFUL!",
    "date": "2025-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "At this point why even make another ? The blasphemy from this movie is so annoying I won’t put any time of watching another one it was so unfunny",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Characters felt underdeveloped, especially Brian's daughter, in the previous movie she learnt to be more responsible. In the new movie she hasn't remembered anything it's hard to believe she would still be acting this way. I like the holiday aspect but it felt rushed and the ending didn't make sense. The fiance character was horrible he had some half ass lackluster moment of expression to brian but that didn't make up for his blandness. Didn't seem like a good guy.",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The new Madea movie falls flat, offering nothing fresh or surprising. It recycles the same predictable formula we’ve seen countless times before—over-the-top family drama, exaggerated comedy, and a rushed “life lesson” ending.",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I have always enjoyed the Madea movies as they make me laugh. This one is just one big commercial for the Atlantis resort with the end not making you to want to go there because of all the extras you have to pay. The plot was thin, the premise unbelievable and even Tyler Perry as Brian did not seem to believe his own script. As Madea he was weak, relying on all the same old jokes that did not work here. Don't watch this movie. I expect more and better from Tyler Perry.",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Normally, I would be more interested in a Tyler Perry’s Madea film, but this one didn’t sit right with me. I felt the jokes were too forced and did not stick to the main plot. Not only that, I had to pause the movie sometimes because there were too many moments of overlapping chatter. That started to give me a headache. I’ve only seen the film once and have no plan on watching it again anytime soon.",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Terrible: the acting, the plot, the twist, everything \nI will always say that the best movie T. Perry has done is Diary of a mad Black Woman. This movie feels like he wrote it in his car and scrambled to place something out to the public. Thank goodness it wasn't in theaters!",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "An absolute hot mess that wasn’t even funny. I tried to laugh and couldn’t. It was like watching a train wreck on steroids. The plot was just down right silly.",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Style Perry should stop with Madea now. It's played out. A bore. The script was lame, the jokes were flat, bad acting, it all felt so low budget, forced and cringe. Please no more.",
    "date": "2025-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Terrible movie. Mostly cackling, arguing & screaming. Only watched it because my 16 year old wanted me to. Other than spending time with her, this was a complete waste of my life. Atlantis should be embarrassed to be associated with this film. The acting was fine but the jokes are not funny at all.",
    "date": "2025-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "So dumb. Terrible acting all around. Barely any Plot, drawn out, stupid movie.",
    "date": "2025-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Im a fan of the movie series, but this one was so disappointing, predictable, and the acting was just not good. Perry will never surpass diary of a mad black woman, he should just stop now.",
    "date": "2025-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It’s a pretty good movie in the Madea Universe.Has better writing than Madea’s Homecoming at least, but one problem I found with both movies were the characters. A lot of the characters made idiotic and not thought-through choices. If the characters weee better, I’d give this movie a higher rating.",
    "date": "2025-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is absolutely comedic gold.  Would watch again.",
    "date": "2025-07-31"
  }
]