[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I made an account just to review this movie.\n\nLiberal murder-fetish trash.",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Not great at reviewing but i enjoyed it",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great thriller!!! Loved how I was left wandering the whole time who the killer was!",
    "date": "2025-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Predictable ending, but not too heavy on the I’m better than you theme.",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Damn it's not a 19%.....at least it's a watchable movie but that's about it",
    "date": "2025-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The gore was good, it wasn’t extreme but still it was good. And the romance 🤭🤭🤭 also if there’s someone in your house RUN OUTSIDE 🤦‍♀️",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love this movie and good gore",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "We ate pizza too!!! Grabbed by the first second it was very relatable but by scene 3 my friend got got a little bit excited and exploded into a song about someone inside my house . It was scary!!!! Should I say ?? Mega scary . Oh dare it say it . Oh yes I did. I went there. Tehee. But on a real I’m not even being funny this film was mega good , if you don’t mind the occasional oopsie daisy",
    "date": "2025-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Sydney Park was too good of a lead for quality of this…",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "SPOILER WARNING: Definitely would not recommend this watch, I read the book before watching the movie and (the book) was absolutely amazing but the movie lacked in pretty much every aspect. There was poor acting, poorly written murders, also didn’t try to match any of the characters to the descriptions written in the book (I know this is not always easy but it’s like the only character they tried to match with the book was Makani). Also they added the part where Ollie did a background check making him seem like a bad guy when she revealed this later on in the book.",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This is a bad movie. The writing is poor, as is the acting. The story is makes little sense.  A movie filled with no likable characters.",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "\"There's Someone Inside Your House\" is Netflix's venture into the slasher genre, and while it's easy to compare it to its more innovative predecessors, it carves its own path without relying on nostalgia.\n\nWhat I appreciated about this film is its commitment to doing things on its own terms. It doesn't try to be a parody or a throwback; instead, it stands on its own. The story is straightforward slasher fare—teens getting picked off one by one—but it has a charm that's hard to ignore, even if it feels like it's just rehashing familiar territory.\n\nThe film has its entertaining moments, though it doesn't entirely deliver on the scares or the drama. It's like a slightly stale cookie—it might not be perfect, but it still satisfies a craving. The body count is lower than expected, and the tension doesn't always hit the mark, but it manages to keep things interesting enough.\n\nOne of the movie's strengths is its blend of style and substance. The kills are inventive, and there's enough suspense to keep you guessing until the end. However, it does struggle with character development and sometimes feels like it's ticking off boxes rather than creating a compelling narrative.\n\nUltimately, \"There's Someone Inside Your House\" is a decent addition to the slasher canon. It might not redefine the genre, but it provides enough thrills to make it worth a watch for fans. It's not the scariest or most original, but it has a certain appeal that makes it enjoyable.",
    "date": "2025-03-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This is a slightly above average film. It's like a cross between Saw (2004) and Scream (1996) but made in 2021. The characters and story aren't as memorable as Scream and the violence isn't as intense as Saw. The murderer wasn’t who I thought it would be, which was good. The reasoning didn't really make sense. There are some really great sequences like driving into the fire and the phone torches at the party but there's also too much filler and it can be pretty slow moving at times. The concept can't fill the runtime. I did enjoy the slashing violence and gore. Worth watching if you can't think of anything else to watch.",
    "date": "2024-12-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I don't know if this is me being dumb but it's not really clear what the killer's motive is.\n  Loved the characters in this film very likeable the horror aspect of it isn't there though.",
    "date": "2024-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Meh. Basic plot with a mediocre reveal. Not even remotely scary. The actors did a decent job though, and made it watchable.",
    "date": "2024-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It’s not THAT bad. It’s a generic modern version of Scream. Not a bad watch. #Justice4Rodrigo.",
    "date": "2024-06-16"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Cookie cutter and badly acted. Trying to make a statement about the culture wars but clumsily handling it and about as subtle as a baseball bat across the head.",
    "date": "2024-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "A failed attempt Scream wannabe.",
    "date": "2024-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A boring, stale, predictable waste of time and energy",
    "date": "2024-02-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I watched this movie for the first time October 2022. I honestly don't really like horror, but this movie was definitely amazing.\n\nThe plot twist wasn't that expected for me. But maybe that's just me.\n\nI also appreciate the fact they added a queer character, as it's always nice to see some representation in horror music\n\n\nSo yeah a 10/10 from me :D",
    "date": "2023-12-12"
  }
]