[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great family movie. I'm awarding my rare, coveted and much desired 5 star rating to this one.... and no one knows rating like I do. That I can tell you.",
    "date": "2025-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Instant family is one of my absolute favorite movies. I loved tue family dynamic, the realism that came with every relationship involved. I loved the realism thoughts and questions that came in play when adopting and the difficulties shown. I absolutely love this movie as someone who is planning on adopting in the future and have wanted to since childhood. I loved the healthy relationship of the parents and transparency between, just such a healthy relationship which leads to a healthy family. I’ve rewatched instant family about 4 times and will continue to rewatch it :) my comfort show.",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Instant Family (2018) is a comedy film with some adult jokes that is very fun to watch. The film also highlights the importance of children who need a home and good parents. The story is simple but effective, and it has a great cast that has a lot of fun on screen. A great surprise from Paramount.",
    "date": "2025-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This is an extremely annoying film that tries too hard: it tries to cram too much dialog into short spaces. It tries to substitute valid acting with ridiculously embarrassing overacting. The direction is poor—since competent actors are starring, I lay the blame directly there. \n\nPlus the script is tremendously overblown. It’s downright stupid. If people talk that way, they never do it around me. What a waste of Mark Wahlberg’s talent. \n\nThere are flashes of humor that work, but they’re overwhelmed by the “let’s throw everything at the wall and something will stick” hackneyed script and direction. \n\nWe made it 30 minutes in before switching it off. That was at least 15 minutes too long.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Cute as hell that includes laughs and cries.",
    "date": "2025-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Filme mais ou menos, o roteiro é fraco, as cenas são mais ou menos, a história é fraca, o elenco é bacaninha, mas ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A happy, heart warming and emotional film! Highly recommend",
    "date": "2025-06-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "What a surprisingly great movie! I looked it up because of the janitor beatdown scene that showed up in my FB newsfeed, but it was so much better and tear jerking than that. Great performances all around and really dealt with the complexities of fostering, reunification efforts, and adoption.",
    "date": "2025-06-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This film is one of the few films that exceed expectations. While watching you experience a range of emotions. The films raise a lot of problems that modern families face, highlight the \"struggle of generations\", and very emotionally convey all the moments that we encounter in our own lives. It was shot simply incredible, the main actors for the game 10/10, a must-see",
    "date": "2025-06-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Given the known struggles of child actors struggling to maintain a dependable reputation over the many years that pass, Isabela Merced manages to break from the Nickelodeon American Television Series \"100 Things to Do Before High School\" and explode into an emotional in-depth comedy like Instant Family with flying colors. The performances of the parents, Mark Wahlberg and Rose Bryne confirm their timeless acting abilities. These three celebrities have if not one thing in common, that being, their ability to act and adapt to their age. The foster parents are executed wonderfully, and Merced is able to not portray a rebellious, lost teenager with rose-tinted glasses.",
    "date": "2025-06-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved this movie!!!",
    "date": "2025-05-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Sure it's a little risque and there are some annoying characters. But the film's intentions are good and it will yank on your heart strings.",
    "date": "2025-05-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "We absolutely love love love this move! It is one of our favorite feel good movies. It’s cute, funny, makes you cry a little and makes you feel great!  Highly recommend!",
    "date": "2025-05-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very heartwarming film with a good mix of laughs. Definitely worth a watch.",
    "date": "2025-05-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A great feel good movie.  Loved it",
    "date": "2025-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie was so corny. Cool concept but all the jokes sucked",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great Movie!!!! Highly Recommended!!! A++ 🍿🎥🍿",
    "date": "2025-05-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Funny movie with a fun plot twist.",
    "date": "2025-03-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Sean Anders co-wrote and directed this family drama based on a true story, which stars Mark Wahlberg, Rose Byrne, Octavia Spencer, Isabela Merced, and more. The film is based on the director's real life experiences. Mark and Rose are husband and wife who have not had a child. They have a tender heart, and the notion of innocent kids suffering as a result of their parents' marital troubles or natural causes of death breaks their hearts. So they adopt three Latino siblings, one of whom is a teenager. The first few days are peaceful, but Mark and Rose soon find themselves in a rough and tough situation.\n\nThe film provides Mark a fantastic opportunity to portray a family guy, and he does an excellent job in the role together with Rose Byrne. The story is solid, full of humor and hilarious scenes that will make you cheerful. I thoroughly enjoyed the film's comedic, dramatic, and sad moments. Sean made certain that his precious experience of having kids around was relayed to the audience with pure love and joy.",
    "date": "2025-02-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A movie that worried me in the first 10 minutes due to the fast cut editing, which always gives me a headache, and it's rather generic, some things don't really make sense, BUT.. who gives a darn when the movie is so endearing, cute, and rather fun. Rose Byrne elevates all the comedies she is in. She is amazing, and I love Isabela Merced also. Marky Mark has real good comedic delivery, and is always a nice addition to movies like this. Give it a go if you want to have a wholesome, but fun time. Thank you!",
    "date": "2025-01-22"
  }
]