[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The cinematography matched the sweaty Southern scenery. The theme of the movie unpacked the potency and psychological effects of everyday violence and bullying, dipping into some interesting backstories. I thought Whitney Peak shined, and the dream sequences were my favorite – scary, weird and filmed in unexpected ways.",
    "date": "2025-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved the style and story of this Southern gothic nightmare. The dream sequences were trippy and terrifying in the right way and the camera direction made it all feel right at the edge of reality.",
    "date": "2025-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The actors were superb and one felt their fear, pain and hurt throughout the story. Tilley integrated complex mood lighting, on point scores and just the right amount of suspense to keep me on the edge of my seat.",
    "date": "2025-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Independent compact budget film but was a pleasant surprise. An entertaining horror flick. I liked it a lot. They did a good job building suspense and though the story was ok, the acting and scene set up was well done. Its going to be a good halloween season.",
    "date": "2025-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I normally  don't like horror movies that tend to rely heavily on blood and gore, but in Eye for an Eye the director skillfully creates a subtle and insidious sense of impending doom that keeps you on the edge of your seat.  If you like psychological thrillers with more substance than usualI I highly recommend this film",
    "date": "2025-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Instant new horror classic",
    "date": "2025-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Incredible watch! An absolute horror movie must see!!!!!! Colin Tilley is a genius!!",
    "date": "2025-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Liked the setting, cinematography and build up to settling scores with the bad guys.",
    "date": "2025-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing film. Great visuals and story keeps you on the edge as it tells the story of bullies getting what is coming for them. Love the back ground story for Vincent \n\nA must see",
    "date": "2025-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Southern Gothic at its best!",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "what a weird movie. i liked a lot of aspects. my eyes",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "a good ride, me and my girls watched this last night and loved whitney peak",
    "date": "2025-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Nail biter! Fascinating take on gothic horror swamp lore",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie! Tilley's prowess for graphic, visceral visual storytelling is on full display in this unconventional take on the traditional teen horror flick. With the unforgettable performances of Whitney Peak (Gossip Girl) and Golda Rosheuvel (Bridgerton) driving the film, Eye for an Eye is one of the most unexpectedly rewarding indie offerings 2025 has seen so far. Don't miss out on this riveting gut-punch of a movie...just make sure you have someone to snuggle up while you watch, as it gets SPOOKY! 10/10, amazing film!",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Stupid, cringy, pointless, uncomfortable, I cant believe it has 92% raiting. Just goes to Show that critics dont know what are they doing",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Eye for an Eye is a sharp, stylish thriller elevated by Collin Tilley’s outstanding direction. Known for his visual storytelling, Tilley brings a cinematic intensity and emotional depth that keep you hooked from start to finish. The film balances suspense and heart perfectly—smart, gripping, and beautifully crafted.",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This was a super weird movie haha but it was also pretty good!",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "bring back weird movies! i loved this; this felt like i was discovering a bunch of unknowns and I cant wait to say i was fans before they were big",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Def worth a watch, Whitney Peak is a future star. The script was a bit basic but enjoyed the visual side. Sandman scary af",
    "date": "2025-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I really enjoyed this film, overall really interesting visual style. Storyline had some holes, but the tone kept me in my seat.",
    "date": "2025-07-17"
  }
]