[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Uhtred of Bebbanburg, long retired, returns to have a role in the formation of England.  Battles ensue.\n\nAlthough this film was planned as a conclusion to the series long before the show was over, it still feels like a half season, if not a full season, crammed into two hours.  It has strong production values and enjoyable battle scenes.  I don't think anyone that hasn't watched the series would enjoy it.  I did but not as much as I'd hoped.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It was ok. Not even close to the show in terms of excitement. Also did not feel fully flushed out. A mediocre effort.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Why did they have to add two guys kissing immediately it ruined the movie for me pretty quick I would have been ok with just seeing the show 🫡",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "They should've just made another 1 to 2 seasons instead of this garbage",
    "date": "2025-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "For someone who watched the last kingdom and the Viking series, this was terrible. They tried to squeeze an entire season into 1.5hrs.  Made Uhted weak and of course Hollywood had to ruin it with the usual….",
    "date": "2025-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Pretty weak movie. The narrative is well structured and the actors aren’t bad. The music is well done and fits nicely. The fight scenes are some of the weakest out there, with Uhtred constantly lost on the battlefield and searching for Aethelstan. For the greatest warrior of that era, it’s quite disappointing. All in all, it’s a film that tries to be epic but never rises above mediocrity.",
    "date": "2025-05-31"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Forced.  Rushed.  Crap.",
    "date": "2025-01-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Seven Kings Must Die is obviously a very rushed job. However, for many fans of The Last Kingdom series it was an added bonus to finish things off.",
    "date": "2024-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Having watched the series this was an extreme disappointment; completely rushed and a very poor storyline.",
    "date": "2024-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Honestly, I wish I had never watched the final story of Uhtred. This movie was sloppily assembled as if rushed by writers sick of their job. They couldn't even find a one-liner for Finan. Scenes did not blend well. Lines were weak. Too many story to ines in too short of a time period. Even the cinematography was weak and immediately noticeable. A fictitious and current social storyline was added that ultimately only served to add one more piece to this dollar store puzzle. It was done without the time and writing to support and develop only to have the character dramatically realize the errors of his ways and be welcomed back with open arms then boom movie over.  Where is the bullshit*t flag, this play needs to be called for what it is bullshit*t.\n\nHalf of the actors did not join this film and of the ones that did a number of them met an untimely ending for which little time was spent allowing the characters to respond. Then they finished it all off with  nearly laughable CGI, were it not truly sad to see them ruining my wonderful memories of the show. I wish I could scrub my memory clean of this movie.",
    "date": "2024-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "very rushed, disappointing finale. should've been a full season.\n\n5/10",
    "date": "2024-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "As a big fan of the series, which was done very well and wrapped up quite nicely at the end of season 5, the movie was disappointing. It really should have been a 6th season rather than a film because it felt incredibly rushed, a bit all-over-the-place, ruined/insulted a few characters that were built up over a long time in the show, and barely managed to cobble together a halfway satisfactory ending. In fact, looking through those doors at the end was the best moment of the film by far for me, despite even that scene omitting a couple of key people who really should have been present. Everything else felt hollow and rushed.\n\nAll in all, not even close to the ending you'd hope for for such a beloved, intricate and emotional series. I wish I hadn't watched it. If you read this before watching, please save yourself the disappointment and just stick with season 5's ending.",
    "date": "2024-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Respect for everyone who stopped after 20 minutes. If you liked the series, better to not watch the movie. Ruins the feels.",
    "date": "2024-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Disappointing how we loved this series, and this movie was a terrible way to end it. I stopped watching after 20 minutes",
    "date": "2024-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love this show. I agree with comments on forced inclusivity but it did not stop my enjoyment to the conclusion of this saga. To everyone involved in this series: You made one person on this earth very happy with what you made. I can only hope another tale is told, in a similar era, with the same love as this was.",
    "date": "2024-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A great ending to a great story. The action, the drama, the visuals, and the fantastic acting all come together nicely to give the series a satisfying close. Watch seasons 1-5 before watching the movie though.",
    "date": "2024-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "As a fan of the show, the movie is just ok. The world of the Last Kingdom is up to the same old tricks and story beats, so if you wanted another quick dose of the show then 7 Kings has you covered.",
    "date": "2024-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This is as stupid as a movie can get. Take what you have done repeatedly in a television show and do exactly the same thing again but find a way to make it worse. How you spend years creating a character and think you can sell the fact that no matter how loyal that character is, EVERY SINGLE CHARACTER he has sworn to protect betrays him is ridiculous. So stupid.",
    "date": "2024-03-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it. Alexander Dreyman brilliant again. His sidekicks wonderful as always. Action, loss, honour, all the usual. Ending was OK. Battle a little unreal but the film was enjoyable. Just ride with it. Relax and enjoy.",
    "date": "2024-03-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The ending I was hoping for to this saga, words can't describe the joy I had when watching the end of this film, as someone who lives near to Bebbanburg the ending was perfectly done. Great finish to a wonderful series, I rate this as high up as breaking bad personally.",
    "date": "2024-02-28"
  }
]