[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "**SPOILERS AHEAD** \n\nLike most of TP's most recent movies, the acting saves it. Everything else is a let down. The movie is 2 hours long and yet it feels like rarely anything is properly developed. Bayou and Lil Ann's romance happens so fast (which idk if that was done in the 40s) and the letters, while endearing sometimes, took away from the journey as a watcher cause I wanted to just watch the relationship progress and deepen on my own without Bayou's narration of it spelling it all out for us. \n\nThe ending was disappointing. You mean to tell me Leanna didn't tell her own son about her father for all of these years? and he just..goes to sit down on his porch after? Why is Hattie Mae the one giving him the letters? It feels like a cheap surprise ending. I feel like this movie would've been much better as a fight for justice with a love story strewn in. \n\nI will give TP his credit: he does dramatic scenes very well because Bayou's death is haunting.",
    "date": "2025-05-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "If there's one current movie I'd recommend to everyone I know, it's this. The artistry, writing, message, impact... beautiful, powerful, timely and profound. Tyler Perry and team outdid themselves with this film. It should be an instant classic.",
    "date": "2024-10-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The story is beautifully told, but unfortunately not realistic. Leann and Bayou declare their love for each other, but don't act on it, so the movie and the story feels fake.",
    "date": "2024-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Nice music and 1940s story.",
    "date": "2024-04-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing heart wrenching and heart warming story of enduring love. Perfectly cast and seamlessly written. A multi faceted modern day Note Book. I would have to say this has transcended Tyler Perry movies for me. I laughed, I cried, I sat on the edge of my seat, I sank into my seat totally overcome by raw emotion leading me to write this review my first ever movie review.",
    "date": "2024-02-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I stopped at 3.5 stars just because 4 and up seems like the best of the best to me.  This movie was very good though.  Good story, good acting and I always love a film set in the deep south.  One thing I didn't like was when Miss Leann came back somehow only a few years later there were people who did not recognize her as the same girl, Bucket, they knew before??",
    "date": "2023-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Music for a start! Great music..but would expect a period film to also adhere to something thats in keeping to the timeline. \nOpening first 6 mins, it's 1926 , sugar shack barn playing jazz from the 50's\nSo music out of sync. Script totally predicable. Nice photography and locations.\nBut ultimately a poor film",
    "date": "2023-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great story, emotional captivating",
    "date": "2023-03-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This was a touching story, so tired of seeing this type of movie. I am pleased with the music and setting, this was one of the best Tyler Perry movies yet. I enjoyed the cast, some were better than others and it was great to see some familiar faces.",
    "date": "2022-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This has to be Tyler Perry's best movie. I watched it twice. Its a great bu sad period drama. It shows the prejudice between  black man dating a white woman. There is lots more to this movie. The acting is wonderful. The movie left me knowing how horrible race relations were and still are evil. And that we should all at least try to get along. Love is much better than hate. I highly suggest this movie for people old enough to understand. I would rate it (R) for violence, nudity and language. It's not for children.",
    "date": "2022-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Phenomenal Directing, Writing, Setting, and Acting.  Also, impeccable Costume Design, and beautiful Nostalgic Jazz Music.  This Film gets an A+ from me!",
    "date": "2022-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Well done Mr. Perry.",
    "date": "2022-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Lovely original songs, musicians who acted well, but a bit of a traditional script - sort of a Romeo-Juliet romance, in which all characters have rather little depth and are clearly defined as very good or very evil.",
    "date": "2022-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I'm a huge tyler perry fan.  This was his worst movie. Slapped together. Bad acting and weak storyline.",
    "date": "2022-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This film brilliantly captured the feel and texture of the southern U.S. in a dark period in American history. The plot was more complex and intriguing than I thought it was going to be.",
    "date": "2022-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "the acting was not good  even the songs they song boring n dull like  remake of color purple meets cain and able",
    "date": "2022-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I didn’t like it. Typical exploitative Tyler Perry movie. Bad film plot, lots of holes in the story line.",
    "date": "2022-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "TypicL ending. Tyler always goes for the extremes with his characters. No real nuance or character development.",
    "date": "2022-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it! Great movie!!",
    "date": "2022-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Even though it was predictable this is probably Tyler Perry's best film yet as far as execution. It was well put together.",
    "date": "2022-09-30"
  }
]