[
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Just an upsetting experience to watch and no real redeeming value. Confusing plot and disappointing to the very end.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Arguably Hopkin's best performance of his whole career.",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Harrowing, heartbreaking. Hopkins and Coleman hit it out of the park.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Emotionally hitting film of this generation",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The Father is a heartbreaking and masterful film that captures the disorienting experience of dementia with stunning authenticity. Anthony Hopkins delivers one of the greatest performances of his career, embodying both strength and vulnerability in a way that is utterly devastating.",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "scarily accurate. i have a 94-year-old great grandma and anthony is just like her. the same grunts, the same stammering and shaking hands, the same distant stare, it's all done so well. what was also particularly heartbreaking was that, at the start of the movie it was written so that you were just as confused and anthony, but then as it continues you slowly piece everything together while he only gets worse and more confused. one of the rare gems to come out of covid.",
    "date": "2025-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Brilliantly acted, heartbreaking and superbly crafted.",
    "date": "2025-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The acting from Hopkins was genuine, emotional, and unparalleled. Coleman was also very, very good. The plot was unique and heart-wrenching. I personally loved it.",
    "date": "2025-06-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This story was gut-wrenching, but so beautifully told. Such a creative idea to tell the story of this man the way they did. Absolutely worth the watch, but bring tissues!",
    "date": "2025-06-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Very well acted movie that I will probably never watch again. Because it's so upsetting to watch. It reminds me of this woman who lived at an apartment complex where my father was a maintenance man. He sort of was friends with her and had helped her do some things over the period of a few years. But I remember being asked wants to help move her stuff because she had fallen down or something I don't know what exactly. So I go help move some of her stuff and then we take her to this place that I can only describe is like a place you go die. This poor woman goes from her home to a white cinder block room with a curtain separating her from a roommate on the tiniest bed you can imagine and we left her there and I will never f****** forget how heartbreaking that was and I barely knew her.",
    "date": "2025-05-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Went into a different direction from which I hoped it would. Excellent acting but the story has been done before.",
    "date": "2025-04-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Only watched it once because it is so sad but  it is amazing. You as the viewer feel like you are experiencing the dementia. The movie at times feels scary!",
    "date": "2025-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A heartbreaking and emotional psychological drama with an amazing performance from Anthony Hopkins.",
    "date": "2025-03-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Superb performances by Olivia Coleman and Anthony Hopkins. I watched this movie alone as my wife’s father has dementia. Realistic account of the disorientation, paranoia and hopeless confusion experienced by sufferers of the disease. Watching this movie would destroy my wife.",
    "date": "2025-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "O A powerful performance from Coleman and Hopkins one of their career highlights, a  thought provoking and accurate portrayal of the devastating effects of dementia on the whole family. Anyone who has experienced dementia in the family will connect with this film.",
    "date": "2025-02-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Dura 1.40 no le sobra ni le falta nada.\nPorque ya el tema en si es un drama (persona mayor con problemas demencia) pero lo tratan con mucha delicadeza. No lo amenizan no lo tornan sumamente tragico por demas. Igual lo ves a él llorando y te parte al medio. Excelente pelicula. - by Maiu -",
    "date": "2025-02-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Gut-wrenchingly sad film with a very realistic portrayal of the world of someone suffering from Dementia. Anthony Perkins is stunning in this, portraying a not so likeable character in the most human endearing way possible. So impressed with how the film plays around with the sets and cast to portray someone who's mind is slipping.",
    "date": "2025-02-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "An authentic, heartbreaking and inventive exploration of dementia that from start till end is a spectacular film that is perfectly written and directed while Anthony Hopkins and Olivia Colman gives two absolutely remarkable performances that brings so much emotion and humanity to its layered, beautiful story. A true modern masterpiece.",
    "date": "2025-01-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "With some of the best acting ever. The Father is a great movie that captivates dementia in a dramatic and emotional way. And Anthony Hopkins and Olivia Colman deliver some of their best performances.",
    "date": "2025-01-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "\"The Father\" extremely well made & tragic drama facing one's mental decline while suffering from the disease dementia.\nDirector, Florian Zeller throws you in the shoes of Anthony, as his confusion of memories are tough to break away from. Occasionally using actors to swap roles, the repeating of dialogue & the use of different locations keeping a familiar look in design to keep you trapped in Anthony's confusion of reality around him, it adds a certain emotional uncomfortableness to the storytelling.\nAnthony Hopkins & Olivia Colman both give great heartfelt performances that deserve the praise, especially Hopkins as his performance left me emotionally beaten.",
    "date": "2025-01-06"
  }
]