[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it!! Wasn’t expecting a thriller from Tyler Perry to be so good!!",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Yes life is hard, especially a single poor Mom. But this story is too over. I cannot feel its real",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very good, and a twist I definitely didn't see coming",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent acting and writing! Taraji P. Henson and Sherri Shepherd have great acting chemistry together on screen. Would love to see them both do another movie together.",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "THE MOVIE PORTRAYS SOCIAL INJUSTICES AND THEIR CONSEQUENCES... WITH THE HOPE FOR HUMANITY TO MAKE BETTER CHOICES WHEN IT COMES TO TREATING OTHERS. YOU NEVER KNOW WHAT A PERSON MAY GO THROUGH. IT HAS A GOOD INTENTION AND ASKS OF US TO BE MORE KIND TO EACH OTHER.\nNOT GONNA LIE, AT FIRST I WAS VERY SKEPTICAL. I DIDN'T LIKE THE CAMERA ANGLES, EVEN ACTING FELT MEDIOCRE AT TIMES, PRODUCTION WAS LACKING AND IN GENERAL I WAS NOT A BIG FAN OF THE PRODUCTION. EVERYTHING CHANGED DURING THE SECOND HALF OF THE MOVIE. IT KINDA PUT ALL THE PIECES TOGETHER! YOU WILL BE SURPRISED. I CRIED AT THE END. IT WAS VERY EMOTIONAL.DESERVES IT'S FLOWERS!",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The only plus factor is Taraji Henson's acting was great yet the movie in whole is so insufferable looks like the script was made through an AI platform.\n\nThe script been rushed, unrealistic and utterly exasperated.",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Melodramatic plot and the twist feels artificial and forced.  What made me watch until the end was the brilliant acting from two of the main actresses.  If it wasn’t for them, this would have been a mediocre film.",
    "date": "2025-10-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Raw and emotional, I loved it! Henson’s acting was amazingggggg. I wanted to cry and felt every emotion. Henson definitely carried this movie, I think that if it was anyone else but her it would’ve sucked",
    "date": "2025-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Intense, pulls on your heart strings. Fantastic movie.",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wow. What an intense story- right from the start, it wasted no time! And yes, lots of the acting was bad &the music was a bit too dramatic during intense scenes but the main character’s performance (aka Janiah) was really strong and she pulled me into her world. The ending was shocking and brought me to tears.",
    "date": "2025-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Only half way in and I'm already cheesed out by the cheesy script, over acting, under acting, over dramatisation, and unrealistic story, but I'm going to push through and see if I can hold my lunch down...and what's with the over glamourised detective impersonating Michael Jackson?...oh...and the police hats don't fit",
    "date": "2025-09-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I would have rated this movie five star, it's really emotional meaning the actor know how to play their game properly. 😝",
    "date": "2025-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Ni las telenovelas turcas son tan dramáticas ni sobreactuadas.\nLa película se va desarrollando en una temática que la envuelve en situaciones cada vez menos creíbles, incluyendo el final.\nAunque el objetivo de la película es sensibilizar sobre las carencias de oportunidades  y la desigualdad social, lo aborda de una forma torpe y burda. \nPuede causar la impresión de un sesgo racial, pero no aterriza en un mensaje profundo que lo valore. \nEl final, aunque inesperado, no salva la película de casi 2 hrs de malas caracterizaciones, actuaciones exageradas, y un fallido intento de causar lástima por el personaje principal.",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It is overall a great watch but a little bit on the implausible side, I feel like there's a lot of injustice done to the it, some concepts feel rather forced, and so much has been done to force sympathy and guilt from the viewer that it feels unnatural.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely amazing and touches on honest themes of mental health and what truly happens when people break!!",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie has all the feels, not only did it resonate but it also sent clear messages on what could actually break the camels back! For people out there who is looking for more perfection towards the storyline clearly don’t understand the struggles of the cost of being sick. I suffer seizures myself every day and it’s not just the cost that sets me back. It’s having to live with it and try not be judged by other people when you’re triggered. People think it’s like a flu, when you’re actually dying inside.",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is well-written, true to real life experience and beautifully dramatic. Don’t Witte this film off because IT WILL. BE one of the best you EEEEEVA see. ❤️",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This police woman Teyana Taylor... Looks nothing like a believable police. It's not a runway. Skip the over the top make up.",
    "date": "2025-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie made me shed tears, and I never cry while watching movies. It was moving, and although some parts were dramatized depictions of reality, the story and the message need to be heard. This was a beautiful portrayal of the struggle.",
    "date": "2025-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This is one where the audience score is a better guide than the critics. Henson and Shepherd in particular keep it on track despite some questionable script choices. If you give it a chance and watch until the end you would have to have a heart of stone to not be moved.",
    "date": "2025-08-15"
  }
]