[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This is not a RomCom, and there is no \"chemistry\" between nicole and zach, eww. Don't waste your time.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I found it funny that the movie kept mentioning that Zac Efron’s character hated the script of the movie he had to act in. I wonder if he felt the same way about this movie.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Terrible movie, we watched it to the end hoping and praying for a plot twist to make it a better movie but it never happened. Shitty mom and grandma, shitty boss, shitty friend: it seems that everything was the main character fall, even if she was bullied from the boss, cheated from the mom, the grandma and the friend, and she also said \"sorry\" for it.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This is not a RomCom, it's a bag of cheap clichés. Don't waste your time.",
    "date": "2025-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I will always give anything a go with Nicole Kidman. By watching the trailer I knew this was going to be your typical predictable movie. It’s not going to win an Oscar, but I found it to be enjoyable. Just marked it down as it was very predictable!",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "So bad... borderline uncomfortable watching Nicole Kidman and Zach Effron as love interests given their > 20 yr age gap. It's like Nicole Kidman got a facelift and started staring in all these weird sexualized movies. Maybe her version of a midlife crises? Regardless, wouldn't recommend it.",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved this movie! I feel like the story line was great! I am 35 years old I’m not married, I don’t have children, however I wish I would have focused more on family but in this movie everyone I feel is going to take something from it good or bad when it comes to age, love, and relationships! But I enjoyed it and everyone played their roles perfectly as far as I’m concerned and I’m the audience.. I believe that’s what movies and/or films are all about I felt like I knew them lol but that’s what we are looking for!! Wether relatable or not like a fairy tale at the end of some Disney movies I feel like a princess or and fairy and that is what the Director wants. Ending in success!!!!",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This was way more enjoyable than expected, took me a bit to get past the plastic unmoveable faces of the leads, but their performances were good enough to overlook it eventually. It's a silly comedy with a lot of unrealistic moments, but it's a fantasy, so who cares. Love Joey King in this and Zac Efron is fun. This is along the lines of many underdeveloped movies cranked out for Netflix slapped with big name stars to try to get viewers, but it's more fun to watch then most of the others.",
    "date": "2025-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "One of the worst romcom plots ever. Joey kings character is wronged by everyone. Very difficult watch, writers need fired. Characters are all awful. Nothing interesting happens just follows some rich nepotism babies in the film industry whining and having awful relationships.",
    "date": "2025-04-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie was horrible..... I love Nicole Kidman.....but she is not sexy at all in this movie....I mean the romance scenes....are totally unbelievable...... not to body shame, but she looks like the crypt keeper in this movie....",
    "date": "2025-04-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "At times it definitely felt like the mom's character (and thus the romance) was taking a back seat to Joey King's role, which was an odd characteristic for a rom-com. It was probably the only way this movie could be said to stand out. Not the best performances by any of the actors, and for Efron it was straight-up disappointing. Only if your expectations are already low will this movie slide by, otherwise it'll be a little worse of a rom-com than you're used to.",
    "date": "2025-03-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A nicely cast rom-com that remains formulaically half-full rather than pursuing potential slapstick amusement, fueled by King’s comedic snarky deliverance supported by Bates’ welcoming shoulder presence, all while Efron and Kidman’s chemistry only feels unenthusiastically coerced to victimize shame. (B-)",
    "date": "2025-02-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Decent flick. The cast helps carry this across the finish line. Kathy Bates is a great and unexpected part of this. Joey King stands out throughout this film as hilarious and delivers a stellar performance.",
    "date": "2025-02-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Cute, fun movie! Good for when you need something light hearted.",
    "date": "2025-01-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Couldn’t even make it through half of the film, it laxked any kind of substance. I can’t believe the actors involved agreed to do this.",
    "date": "2025-01-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Despite being predictable, 〈A family affair〉did bring up something that Hollywood doesn't touch or portray very often. The legendary Emma Thompson said that it's always about younger female falling for the older men, and now 〈A family affair〉proved that female being the mature one can still make the magic work. Watching a loving mother who's also a very successful woman falling in love with a \"A-little douche but still nice\" guy after a ten-year long sorrow and heartbreak is something I personally love to see. \n\nNicole Kidman is just as good as always, Joey King is surprisingly good playing this role (Her acting skill was already pretty good), and Zac Afron proved he's more than a hot guy, he can do this and a little beyond my expectation.",
    "date": "2025-01-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I thought this would be a great movie considering the actors involved. Boy was I wrong. I could barely make it though 1/2 the film and finally gave up. The plot, acting, and predictability was not good.",
    "date": "2025-01-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Nicole Kidman’s hair and eyebrows are terrible and her face and lips are so fake; she was much more beautiful as a natural. The romantic scenes are cringe.",
    "date": "2025-01-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I like Nicole Kidman, and that's what made me watch this movie. I don't like Joey King’s character. The girl needs to quit her job and move out of her mom’s life, let her mom move on, and try dating and have flings again. The whole movie is about her being a meddling B and getting a life of her own.",
    "date": "2025-01-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The Kidman Efron combo doesn't work for me, outside of the fact that both of their faces look reconstructed. The age gap aside, the story makes no emotional sense at all.",
    "date": "2024-12-31"
  }
]