[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A good movie that's based on fighting for the welfare of family is what the Rock has embodied in action, crime, thriller. All for the love ❤️ of his son.",
    "date": "2025-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Consider me eccentric, but I find it surprising that this movie has a 60% rating. Dwayne Johnson, known for his excellence, carries this film exceptionally well, maintaining a compelling pace. I strongly recommend watching it.",
    "date": "2023-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Decent movie with a prudent relatable and realistic plot. Not great by any means but worth a watch",
    "date": "2023-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Good movie to kill an hour and 45 minutes. Acting was good - dialogue could have been better. Totally didn’t understand the scene with all those midgets - made no sense to the plot and came out of nowhere.",
    "date": "2023-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This was 1:45 I'll never get back. I guess if you like Hollywood endings and unrealistic drug cartels then, this is a movie for you. Being a Snitch would bring a lot more problems for your family then was depicted in this movie. I understand it was based on true events but, maybe they should read the paper and find out what happens to you and yours if you double cross the Juarez cartel. It's Hollywood I get it but for once I'd like them to show a little more realism and, a little less \"Hollywood\". Dwayne Johnson should stick to action movies I just couldn't buy him being a subdued father.",
    "date": "2023-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Must See! I loved the plot and the character development.",
    "date": "2023-05-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The last of the not very good Dwayne movies",
    "date": "2022-12-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It works just well enough to entertain but you may forget it by the next day.",
    "date": "2022-12-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Solid movie and pretty good acting for the most part. Not a movie with a bunch of Dwayne Johnson fight scenes supported by some weak script. Jon Bernthal is a pretty good actor too. I liked the movie enough to have watched it several times over the years...can't believe it's 9 years old at this point. Watched it today, and then bought the soundtrack.",
    "date": "2022-02-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Great film. Highly recommend! Dwayne Johnson & Jon Bernthal work great together. Action & heartfelt movie with one of my favorite movie scores ever by Antonio Pinto.",
    "date": "2022-02-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The Rock was good in this more serious role about stuff drug penalties on young people.   I also liked the walking dead guy in this.",
    "date": "2022-01-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Probably the Rocks best film.",
    "date": "2021-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fantastic movie! Everyone did a great job with this film!",
    "date": "2021-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Johnson's not the usual action hero in Snitch, instead he's the smart father that will go to great lengths to get his son out of prison.  More a commentary on hefty first time offender drug laws than anything.",
    "date": "2021-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Barely warrants a recommendation from me. Needed a bit more action.",
    "date": "2020-12-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Snitch is a fairly basic film about a father who will do anything to help his son. The idea of it is ridiculous at times, particularly in the way the District Attorney agrees to work with him. However, he formulates a plan to deal with the problem that is understandable, and creates a dramatic series of events in the climax. Dwayne Johnson instantly makes for a likeable protagonist, but this film doesn’t capitalize on all his charisma. He isn’t having fun at any point in this film, and that is not a great idea when you have a guy like The Rock starring in your movie. The other issue with the film is that people are meant to be a threat to Johnson, but he is such an intimidating presence that it’s hard to see others as a danger. Susan Sarandon is perfect as the no-nonsense lawyer who is looking out for only herself and her job. I don’t really get the Jon Bernthal thing, though, he’s simply not all that engaging to me as an actor. I think at the core of Snitch there is a decent story, but it’s not all that original or interesting. I was into the plot enough to watch through to the end and see how it would resolve, but it’s nothing I need to watch again.",
    "date": "2020-04-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing movie. I didn't deserve this punishment either. How dare you all for hating on a movie that at least is trying to put us in the right direction. This wasn't Central intelligence or fast and furious. It was a movie trying to prove something unjust. You all that down on movies like this just like to hear yourselves talk.",
    "date": "2018-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Snitch with Dwayne Johnson is a really intense and hard edged thriller!",
    "date": "2018-05-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This had to be one of the worst movies I have seen Dwayne Johnson do. Yes, it was a different role than him being the big bad ass but, being the big bad ass is what he does! It pained me to see him get the shit beat out of him in this movie and not even try to fight back.",
    "date": "2018-04-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very good movie based around a very real problem still currently plaguing America today.  I wish there were more movies like this.",
    "date": "2018-04-11"
  }
]