[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "For me, and I consider Sci ci movies like aliens or blade runner  masterpieces. I consider Riddick as a flawless Sci fi horror action masterpiece. The cast is likeable and have great energy together which is rare in modern movies. The look of the movie. The dialogue, the ecosystem of the planet, the score, the survival aspect.. I really love this movie. I think also it's the best in the franchise. \nSeverely underrated!",
    "date": "2025-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "'Riddick' isn't a movie that I hold much praise for, yet it somehow did end up working for me. I was sensing light boredom for the majority, though it picks up enough by the conclusion that I'd say I'm cool with it. I could easily be rating it a notch lower, mind.\n\nThis is probably Vin Diesel's weakeast showing thus far as Riddick, though I still find the main man to be a solid watch; I like him as an actor, so little surprise I guess. Katee Sackhoff's Dahl is actually the one I enjoyed most, even if they annoyingly undermine the character at the end.\n\nThe rest of the cast aren't worthy of much note, though Matt Nable is alright and I'm always happy to see Dave Bautista involved in a project; this is, in fact, the fourth (unconnected) film I've watched this year that he has popped up in, more the merrier!\n\nEffects-wise, this mostly felt like a downgrade from the previous flick; despite the nine-year jump. The doglike creature, as cute a sidekick as it made, looks quite lousy. The feeling of being bored stemmed from the pacing, which did initially feel debilitating but it overcomes it.\n\n'Riddick: Furya' is set to be the fourth installment of this series. That could actually be good, on paper it sounds interesting at least. We'll see!",
    "date": "2025-04-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Assim como seus antecessores não me atrai, num futuro distópico sujo e empoeirado com homens sendo homens, a ambientação é interessante, gráficos perfeitos, e os bichinhos monstregoides são fofos, originais e bem construídos, o roteiro poderia ser mais cativante, o desenvolvimento não atrai, exceto os já apaixonados pela franquia, o que não é o meu caso… Boa ambientações, efeitos e bichinhos, de resto apenas regular…",
    "date": "2025-02-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I like it better than Chronicles and is defintely more in line with the first, but that's still not saying much. Oddly enough even though I like this more, it feels more forgettable in a way than Chronicles. Everything is just alright. The strongest part is the first 20 minutes showing Riddick suriviving on the desolate planet but it just becomes very forgettable when the mercenary gang lands and becomes the main focus. They all pretty much just blend in aside from a psycho and a girl being the only standout traits. Riddick just straight disappears in the middle and it just ins't as interesting. In a way you could cut the opening with Riddick and just start with the space marines and not much is lost. It also sometimes gets so dark in the second half you can barely see it and the CGI is terrible overall. Things this does get right is it trades mindless fast paced action for a slow burn survival story at first. Than becomes like the space marines in Aliens investigating and becomes more of a horror surival like the first one. It tries to merge these 3 aspects together and it isn't the most cohesive thing in the world but it works enough. It still feels like 3 completely different films though. The slow burn, immersion in the world, and the horror elements are positives and defintely the strong sits here. Riddick is alright but doesn't really have much character devlopment. In a sense this is sort of like a repeat of the first in certain aspects. While more in line it still isn't anything special. Most people could skip this. Just stick to the first.",
    "date": "2024-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I know this movie isn't perfect, but it's unpredictable and action packed, I re-watch it every couple years! \nIt's got a bit of everything, he befriends a dog, makes you want to protect the woman, revenge on the bad guys, battles monsters, etc.",
    "date": "2024-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Fitting end to the trilogy. Wish there was more.",
    "date": "2024-06-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Really cool other-world set, creatures and costume design. I appreciate that VD talks slowly and carefully otherwise I wouldn't understand what he's saying with his Jersey? accent.",
    "date": "2024-05-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I don't think it's possible to make movies like that these days.",
    "date": "2024-03-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Perhaps a slight improvement from the horrible 2nd entry.",
    "date": "2024-02-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Is an entertaining action movie with well choreographed fights but the story is average and predictable. The first movie is more original in the script.",
    "date": "2024-01-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The dialogue is nonsensical, pretentious, and insufferable.",
    "date": "2023-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Finally, the third and potentially best installment in this sci-fi trilogy by director David Twohy Vin Diesel reprises his role as the man who can see in dark living on a desolate rock in space after being exiled from his kingdom of the Necromonger fleet when all he wanted was a break from ruling A couple of mercanries land on his turf and he has to face all of them Although this rock is also inhabited by savage creatures so Riddick will have to work with them to survive It’s so refreshing that this is so much better than the second film which sadly failed to catch on despite having a larger budget and scope The first one was fine, acting more as a slow burner Here Riddick works way more as a character piece while also relying on slick visuals, cool violence, badass creature designs, and subtle action He co-stars with Dave Bautista, Katee Sackhoof, Bokeem Woodbine, and Karl Urban This pretty much acts as a soft reboot; Vin Disel actually made this film possible because it was a passion project for him This charmingly fuses 1950s style survivalist fiction meets Alien 3, there's certainly some Dune vibes here too Think of this as a Rosetta Stone for the sci-fi sub genre It helps to have a smaller budget even if there are plot holes and inconsistencies But thankfully Vin Diesel is so passionate about this character this is able to rectify many problems from last time",
    "date": "2023-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Minha opinião: Esta série de filmes Riddick, acredit que nem Diesel imaginou que chegaria até a 4º filme, que deve ser lançado este ano 2023. Que será 10 anos após o 3º que é este que iremos comentar. Para mim a persona de Riddick é o Conan na época dos bárbaros. O estilo a vida solitária e de sempre ter feras e traidores ao seu lado e ter a promessa de um reino é o mesmo de Conan. Diesel incoporou muito bem este papel. Que neste filme lembra Rambo no meio da floresta. Desde o 1º Riddick de 2000 quando Diesel tinha 33 anos aos dias de hoje. Aqui Riddick é traído pelo Necromounds e por Vakko é deixado em um planeta inóspito. Com criaturas mortais. E para a fuga do planeta Riddick chama caçadores de recompensa para o planeta. E assim surgem 2 grupos. E começa a caçada. Mas Riddick faz amigos no planeta e tem estratégia para fugir, já que as feras irão acordar. Assim decorre o filme lembrando muito o 1º. E temos aqui o pai em busca de vingança. Entre vingança e recompensa e criaturas. Filme bem produzido ao estilo Riddick. Estamos com expectativa para o próximo.\nVale apena assistir? Sim\nNota: 7,5",
    "date": "2023-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Lots of interesting special effects, almost enough action to take your mind of the goofy plot.  I did enjoy the sci fi scary parts.",
    "date": "2023-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I was hoping for quite a bit more from this new installment to the Riddick franchise. Instead, they went very basic and really just rewound the clock. There is already a movie in the franchise where Riddick survives on a hostile planet against monsters and people who want to kill him. It's called Pitch Black, and it rocks. \n\nMore than anything, this movie just feels like a missed opportunity to take Riddick to the next level and expand the universe. I enjoyed it for what it is, but I wouldn't buy it or watch it again.",
    "date": "2023-01-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Similar to the originals. Not amazing but still worth a one time watch",
    "date": "2022-12-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I liked this one. It was more \"back to roots\" than the chronicles. Survival in a remote desolate planet. There was a bit of comedy too, but Riddick was still a badass that he should be. I like the thing that he is usually one step ahead of others. I liked characters in this one. Different parties of mercs (professionals and scavenger- likes) gave more indepth to the world of Riddick. There were no Necros in this one (after the intro ofc) and they would have not fitted too good in the movie anyways. Only thing that I missed, was the original uncut start. First time I watched this, there was longer beginning with the stabbing and such, but later on I haven´t found the original version anywhere. Still, this is a good movie carried mostly by Riddicks persona. All this in  my opinion ofc.",
    "date": "2022-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Riddick is not a very deep, complex or nuanced film, but it does understand the 'Show Don't Tell' principle better than almost any other film this century.  The fact that this movie literally has a wordless 30 minute gap, and this bit is the most engaging part of the movie, really says something.  Honestly, I would've been happy if the entire movie were just Silent Riddick vs The Hostile Environment, which is what this chunk of the movie was.  Then other humans show up, and the movie does dip in quality -- however, it's still overall quite engaging regardless.  (On a side note I just realized that this is something I'd say about Evil Dead 2, so if you've seen that, you can apply that thought to this movie..... just know that Evil Dead 2 is amazing, while this is merely good.)  Vin Diesel does a good job as the no-nonsense anti-hero protagonist, and his \"pet\" is one I genuinely cared about.  The action scenes are also pretty good as well.  If there was one actual point of contention, it would be that the previous film, The Chronicles of Riddick, ended with a MUCH different sense of tone and scale than this movie, and the way that the movie decided to entirely drop the story that came before it, all just to return Riddick to Pitch Black territory (by that I mean the first movie of the series) felt very much unsatisfying, at least for those that found the previous movie interesting, which I did.  I also felt that the ending of this movie was slightly abrupt, but honestly it was fine.  If you would like a good way to kill 100 minutes, and you don't have other screens demanding ocular attention, I actually recommend this movie - it's not great, but the silent portion is legitimately borderline-excellent, and the movie is worth seeing for this portion alone.",
    "date": "2022-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Neutered Riddick with a heart and feelings now carried over from the last movie.  The direction of this one was going great with it being Riddick and dog versus the environment, then they f*ck'd it up by adding humans and the same element of escaping aliens from the first movie to the second half of this movie.  Totally ruined it for me.  If they kept it man and dog vs the environment till the end where they hijacked a ship from space pirates and man and dog escaped the planet with hostile aliens then I would have enjoyed it a lot more but the script writers were all over the place then copied the last half from the first movie so in the end I was very disappointed.  Would have given it 3 stars but killing off the dog pissed me off.",
    "date": "2022-03-22"
  }
]