[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Lol this movie gets dumber the longer it goes.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is the dumbest movie I’ve seen in my entire life. \n\nGet bit by a gator 7 times, have nothing but scratches and cuts, get barrel rolled by it, and you’re still apparently able to use your arms and legs all the while STILL being faster than the gator. \n\n200+mph category 5 hurricane winds? No worries! Helicopters and boats still work just as well. \n\nYou can even retain the flowers on your rose bush. They’re immune! \n\nI watch a movie almost every night and this is the first time I’ve seen a movie so bad I’ve considering drinking to drown the sorrow. \n\n-1/10",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Relentless nonstop intensity. Great creature feature. The gators are genuinely frightening.",
    "date": "2025-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Definitely worth a watch if you enjoy this genre!",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It’s a fun concept with some really good bones. They missed a lot of opportunities to make a richer story, but it’s enjoyable and an insane watch.",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "If you liked this, you'd probably also enjoy another horror movie made by this director called High Tension (2003) or this other natural horror movie called The Shallows (2016).\n\nCrawl (produced by horror legend Sam Raimi) far exceeded my expectations and firmly sits near the top of the list when it comes to \"natural horror\". What really makes this movie work is the combination of a few things...\n\n1. This movie is advertised as a horror, when secretly it's also a natural disaster thriller (like Twister). The characters refuse to drown trapped in the crawlspace under their Florida  home being flooded by a hurricane, therefore they MUST face the threat of alligator attack by traversing through the waters in an attempt to get to higher ground. The audience suffers both fear from the creatures and anxiety from the storm at the same time.\n\n2. The script wastes no time getting down to business. With a runtime of 87 minutes, the protagonist's Dad is declared missing and the hurricane starts 5 minutes in. At 15 minutes in, a tree is hurled through the window of their home and the threat of weather is real. And at 20 minutes in, our two protagonists are pinned down by 2 gators in the flooding crawlspace underneath the house. \n\n3. Almost 60 of the 87 minutes of Crawl takes place in a single location: the crawlspace under the home. This confined space cleverly adds a layer of claustrophobia on top of the fear of drowning and being torn apart by alligators.\n\n4. Most importantly, this creature-horror seems (relatively) realistic, like The Shallows (2016) and is fiercely anchored by strong performances by Kaya Scodelario and Barry Pepper.",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I thought it would be a lazy, \"Jaws\" copy used as a cashgrab, but I left amazed. Like seriously this was actually intense, I didn't expect half of the stuff that happened in the movie. It could benefit from better camera shots tho. I don't have any more problems, the story was good, the jumpscares were good, the enemies were good, the characters were good, the kills were good, the setting was good... Like literally everything was done as well as it could possibly be!",
    "date": "2025-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This simple film is by no means a masterpiece for the ages, but it had a lot of heart, and I enjoyed a lot for what it was. The basic situation is almost guaranteed to provide plenty of suspense, and this element was executed competently. I found myself warming to duo of main characters (or trio if you include the dog), the protagonist and her dad, which made me root for them in their peril. The alligators are suitably brutal, and they facilitate some effective action sequences. Furthermore, the film doesn't outstay its welcome. I have very little to complain about here!",
    "date": "2025-05-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Crawl is an intense, solidly made little thriller that delivers some genuinely fun and nail-biting moments. While the lead character can be a little grating at times and the ending wraps up a bit too cleanly, the film largely succeeds as a lean, mean creature feature that keeps you on the edge of your seat.",
    "date": "2025-05-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A fun thrilling killer alligator movie and is so much better than sharknado.",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Stupid people making bad choices and losing body parts to strangely ravenous alligators",
    "date": "2025-04-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This horror movie is precisely one of the styles I love to watch as it is both engaging and concise, thereby evoking a thrilling reaction.",
    "date": "2025-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Review scores of 84/75 for this flick is wild. This is solid, but nowhere near great or classic territory. I mean come on, there are no surprises, an enormous amount of dumb decisions so the plot moves forward, and lots of very poor CGI",
    "date": "2025-03-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It delivers on all fronts, exciting and to the point. It’s the Gainesville, Florida equivalent of Cameron’s Aliens.",
    "date": "2025-02-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "What a boring movie, and so predictable. With an alligator that is about as real as Mary Poppins. That alligator would have had her and him in the first few minutes, for the rest of the movie we suffer bad acting from everyone and more bad toy alligator scenes with it making sounds no alligator makes. Sooner watch gloss paint dry",
    "date": "2025-01-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Easily one of the most unrealistic movies I've ever seen, gators don't just go around eating people. The dads injuries should've had him in complete shock or dead. The daughters injuries seemed to not imcompacitate her at all. This movie is a complete dud, complete with a dumb ending",
    "date": "2025-01-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Watched it with my mommi, she was so scared.",
    "date": "2024-12-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The film is a waste of time. No one survives the crush of the alligators' jaws -- unless of course it's the two main principal actors who seemingly heal in minutes.  Much of the dialogue is those two yelling the other's name back and forth:  \"HALEY?\"  \"DAD?\"  And of course \"HELP!\" All leading to the bland and ridiculous ending. Hated this film.",
    "date": "2024-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Most creature-features both good and bad exaggerate their wild antagonists in an attempt to make things more interesting. Ever since the genre peaked with Jaws, such attempts have since dropped even into hysterical attempts. But that's what's extra scary about Crawl. The things these alligators do, how big they are, how they act - it's very plausible. The gators are portrayed very well. My only note is gators don't need to eat that much but then again when you only eat a few times a year why not go at it? Anyways the story is pretty good, the cast isn't special but their acting is supplemental. Violent, fast paced, lots of suspense.\nHurricane Milton Meets Hurricane Wendy (not the fast-food location).",
    "date": "2024-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Good movie, very exciting. some gross parts but I was happy when the main charectors all got away from the aligators. including their dog.",
    "date": "2024-07-16"
  }
]