[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Light hearted amazing cast very relatable humorous!!\nLoved the music and writing was amazing \nA very feel good movie",
    "date": "2025-05-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Entertaining movie. Nothing more, nothing less.",
    "date": "2025-04-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Entertaining movies! Couponing is what we’ve always wanted to do right!! Love it.",
    "date": "2025-01-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "While the Vince Vaughn-Paul Walter Hauser scenes are uproariously enjoyable, Kristen Bell and Kirby Howell-Baptiste’s piloting charm along familiar schematics was letdown by demeaning subjectivity deemed uninteresting and pitifully illogic. (C+)",
    "date": "2025-01-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I liked it more than I thought I would, it's finally a little different story which is entertaining to me so many movies are about almost the same this is something fresh and Id recommend it",
    "date": "2024-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Above average dramedy - Kirsten Bell really makes some excellent choices. Totally surprised at the story telling and acting of a real-life story that had a great chance to be a bomb. I mean, what to expect of a movie about supermarket sales coupons? Just the ending I missed the day after of the postal officer.",
    "date": "2024-12-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A welcome reprieve from Hollywood's stilted dialogue and predictable and formulaic story lines. Funny, irreverent and thoroughly entertaining with original characters. I'll be watching it again.",
    "date": "2024-12-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Funny, easy watching. Good movie to pass the time with, nothing too spectacular but worth the watch for the dancing!",
    "date": "2024-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I really enjoyed this! I really wasn't expecting much but it was so much fun. There's definitely some moments in it that don't add up (buying so much in cash and no one raising an eyebrow?) and the very end wasn't the most satisfying, but I still thoroughly enjoyed it.",
    "date": "2024-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It has an interesting premise and some entertaining moments, but it's predictable and most of the humor feels forced and falls flat.",
    "date": "2024-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great portrayal of a true story!",
    "date": "2024-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I think you're supposed to sympathise with Bell and Kirbys characters, but they're unsympathetic, unrepentant and unlikeable throughout. The plot is extremely simple though so it's okay if you want some background noise.",
    "date": "2024-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Likeable cast, funny story. A good movie",
    "date": "2024-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I like this movie, despite all the negative reviews. Interesting I like a lot of productions that the critics give bad reviews. Kristen Bell is excellent in this movie as is the rest of the cast. Tune it in you will not be sorry.",
    "date": "2024-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It’s alright ending wasn’t all that nice mailman my favorite character he chill.",
    "date": "2024-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Thoroughly enjoyed the film, it got me out of a bad mood and gave me a good laugh. One of the best comedies I've seen in awhile and I know while the bar is low, this was a good one. It actually had a clever plot which I think a lot of comedies out they're missing.",
    "date": "2024-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Watching this a second time and I still love it!",
    "date": "2024-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Rating: 7/10. 74/100",
    "date": "2024-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I thought the casting was spot on, script was okay",
    "date": "2024-04-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Underrated comedy. Good cast, funny smart writing.",
    "date": "2024-04-21"
  }
]