[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The animation look great, but the kind of mess with the sauce material what I did rap to Dr. Seuss it’s stupid. Find the Grinch don’t feel like the Grinch we know in love. These movie is good to have some good parts in it. But this is a mediocre movie.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It’s an adorable movie that children love. I do however wish it would have stayed true to the original Grinch plot.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was such a good movie!! I loved it",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This is a ridiculous hay fever dream of a movie. It takes the concept of The Grinch and makes it nearly unbearable to watch. It’s so awkward, uncomfortable, and just plain painful to sit through.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I read some of the Dr. Seuss' books when I was in Kelly Elementary School, so that means I can see Christmas movie every year, especially Tim Burton's the Nightmare Before Christmas, The Grinch, Home Alone and Home Alone 2: Lost in New York, along with the Toy Story movies.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The voices were funny, and there were fun moments",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "La mejor película navideña del mundo",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It’s fun! It does a great job in capturing a modernized version of WhoVille and the Grinch tale. My 8-year-old just chose it as the first holiday film to watch this year. \n\nThe voices work well too.",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "6 out of 10.",
    "date": "2025-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The animation was perfect and also story accurate as well as the 2000 Grinch even though the 2018 Grinch didn't say the exact same line from when he noticed his plan didn't go right but it's the thought that counts",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I like The Grinch it’s my favorite Dr. Seuss characters and Overall Holiday. That being said this movie is a big downgrade from Jim Carrey’s grinch interpretation. It just doesn’t have the magic and the feeling of a great holiday film. I was basically disappointed with this iteration of the grinch and I think still to this day Jim Carrey‘s grinch is the best.",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great rendition on the original in a more modern and well depicted manner. favorite of the 3",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Benedict Cumberbatch voices the festive grump in this frenetic, family-friendly animation of the Dr Seuss story.",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It’s honestly pretty alright",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I  was very pleasantly surprised how much I adore this version… it’s miles better than the live action version…..\n\nThe Grinch delivers exactly what a holiday film should: charm, laughter, and a heartwarming message about the true meaning of Christmas. \n\nWith its standout animation and the beautiful, deep affection between the Grinch and Max, this movie is a holiday treat that has  to be a new holiday tradition.",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It's pretty solid way better than the realistic one but my fav is the first one the first is a classic but this is probably what Dr seuss would want for his movie it is completely kid friendly just like him",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Un ottimo film natalizio",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great film. Emotional and entertaining. Great music.",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Good enough for children to mindlessly watch, but nowhere near comparable to the comedic genius that previous versions of the film offer. This film should be classed as a standalone.",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Even though I don’t really like this film somehow I find myself watching it every year",
    "date": "2025-07-20"
  }
]