[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Disappointing waste of time. Should have been marketed as an urban comedy. But unrealistic, insipid, and uninspiring. I felt nothing for these characters other than actors acting rote and tired. Poor excuse for a paycheck. Don’t waste your time. You would have more fun removing the mildew from your shower walls!!",
    "date": "2025-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This movie is compared to Hitchcock.  Is that Bob or Jack Hitchcock?  Because it can't be Alfred Hitchcock.  The first few minutes are intriguing and OK somewhat Hitchcock-like, but then it turns into a claustrophobic retelling of Who's Afraid of Virginia Woolf.  There's a twist ending in spades which I really hated. I watched this right after Cobweb, so it was bad night for movies.   I added a star because the female lead is Phil Collins' daughter which is just awesome.\nP.S. I feel I have to vote thumbs up on Netflix even a bad movie if it's in one of my favorite genres.  Otherwise, the algorithm may recommend soap operas to me.",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Unresolved plot lines. No character development,  not sure who was the villain and who was the victim. Slow paced.",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "'Windfall' holds some moments of promise, though my interest dropped out too often for me to deem it as a good, or even an average, movie. I was uninterested more than I was locked in. That's a shame, because the (tiny) cast are great on paper.\n\nLily Collins is the standout, with Jesse Plemons closely following. Jason Segel is iffy in this, his body language sorta acting is actually good but once he starts talking I just didn't buy the whole situation; same could perhaps be said (albeit to a lesser degree) for Plemons, who I am a fan of.\n\nThe fact that it is a very obvious 'COVID movie' doesn't help, it just makes the limited, one location nature of the plot feel too restrictive. That's probably an unfair thing to judge the movie on given the time, but still. In total fairness, the film picks up its pace slightly near the end.",
    "date": "2025-06-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Charlie McDowell seems to only score.  I’m a fan.",
    "date": "2025-03-31"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Boring I dont fet what's the point of the novie.\nI wasted my time for this bad movie.",
    "date": "2024-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Ugh… so slow.  Didn't feel like a thriller at all. A lot of drama and low paced sitting and waiting.  Boring.",
    "date": "2024-03-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Nearly everything was fine in this slow and sober psychological thriller until the ending. The closing act is unforgivably grotesque and illogical–it simply does not follow from the characterization that the script so carefully managed to build.",
    "date": "2024-01-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie is vapid ….  What a god awful script whomever wrote this wrote.  Complete waste of time",
    "date": "2023-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I'll start off by saying the acting in this movie was great. Jesse Plemons is so good at playing a guy you want to punch in the face... But the pacing in this movie was so bad. It was so slow. *SPOILER ALERT* I could've dealt with the slow pace if there was some glorious payoff at the end... But there wasn't. We never find out the real story behind Jason Segel's character. It would've REALLY helped the movie to learn his backstory. We learned a little bit about Lily Collins' backstory, but not enough to justify being a homicidal maniac. This movies was sooooo close to being really good, but it just dropped the ball at the end.",
    "date": "2023-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Edge of your seat kind of thrill through the whole movie!",
    "date": "2023-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Stylish, well shot and appropriately paced, none of which compensates for bland dialogue. There's not a profound line to be had in this movie.",
    "date": "2023-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Horrendous. Super boring. Some of the worst and unconvincing, cardboard face acting I have ever seen. All of the characters are unlikeable and lame. This movie is not even on the the level of a failed high school graduation project. Very stupid storyline that got dumber with every passing minute. Terrible dialogue. A ridiculous plot that is full of random and aimless events with countless gaping holes. The ending is purely idiotic. It was predictable, unimaginative, and cheap. It was a failed attempt at a plot twist, but you already knew how the movie was going to end from the beginning. Overall, it's a very cheap, nonsensical, and poorly made movie that should have never been produced, acted, or directed.",
    "date": "2023-03-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This was an interesting movie. It was okay overall. It only had four characters in it and the performances by the three leads were really good. It's not really about a burglary gone bad. It's more about a simple trespassing gone bad. The mystery element comes from why one character broke in in the first place and what his beef with the husband is. The twist ending regarding one characters windfall was a surprise. A well acted and suspenseful film. I think it wasted some time though with lots of shots where nothing happened other than suspenseful music played. It was effective at first, but overused throughout. A decent mystery though.",
    "date": "2023-02-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Jason Segal breaks into the vacation home of a wealthy businessman played by Jesse Plemons.  Things don't quite go as planned when Plemons and his wife, played by Lily Collins, arrive unexpectedly.  \nThis was a good crime thriller with some tense moments.  Very good performances by the three leads. Went in blind on this one and quite enjoyed it.",
    "date": "2022-12-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Another decent “pandemic” movie. Small cast all in one setting. The only real downfall of this movie is that, at times, it’s painfully slow. The acting is brilliant and all three main characters were pretty great. Although excessive, I found the background music quite playful as it fit the movie quite well. Never really knew what to expect with this one until it was over.",
    "date": "2022-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "excessive profanity but decent acting and cinematography",
    "date": "2022-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Very dissapointing held together by a decent cast.",
    "date": "2022-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A well made Covid production, I think maybe the ending twist/motivation was a little too easy to predict. Wonderful cinematography.",
    "date": "2022-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Surprised to see so much lukewarm reaction to this movie. Far from an edge-of-your-seat thriller, but definitely does more than enough to keep your attention through its brisk 90-minute run time. The three main actors perform surgically in every frame. Though the conclusion is heavily telegraphed throughout the third act, it still manages to land as satisfying. Two thumbs up from me.",
    "date": "2022-07-05"
  }
]