[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Good fight scenes, the story gets a little fuzzy , but all and all a good film",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Paul Mescal defined the voice, the aura and the embodiment of a true Roman, with a beautifully orchestrated chaotic Rome by Ridley Scott. My biggest regret not watching it on the big screen.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A truly dreadful film and I can’t help feeling Ridley Scott was having a trip when he wrote it. Where Gladiator was terrifically scripted with an excellent cast, well filmed and with one of the best music scores I can imagine, GladiatorII is the opposite in every way. The storyline struggles to hold itself and the casting is actually funny in its lunacy. Nothing rings true: in particular Washington is awful and the casting of Matt Lucas is just bizarre. Some scenes are just nuts - sharks in a flooded Colosseum??? A massive miss. I have just watched it in full having given up after 30 minutes last time but still nothing works. A total flop. Don’t waste your time!",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The majority of this film felt like it was leaning too heavily on call-backs to the original - which mostly feel forced. Great action sequences, but a story that you can call every step from miles away. Predictable but entertaining none-the-less.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Well acted and written",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Poorly-edited CGI slop. Despite having a huge budget, there are so many beginner-level mistakes.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Very much similar opinions to the first one. This just ain't my thing.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This is not a good film. It's like Ridley Scott rewatched the first one and copied it in every way, but without understanding what made the 1st film so brilliant. Similar characters, similar storyline, similar lines. The acting isn't great, and my main issue is the characters are so 2 dimensional, it's hard to care about any of them.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Denzel Washington is an all time great, but he works best in modern gangster style roles like Training Day, Equalizer, or Man on Fire. Dropping him into Gladiator 2 just did not work. His style, presence, and delivery all feel too modern for the Roman world, and instead of blending in he becomes a distraction.\n\nThe film tries to present a gritty, authentic Roman environment, and then in every scene he feels completely disconnected from the world around him. It breaks the immersion and makes the story feel less believable. It is not about his acting ability at all. It is the casting choice. He simply does not match the tone, culture, or atmosphere of the setting, and the contrast is obvious every time he appears.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Production values and acting alone warrant a watch. The original was better as a stand alone film with real emotional stakes. That doesn’t diminish the quality or fun I had watching the sequel. Denzel Washington played a pitch perfect villain.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Guys I really wanted to like it but it did such a disservice to the original gladiator. Didn’t really bring anything meaningful to the “next” chapter of the movie",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "They don’t make movies like they used to. Seemed like a money grab rather than making a decent movie.",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Big budget, striking visuals mean nothing when the story is a tired mess. The worst offence was the Sharks. I still don't understand how the Romans fished for sea-bound beasts and stuck them in the middle of the colosseum. Someone please explain this to me?",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Whilst not on the level of the original movie it is enjoyable enough. Some good performances from Denzel and Connie, but I felt the lead actor was not the best casting which lets the film down somewhat.",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The story of Lucius’s (Paul Mescal) forced entry into the Colosseum after his home is conquered by the tyrannical emperors now leading Rome is often visually stunning, but is also very violent, beyond what is needed, only for unnecessary emphasis. It’s also quite long as it journeys its audience through loops of the same narrative aspects.",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I didn't have high hopes for this sequel, but it managed to surpass all my expectations. Mescal excels as the leading man and left me wanting to know more about him by the end...Return to Rome...Your destiny awaits.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Can’t connect both movies, the first one was raw, storyline made more sense to me and the development of the characters resonated more in the movie, the second movie has a lot of cgi for no reason that makes imposyin my opinion to be able to connect both movies, the storyline feels a lil forced and I don’t know why but rushed also. Feel like they could have made a awesome Gil, specially because of the actors they had.",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Worth a watch if you liked the first one. This is nothing even close to that but has some good moments and performances.\nOne extra star just to be a somewhat honorary sequel.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I’m a fan of this sort of film, an action picture set in ancient Rome, but Ridley Scott no longer seems capable of mustering the old magic that marked his early filmmaking. The writers missed capturing the essence of what made the first film interesting - historical drama based in history. \n\nPaul Mescal is good, but never mustered the same presence as Russell Crowe, and the Denzel character seemed hollow and never developed due to the screen time dedicated to the fatuous duo dunce Emperors. \n\nI absolutely recommend a watch, if only to pay homage to the first landmark film, and the fantastic VFX rendered by the crews in this one.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It was visually pleasing, boring storyline and you didn't really get drawn to anyone. It was ok, but nowhere near the level of the first one.",
    "date": "2025-10-29"
  }
]