[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Monster Hunter was released in theatres in 2020 and stars Milla Jovovich as the protagonist in another of her husband's, Paul WS Anderson, movies. Anderson is of course known for his terrible Resident Evil films and most recently for In The Lost Lands. Anderson uses a bunch of different tropes for this movie grabbing scenes from Predator, Alien, The Mist, The Dark Tower series, Lord of the Rings, and more. Jovovich plays a female US Ranger Captain in charge of a UN team searching for a lost patrol; yes that's the plot. During the search they are transported to another universe by a magic storm where monsters reign and she has to fight her way to a portal. Nobody in the film knows how to handle a firearm unfortunately so everyone except Jovovich is killed immediately but there's a hunter with a cool bow shooting monsters so we're good. Honestly, I like the CGI locations, some of the monsters looked good, but the plot was horrific (sailing ships on sand lol), and the acting was largely embarrassing. But, this was so bad I actually enjoyed some of it so if you like campy sci-fi action movies this may be for you.",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The film starts out fine. The visuals are great and the humor keep me engaged. The characters and setting are well established and I was with the Rangers as all hell broke loose around them.\n\nOnce the Ranger and the Hunter met the film lost me,. The extra long unnecessary fights between the characters made no sense to me. Didn't they just see the giant monsters outside?? Is there not a literal threat just outside the window that take priority to just survive? \n\nI thought we'd get some kind of more established plan to take down some big ass monsters. This part was half-baked and came of as rushed. We get ginat battle after giant battle that ultimately would have been more fun tot play than watch. The final act of the film barely qualified as a movie, more like a sequence of events, a few cut-scenes shown in a row. The narrative payoff is very low, and the visuals get repetitive. The film is begging for a sequel that will never come, hopefully... Which is a shame given the the first act was fun.",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "One of the least faithful adaptations I've ever watched. It's like they were trying to misrepresent the world of Monster Hunter on purpose.",
    "date": "2025-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "An awesome ride of the movie! The trailer didn't do it justice. It's a non-stop action adventure with excellent CGI base monsters. I didn't expect the body count to be so high for a movie based off a video game but did it delivered some fight scenes! I can only hope they produce a sequel!",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "ULTIMATE REVIEW:   Mindless monster fun but still manages to annoy you.  Some final monster battles save this movie.  Usually these movies can be more fun than mindless but they tried to fit 3 different plot lines in one movie and told completely separate.   Not consistency.  No rhythm.",
    "date": "2025-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I don't know why this movie got so much hate it was a very good movie. I played the games it's pretty much like the games but is really cool to see it in a live action. I hope they make another one and people give it another shot because it was a really good movie to watch. It was pretty high the last scene was awesome and the CGI was very good. Also the actors were great and the acting was well done.",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Another movie made to simply make money not to appease public or stay true to form",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A military unit crosses dimensions and encounters a bunch of large bugs.  Hilarity ensues.\n\nIt's a good thing I've never played the Monster Hunter video games.  As I understand, it's set in a world where PCs get assignments and go out to kill monsters.  This film isn't that.  Instead of being a film that builds a world, we instead get some Americans going blind into a situation in which they are woefully under prepared.   It takes over an hour to get past the first conflict and once we get to learn about residents of this world the film is over.  And we don't get to learn much about the setting anyway.   I had no idea Javovich, who plays the lead, was Anderson's wife.  Virtually every film he's done since meeting her features her.  She's an okay actress but I think he should quit indulging her.\n\nThe action scenes are decent and I did love the dragon-kin toward the end of the film.\n\nIf you do view it, there is a mid-credit scene.",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1 hour and 43 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated PG-13 for Violence Throughout and Sequences of Creature Action!!!!!!!!!!!! The USA grossed over $15,100,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "So cool. Did not have any expectations coming into it, and left satisfied.",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "(CASTELLANO) Tenía claro que no iba a ver una obra maestra, pero no esperaba algo tan desastroso. Monster Hunter falla en prácticamente todo. Siendo fan del videojuego, lo mínimo que uno desea es un guiño bien hecho o una atmósfera parecida. Pues ni eso. La película es ruido, explosiones, monstruos que apenas transmiten nada y personajes que dan igual. Ni siquiera Milla Jovovich consigue levantar esto, y eso que siempre le tengo cariño por su entrega física en este tipo de cintas.\n\nEl guion es una colección de escenas que no conectan, con una narrativa que parece escrita en una servilleta. La dirección de Paul W.S. Anderson apuesta por la acción sin pausa, pero sin ritmo, sin alma, sin emoción. Hay alguna criatura visualmente interesante, vale, pero el conjunto es tan aburrido que cuesta mantener el interés más allá del primer acto.\n\nMe cuesta entender cómo se puede desaprovechar tanto material. Y no es una cuestión de presupuesto ni de actores, es que no hay una sola idea buena detrás. Es como si todo se construyera con prisas y sin pasión. Una película que parece hecha para cumplir con una cuota, no para divertir ni para homenajear nada.\n\nLe pongo un 3/10 porque, a pesar de todo, Anderson ha sabido hacer cosas mejores y alguna que otra escena está bien filmada. Pero es un desastre de los que cansan. De esos que ni con palomitas se salvan.\n\n(ENGLISH) I knew I wasn't about to watch a masterpiece, but I didn’t expect something this disastrous. Monster Hunter fails on almost every level. As a fan of the video game, the least you want is a well-done nod or an atmosphere that feels familiar. But no. The film is just noise, explosions, monsters that barely convey anything, and characters you don’t care about. Not even Milla Jovovich can save this, and I usually have a soft spot for her physical commitment in this kind of film.\n\nThe script is a collection of scenes that don’t connect, with a storyline that feels like it was scribbled on a napkin. Paul W.S. Anderson’s direction goes all in on non-stop action—but without rhythm, without soul, without emotion. Some of the creatures look interesting, sure, but the whole thing is so boring that it’s hard to stay engaged beyond the first act.\n\nI struggle to understand how so much material can be so poorly used. And it’s not a matter of budget or actors—it’s just that there’s not a single good idea behind it. It all feels rushed and lifeless. A film made to meet a quota, not to entertain or pay tribute to anything.\n\nI give it a 3/10 because, in spite of everything, Anderson has done better in the past and a couple of scenes are decently shot. But this is a tiring mess. The kind that not even popcorn can save.",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Completely missed the mark of the games",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The only good part for me is they had Gore Magala at the end, and there’s barely much monster hunting.",
    "date": "2025-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Not really sure what to say… the action and CGI were great, but other than that, it was kinda boring.",
    "date": "2025-05-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Worth a watch! Good CGI and action.",
    "date": "2025-05-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It was bad enough for me to come here and say it was bad.",
    "date": "2025-05-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Barely any storyline. A mishmash of creepy action and bland thin storyline. Over halfway through with zero context of who or what the giant animals are. With zero context of why they are here. lol might as well be a commercial for the female actor trying to be the next GI Jane. Just nonstop screaming and grunting. Im amazed at how poor the chemistry is. It was trying to be a starship troopers movie. But that actually was notable with a well built story line.",
    "date": "2025-05-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I am not familiar with the Monster Hunter universe, so I can't say for sure if this is the best adaptation of the game. What I can say is I thought this movie was awesome! It's not a masterpiece, but it was really fun to watch, had incredible action sequences, and a really compelling story. I definitely recommend it for fantasy and action fans!",
    "date": "2025-04-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I have learned that if Rotten Tomatoes gives a mediocre rating to a movie, I will definitely like it.",
    "date": "2025-04-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "My Army Ranger son would laugh out of cringe when watching this then he would throw a beer bottle at the TV screen.",
    "date": "2025-04-26"
  }
]