[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "An insight into that top 2% that makes champions. Yes she is abrasive and all the social graces of a viper but you will find that in every winner. Great acting and I wish I had what it takes to be a NYAD but uplifting as it is we can't all achieve her greatness. Grab all the motivation you can from this and live another day",
    "date": "2025-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Nyad is a beautifully told adventure drama about  courage, achievement, aging, and friendship. The stars, Annette Benning and Jodie Foster, both give awards-worthy performances as Diana Nyad and her coach, respectively. Netflix is great at finding classic dramas with a modern twist and this true story of a World Record achievement really works. “Everyone should feel like the star of their own life,” says Diana Nyad, whose goal of swimming from Cuba to Florida was an “impossible” dream that she turned into reality. If you want to take a moment to feel inspired, then see this film!",
    "date": "2025-01-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Filme: \tNYAD\t\t\tAssistido: 03-01-25\nElenco: @annettebening  @officialjodiefoster @rhys_ifans_welsh_actor @annaharriettepittman\nModelo: #esporte #superação #drama #fatoveridico\nDuração: 2h\tAno: 2023\nMinha opinião: Um filme de fato verídico que conta a história de Diana Nyad, uma nadadora de longa distâncias e que detém recordes de nado. Mas o único desafio que não conseguiu foi nadar de Cuba a Florida. São 160 Km em mar aberto, mas isso depois de 30 anos. Ele tenta quando esta 61, 62, 63 e quando estava com 64 anos consegue, quando todos não acreditava mais nela, e por causa das adversidades e da idade. Mas a sua determinação e concluir esta missão, proposito de vida fez ela vencer, o mar, águas marinhas, sol, tempestade os amigos, a técnica, e a si própria. \nRoteiro e enredo de perseverança. Lembrando que temos Jodie Foster e Annette Bening.\nVale apena assistir? sim\nNota: 6",
    "date": "2025-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Fun feel good story. Jodie Foster and Anette Bening's chemistry was great. Really loveable and amusing characters. Worth a watch",
    "date": "2024-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Nyad avoids (most of) the typical clichés that accompany athlete biopics. At two hours and a singular minute, it is well-paced and, as someone who knew nothing about Diana Nyad’s (Annette Bening) story, provided a plot with scintillations and concerns — if she couldn’t do it at 30, how would she do it in her 60s? Annette Bening plays the protagonist as someone monomaniacally driven and pretty shitty to those around her, even if she couldn’t accomplish the feat without their assistance. If swimming in shark and box jellyfish-infested waters from Havana to Key West isn’t enough, Nyad recounts sexual abuse she endured as a teen when a jellyfish smashes her in the face. Unfortunately, the film suffers from this common trope wherein the remarkable, death-defying stunt isn’t enough and we must include adolescent trauma. Her story is uplifting, even if the authorities at be have questioned the legitimacy of her accomplishments. Jodie Foster, as her long-time friend and coach, and Bening have the chemistry you’d expect from that sort of lengthy, even beleaguered, relationship. While I don’t think it will win anything at the Oscars, its nominations (Best Actress and Best Supporting Actress) got me to watch and review it and I can definitely recommend Nyad for not diverting from the core of what an athlete biopic should be.",
    "date": "2024-12-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What an amazing movie. what an amazing true story of a human grit.\nBravo...",
    "date": "2024-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Me gustó la forma de contar la historia, la introducción me parece correcta y como intercalaban las imágenes reales de las hazañas de Nyad, los personajes son interesante y no se sienten ni planos ni forzados, todos tienen tu propósito en la pantalla y lo cumplen perfecto. Quizás el ritmo es un poco lento al inicio pero es necesario para ir asentando la historia y la forma en la que la misma Nyad estaba llevando su vida, también fue interesante como fueron mostrando el abuso de su niñez con breves imágenes y relatos que no rompían con el ritmo de la historia.",
    "date": "2024-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Acting was great from the two legends Foster and Benning. However, I found the protagonist to be so unlikeable that i lost interest with her endeavor and in the movie. I struggled to finish it.",
    "date": "2024-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I was surprised at the 85%-plus audience & critic ratings. I'm a sports fan, but somehow the story didn't really grab my interest/emotions.\n\nGiven the portrayal of Ms. Nyad as somewhat psychologically \"absorbed\", it is a bit surprising that the movie brings forward her claims against former coach (& long deceased) Jack Nelson. In a quick search I did not find any support for the movie's representation that multiple former swimmers had made claims against Nelson. I do not mean to proclaim Nelson's innocence or say that that Ms. Nyad's allegation is untrue.",
    "date": "2024-07-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Nyad is just a bad inspirational biopic I wish I could just swim away from this bad movie.",
    "date": "2024-06-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Two of the finest performances from Annette Bening and Jodie Foster. The screenplay was exciting all the way through, even though we knew how the story was going to end. Great script, direction, and cinematography.",
    "date": "2024-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The performances of Jodie Foster and Annette Bening take an already captivating story and make it a must-see movie.",
    "date": "2024-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The rare “inspiring biopic” that mostly works.",
    "date": "2024-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Incredible performances from both Bening and Foster. This film had me on the edge of my seat!",
    "date": "2024-04-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Annette Bening and Jodie Foster make this a must see movie, however, the unlikeable main character & slow moving plot made it a struggle to watch to the end & like others, I was rooting for the sharks!",
    "date": "2024-04-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Estou assistindo alternadamente dois filmes baseados em fatos reais sobre três nadadores excepcionais e especiais, As  Nadadoras e Nyad e completamente encantada e apaixonada por ambos, impossível escolher melhor... Todas elas desafiaram a morte e seus próprios limites, muito diriam que é apenas um orgulho besta de Nyad, mas e muito mais que isso, é uma realização de vida, entendo. Jodie e Annette perfeitas, Jack Nelson estuprador. Como não amá-las, respeitá-las e exaltá-las. Chorei horrores.\n\nAo completar a travessia Diana diz que quer dizer três coisas: \"Primeira, nunca, jamais desista. Segunda, você nunca é velho demais para perseguir seus sonhos. E terceira, pode parecer um esporte solitário... mas é preciso uma equipe.\"\nEla um percurso de 165 km que Diana fez em 177km devido a correnteza, levou 52h e 54 min e depois de 4 tentativas frustradas (1978, 2011 e 2012) completou em 2013 aos 60 anos.",
    "date": "2024-04-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Pues si se merecen sus nominaciones.",
    "date": "2024-04-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Thank you for making this movie. The makers of this truly know what real empowerment looks like.they succeeded in conveying the message of what those big budget productions failed to do. These are the stories that need to be depicted. \nThank you",
    "date": "2024-04-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing, what a perfect film and incredible story.  The cast were absolutely great, it was shot fantastically and it tells the story well, moving quickly but not skimping on details.  Would 100% recommend!",
    "date": "2024-04-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie!  Well told story.  Great performances by the cast especially Annette Bening and Jodie Foster.  Will watch again!",
    "date": "2024-04-03"
  }
]