[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "No academy awards for this, but far better than the score it gets on RT.",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "In the train scene I realized how the movie continued, I didn't continue watching it, a shame because I had expectations for the good actors, it took me years to decide to watch it and I didn't finish it.",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Winner in 2 hours and 25 minutes!!!!!!!!!!!!!!!!!!!!!!!!!! Rated R for Grisly Images, Brief Nudity, Sexuality, Some Language and Violence!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $6,700,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I absolutely loved this movie, I really don’t get all the bad reviews!!!?? I feel like it was slow burn Detective thriller, like true Detective and really liked it. Give it a chance!!",
    "date": "2025-05-31"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The only good thing about this movie is Rebecca Ferguson. She is an incredible actress!",
    "date": "2025-03-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Good gawd what a wasteful thriller some of the cast have really horrible adr voice the story makes no sense that you get cold feet.",
    "date": "2024-12-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Alfredson may as well have had a snowball fight with himself... This is my second full run-through. I didn't dare review it after the first watch - surely I missed and/or didn't understand something? No. It is actually as bafflingly awful as it was when I first sat through it. What a monumental waste of talent, setting, and source material!!!!!",
    "date": "2024-12-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie had so much potential with a stellar cast and excellent source material, but somehow it was botched royally.",
    "date": "2024-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Truly dire....tries so hard but fails at every turn. Embarrassing mish-mash. So many good actors totally let down by the awful production. Don't even start me on the ludicrous storyline..",
    "date": "2024-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Harry Hole books are incredible. But it is much more incredible how the director ruined the story and made this film as an amateur",
    "date": "2024-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It seems to have very bad reviews, but I thought it was quite a gripping plot that was easy to follow but intricate enough. It is worth a watch for the views of the Norway in winter, beautiful.",
    "date": "2024-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The movie got very rotten Rates, and I kind of understand that - though it is not the fault of the cast, the setting or the original Story.\n\nThe problem is that the original Story started 6 books earlier, had hell of a lot of character-introducing and -building, Tons of norwegian police-lore, the personal struggle and tragedy of Harry Holes fate... you CAN'T just start in the middle of this modern Saga.\n\nAnd there was no way that this incredible good cast, the original landscape of the setting and the quite good work of the cameramen could save this hopeless endevour - the movie was doomed from the start.\n\nJust imagine that Peter Jackson never intended to make the Lord of the Rings-triology, but instead only focuses on the siege of Helms deep - 2,5 hours long.\nNo time for Characterbuilding, no Storytelling of what lead to the events: the movie starts with King Theoden standing in the Rain on the wall of Helms deep and saying \"and so it begins\".\n\nYou recognize this and the coming 70min as a great piece of Cinema, but just imagine that \"the fellowship\" and \"return of the king\" as well as the first half of \"the tow towers\" never happned... you would stand there, without any clue why the Orcs are attacking, who this Aragon and Theoden are, what exactly it is that makes Gimlis and Legolas friendship so special, and where does Gandalf come from with whome and who is this Gandalf-person?\n\n... you would be clueless and the movie would need an extra of at least 50min to explain all that and it wouldn't be enough. Also it would becoming boring, it would feel pointless and confusing, you couldn't even enjoy this absolute masterpiece of Drama because the constant need to explain all around would Ruin the thrill.\n\nAND THAT is what they did to \"The Snowman\".\n\nB",
    "date": "2024-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "We watch a lot of crime thrillers, this was terrific. Glad we didnt see the Rotten Tomatoes review as the idiots marking it down dont do it justice",
    "date": "2024-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I’m not sure exactly how long this movie was, but it felt like days had passed before the end credits rolled and made me want to burn my TV. \nNonsensical plot, so many WTAF moments that made absolutely no sense, and all of the actors were on autopilot! Characters come and go, adding nothing to the plot. I could go on, but basically, I watched this steaming pile of manure so you don’t have to! AVOID!",
    "date": "2024-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Maybe this film could have been done a bit better but it certainly deserves more than a 20% on RT. I’d give it a fair 70%.  The acting and story is solid with some good twists. Ya there’s some odd scenes and dialogue but kinda adds to the overall creepy-ness of the film.  I do wish the ending had been a bit more climactic there wasn’t the payoff you were hoping for.",
    "date": "2024-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Very boring movie.\n\nI knew something was wrong when they promoted this as having Martin Scorcese as executive producer, to give the movie some weight. But i still watched it, in hopes that it would be at least decent.\n\nI don't know what's wrong with Michael Fassbender but appart from a few good movies, he only seems to accept really weird, depressing and boring roles. \n\nSave your time and watch something else.",
    "date": "2024-05-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie is boring as hell",
    "date": "2024-05-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "what a stellar cast for such an unfathomably boring movie.",
    "date": "2024-05-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "good movie great acting good ending but i wished we could see a second movie Micheal Fassbender was good as Herry hole the twist was cool but i wished they did leave some stuff out of the movie but it still a good movie don't listen to the reviews watch the movie and don't listen to critics",
    "date": "2024-04-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "One of the most uninvolving movies I've ever seen. Terrible direction, appalling editing by a renowned editor (though can't really be blamed as only had garbage to work with), disjointed scenes, unbelievably bad script. The only thing going for it is the snow-bound scenery. The high-calibre actors in this movie all made a major mistake signing up for this disaster.",
    "date": "2024-02-10"
  }
]