[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "If you want to waste an hour and 30 minutes, this is the movie to do so. Poor acting, the plot is all over the place so sometimes you forget what they’re talking about. You’re not gonna have a good time with this movie, just a boring watch. (Side Note: why is the little girl so bipolar like just stop).",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie is the wooooorst",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Film makes sense and could of been good but it just lacks the horror element. Ending is not worth it.",
    "date": "2025-06-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "this felt extremely slow, and somewhat weird at times, it felt like some things happen just to happen and they make no sense, in my opinion this is an easy skip",
    "date": "2025-05-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "peak!!!!!!!!!!!!!!!!",
    "date": "2025-04-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Okay, I honestly don’t know why people are hating on this movie, because I honestly thought it was great, there is not annoying dialogue, and to get what the hell is going on with this movie you’ve gotta think and actually use your brain, I love that in a movie. And it might seem like a jumbled up mess to people who don’t know how to use their braincells but honestly, I loved this movie.",
    "date": "2025-01-31"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Just paint a splotch on your wall and watch it dry.  Far better than this absolute windbag.",
    "date": "2024-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a thinker's movie.  Those who rated it lowly probably didn't get it.  Watch it, and think about it.  It all fits together.  Not perfectly, but there are so many pieces brilliantly put out there that you need to fit together.  There are some folks on reddit who mostly figured it out if you want some hints.   A real psychological thriller.",
    "date": "2024-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The strong performance of the lead can only carry it so far.  Slow, dense, and overwrought with everything except a good explanation why, complete with a dead ending.",
    "date": "2024-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Created an account SOLELY to give this a bad rating. One of the worst movies I've watched all year. Would only recommend if you're trying to torture someone into insanity.",
    "date": "2024-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This movie is just waste of time. Nothing happening in each of the scenes, the plot is meaningless and the final \"plot twist\" is unoriginal and useless.",
    "date": "2024-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Rating: 6/10. 67/100",
    "date": "2024-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Aterradora, usa el pretexto de fantasmas y reencarnaciones para contar una historia incluso mas perturbadora de lo que cualquiera de ellas puede llegar a ser. No es la típica película de sustos con golpes fuertes, va por la linea del terror psicológico que no es para todo el mundo y a la vez que te asusta realmente con lo que estas viendo (si uno le entiende y le presta atención, obviamente). Otra gran joyita australiana.",
    "date": "2024-03-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Run Rabbit Run has some interesting ideas and tries to build some gripping dynamics, but is cut short due to its repetitive storytelling and thin emotional depth.\n\nThe acting was one of the better parts of this movie, with Sarah Snook delivering the best performance. The cinematography was also one of the parts that I enjoyed throughout the movie. \nThe most frustrating part for me was the repetitiveness of the writing. \nAfter establishing some good connections, the writing fails to move anywhere with the plot. It keeps repeating the same sequences over and over again. \nBecause of this, the emotional connection to the characters is getting cut, which in turn makes the ending of this movie feel empty. \n\nOverall:\nRun Rabbit Run had some decent ideas but is failed by its boring writing. 5/10",
    "date": "2024-03-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The road to a successful psychological thriller movie is one laden with potholes. These potholes form like any other: through weathering and deterioration over time and frequent travel. Over the years, we've seen an evolution in the genre, with many stand-out examples that stand the test of time, like Silence of the Lambs, Vertigo, and American Psycho. In fact, some of them set so good an example, directors and companies protrude from the woodwork and say \"hey, I can do that, too!\"\n\nThis is where we find Run Rabbit Run, a 2023 Australian psychological thriller about the harrowing experience that a divorced mother and her daughter endure as they grapple with an unseen malevolence with ties to their past. From the get-go, this film gave me flashbacks to The Babadook with its creeping dread and fear of the unknown, wrapped into familial drama that would set any parent ablaze with terror.\n\nI really had high hopes for this. As a psych-thriller fan for many years, the set up was promising, the acting was markedly good, and the direction weaved together a lonely, tense world. This tension slowly applies itself to your psyche to set you on edge and alert for threats. The obvious choice to keep light on the jumpscares added even more points to the proverbial report card from me. The first act geniunely had me guessing what direction this film would take us...\n\n...until act 2. The aforementioned potholes were trampled over with Run Rabbit Run's sizeable genre vehicle, with every bump further shaking me loose from the tension and sending me down the beaten path of predicibility - a trait even more disappointing in the horror genre. Creepy drawings of unseen horrors? Check. Small girl who says spooky things in traumatic situations? You bet. Scary mask? Certainly. Et cetra, et cetra.\n\nAll in all, a solid horror flick for fans of the genre. I can see this pleasing those who are looking for a movie to analyze with their friends at a watch party, but here are some pro-tips: have a second movie on-deck if this one proves to be too slow, boring, and predictable for your horror-loving pals.",
    "date": "2024-02-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The movie had so much potential but just ended. It didn't explain anything that happened, we didn't get to see the resolution, no explanation on anything that happened just loose ends and a kid with a bad temper.",
    "date": "2024-01-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Don't bother. Great acting but a terrible plot - not remotely scary.",
    "date": "2023-12-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie captured slowly falling into madness very well.",
    "date": "2023-12-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Not very predictable which I liked a lot! Cute rabbit and im glad it didn't die.",
    "date": "2023-12-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A jarring unexpected journey. Watch",
    "date": "2023-12-11"
  }
]