[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "terrible, no fui capaz de llegar a la mitad de la pelicula",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "If you don’t have a—uh, thunder buddy—you might want to find one, or maybe reanimate your childhood imaginary friends. This movie is basically the holy grail of hell for lonely singles who want to write angry reviews. I mean, the movie kinda sucks… but watch it with someone you’re fu**ing, and suddenly it’s not that bad.",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "it sucks dont watch unless you want to barf.",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It's nothing more than porn. I found this movie overall boring and just unpleasant to watch. Absolute garbage",
    "date": "2025-09-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "365 Days is wild, sexy, and impossible to look away from. I absolutely love it. The story is over-the-top and dramatic, but that’s part of the fun. The scene on the boat is unreal—so intense and steamy, easily one of the most memorable adult scenes I’ve ever seen. It’s a mix of fantasy, tension, and pure indulgence, and I can watch it again and again.",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I thought it was totally HOT! He is very sexy and maybe not the deepest story, but kept me amused. I did hear they tamed it down and re- released it.",
    "date": "2025-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It's just pornography",
    "date": "2025-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "sharp acting, not too bad for somebody that wants to do something bad",
    "date": "2025-06-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "They really made FSOG but worse.",
    "date": "2025-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "If I could, I would remove this film from the face of the earth myself.",
    "date": "2025-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "this is seriously the worst movie to ever exist",
    "date": "2025-05-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "What did I just watch? This FSOG knockoff is absolutely stupid. The script is lazy, acting is lazy, fotography is lazy & you feel like you're watching MTV (but only with bad songs) in 3/4 of the movie. Do not watch, whoever made this film does not deserve to be recognized.",
    "date": "2025-05-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "the pornography is very low quality, i'm surprised people still watch it. well no, i'm not surprised",
    "date": "2025-04-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "365 days ini bener2 asdfghjkl hot bgt. chemistry-nya dpttt visualnya aesthetic, soundtrack-nya enak, vibes-nya mewah. pokoknya guilty pleasure. buat pecinta romance-drama yg berani cocok sama ini film",
    "date": "2025-03-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Overall, \"365 Days\" might appeal to viewers seeking a film with strong romantic and sensual elements, but it's important to consider various perspectives before watching.",
    "date": "2025-03-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "saya sangat menyukai film ini, benar benar bagus film nya rekomendasi untuk ditonton di hari libur🫶🏻",
    "date": "2025-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The guy must feel like a very, very nice man. This movie is only worth watching for couples' nights. So that you stop watching after 5 minutes.",
    "date": "2025-03-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "the movie is cool, the actors are also really good",
    "date": "2025-03-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Lumayan filemnya....",
    "date": "2025-03-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "this nod bad but not my favorite",
    "date": "2025-03-23"
  }
]