[
  {
    "user": "Pablo O. Scholz",
    "rating": null,
    "text": "It's an action film. I was going to say action and intrigue, but these soon disappear. [Full review in Spanish]",
    "date": "2021-12-20"
  },
  {
    "user": "Scott Phillips",
    "rating": null,
    "text": "There are some competently staged shootouts surrounding the bank robbery, but those sequences are not enough to recommend the film.",
    "date": "2020-07-24"
  },
  {
    "user": "Emilie Black",
    "rating": 2.5,
    "text": "211 is an action heist film that comes off as taking itself very seriously which would work if it were a better quality film overall.",
    "date": "2020-04-11"
  },
  {
    "user": "Javier Perez",
    "rating": null,
    "text": "211 is a film that's loaded with improbably situations with a Nicolas Cage on autopilot. [Full Review in Spanish]",
    "date": null
  },
  {
    "user": "Maitland McDonagh",
    "rating": null,
    "text": "Adhering to a formula is one thing, but this cliché overload pushes 211 over the line that divides undistinguished movies from bad ones.",
    "date": null
  },
  {
    "user": "Ernesto Zelaya Miñano",
    "rating": null,
    "text": "211 could have used some of the actor's special brand of bug-nuts craziness. It would have considerably livened up what is a barebones action movie that moves quickly and doesn't do much other than present some competent but unexceptional gunfights.",
    "date": null
  },
  {
    "user": "Stephen Danay",
    "rating": null,
    "text": "211... is a shoe-in for worst film of the year, and frankly belongs in the conversation for worst films of the century thus far.",
    "date": null
  },
  {
    "user": "Jacob Knight",
    "rating": null,
    "text": "Nic Cage's latest DTV action endeavor is a bizarre slog.",
    "date": null
  },
  {
    "user": "James Berardinelli",
    "rating": null,
    "text": "Despite a high body count and the expenditure of extraordinary amounts of ammunition, 211 is inert.",
    "date": null
  },
  {
    "user": "Todd Jorgenson",
    "rating": null,
    "text": "... disjointed and emotionally hollow despite some trademark Cage theatrics.",
    "date": null
  },
  {
    "user": "Richard Roeper",
    "rating": null,
    "text": "A muddled, overcrowded, trigger-happy heist movie brimming with clichs while constantly trying our patience.",
    "date": null
  },
  {
    "user": "Glenn Kenny",
    "rating": null,
    "text": "A cavalcade of crap. Loud crap.",
    "date": null
  },
  {
    "user": "Mark Dujsik",
    "rating": null,
    "text": "A bunch of generic types get into a massive shootout in 211...",
    "date": null
  },
  {
    "user": "Peter Sobczynski",
    "rating": null,
    "text": "For collectors of [Nicolas] Cage insanity, I am sorry to say that your hero has come up painfully short here - this is as bored and listless of a performance as I have ever seen him give.",
    "date": null
  },
  {
    "user": "Frank Scheck",
    "rating": null,
    "text": "It's probably foolish to wish that Nicolas Cage would once again make movies as good as Adaptation and Leaving Las Vegas. But is it too much to ask that he go back to the comparative glory days of Con Air and The Rock?",
    "date": null
  },
  {
    "user": "Dennis Harvey",
    "rating": null,
    "text": "Unsurprisingly, the director doesn't get very good work from a cast asked primarily to ramp up the intensity on stereotypes.",
    "date": null
  },
  {
    "user": "Noel Murray",
    "rating": null,
    "text": "Even the subset of Nicolas Cage fans who like it when the actor makes laughably terrible movies will have trouble sitting through \"211\"...",
    "date": null
  },
  {
    "user": "Luke Y. Thompson",
    "rating": null,
    "text": "I can't begrudge you waiting until 211 shows up on a Blu-ray at Walmart that also contains ten other Cage movies...But I can tell you that when it does, you shouldn't skip over this one.",
    "date": null
  },
  {
    "user": "Chris Bumbray",
    "rating": null,
    "text": "A mortifying, poor showing for Cage. Classic film fans may remember when Buster Keaton was forced, in his later, near-destitute years, to do cameos in sixties beach party movies. This is worse.",
    "date": null
  },
  {
    "user": "Brian Orndorf",
    "rating": null,
    "text": "\"211\" plays more like a TV pilot than a feature film, slowly losing interest in the gritty aspects of the story.",
    "date": null
  }
]