[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It’s a boredom basher, and that’s really about it.",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love these guys!",
    "date": "2025-09-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A smooch like your kissing your sister 🔥",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Silly, action-packed movie with very likable and entertaining characters!",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "O humor as vezes é divertido e os gráficos são lindos, mas o vilão e a trama é meio bagunçada e irrelevante. Mas não se preocupe, é até divertido o filme, e colorido para uma criança pequena assistir.",
    "date": "2025-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The plot could have been better but it was really funny! The graphics were fine.",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is great movie!",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Just a fun spin-off. About the badass karate fighting funny penguins from the Madagascar trilogy. Fun ass movie that is nothing but fun",
    "date": "2025-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great humor and just a fun time. The plot isn’t the best and the villain isn’t my favorite but the humor alone is worth the watch. the north wind story was a little forgettable to me but classified was a great character. overall a very rewatchable movie with a hint of action and is carried by the penguins.",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Penguins of Madagascar is a fun and energetic spinoff from the beloved Madagascar franchise by DreamWorks Animation. While the original films did a great job introducing us to this quirky group of penguins, led by Skipper, Rico, Private, and my personal favorite, Kowalski, this movie takes them on their own unique path—separate from the original Madagascar storyline.\n\nThat said, this film doesn’t quite feel like a natural extension of the franchise. It lacks some of the heart and familiarity of the earlier films, especially for those who haven’t seen Madagascar and therefore miss the context of where the penguins came from. I wish the movie had included a bit more background for newcomers or casual viewers.\n\nThe animation is vibrant and sharp, and the addition of new characters—while adorable—felt underutilized. They were introduced, served their moment in this one story, and then disappeared without any further development or return in later entries. That was a bit disappointing, especially for characters that had charm and potential.\n\nThis film is clearly aimed at a younger audience, and for that demographic, I think it works well. It’s silly, fast-paced, and filled with visual gags that younger kids will enjoy. But as someone in my 40s, I found it hard to stay engaged the whole time. The pacing felt drawn out, and it just didn’t land for me the way some animated films do when they balance humor for both kids and adults.\n\nThat said, I wouldn’t call it a bad movie—it’s definitely entertaining for families, and I’d recommend it for children or fans of the penguins themselves. But it’s not a film I see myself revisiting anytime soon.\n\n🎬 Fun, quirky, and kid-friendly, but not quite built for older audiences.",
    "date": "2025-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1 hour and 32 minutes!!!!!!!!!!! Rated PG for Some Rude Humor and Mild Action!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $83,300,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Un capolavoro della Dreamworks",
    "date": "2025-06-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "why is this so funny",
    "date": "2025-04-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "There ARE PENGUINS and they ARE in MADAGASCAR 10/10 PEAK!",
    "date": "2025-04-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Too many jokes for adults to enjoy just as much as the kids, however, the plot is not childish enough for the parent to want to jump out of their seat and leave the room. The soundtrack is also excellently composed, especially for a kids movie.",
    "date": "2025-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love these bad boys. Its funny that the episodes of it are still on air. Im waiting for a new season plz",
    "date": "2025-04-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "best madagascar movie",
    "date": "2025-04-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A great spinoff movie for Madagascar it is probably better than any Madagascar film",
    "date": "2025-03-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Penguins of Madagascar is a goated movie",
    "date": "2025-03-22"
  }
]