[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved this movie! I’m a true crime fan and this movie captures the audiences attention and hooks you in with suspense. The actress who plays Lisa also plays Kara Robinson another similar movie to this (based on a true story) and she is a MARVELOUS actor! I really enjoyed the way the actual Lisa McVey talked about her experience at the end of the movie. It brings you back to life by reminding you this really happened to someone. All in all an amazing movie if you’re a true crime fan I would definitely recommend !!",
    "date": "2025-01-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thought it was sad no one believed her besides the one guy.",
    "date": "2024-12-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wow! Great story of survival; great actress!",
    "date": "2024-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing movie the actress was so good she honestly one of my favourite actors, I wish I could watch again but it’s not out on anything right now ToT.",
    "date": "2024-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The suspense felt like the original Halloween 1 and 2 💯",
    "date": "2024-03-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best made movies, especially one that's  based on true events,that I ever watched. Amazing acting and it's so close to what truly happened.  Lisa is a hero of mine.  This actress done such a great job.  10/10",
    "date": "2024-01-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "i can't say whether or not it captured the story perfectly, because i wasn't there. but the feelings it emits are captured beyond comparison.",
    "date": "2023-12-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Highly recommend this thriller very good true to life story James Welch, Henderson, Arkansas, August 22, 2023",
    "date": "2023-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "such a talented actress and portrayed trauma and dark feelings well",
    "date": "2022-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A very good movie and also based on a true story. Lisa was/is amazing!",
    "date": "2022-04-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A real adrenaline rush watching the movie....",
    "date": "2022-04-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I'm impressed with Lisa's attention to detail. Despite being blindfolded the entire time, her keen memory helped prosecute his kidnapper. A remarkable story, indeed. It's a great example of how Stockholm syndrome could be used to save your life during such unfortunate events.",
    "date": "2022-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Surprisingly good. I didn't know it was based on a true events until I finished watching, and it made it even better knowing that.",
    "date": "2022-03-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Excellent movie that does justice to Lisa's remarkable story of courage , determination and success.",
    "date": "2022-03-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "me gusto mucho la peli 8/10",
    "date": "2022-03-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Lisa McVey (Katie Douglas) left a bad home situation with her mother to live in Tampa with her grandmother, but within a few weeks she was being abused by Morris, her grandmother's boyfriend, and then abducted by Bobby Joe Long. Even worse, her grandmother just assumed that she ran away and wasn't in any danger.\n\nBobby (Russif Sutherland, the half brother of Keifer) holds Lisa bound and blindfolded — much like the nine other women he'd already killed — continually assaulting her while she gains his trust by asking him about other women and then leaving behind as much evidence as she can, touching everything in his apartment and even pulling out her hair and hiding it all over the place. She also begins memorizing everything she can.\n\nFinally, when she escapes — pleading for her life when Bobby wants to shoot her in the head in the woods — Morris and her grandmother beat her for five hours before calling the police. Luckily, her case is assigned to Sergeant Larry Pinkerton (David James Elliot, who made your grandmother and aunts feel all tingly when he was on JAG), who is one of the few people who believes in her.\n\nAmazingly, this true story ends with McVey becoming a deputy sergeant in Sex Crimes, working to protect children from the terror that she survived. As for Bobby, he was arrested outside a movie theater and was executed in prison via lethal injection in 2019.\n\nAiring on Showcase in Canada and Lifetime in the U.S., this is a pretty frightening story even in TV movie format. I can't believe that McVey made it and was able to lead such a positive life after.",
    "date": "2021-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Since watching this I have not stopped telling others to do the same. A real breathtaking film. A must see !",
    "date": "2021-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This is very much a Lifetime movie. It's a shame, because Lisa's story is incredible. The movie is just not good.",
    "date": "2021-06-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was exceptionally emotional from the very beginning. It can be hard to watch at times. It covers such serious and important topics and does so in a way that left me breathless. \n\nThe fact that this film is based on actual events makes it even more chilling and dark to watch. Lisa McVey was portrayed as, honestly, a huge hero. She has such courage and is so brave, not to mention incredibly smart and strong. Believe Me shows the importance of believing victims of crimes; too often victims - especially those of rape - are not believed and because of it, sick criminals like Bobby Joe Long aren't caught soon enough, if at all. \n\nWhile I was watching this movie, it showed me ways of dealing with seriously dangerous and traumatic events as they are happening. It inspired me. As a victim of trauma, this amazing woman inspires me with how strong she is. There was hardly a minute where I wasn't crying my eyes out, and I cried in every emotion. \n\nThe cinematography, lighting, acting, script, cast... it was all brilliant. This is a must see. Hopefully this film can inspire more and more victims to speak up, and be believed.",
    "date": "2021-06-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What a woman! Really sad, yet incredibly powerful story of a woman's past and her experiences. Resilience and the human spirit are shown as forces to be reckoned with, regardless of the odds. All credit to the creative team who did such a great job",
    "date": "2021-06-04"
  }
]