[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's A Silly Little Kids Movie Meant To Be Aimed Towards Silly Little Kids.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Everything about this makes me SICK! Disgusting animation, Abysmal script, uncreative plot and CRINGE jokes that wouldn’t make a toddler laugh! This is, without a doubt, the WORST movie I’ve ever watched!!!\nDon’t watch this unless you want to get scarred for life!",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Well... I  mean... It's not the worst thing ever?",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Again, it’s one of the WEIRDEST, CRINGIEST, and GROSSEST movie of all time. But whoever made this movie, probably actually understood the original cartoons. And it was funny to see Buzz the Buzzard’s plans to shut down the camp fail and getting hurt. And they actually did a pretty good job on Wally the Walrus. He is a human now, he’s weird, but making him a human and working for the Parks and Recs actually works. But it’s still not a great movie.",
    "date": "2025-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Same as Woody Woodpecker 2017 but is just not bad enough to be considered a campy trash bag so it doesn’t work that well, however it is more faithful to the original cartoon",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Honestly, what even was this movie?",
    "date": "2025-06-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's the Best Woody Woodpecker Movie of 2024",
    "date": "2025-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "“Woody Woodpecker” feels like a tired attempt to cash in on nostalgia without bringing anything new or clever to the table. The humor is forced, the plot is bland, and the character—once iconic—is reduced to an annoying, one-note nuisance. It’s uninspired and forgettable.",
    "date": "2025-05-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Sussy lol\n\nIts good but also annoying. We had to watched it at least 6 times and it was repetitive. Also make more Woody Woodpecker movies please.",
    "date": "2025-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I Love This Movie better than the cat in the hat",
    "date": "2025-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This movie was just cringe not much to say.",
    "date": "2025-03-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I found this film to be ok . I enjoyed Woody woodpecker as a kid and this story is no different its a fun family friendly film .",
    "date": "2025-03-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Es una película no solo emotiva si no responsable de la trama",
    "date": "2025-02-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This film is the best, funniest, most fantastic film i have ever seen",
    "date": "2025-01-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Siete años después de que Woody tuviera su primera película, al fin llego la secuela para ofrecer más dosis de este querido personaje. La razón por la que estas películas no son bien recibidas es porque hacer una caricatura con personas reales puede llevar a una comedia demasiado bizarra o exagerada para el agrado del público. En el caso de esta película, hicieron algo que se siente como un episodio de la serie animada, pero adaptada en acción viva. Lo que es agradable, pero no todos serán capaces de disfrutarlo, es que la película tiene el humor de las caricaturas adaptado a los tiempos actuales. La película respeta la esencia de la comedia que hizo a la caricatura clásica tan querida. Al igual que en la película anterior, respetaron la personalidad alocada de Woody. Además, la película tuvo la decencia de incluir a Wally Walrus y Buzz Buzzard y eso fue un acierto porque se tratan de personajes recurrentes de las caricaturas de Woody. El diseño de estos personajes es el mismo que tuvieron en The New Woody Woodpecker Show. La personalidad de Wally es tranquila e inofensiva como en las caricaturas donde él solía ser el blanco de las travesuras de Woody. Al igual que en las versiones animadas, la personalidad de Buzz como un malicioso antagonista se mantuvo intacta. Buzz siempre ha sido un antagonista esencial en las caricaturas de Woody Woodpecker y su participación en esta película aporta muchísimo. Aunque el CGI no es tan realista en ciertas ocasiones, tienen un tono caricaturesco que es bastante compatible con el humor de la película. La finalidad era hacer una película que se sintiera como una caricatura y es algo que lograron conseguir. La forma en que recrearon la canción tema y la intro de la caricatura reflejan bastante amor hacia las caricaturas de Woody Woodpecker con las que muchos crecimos. Esta película logra seguir el ejemplo de buenas acciones vivas que se han hecho de otras caricaturas como Scooby-Doo, The Smurfs y Garfield. Woody Woodpecker Goes To Camp es una destacable película que revive el espíritu de las caricaturas de Woody Woodpecker. Mi calificación final para esta película es un 8/10.",
    "date": "2024-12-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "its ok  buzz was weird its kinda gross and cringe",
    "date": "2024-12-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This Movie Was Amazing, Woody looked way better than the original one (ugh.. the original one sucked)\nThis was a huge step up from the original despite it being made by the company who produced SPIRIT UNTAMED (Netflix adaptation)\nI Give this film a 8/10 just for the end credits music and the looks of woody. If it hadn't been those, I would have rated it way lower",
    "date": "2024-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Woody Woodpecker's second movie was the best. He is for everyone.",
    "date": "2024-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "TO BE HONESTY I LOVE THIS SEQUEL SO MUCH I BEEN WAITING FOR 7 YEARS BUT I DIDN’T NOT NOTICE IT HAS PLANS TO MAKE ANOTHER SEQUEL IS EVEN BETTER THAN FIRST MOVIE. I DONT UNDERSTAND WHY PEOPLE HATE FIRST MOVIE BECAUSE FOR ME IS A MASTER PIECE.\n\n\nI’m Super Huge Fan of Woody Woodpecker Movies that people always confuse why there are different directors and producers and writes and screenplays is charm I’m wonder why ? In this First Movie is got 10 Million Dollars of Movie",
    "date": "2024-06-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Way better than the last one in so many ways",
    "date": "2024-06-13"
  }
]