[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Quite good. Good directing, whole cast very convincing in character. Story line is ho-hum, typical Hollywood, but hey, everything is melodramatic on screen hey? Cinematography is okay but overall not very memorable movie",
    "date": "2025-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "An action movie, that does not add anything",
    "date": "2025-03-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I’ve never watched a shittier movie in my life, no climax not scary one bit overall worst movie I’ve watched. How did they even get a budget for this film",
    "date": "2025-03-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Filme: Sentinela\t\t\t\tAssistido: 29-01-25\nElenco: @michaelkirkdouglas @kiefersutherland @evalongoria @kim.basinger Martin Donovan, David Rasche\nModelo: #terrorismo #investigação #conspiração\nDuração: 1h 48m\tAno: 2006\nMinha opinião: Temos vários filmes que tramam a morte dos presidente dos EUA; SALT, Crime na Casa Branca, O Inimigo de Estado, O Ataque,.... E este filme temos Pete (Douglas) tem que provar sua inocência que não esta tramando a morte do presidente (Rasche), mas para complicar o caso Pete esta tendo um caso com a mulher do presidente Sarah (Basinger) e este segredo que agora não é mais segredo, acaba fazendo com que se complicasse e sendo suspeito, pois teria que esconder isso. E enquanto ele foge e tenta provar sua inocência, esta sendo perseguido por David (Kiefer) e Jill (Eva). E nessa corrida de caça ao rato, e cada passo que dá o serviço secreto esta lá. Até descobrir que o verdadeiro traidor é William (Donovan) que também é do serviço secreto. E que tem um líder o leste europeu que esta por de traz de tudo. Um filme que não para do inicio ao fim. É claro que tem umas facilidades, como deixar que Pete fuja por duas ocasiões. Mas um filme que vc tem Douglas, Kim e Kiefer, é legal de assistir.\nRoteiro e enredo um pouco confuso, mas ver atuação de atores  e pura nostalgia.\nVale apena assistir? Sim \nNota: 7",
    "date": "2025-01-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A self-aware thriller where motivation is fickle, ironclad security underpinned by the armed thousands all has gaping holes if you nudge even gently and characters who don’t so much move through a development arc as orbit one…without deviation.\n\nIt’s of its time and worth and an hour and a half of your time if the other options don’t inspire.",
    "date": "2025-01-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Lame plot, poorly done.  Great actors and ok direction. By very badly written. Criminals just run out back door to never be caught often.  Secret Service knows the bad guy but stars has to personally go there to stop them. Just a call would do it. \n\nEnding with 15 people surrounding the President and a bad guy walks up and grabs the First Lady was a perfect stupid ending for the rest of the stupid things. Little bad stuff is even obvious such as the good cop's gun uncocked as he goes to battle. Of course guns are easily knocked out of good guys hands and bad guys are walking malls shooting 15 people but walk away. Walking out a side door. \n\nWasted 2 hours watching.",
    "date": "2025-01-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "If you haven't seen many thrillers/political thrillers than I guess I can see how someone may like this a bit more. But especially if your a fan of the genre this is the same Fugitive style plot you've seen done to death a million times now by the best of them. It's totally predictable how it will end and yet the actual conspiracy isn't so much convuluted as the movie just straight never really explains what it is. We know Douglas is being framed and using the First Lady affair as blackmail but we never find out really why or who these people are. And what is explained about the conspiracy is done so poorly. The villian is lame and barely in the film. We never see them interact either so it's hard to put a face to the conspiracy. The editing isn't good and is very jumpy with lots of speed up cutting in certain spots, slow motion that is blurry for no reason, and it just feels like stuff happens once he's on the run and cutting between K.S., the first lady, Dogulas, and the few times it cuts to the bad dude. And it jsut all collapses in the final 15 minutes or so. The pacing isn't good and everythign else is just alright. The actors are all trying and giving good performances but the characters aren't anything special, it's hard to get invested in any of them because there all pretty stock and the affair thing is so over the top it feels like too, to make up for a lack of in depth character. Direction isn't bad but and the music in the first half is pretty good actually. But it just feels like it becomes so bland and not used as well later. Skip This. It's basically The Fugitive style plot in a In The Line of Fire setting but not done anywhere near as well as those.",
    "date": "2025-01-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Why not fair rating for this when it is not over depicted the power of secret service ?",
    "date": "2024-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "All the elements are there for this to be a great movie. But the plot holes and unrealistic escapes make this movie less enjoyable and overall forgettable.",
    "date": "2024-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Absolute twaddle.  Plot is nonsense,  weak and makes no sense in human nature and behaviorism.",
    "date": "2023-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A by-the-numbers assassination thriller.",
    "date": "2023-09-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "about as easy to watch as they come. a couple slightly silly twists towards the end, but still a Good watch.",
    "date": "2023-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Conventional. Typical. There are moments of brilliance here & there and I believe Keifer Sutherland is damn good in his role. Smart, calculated, ice-cold. But the plot is way too familiar. Still a watchable thriller.",
    "date": "2021-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Well this film starts out ok, and then it deteriorates into a complete and utter farce, the french special forces must really embarrassed about this film. She is pretty useless at unarmed combat, and any solder suffering post traumatic stress and on drugs, would never be allowed on duty, especially behaving like she does. Not even worth watching in desperation",
    "date": "2021-03-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "2.5 bags, a lotta sneaking out, and the last movie I saw Basinger in. Douglas is still a cheater in this movie but he's not a creeper like he was in \"A Perfect Murder\" or \"Fatal Attraction.\" We started 531 with so many creepy and offensive Douglas movies. He was good in the \"Ant Man\" series which have been watched but still kind of an asshole even there. So with \"Wall Street,\" it was a great Douglas movie/performance. This one is good too, or at least I think this movie is less boring and more exciting than other ppl but it doesn't hit 3 bag status 'cause Kiefer Sutherland is such an asshole in it! I like Don Sutherland better (see the Dirty Dozen, he was in that one). So let's hope for no more bad Douglas movies/experiences! Douglas has been on thin ice since this whole thing began...",
    "date": "2020-12-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "familiar premise is effective enough due to the cast but will quickly be forgotten.",
    "date": "2020-06-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Conventional action sequences and a mediocre plot render The Sentinel as a disappointment.",
    "date": "2018-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "What is with Michael Douglas and having an affair...? lol jeez!  Decent action/thriller, but nothing really noteworthy.  Basically just a time waster if you're in the mood for this kind of thing.",
    "date": "2017-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Secret Service Film yang kurang macho karena peran utamanya juga udah ga bisa macho2, mau ada aksinya, mau plotnya keren tapi mentok karena casting (Douglas) nya juga terbatas karakternya buat main film ginian. Jadinya, begitulah ...",
    "date": "2017-06-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's good movie to watch",
    "date": "2016-12-30"
  }
]