[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I used to love this, but not anymore. If you're about to watch it, you need a doctor.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The movie was not that bad it shows the teenage life in the form of typing and emojis, its a really good movie to watch if you want to learn more about how the teenage life is and as a teenager myself it is one of the best movies i've ever seen in my life and ive seen alot. I dont understand the hate on this movie it's aged pretty well.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I honestly don't really understand the hate. I mean I wouldn't watch it again but It's not what you all are saying. Like sure it isn't that fun but it isn't so horrible like everyone says",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I don't know why you didn't like it, it's very good.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "One of its worst movies in general!! poor, awful cringe, inappropriate script and that’s the reason why this movie never got a sequel or the sequel not planned because it flopped hard.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Not a bad plot but it just was just a bad movie in general",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Bro I Enjoyed This SOOOO MUCH I WILL PROTECT THIS AT ALL COST",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Good. Just TOO good",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "La película aunque no la considere como mi favorita, sinceramente me entretiene mucho y la historia está aceptable. No es la mejor película que he visto, pero de entretener sí que entretiene, y bastante.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Ok because it is about this emoji called Gene and he doesn’t think he is very popular and there is this kid called  Alex and he likes this girl called Addie and he thinks his phone is acting weird and there is this evil emoji called smiler and she wants to delete Gene and he meets this other emoji called high-five and this hacker called jailbreak but it reveals that she is actually a princess  ok movie 6/10",
    "date": "2025-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "From the very first second, I felt my soul leave my body. 💀\nThis wasn’t a movie — it was a 💣 corporate fever dream, a tragic fusion of 💩, 📱, and 😭 pain.\n\nThey took something as harmless as emojis — our tiny digital friends! — and turned it into a two-hour advertisement for despair. 🤑\nThe plot? Nonexistent. The characters? Emotionally hollow. The jokes? So bad they made me question the concept of humor itself. 😐\n\nGene the “meh” emoji was the perfect metaphor — not because he was relatable, but because I was also meh for 86 agonizing minutes. 😩\nThe pacing felt like watching a buffering YouTube video on 1% battery. 🔋🐢\n\nEvery frame whispered: “This was made by a marketing team, not artists.” 💔\nBy the time the credits rolled, I was staring into the void, wondering how a film could make Pixels look like Citizen Kane. 😵‍💫\n\nFinal Verdict: 💩💩💩💩💩 out of ⭐️\nThis wasn’t a movie. It was a crime against cinema. 🎭🔥",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I Did Not Like This Movie, Because... IT'S THE WORST ANIMATED MOVIE FROM 2017 EVER EXISTED IN THE WHOLE WORLD!!!!! 😡😡😡😡😡👎👎👎👎👎",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The Emoji Movie is a disappointing attempt to cash in on smartphone culture without offering any real heart, humor, or originality. The story feels forced and predictable, the jokes rarely land, and the constant product placement makes it feel more like a long commercial than a film. Even the talented voice cast can’t save the shallow script or the lifeless animation. Overall, it’s a soulless, emoji-filled mess that fails to connect with kids or adults — a movie that should have stayed in the drafts folder.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Why did I even rate this…?",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "my daughter says: its a fine movie but not safe for kids...some parts are kind of inappropriate this is a nightmare for adults... never ever let your kids watch it.",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Nowhere near as bad as it is made out to be, but still it’s obviously trying to copy Inside Out with much less emotional depth and worse story.",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Do I even need to explain?",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "If you want to keep your sanity intact, don’t watch this movie.",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I do have some positive things to say about The Emoji Movie:|\nPros:\nDecent and colorful animation (while bland)\nSome actors tried their best\nGood soundtrack\n\nCons:\nHorrible writing and storytelling\nRips off so many good films\nHatable characters\nUnnesscary mean-spirited tone\nForced message\nSouless product placement everywhere\nAnimation (while decent) is bland and sometimes uncreative\nSome of the voice acting is pretty bad\n\n3/10",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "👎😴🤬😡🚫☹️😕🙁😞🙅‍♂️🙅",
    "date": "2025-09-21"
  }
]