[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A romcom that doesn’t aim high but somehow manages to deliver. The writing is weak as events unfold in a contrived way rather than through genuine character agency or earned development. The dialogue often feels forced, with the two leads jumping into deep, heartfelt conversations after having just met. Still, as a romcom, it’s not meant to be taken too seriously.\n\nWhere the film truly shines is in its lavish production design and its beautifully shot Irish landscapes. Some might find this idealized portrayal a bit lazy or even disrespectful to Irish culture, but visually, it’s undeniably appealing. Beyond that, the filmmaking feels fairly generic, and while the performances are passable, they never quite stand out.\n\nI wouldn’t particularly recommend it as there are far better films in the genre, but if you’re in the mood for a light, silly romcom with gorgeous Irish scenery and don’t mind mediocre screenwriting, this one might do the trick.",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "What a waste of everyone's time and resources. Lohan deserves a comeback but this isn't it. Her character is literally the least interesting lead I've ever seen and I can't buy her as an actual human being at all. The wardrobe alone, yuck. Sometimes I like cringey movies but this was waaaaay over done. There's an old made for TV movie called the magical land of the leprechauns that is 10 times better than this.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "What a bad movie... they only came out throwing cliché after cliché 🤡",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The accents were awful, and the acting was atrocious. I loved this movie.",
    "date": "2025-04-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "A very corny romance movie by a lazy script writer to a simple formula.  They should go back to writing morning TV soap opera.   Lindsay Lohan very uninspiring.",
    "date": "2025-03-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This is about as light and predictable a rom-com as you can get! There were certainly no surprises but the Irish countryside was breathtaking and pub experience was fun.",
    "date": "2025-02-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The film is supposed to be hallmark-esk. Lindsay Lohan’s performance in this shows just how charming she is on-screen and why she should be in more A-list projects. She is getting her face back out there to show that she’s still got it! The film is cute. Not very well written and the acting is a little off, but if you are looking for a cute rom-com to watch on a rainy day, this is the one for you.",
    "date": "2025-01-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Sweet, wholesome movie, perfect rom com for the family. My teenager loved it. Lindsay is charming and beautiful. It’s an easy light hearted film, with pretty scenery, we enjoyed it.",
    "date": "2025-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "My dog can act better than anyone in this cast.",
    "date": "2025-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This film as brilliantly awful! There's nothing redeeming about it: terrible story, wonky acting, and everything down to the \"special effects\" is just a disaster. It's so bad it's just a blast to watch. Make sure you're watching with friends and you can just rip the whole project to shreds while face-palming for about one and a half hours straight! A Must-See.",
    "date": "2024-12-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "what in the actual balls? first of all, my great grandma could act better than lindsay lohan, oh wait shes dead. second, i get the whole cheesy rom com whatever but this cheese was on crack or something. last, if you get nothing else from this thought out review, dont even read the title, you will suffer. i wish that your eyes do not have to endure this movie.",
    "date": "2024-12-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I really liked this. Beautiful Irish countryside. Lovely escapism. Easy watch.",
    "date": "2024-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "definitely decent not bad",
    "date": "2024-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Irish Wish - 3/10. Oh no. First of all, Lindsay Lohan deserves so much better than this. The same director that delivered her somewhat mediocre Netflix Christmas film delivers this comically bad romcom. This is literally laughably bad, and its shocking because the christmas themed film the two did previously at least had some tinge of good work in there. Irish Wish is one of those movies that has nothing going for it in a general sense. Lindsay tries her ever so best to make this work, and Ed Speelers actually does a decent job with his scenes with Lindsay here too. Jane Seymour is here, and like Lindsay, is betrayed by a bad script, making some of her performance feel a little goofy. The main issue here is that the movie just feels so artificial, goofy, wooden, and just badly written/directed. I laughed at some of the creative choices taken in the film, and as much as it tried to be funny, it just couldn’t be hilarious to save its own life. I really wanted to like this, because romcoms are my thing. But holy is this really bad. The funny thing is, the fight near the end was probably the only good thing in this entire movie, and even that scene was done in a middling way. The locations are beautiful, and along with the very few things in this movie that work, this is probably gonna be one of the worst films of the year. Lindsay, you deserve so much better than these Netflix movies.",
    "date": "2024-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I was honestly genuinely surprised with how much I liked this movie. As Rom-Coms are far and few between in recent years, this is a nice addition to the genre. With breathtaking cinematography in scenic Ireland and Lohan's enigmatic & humane performance making you undoubtedly root for the protagonist - the message of standing up for yourself + making your own destiny is alive and true. It doesn't hurt that the soulmate arch between the two leads is natural and emblematic across the breezy run-time. A heartwarming, comfort film that you shouldn't miss and has tons of replay value!",
    "date": "2024-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I couldn't finish watching this movie. Even watching it as if it were a podcast since I got so bored was too boring.",
    "date": "2024-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Absolutely diabolical movie. Avoid..",
    "date": "2024-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Don’t waste your valuable time watching this!",
    "date": "2024-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "As an Irish person, I cringed all the way through this film out of curiosity. I enjoy a cheesy rom-com from time to time but wow. This felt like a rushed cliche production, with most scenes fitting more to a tongue in cheek SNL skit than a real attempt. The accents were hard to listen to, the clothes were so far off any Irish culture from any era, and the story only emphasised egos, bad friends, and embarrassing portrayals of love at first sight, yet without chemistry. I had to double check the year with the gender stereotypes and embarrassing clichés too. Wow",
    "date": "2024-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "As an irish person, I’ll never get back the time I wasted watching this movie. \nNo one talks like that. \nNo one dresses like that.\nThe forced accents made want to poke hot sticks into my ears. If your Helen Keller you would enjoy this!",
    "date": "2024-10-01"
  }
]