[
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Utterly predictable in pretty much every aspect. Even the supposed twists feel shallow and forced. The acting is fine, I guess, though there’s not much to work with. And then ending is absolutely atrocious. Without that ending, I might have said it was worth watching if you just want the feel-good and can shut off your brain. But if you can shut off your brain sufficiently to enjoy that finale, then I don’t really have anything for you anyway.\n\nOh, and the music sucks, too.",
    "date": "2025-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Well done. While I wasn't 100% sure of how the main character resolved (did he sign the contract or decide to stay and lead the drum group?), the rest of the film made up for it.  I definitely recommend watching this film.",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very well done! Ed did a fantastic job portraying his character. It's heart felt and raw; not over produced. Another one in the box for Ed!",
    "date": "2024-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Really good movie. It is a bit of a throwback, and sadly, movies like this are rare these days. The character arcs were well done, and the plot moved along without any holes or lulls. It's a fun, feel-good movie.",
    "date": "2024-12-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Really wanted this movie to do it for me, but it didn't.",
    "date": "2024-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie gives you a different perspective of the life after popstardom. It's a new story. Ed Skrein's acting was the best I've ever seen in a while! He should have won an Oscar for this one.",
    "date": "2024-03-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This was one of those movies where you can see where the director wanted to go, but he missed every opportunity on the way to get there, and instead chose a direction that left me at the end with that \"that's 2 hours of my life I'll never get back\" feeling.",
    "date": "2024-03-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Just watched this with my 12 year old son and we really enjoyed, including drumming along and a bit of cheering on! Had no idea it was based both in Peckham and Hastings which was a big bonus too as both our endz!",
    "date": "2024-03-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very well written movie with an excellent  believable cast.  Great storyline with some cool songs.  If you like music, and a feel good movie- You may like this!  I really liked it!",
    "date": "2024-01-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Wow. A positive feel good movie for once that doesn’t suck. Was rooting for Vinnie D. And Stevie the whole time.",
    "date": "2023-12-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Really sweet movie. It's nice to see movies with positive figures. Highly recommend.",
    "date": "2023-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "\"I Used to Be Famous\" is a genuinely enjoyable film that effortlessly blends charm, heartwarming moments, and drama. Its endearing characters, sincere performances, and resonant themes of redemption and friendship make it a worthwhile cinematic experience. Whether you're a music lover or simply in search of an uplifting story, this movie will leave you with a smile on your face and a renewed belief in the power of dreams.",
    "date": "2023-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I liked this story of a rock singer fallen on hard times who (nearly) makes a great comeback together with a young autistic drummer a lot, but the ending is too fairy-tale too-good-to-be-true for my taste. Great scenes of sordid London, sensitive treatment of the autistic boy and his mother, great scenes with the music therapist.",
    "date": "2023-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This is a sweet movie that will make you feel good.",
    "date": "2023-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This is an unexpectedly quite lovely film in its follow of flawed former popstar Vince, whose dreams of making a comeback are segued after an impromptu jam session with autistic young drummer Stevie sparks an unexpected friendship between the two. It's moving and feel-good and all the emotions in between.",
    "date": "2023-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A beautiful movie.  A great story and great music.",
    "date": "2023-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I thought it was ok overall as it was a nice story, but it fails to fully develop the characters and the back story on each of them including the main character. Still worth watching, but it does drag in some places with content that doesn't contribute to the overall movie.",
    "date": "2023-04-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very believable and relatable characters. Story line holds together from beginning to end. This movie has stayed with me days after watching.",
    "date": "2023-03-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Cute, predictable, easy to watch - lacks of a bit of real depth, but passes the time.",
    "date": "2023-03-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I was surprised at how much I enjoyed it. A feel good movie with a happy ending.",
    "date": "2023-03-15"
  }
]