[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "As someone who has worked in radio for over 25 years as both an on-air DJ and behind the scenes in production, whenever I see a movie that puts that branch of media on display, I'm always intrigued to see the direction they decide to focus on for the film.\n\nThis particular movie isn't necessarily breaking new ground as Mel Gibson plays loud-mouth shock jock Elvis Cooney, who finds his audience among those listening during the graveyard shift.\n\nUp until the ultimate twist in the last 15 minutes, I found myself enjoying the setup and execution of the basic plot, which sees a disgruntled caller talking out his frustrations on the over-the-top disc jockey.  It held my attention even in moments that I thought were absurd or downright ridiculous. \n\nThe momentum they built during the first two-thirds of the movie had the potential to lead to a climactic ending that was creative and unique.  Instead, I sat disappointed as I watched what played out before me.\n\nGiven his reputation over the past 15-20 years, I'll give Gibson credit for playing an easily dislikable shock jock.  He seemed to fill those shoes relatively easily.\n\nAs far as the authenticity of a working radio environment?  Well, considering automation runs just about everything nowadays, I had to suspend my disbelief that there would be an office of people working the overnight shift at a real commercial radio station.\n\nDon't go in with high hopes.  Just turn off your brain and enjoy this film for what it is:  a movie about a shock jock that tries to shock you.\n\nOr, maybe watch \"Play Misty For Me\" instead.",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "this movie was so bad i feel like i need to go to therapy now.",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Absolutely ridiculous! First off why make a effing movie with jokes that shitty, waste of time. And the ending was dumb",
    "date": "2025-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Thoroughly enjoyed it until the ridiculous ending.",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Was just on Netflix looking for something short, and came across this one. Thought the premise was interesting when I read it, and I got about what I expected. Nothing really that crazy, but nothing terrible. Story was something I haven't seen before, and I thought it was fine. Wasn't a fan of the writing tho. Also wish we had a bit more time to develop the characters. I thought the twists were fun too. Just very middle of the road for me.",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Horrible movie!! I love Mel Gibson but the writers for this movie are f*ed up. I wouldn't watch it unless u like bad writing and a disturbingly sick (in a bad way) plot twist.",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie loved the twist at the end nice to not have a predictable movie very well done.",
    "date": "2025-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing twist  gotta watch",
    "date": "2025-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is the saddest excuse for a movie I’ve ever experienced. Absolute terrible acting from majority of the cast. Such predictable ending and I can’t beleive I had the strength to finish. TERRIBLE waste of time.",
    "date": "2025-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I made an account just to say this is the worst movie I have ever seen. Complete waste of my time. I would have more fun reading a dictionary. Absolutely dog",
    "date": "2025-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was recommended by a very good friend of mine, and it definitely was not a let down. The ending is completely a WTF moment!!! This is not an Oscar worthy movie but the time is not wasted at all. Good movie, that keeps you engaged and at the edge of your seat. Highly recommended watch.",
    "date": "2025-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "It feels like the writer of this script was fired before they finished writing it, and they had to hire an amateur to finish it. The movie was decent thriller right up until the last 10 minutes. Then it gets destroyed by its double \"twist\" ending.  The first twist absolutely no one sees coming, but the second is so obvious it hurts. I'm so glad I watched tis at 1.5x speed so I at least didn't waste as much time as the average viewer. Bah!",
    "date": "2025-06-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This was the absolute worst watch of my LIFE!!! Words can NOT describe my frustration and disappointment throughout the entirety of this movie. I watched it with my girlfriend who said this was an ALRIGHT movie and I will NEVER EVER EVER get these 2 hours of my life back. My lifespan was shortened by 2 hours. If I wanted to die this is how I would go. Watching this pathetic excuse for a movie!!!!! 1/10 stars. DO NOT WATCH",
    "date": "2025-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "You leave this movie feeling uneasy and more than likely upset.",
    "date": "2025-06-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Very short and sweet fun movie. I can not for the life of me understand the low scores.",
    "date": "2025-05-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I knew 10 minutes in that I needed to turn it off, but unfortunately I finished watching. Cheesy script, amateur directing, and the acting sucked (including Mel Gibson surprisingly). I need two hours of my life back. Don’t waste your time on the C-movie",
    "date": "2025-04-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The end pissed me off. I thought there was a real antagonist.",
    "date": "2025-04-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The movie is solid until the not needed twist ending. Feels like the writer dug a whole to deep to write himself out of. Just go watch phone booth. Its the same premise with a better execution.",
    "date": "2025-03-31"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "What a stupid pointless movie. I give it 💩💩💩💩💩",
    "date": "2025-03-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Not good. Surprise ending if you are just not thinking at all. Not good.",
    "date": "2025-03-25"
  }
]