[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "One would have to be soulless to not be moved by a film like this.",
    "date": "2025-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely stunning. Very emotional and captivating. Beautifully written and brought to screen. Very capable cast all excels in character. Amazing cinematography. Adventure, suspense, heartbreak, joy and lots of intrigue. What if the \"Have fun, save the ones you can save, and just be here now\" is really the purpose for us all? Highly recommended",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A Dog's Journey is a heartwarming and deeply emotional film that explores the enduring bond between humans and their canine companions. While the plot may tread familiar ground, the film's genuine sentimentality, charming performances, and focus on themes of love, loyalty, and reincarnation create a powerful and moving experience. Be prepared to shed a few tears as you follow Bailey's journey through multiple lives, each filled with purpose and unwavering devotion.",
    "date": "2025-03-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Perfect sequel for a perfect movie. 5/5 Stars",
    "date": "2025-03-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Imagine a thrilling rollercoaster ride filled with both bittersweet moments and bursts of joy. It's a whirlwind of fun and excitement, capturing the unique perspectives of dogs as they navigate their adventures. Each twist and turn offers a new glimpse into their playful world!",
    "date": "2024-12-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Honestly, I don’t now what the pro critics are talking about. A Dog’s Journey is an amazing film! I am obsessed!!\nI would definitely recommend watching the first movie, A Dog’s Purpose, beforehand, which is also great.\nI absolutely love dogs, and this film was the perfect one for me! The plot is amazing, the actors are great, it was just an amazing watch overall! I finished it all in a day.\nThe ending is so sad, it made me cry - don’t worry, they were happy tears! Personally, i think it is much better than the first one, but I love them both! I can’t wait to read the books.\nIf you want a great family movie, love animals/dogs, or are just looking for a good watch, I would definitely recommend these films!",
    "date": "2024-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was executed perfectly. All the actors were so convincing and it was very enjoyable to watch - especially for kids. It's a go to family movie that - in my opinion is extremely underated.",
    "date": "2024-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "De las mejores películas que eh visto es muy sentimental y creo que está al nivel de la primera siempre que la veo me saca una lágrima le doy un 9.5 no se porque a los profesionales no les gusto",
    "date": "2024-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Definitely better than A Dog's Purpose. It was my favorite movie for many years and I loved it! It was very well made and I loved the ending. Letter Grade: B",
    "date": "2024-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I love Bailey's Journey but I do think the first movie was better story and writing wise.",
    "date": "2024-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I’m trying to figure out one of the pro r critics hated it",
    "date": "2024-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely brillant the acting loved the dogs and hope that does happen that the dogs go on the last part pulled my heart strings and I cried not ashamed!! loved every part and anyone who couldnt see that baffles me again absolutely brillant",
    "date": "2024-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "What happens when a writer what to put emotions into a movie but doesn't want to take the steps to find a good way to, kill a character you like. But in this movie the writer does the lazy thing 5 TIMES! In a Hallmark movie on crack. This whole movie could have ended an hour early if legal act was taken. Be the end of the movie you don't care at all about the characters or anything and you want to smash your fingers in a door repeatedly to ease the emotions wipe lish of a dog's journey.",
    "date": "2024-05-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Muito interessante esse filme 👏👏 e eu amo filmes de animes ❤️",
    "date": "2024-05-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Idk what's wrong with the critics...but this was an amazing movie!  Even better than the first one!",
    "date": "2024-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "If you love your dog, you'll like this movie. It is a sentimental movie told on a childlike sentimental level, but the idea behind the telling, the belief at the core of the story, is profound. (And true 😊🎈)",
    "date": "2024-03-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was one of the best movies I have ever seen. It touched my heart; both this and the sequel.",
    "date": "2024-03-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "You shouldn't always belive what the critics say. These two movies were a great experience, an entertaining summer movie wtrh deep meaning. You can laugh, cry, be relieved or worried. It is wn emotional roller-coaster. Its a great movie, not a Pianist or Shindler's list, but the move is great. Its good in what it suposed to be good at.",
    "date": "2024-02-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Similar to the previous film, it had many touching moments despite the negative atmosphere presented throughout the film. A great conclusion to the two movie series, and Bailey is still the Bailey we know.",
    "date": "2023-12-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I liked it a little bit more than the original movie. I felt more connections to the character not just the dog. I grew to really like most characters shown in this movie. And the harsh challenges these characters face, is much more realistic than the first.",
    "date": "2023-08-06"
  }
]