[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very cool movie, I prefer the first part a little.",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Absolutely nothing like the book. Im sure Lee child would have watched this film and shook with disapproval.  Changing the entire storyline and using the very basics of the book to make a film. Surely there has to be some accountability to the director of this film for the lack of integrity in it. Im genuine beyond disapproval and disappointment.  Tom Cruise also, as good an actor as he is, probably the worst case for Jack Reaher",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The plot makes zero sense even giving it more thought than it deserves. The action scenes are boring. It is terrible. Skip, Let this be the last Cruise as Reacher movie, please. He is too skilled for this.",
    "date": "2025-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "enjoyable enough but Samantha is just bloody annoying!",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Non-stop action and entertainment. Tom Cruise remains a weird choice as Jack Reacher, but I love Cobie Smulders in this movie.",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I don't know about \"monotonous\" and \"formulaic\", but this is great when viewed on it's own. We want to compare to predecessors, always, but try to resist that temptation. This is a good movie, great cinematography and loads of action. Good, sometimes a bit cheesy, yes, storyline. Entertaining and thrilling nonetheless, enjoyed it very much",
    "date": "2025-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A failed action movie in 1 hour and 53 minutes!!!!!!!!!!!!!!!!",
    "date": "2025-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The movie was amazing! The action were phenomenal and good. It was fun watching the movie even though they also have the TV show as well but it's wasn't bad!.",
    "date": "2025-05-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not to bad, it is still pretty good but not as good as the first movie and no where near as good as the tv series but still a solid Tom Cruise action movie.",
    "date": "2025-05-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "For all so called “critics”: this is an entertainment movie not artistic pretentious vomit you otherwise expected. Chill and learn how to have some fun. The movie was great, like all Tom Cruise’s work.",
    "date": "2025-05-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Pay no attention to the negative reviews.  This is an excellent Tom Cruise/Jack Reacher action movie.  Acting by Danika Yarosh is top notch.  The fight scenes are well done.  I'll take off a half star for poor military realism, but tbh, that's just nit picking.  If you're at all interested in this kind of movie, you won't be disappointed.",
    "date": "2025-05-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I dont know what all the negative reviews are about, this is clearly better than the first movie to me.. perfect blend of action and drama and I loved the ending.",
    "date": "2025-05-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Absurd from start to finish. Weird conception of U.S. military. Cruise should never signed up for this strange movie whose top features are explosions and automatic weapons fire.",
    "date": "2025-03-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Nice movie. Action wise it was better than the first movie, but in terms of plot, I prefer the first one better.",
    "date": "2025-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I'm aware that sequels do tend to be inferior to their predecessors, however, after watching 'Jack Reacher: Never Go Back,' I can only conclude that this one is one of the few exceptions to that rule.  And, from my own perspective, I back this claim up because I can't actually remember a thing about the original film (besides some reviewers who had obviously read the book it was based on, moaning about how the titular character was well over six feet tall - Tom Cruise falls quite short of that I believe!).\n\nAlthough, during the 'build up' to the point where 'Part II' really gets going, I was feeling that this film would also be forgotten in my mind as well.  The first half an hour is pretty generic, as Tom, er, sorry, Jack, is set up and forced to go on the run to clear his name.  Am I writing about Jack Reacher, or Jason Bourne here?!  Yes, the plot is hardly inspiring and the rest of the film is effectively a 'chase' with moments of bonding and character development from Jack and the woman he's on the run with, plus a possible daughter-figure.\n\nThe other characters do their best with what they're given, but Tom Cruise is such a big star that any film that has him in it means that everything is going to centre around him and the others can only do their best with the screen time they're given.  But they're all functional for what the story required.\n\nI can't really say too much else about the film.  It's quite simple and nothing that you haven't seen before in recent time, i.e. with the Bourne franchise.  Yes, it has a lot of the same plot points and flaws, such as the villains fall into that 'Marvel Cinematic Universe' category of being pretty forgettable and little more than bad versions of Jack.  It's nearly two hours long, so you'll have to invest a little more time in it than most.  However, based on the fact that I can remember this one over a week after I've seen it and I couldn't remember anything about the original besides the narky comments about Tom's lack of stature, hopefully that means it's at least worth a watch if you're into your spy/chase-thriller type movies. \n\nIn fact, this sequel has made me want to track down the original Jack Reacher film and give it another watch to see if I missed something the first time round.",
    "date": "2024-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This was awesome and a little fun but not my favourite 😏",
    "date": "2024-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "3.0 stars;      This sequel was okay, but not as good as the original. It was more of a formulaic plot, with plenty of action but less mystery and character development (outside of Jack, that is).\n\nI am a big fan of the literary series by Lee Child and have read most of the books in the series. I know this is counter to popular opinion, but I like Tom Cruise in the lead role. He plays it exactly the way I imagine it when I read Child's books.\n\nI presume that this is the last one of this movie series with Mr. Cruise. To me, that's a shame, because the TV series attempts have been, let's say, disappointing.",
    "date": "2024-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Good set up but the plot gets a little lost toward the  end. Chemistry between the characters is good. Cruise is entertaining as always but a little unbelievable that the can beat 5 guys the same size as him in a fight . Worth a watch",
    "date": "2024-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "If the first one was a patchwork of halfbaked ideas, this one is just undercooked in general. Dramaturgically it feels weird and neither Smulders or Cruise seem fully committed to the project.",
    "date": "2024-09-19"
  }
]