[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Yes, it's very cringy in some parts, but once you look past that I think it's a very enjoyable movie",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 23 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated TV-Y7!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The soundtrack can either have lyrics or no lyrics!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Could Have Been Better",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Songs were good, however it needed better script writing.",
    "date": "2025-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved every second of it.",
    "date": "2025-06-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "With catchy songs but awful writing, The Loud House Movie may not have that signature charm we saw in the original show, but it still passes as a great adventure for your kids to enjoy.",
    "date": "2025-02-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I like this movie. I really like the series, and I am so glad they made a movie! My favourite character is Lincoln. My least favourite character is Lucy because she can be very creepy. My favourite part is when they travel to Ireland. My least favourite part is when everybody sings while the Louds are walking through town because it's kind of obnoxious.",
    "date": "2025-01-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I mean the Loud house is kind of part of my childhood , but this common man , what was this , it was not good at all , it didn't made sense and overall this just was a terrible and boring watch , first 10 minutes were alright were , they start off in their normal home but then as soon as they came to Scotland this movie was getting terrible",
    "date": "2024-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I Love The Loud House",
    "date": "2024-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I liked it!\n\nThis Movie was AWESOME! I really like the story, the songs and the villain (Morag), for me, this movie was amazing, funny and hilarious, you must see this awesome movie from Nickelodeon.\n\nAnother thing is that I liked the message that The Loud House movie has, the truth is that a person will always be special and Lincoln is without a doubt, one of the best characters I have seen on Nickelodeon.\n\nMy Rating: 100/100",
    "date": "2024-03-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This is an episode… I mean movie that exists.",
    "date": "2024-03-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Its literally the same as every other cartoon movie, Some villian trys to get power and be the duke and the \"superheros\" saved it from happening. Its also a shitty musical too",
    "date": "2024-01-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The Loud House movie is one of the best Nickelodeon movies. Not quite on the level of the first Spongebob Squarpants Movie but it's a good time especially if you like the show. The animation and storytelling are very well done and the performances especially from David Tennant are great. It also has a good musical score.",
    "date": "2023-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I absolutely love this movie and highly recommend it for a great and fun family movie night with awesome  songs and heartwarming messages for everyone to learn from, also a very Beautiful ending to the film to make you smile from happiness and cry from pure love.",
    "date": "2023-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I really didnt like anything about the movie. It was super cringe and the whole writing is bad",
    "date": "2023-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Harmless. Annoying, cheap, bland, confusing, unlikeable, and boring. But still, harmless.",
    "date": "2023-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "What does both \"Encanto\" and \"The Loud House Movie\" have in common? An insecure protagonist who wants to find the genetic specialness while the rest of the family are proudly content with theirs but ignorant of one's painful truth being kept from them. Respectively, Mirabel waits for a miracle, while Lincoln laments over his ordinariness. Both been produced simultaneously and released couple months apart, but the Disney phenomenon is more original than the film treatment for \"The Loud House\" that acted out on the taken notes from the aforementioned lineage.\n\nDebuted as a short in 2014 then premiered in 2016, Nickelodeon's \"The Loud House\" modernly throws back to how cartoons used to be enjoyable, chronicling the antics of a 13-person household family with ten sisters and one brother as a middle child. Each of the sisters have distinctive talented personalities, while their brother Lincoln is the survival guide that would only stir them up if not assisting them. The occasional mean-spirited treatment distastefully turns it off and lowers their dignities, albeit heartening moments brewing around the corner including humorous laughs that still demonstrate their supposedly true family center. The film addresses the issue as an attempt to reassure, or from a cynical perspective restore, in faith. Though the imagery remains the same in ridiculing the characters just to elaborately prep a teaching lesson these films wanted to focus on than just comedic gags. Lincoln's case may be the messaging source hosting some sort of wholesomeness after disapproving desperation that shows how his insecure cage gets easily rattled whenever he finds himself continuously overshadowed by his sisters, thinking he'll never rise to their specialness. An idea popped into his strategic head is learning the family's ancestry that leads them to Scotland to learn royalty runs in their bloods, including him with a likeness birthright of becoming a duke, then glimpsed unneeded culture clash ensues that was left fizzled.\n\nIt should've been a TV film but initially announced for a theatrical release, which is why the production merits look pleasantly heightened by scaled enlargement akin to similar film treatments that some animated shows received. General reception upon that kind shows the enjoyment surpassing the serial episodes. Animation's more fluid minus the computer-generated assistance, and the story challenges the cast that a couple episodes couldn't disrupt. While that may've been expected for this film, another expectation regards the nature considering how problematic it's become for the series. \"The Loud House Movie\" committed in embracing the heart to dimensional extensions with thoughtful approach to the characters, albeit treated certain most of them without an individual stance despite the wholesome turnout. It seems they decided to go with the first season's focus, insisting most operate like a somewhat amusing hive despite how they've been developed and better explored in the later seasons, though acknowledged the improvements that were made except for its indecisions. Maybe this practice could suggest ideas on how to pivot storytelling onto one of them or actively all next time considering the main cast of characters.\n\nThe musical injection energetically expresses the scale despite the occasional cringe (lessened after watching \"Dancer in the Dark\" encrypting the genre), it certainly took notes from Disney, particularly the Renaissance era. Besides the coincidental opening as comparison to \"Encanto\", once the Louds arrive in Scotland, similarities strike with the lyrics backed up by unoriginal beats and the circumstances flashes back to tense actions from the films. \"Aladdin\" most definite as the opposite comparable bookend with Lincoln taking up the eponymous helm in his story dealing with the ancestral, grudging witch that embodies almost half of the villains from that era. The formula here reminisces in cheeriness whilst still enjoying the characters each with their own moments, though some newly written served as shortcuts without worth considering other ways in providing pivotal directions as certain aspects should've been played differently and at least presented under realistic consideration.\n\nFrom the outer perspective, won't be able to fully grasp the relations nor the built narrative as \"The Loud House Movie\" is best for those who've watched the show, finding purity and better enjoyment through worthwhile fun then something actually heartwarming with subtle heft. The returning cast heartens their assignments with manifested caress and spirit, joined by \"Doctor Who\" alumni David Tennant and Michelle Gomez filled with passion in amplifying the new characters. Though the film may not quite share the entertainment values experienced through the SpongeBob films and \"Rise of the Teenage Mutant Ninja Turtles: The Movie\" – released a year later with better qualities, it's enjoyable over its heart that the show seemingly values by now improved margins. But does it convince viewers to return to watching the show? Depends. (B)",
    "date": "2023-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "L'animazione è bella ma mi ha un pò annoiato",
    "date": "2023-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "From the people that released the paw patrol movie comes another movie released by the same company with a very toxic community full of little kids for a godawful show that so happens to be this shit.",
    "date": "2023-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Love this movie, you should definitely go check it out if you're a loud house fan",
    "date": "2023-06-19"
  }
]