[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The cast was better than the story. Just another twist on the same ole same ole. I would go further but I would give away the ending and you may want to actually watch this. It was one of those movies where you could pretty much figure out what the next scene was going to be, a long with the ending at about halfway through. Cast was strong and acting was good. But besides that it was just ok.",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Thomas Bezucha did well with this one. Great story, gripping, intense and lots of intrigue. Very good cinematography. Diane Lane and Kevin Costner just WORKS nicely as a combination, always. Whole cast excels in character delivering convincing performances. This will keep you interested right to the end",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Honestly, I came into this film with the wrong mindset. I thought this was going to be another Kevin Costner \"Taken\" clone, something like \"3 Days to Kill\". But no, this is far more of a slow burn drama as opposed to a breakneck action film. So, it took me some time to adjust my expectations. With that in mind, the movie has some serious pacing problems. They try to milk scenes for suspense where there is no suspense to be had. A scene does not become tense just because they add in creepy music. There are some good scenes in the movie, but they are too few and far between to make up for all the terrible characters.",
    "date": "2025-06-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Diane Lane and Kevin Costner - what’s not to like?They should have been matched together years ago in movie land. Great story, great actors especially Diane Lane.\nGeorge should have taken his gun to the initial Weboy meeting just in case. Once he found out how evil they were, he could have easily blown them away.\nSorry, shortest movie ever.",
    "date": "2025-02-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Sceneggiatura molto interessante e con pochissime incertezze, con la rodata coppia Costner - Lane al comando, con evidente complicità nel dominare la storia che, grazie ad una sapiente regia, pone i due attori al centro del progetto e fornisce tutti gli elementi per emergere con dialoghi lunghi e profondi, ritmi lenti e sequenze lunghe.\nLa sceneggiatura si compone di pochi eventi allacciati tra di loro da ottime inquadrature a campo largo alternate appunto ad intensi dialoghi tra i protagonisti.\nIl clima di tensione sempre crescente esplode in due sequenze che spiazzano totalmente lo spettatore abituato alla dolcezza blanda del film fino a quel punto e che viene, in modo molto veritiero, schiaffeggiato e riportato alla crudeltà della vita.\nNon del tutto chiara è la presenza del giovane \"indiano\" che probabilmente non viene sfruttato nel modo migliore ma solo \"usato\" ai fini della trama.",
    "date": "2025-02-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Panalo. Galing ng pag ganap nila Lane & Costner. Simpleng kwento ng family drama na may pagka thriller dahil sa mga intense na mga eksena.",
    "date": "2025-02-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I enjoyed this movie very much. Some people may say it played out too slow but I believe it had to so the audience can absorb and understand the level of danger the Blackledges and their grandchild is/are in. The Weboy’s are a very violent family making them dangerous to all that question their way of living, especially the way they discipline the grandchild. This good vs evil theme keeps you hanging on to the edge of your seat rooting for George and Margaret to protect and save their family. The reason I gave this movie a 4 star rating is because I don’t think George had to die at the hands of the Weboy’s.",
    "date": "2025-02-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A Gripping and Emotional Must-Watch!\n\nLet Him Go, starring Kevin Costner and Diane Lane, is a deeply moving and powerful film that I absolutely recommend. It’s not just a suspenseful thriller—it’s an emotional journey about love, loss, and the unbreakable bond of family.\n\nCostner and Lane deliver breath-taking performances as a couple who embark on a dangerous quest to rescue their grandson from an abusive family. Their quiet strength, resilience, and unwavering love struck me on a deeply personal level. As a survivor of 17 years of systematic and severe child abuse, I found myself completely immersed in their characters. Their pain, determination, and desperate need to protect an innocent child resonated with me in ways I never expected.\n\nThe film masterfully balances heart-wrenching emotion with gripping tension. Every scene feels raw and authentic, pulling the viewer into the high-stakes battle between good and evil. The cinematography, the hauntingly beautiful landscapes, and the slow-burn storytelling all contribute to an unforgettable experience.\n\nIf you’re looking for a movie that is both thrilling and deeply emotional, Let Him Go is a must-watch. It’s a story about the lengths we go to for those we love, and for anyone who has ever endured or witnessed abuse, it carries an even deeper, more profound impact.\n\nAbsolutely five stars. ⭐⭐⭐⭐⭐\n\nVincent Kleijn",
    "date": "2025-02-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I found this gem on Amazon Prime.  I sample 10 - 15 movies and will usually find a good one and 'Let Him Go' is the one.  Adult theme,  adult content and a story that is close to an emotional reality.  \nI grew during the 1950's and 1960's, in similar  circumstances, just not as bad. The characters are real.  The loving grandmother, the physically abusive husband, the controlling mother, the bullying sons.  These people  aren't super sized like characters in most movies nowadays.\nParts of this movie are intense and I needed to decompress during and after the movie.  When I feel this way after a movie, I know it's a time well spent.",
    "date": "2025-02-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "3.25 stars.  The acting was pretty good although the plot didn't make a lot of sense.",
    "date": "2024-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Gran Torino fans, watch this!!!\n\nLet him go is a 2020 neo western drama starring Kevin Costner and Diane Lane as a couple mourning the early death of their son, only for their grandson to be taken away by very unsuitable guardians.\n\nThrilling to watch, heart wrenching to watch and sometimes even shocking to watch. However, Let Him Go is not a revenge film that fit the likeness of John Wick, but rather a soothing and captivating study of how far people will go to save the ones they care about. \n\nAs the poster might mislead you with it being a action film for the elderly, it's certainly not that. But what it holds is a original concept, breakout performances that all credited actors (including a terrifying Lesley Manville) that can't be looked away from and a terrific score make this a very high quality standard of filmmaking indeed.\n\nOverall, while not exactly original, the plot alone is mostly attention grabbing throughout it's runtime, making Let Him Go differ from the things we see today.\n\nGrade: A+ \n\nAvailable on channel 4.",
    "date": "2024-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great film with some unique tense moments. Some may say it's 'far fetched' but it is not. Given the time period people were more on their own back then opposed to currently.",
    "date": "2024-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Dean and Kevin are absolutely fantastic both together...\nAnd I wish she had stopped Lorna when she saw them on the street. \nThe film is really beautiful and powerful.",
    "date": "2024-04-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Disappointed. I couldn't believe how weak Costner's character was.",
    "date": "2023-12-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Slow first half trailer is misleading",
    "date": "2023-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Incredibly sad, but excellent movie. Captures family abuse so well, and has a great storyline.",
    "date": "2023-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A good modern western with a simple history and emotional moments",
    "date": "2023-05-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Two raw and powerful wills, one to buttress and the other to perform, exemplify the collaborative efforts of both Lane and Costner. The manuscript is worthy of the casting, which is filled to the brim with wisened and seasoned actors.",
    "date": "2023-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Good performances, beautiful cinematography and score, but God what a depressing movie.",
    "date": "2023-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Well paced and excellent acting, as well as a good overall storyline and well done tension. Could have been more of a thriller but even the slow scenes were well done and enjoyable.",
    "date": "2023-04-04"
  }
]