[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "There were some inconsistencies between the different cameras used but overall I didn't mind. I think that it looked pretty sweet! Well delivered surround sound and clear crisp dialogue help the experience. The story wasn't that great but what made it great was the action and silly fun. It was like Gamer (2009) but much better due to the entertaining cast, fast pace, setting and general endearing quality. The bigger gripes come from the double-decker bus chase, you could tell that they didn't have the budget to pull it off convincingly and the concept of rich people betting on a blood-sport which has been done so many times before.",
    "date": "2023-06-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Minha opinião: Um filme de muita ação e tiros. Uma disputa entre assassinos e aquele que vencer o torneio irá ganhar uma bolda. Nem todos querem participar, mas são forçados. Exemplo Kelly e o falso padre Robert. E o filme segue com muita ação, várias armadilhas. Até que chega o embate final. Um filme para quem curte muito sangue, vale apena assistir.\nRoteiro: boa\nVale apena assistir? Sim\nNota: 7,5",
    "date": "2022-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A gory shoot-em-up with a decent number of explosions for a budget film.\n\nThis is not as artistic as John Wick, but it feels like it has a touch of the Wicks about it.  It is an action film dominated by shooting and some hand-to-hand combat.  For a budget film it does surprisingly well and has a range of explosions, car crashes and most particularly, quite gory deaths with plenty of blood and exploding flesh.",
    "date": "2020-12-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Entertaining... Cound have been better tho.\nViolene and shootings, the usual fun stuff, but nothing new.",
    "date": "2018-02-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Pretty awesome little action exploitation flick.  Plot's not very original, but it's great fun.",
    "date": "2018-01-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This was a much better movie than is indicated. Granted, the plot was poor but the action scenes were top notch. Best of all, the main character was a Chinese hit woman (Kelly Hu) who develops a conscience and finds herself protecting a priest who is in the wrong place at the very worst time. Kelly Hu is fantastic!!! She IS the best casting possible for that character: super sexy, super lethal, somehow still vulnerable but in an invulnerable way. Watch the movie, you'll know what I mean. If you're a fan of female martial arts heroes and really insane action, you will enjoy this movie.",
    "date": "2017-06-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It's good movie to watch",
    "date": "2017-01-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Ham-fisted direction drags down what could have been a much better action film. The story of an annual contest where hitmen and assassins from around the globe converge on a city for a tournament against one another where the last one alive wins millions of dollars. Think \"Hitman\" meets \"Battle Royale\" meets \"Hunger Games.\" Although the story doesn't have an original bone in it's body, it's a serviceable story from some halfway decent fight and action sequences. The fight choreography is very good, but the direction and filming of the sequences is pretty lacking. The same goes for the gunplay sequences. The shootouts are well written and have some clever and very gory set-ups, but the execution of those well written action scenes comes off as not so good. This film would have been a much stronger film with a better director. If it were a Walter Hill at the helm, this could have been a tough-as-nails gritty throwback style of action flick. If it were directed by Guy Ritchie or Matthew Vaughn, it could have been a snappy breezy action flick. If it were done by the guys who made \"John Wick\" this movie would have been totally bad ass! The movie is greatly helped by a strong cast that includes Robert Carlyle, Ving Rhames, and Kelly Hu (who I'd forgotten about until this film, but who I had liked int eh Samo Hung American TV show \"Martial Law\"). Overall, this film is a solid little action flick that had the potential to be a whole lot better.",
    "date": "2016-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's fun, and also offers some unusually good performances; but initially it's undeniably a very forgettable movie.",
    "date": "2016-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "An action movie that sort of preceded The Hunger Games concept. It provides surely some good entertainment, with a great flaw that is the extreme prevedibility of what is going to happen next. I cheered for Ian Somerdaler's character, the most psycho and fun to watch.",
    "date": "2016-03-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It would have been very easy for The Tournament to have a lot more dumb fun than it ended up with.",
    "date": "2015-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Good Action sequence.  Plot was similar to another movie done by Arnold about running men who were bet on by rich people.  Backdrop was set in England which is believed to have the highest numbers of public CCTVs in the world.  Isn't that sarcasm?",
    "date": "2015-03-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It's ok. As far as the movie's life goes it was a hard birth almost from start, so... give me a break it didn't make dollars or quids like others worst or the same, but it's an ok action flick, with the extra pleasure of having iconic actors (Ving Rames and Carlyle). Don't hate what's not great.",
    "date": "2015-03-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Not a good movie, Cover looked like fun but it isnt",
    "date": "2014-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Its a brainless premise, but Robert Carlyle and Ving Rhames inject enough drama to make The Tournament enjoyable entertainment.",
    "date": "2014-06-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "For what it is, it's decent entertainment that occasionally rises above the standard action fare due to some interesting plotting and talented performances.",
    "date": "2014-06-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A British town is a playground for the world's best assassins. What more do you expect from a synopsis like that? Guns blazing, carnage, enormous explosions, gory kills and a lot of bullet spray, that's what you should expect. The Tournament may lack depth and emotion but for action fans and anyone looking for a fun time this offers more entertainment than most British action movies. The insanely talented freerunner Sebastien Foucan shows off his skills, Ian Somerhalder turns nasty badass and shows no mercy, Kelly Hu is feisty and dangerous and Scott Adkins plays brutality brilliantly, all these malicious characters only exaggerate the innocence of the mistaken competitor priest played by Robert Carlyle who delivers a performance filled with shock and scare very well. Liam Cunningham's overdone American accent is poor yet he's fun to watch as he hosts the assassin competition. This is no cheap straight to DVD picture, this is a genuine tournament of pure destruction, solid action and endless gunfire that is pleasing to the ears.",
    "date": "2014-03-31"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I almost want to say you can't come up with a worse product even if you tried.  Think: the worst possible iteration of Battle Royale humanly imaginable.",
    "date": "2014-02-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "bad acting. a lot of gore. wouldn't recommend.",
    "date": "2013-12-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The Tournament caught my eye because its feature star was brilliant actor Ving Rhames who is also known for his badass roles in action films, and its plot sounded entertaining too.\n\nWhat kept me going is how The Tournament managed to maintain such a high quantity of good quality action on a budget of $8 Million, considering its of better quality than half the action films of modern day, which it blends with a large level of blood and black humour which makes it tacky but entertaining in that sense. Its not as meaningful as it should be and doesn't always take advantage of its high-concept plot of Assassination games since the inexperienced director Scott Mann is more focused on ensuring that it's a brutal and entertaining shoot-em-up film than anything meaningful or cleverly written, its nonetheless somewhat fun. Although maybe not as fun as it should be and could be. Still, considering its limited budget that ran empty twice, it does supply all the blood and bullets and nudity that fit into the context of its genre well.\nThe cinematography and editing is strong too, but The Tournament largely suffers the same fate of Black Hawk Down. Its bleak action overkill creates too much manic energy for viewers to keep up with and so they can become worn down really easily.\n\nEven though Ving Rhames didn't get as much screen time as I had hoped, his genial presence still worked and he kicked some major ass with a routine strong performance which kept the story tied together and the dramatics strong.\nRobert Carlyle was also good, even though it's an odd transition for him after being in such great films as Trainspotting. He manages to keep the emotional drama of the story alive and his performance is a strong one.\n\nThe Tournament is essentially a well made B movie and entertaining for the right viewer, but it proves that there is such a thing as too much action.",
    "date": "2013-11-04"
  }
]