[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Disjointed serial killer thriller with a great performance from Hugh Bonneville.  The script can be a little laughable at times, and there are a few plot points that don't make much sense. But it is involving and should grip you.",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Some of the least likable characters in any movie I’ve seen. Props to the serial killer for taking care of some of them at least",
    "date": "2025-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "For not being a Hollywood movie....I was pretty good ✌🏾",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "(CASTELLANO) El planteamiento es interesante: un thriller británico que arranca con una premisa social y pronto se adentra en un terreno más oscuro. Desde el inicio parece querer ser algo más que un simple entretenimiento, con guiños a las tensiones de clase y a una juventud que busca rebelarse contra el poder establecido.\n\nEl problema es que la idea se queda a medio camino. La narración cambia de punto de vista con frecuencia, lo que le da cierta imprevisibilidad, pero también hace que pierda fuerza y se diluya la tensión. En ocasiones parece más preocupada por abrir nuevas subtramas que por exprimir todo el potencial de la principal.\n\nHugh Bonneville es, sin duda, lo mejor de la película. Su giro como figura amenazante resulta perturbador y le da la chispa que la historia necesita. A su lado, el resto del reparto cumple, aunque ninguno consigue dejar la misma huella.\n\nVisualmente está bien cuidada, con una atmósfera gris y opresiva que encaja con el tono del relato. Sin embargo, falta un punto de contundencia para que el suspense cale de verdad. Da la sensación de que siempre se queda a un paso de ir más lejos.\n\nEn conjunto, es un thriller entretenido, con momentos logrados y una buena idea de base, pero que no termina de despegar. Una propuesta correcta para pasar el rato, aunque difícilmente dejará huella una vez acabe.\n\n(ENGLISH) The premise is intriguing: a British thriller that begins with a social angle and soon ventures into darker territory. From the start, it seems to want to be more than simple entertainment, with nods to class tensions and a rebellious youth pushing back against the establishment.\n\nThe problem is that the idea never fully takes shape. The narrative shifts perspectives often, which gives it some unpredictability, but also makes the tension weaken and disperse. At times it feels more concerned with opening new subplots than with exploring the potential of the main one.\n\nHugh Bonneville is, without doubt, the highlight. His turn as a menacing figure is disturbing and provides the spark the story needs. Around him, the rest of the cast does its job, though none leave the same impression.\n\nVisually, it’s well put together, with a grey, oppressive atmosphere that suits the tone. Yet it lacks the punch for the suspense to truly resonate. It always feels one step away from going further.\n\nOverall, it’s an entertaining thriller, with some effective moments and a solid idea at its core, but it never quite takes off. A decent way to pass the time, though unlikely to linger once the credits roll.",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I Came By is a thriller like no other — a true masterpiece in modern suspense cinema. This isn’t your average cat-and-mouse story; it’s a haunting slow burn that grips you tighter with every scene until the final frame leaves you breathless.\n\nThe brilliance lies in the slow unravelling of the plot. What begins as a story about rebellious graffiti artists quickly spirals into something far darker, exposing corruption, privilege, and terrifying secrets hidden behind the façade of respectability. The way the tension builds is almost unbearable, yet impossible to look away from.\n\nThe performances elevate the film into something extraordinary. Kelly Macdonald is out of this world, carrying so much emotion and quiet strength in every moment on screen. Hugh Bonneville as Hector Blake is chilling — his performance will forever change how you see him. The calm menace he projects is unforgettable. And then there is Percelle Ascott as the final hero, who delivers his role so beautifully and emotionally that you can’t help but root for him, even as the stakes reach unimaginable heights.\n\nThis isn’t just a thriller — it’s an experience. The atmosphere, the acting, the story, the way it all comes together — I Came By is one of those rare films that reminds you why cinema matters. A slow, deliberate masterpiece of dread and revelation.",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Dear Director,\n\nFirst of all, I want to acknowledge the ambition behind I Came By. The film opens with a gripping premise — bold, socially relevant, and visually intriguing. It immediately pulled me into a world that felt both urgent and raw, and I was genuinely excited to see where it would go. The rebellious tone, the underlying commentary on power and privilege, and the stylized aesthetic made the first half of the film feel promising and impactful.\n\nHowever, as the narrative progressed, I began to feel increasingly detached. The pacing became inconsistent, characters who seemed vital lost momentum or shifted without emotional payoff, and the plot took turns that felt more jarring than bold. The deeper themes that were introduced early on started to unravel, not through revelation, but through a sense of disconnection — like the story wasn't sure what it wanted to say anymore. And by the time the film reached its conclusion, I was left with more frustration than resolution. It wasn’t the ambiguity that bothered me, but the lack of earned weight behind it.\n\nAs a viewer who was truly invested from the start, it's disappointing to walk away from a film feeling like its strongest ideas were left behind midway. I say this not to dismiss the creative risks taken, but to express the letdown of watching a story with such potential collapse under its own ambition. I hope future projects can retain the same daring spirit, but with a tighter, more fulfilling narrative arc.",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I Came By, a thriller starring George MacKay, had an intriguing premise but ultimately fell flat in execution. It’s a decent one-time watch, but not a film you’ll find yourself eager to revisit. In fact, I attempted a second viewing and quickly remembered why it didn’t leave a lasting impression the first time—it simply lacks the momentum and engagement needed for a rewatch.\n\nGeorge MacKay delivers a solid performance with the material he’s given. He’s convincing in his role and brings intensity to the screen, but even his effort isn’t enough to elevate the entire film. The writing feels uneven and lacks the punch that a thriller of this nature really needs to keep viewers on edge.\n\nThe biggest issue lies in the direction. It’s difficult to understand how the film could make it through the production process without someone stepping in to rework or tighten the script. Thrillers rely heavily on pacing, tension, and payoff—but this one struggles to connect those dots. As a viewer, you can’t help but wonder why the creative team didn’t pause to course-correct when the narrative started to lose steam.\n\nWhile I Came By has its moments and isn’t a total misfire, it also never fully delivers on its potential. It’s the kind of film you finish with a shrug—passable, but not memorable. If you’re browsing for something mildly suspenseful, it may do the trick once, but it’s not the kind of thriller that lingers with you after the credits roll.",
    "date": "2025-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "One of the worst movies I've ever seen in my entire life, if not the worst. The idea is excellent and the actors' performances were as good as they were given. However, the movie is frustrating from start to finish. No reward mechanisms or development of reasoning. Like a feeling of always slipping towards the main point. Poorly developed plots, precarious characters in development. Untied ends all the time giving the feeling that it is an irritating and uncomfortable movie in the worst sense of the word: poorly directed! The movie focuses entirely on complex and annoying interactions to the real intention of the plot. Sounding more like an amateur movie with conflicts of interest in the direction. What could have been used for the good of the movie, was extended and delayed to the point of exhaustion, bringing an extremely frustrating ending in the sense of poorly developed. I would give it 2 stars, one for the theme and one for the acting, but it wouldn't be deserved considering that these 2 stars are sucked up by the incompatibility of functions in the script. I never did a review because I never thought it was necessary.  But the film was so negative in my opinion overall, that I sincerely hope it is removed from Netflix because it doesn't get more than 1/10 for both the genre and the purpose given from the beginning. Terrible in practically every aspect. Terrible.",
    "date": "2025-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Very surprised it doesn’t get a higher popcorn meter rating.  I thoroughly enjoyed it! Was very suspenseful with a satisfying ending.",
    "date": "2025-02-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A good thriller with a good storyline and good acting. \nShows us how rich powerful white men can be monsters.",
    "date": "2024-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "it's watchable, but by the time the story was at it's climax it kind of felt predictable and generic. i like george mackay but we don't see much of him in this.",
    "date": "2024-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "After reading other audience reviews I was expecting to be disappointed. Hugh Bonneville is eerily good at being a sociopath like villain. Overall I was held captive by plot progression and impressed by some of the turns throughout. No regrets in watching.",
    "date": "2024-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "While it follows a mystery/thriller trope we’ve seen before plenty of times, it by no means makes it any less tense and anxiety inducing. Great performances all around by its cast makes this film a worthy watch. It has the energy of one of those films that you’re just yelling at your tv dying to see the antagonist get what they deserve, wondering how people could get away with what it’s shown for so long without rising any suspicion by those in authoritative positions. What’s genuinely scary about this film is that things just like this happen every single day while we scratch our heads asking how was it possible they didn’t get caught sooner with the evidence pointed straight towards all of us for all the world to see. Overall it’s definitely a good watch during a late night weekend with friends or spouse; just don’t go in thinking you’re gonna see something completely new in the genre.",
    "date": "2024-06-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Quite a hidden gem. Only good your first watch though.",
    "date": "2024-03-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "No idea why this got so many bad reviews. Good thriller with suspense and excellent acting. Thoroughly enjoyed it.",
    "date": "2024-02-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very good movie, don't listen to the bad reviews. (I'm starting to wonder if half the audience reviewers are just trolls.) Excellent acting, characters, story, and suspense.",
    "date": "2023-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I really enjoyed this film. A good story with good acting. I Came By gets a thumbs up from me.",
    "date": "2023-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Babak Anvari's film is effective in story-telling and mood.  Truly a sad ending though.",
    "date": "2023-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Wasn't a bad flick. Plenty of tension and fairly thrilling. [SPOILERS] But the fact that the people I didn't want to die...died, that just made it really depressing. Mainly Kelly Macdonald's character. She was great in this and her getting murdered kinda ruined the movie for me. Most of the movie she's trying so hard to find out what happened to her son and she's the main one you're rooting for, she's the sole person in that spot the way it's directed, but then she finds the same fate. But some people might find that to be a refreshing/more realistic take. Worth a watch!",
    "date": "2023-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A bit plodding and the criminal was given away fairly quickly, so the buildup, though slightly surprising in how it actually happened, wasn't quite as exciting.",
    "date": "2023-06-24"
  }
]