[
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Jeff Bridges plays Bane in Hawk the Slayer meets Lady Hawk  nuff said",
    "date": "2025-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Seriously bad, so much it's hilarious 😂",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Not remarkable, nor terrible.",
    "date": "2025-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1 hour and 42 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated PG-13 for Fantasy Action, Brief Strong Language, Fantasy Violence and Frightening Images!!!!!!!!!!!!!!!!!! The USA grossed over $17,200,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved this movie. The story line is great. I got the books because of this movie.",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "An entertaining albeit unoriginal & fairly bland fantasy tale, only made a good time with some decent effects work & solid performances.",
    "date": "2025-04-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I don’t care why people gave this a bad rap\nFor a 10 year old movie this is better than a lot of movies nowadays honestly, look at that stupid aliens requiem movie horrible lines, the girl said while a whole full grown alien in site to the robot we could have said her how, but this cgi in this is better then a lot of movies nowadays honestly that’s why in the past 2 3 years it’s been less cgi because most don’t get right at all, writings butt in most as well all that’s been good was the marvel movies and shows honestly, 3.5 for this in my opinion suck nasty butt if you don’t agree, and if don’t agree I don’t know what you was watching it for sure wasn’t this.",
    "date": "2025-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This film was so bad that it brought me back to Rotten Tomatoes just so I could give it a bad review. \nAn impressively talented cast managed to come across as amateurs, playing completely unlikeable characters. \nI couldn't understand a word Jeff Bridges was saying, which was probably a blessing as the rest of the dialogue was terrible. \nThe effects were dodgy, the cinematography was dire and the sound was all over the place. \nMassive waste of time.",
    "date": "2025-02-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "as an avid readers of the books i was so damn disappointed by the adaptation, i like fantasy movies and i liked the animals shifters and Moore but that's about it, a waste of potential",
    "date": "2024-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Very bad movie, wish I hadn't wasted the time.",
    "date": "2024-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "People who love adventure with action this movie is for them its one of the best movie i ever saw worth to watch",
    "date": "2024-06-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I read the series the Last Apprentice by Joseph Delaney when I grew up. I was so excited when I saw there was a movie based off them but the movie is all over the place. I honestly think the books could be like series like GoT but this movie does them bad justice",
    "date": "2024-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Weird how this movie never achieved what it should have.  Great cast, excellent special effects and you can tell there is some kind of story there.  But for some reason the writing was off.  It just wasn't very interesting.  \n\nIf you're a fan of fantasy movies and like these actors, you could very well like this movie.  It's not offense, it's just not particularly compelling in any way.  On the contrary, it's fairly formulaic.  \n\nMade me wish I was watching The Big Lebowski instead.",
    "date": "2024-04-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "For 2015 excellent movie if you like the genre. Good graphics/special effects and the creatures are cool.",
    "date": "2024-02-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie is extremely loosely based on one of my favorite novel series the Wardstone Chronicles. From the very first 2 scenes I was already incensed by then incredible injustice this movie puts on to call themselves based on these books. Like the Batman vs Superman movie of a similar time the production company mush have flipped through the first 5 books or so and just grabbed words they thought to be cool. The characters in this film are only based on the book characters by name alone there is no further resemblance. Universal and Legendary films failed this series and I wish for a tv reboot in the future to redeem this franchise and shine the light that Joseph Delaney deserves on this series.",
    "date": "2024-02-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Actually this movie was great.\nThe acting was excellent from most characters (certainly the lead Ben Barnes gave a heartfelt performance). The SFX were decent. The little jokes were fun. Yes it was cheesy and full of cliché. But its fantasy and as such, a little cheese and cliché is expected.\nI loved it. So did my kids. So did my husband.",
    "date": "2024-02-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's a very good motion picture with charming half-witch by Alicia Vikander...with a villain, Julianne Moore...",
    "date": "2023-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thought the movie was really really good if you like these type of movies which I do I love it hope there's gonna be a second I don't know why people didn't like it, but it was really good. Had a good storyline hope to see the second movie.",
    "date": "2023-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was awesome? I cannot understand why the scores were so low - we gave it a chance as it was on a list of movies similar to LOTR; great storyline, good acting, not the greatest movie ever made; but if you're looking for a fantasy to escape in - it's great!",
    "date": "2023-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Fun but forgettable..i believe there was more to expand on within the books that wasn't explored in the movie adaptation",
    "date": "2023-05-16"
  }
]