[
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Bull goes off leash for a night out when he finds out he's getting fixed in Tartakovsky's worst work yet, the movie is pure raunchy humor.",
    "date": "2025-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I’ve seen a lot of movies, I don’t typically mind crude humor, but this may genuinely be my least favorite movie I have ever seen. Not a single joke lands, it just tries constantly to be so funny by making the same jokes again and again, and it’s honestly disgusting. Absolutely atrocious, wouldn’t have finished if I wasn’t with friends.",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "La comedia en varios momentos si me hizo reír, pero en otras partes si me generó incomodidad",
    "date": "2025-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "No puedo creer que el creador de series tan buenas como Samurai Jack o Primal sea tan asquerosamente enfermo como para hacer esta pelicula. Es honestamente, un atentado contra los derechos de los animes, un manifiesto del odio a la humanidad y la nueva pelicula favorita de un grupo de personas muy repugnates cuyos nombres riman con zoo + filia. Esto no debio de existir.",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I don't like the animation so I'm not going to watch it again and in the movie they're licking their balls and that's disgusting I'm not going to watch that again it's terrible so I'm giving a 0.5 out of 10",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I was honestly surprised by how much I enjoyed this movie. I had read plenty of negative reviews before watching it, but I completely disagree. Fixed entertained me from start to finish and gave me genuine laughs, something I hadn’t gotten from other films in a while.\n\nThe humor worked for me because it connects with the way I see things: irreverent, direct, and a bit absurd. That’s exactly why it felt fresh, different, and fun. I was really bored, not finding anything that could grab my attention, and Fixed ended up being exactly what I needed.\n\nI get that it’s not for everyone, but for me it was refreshing to watch something new that dares to be different. Honestly, it feels like this movie could’ve been made by me — it has my sense of humor written all over it. That’s why it absolutely deserves five full stars.",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A pesar de sus momentos explícitamente grotescos y escenas sexuales, al menos resulta mejor que Spermatoggedon, para mí siempre será la mezcla de La Vida Secreta de tus Mascotas y La Fiesta de las salchichas, así que un aplauso para Sony Pictures Animation",
    "date": "2025-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Cool art style great set of actors it has a good message but it’s hard to sit through 86 mins of 90% sexual jokes that mostly don’t land I think the non sexual humour is the stuff that works",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "9/10\n\nTraditional Hand-Drawn Animation and Raunchy R-Rated “Sausage Party”-style humor sure can make me smile!",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "'Fixed' is, to barely any surprise (well, so I thought), utter tripe. It's somehow worse than 2023's 'Strays', which is the one impressive thing about this 2025 movie. These 'adult animated' films always fascinate me, like who the heck are they for? It's teenage humour for... grown adults?!\n\nGrossed out humour can exist, but I wished they'd stop stooping to the bottom of the barrel every single time... poop and sex gags, that's all they're capable of apparently - even when dogs are involved, evidently. Every inch of this film is just mind-numbingly stupid.\n\nListen, I'm fully aware that I only have myself to blame. Despite knowing nothing major about it, the tiny knowledge I did hold made me know what I was about to watch. Yet I still chose to watch it, hoping one day one of these 'adult animated' releases will be worthwhile...\n\nZero creativity here, proper lazy stuff. I simply cannot compute that people actually sat around and wrote this... they live amongst us, which is a scary thought! Those voices onscreen aren't much better, Idris Elba is the only one who is minorly OK (hearing him f-bomb is minimally amusing).\n\nYou can have all this gross comedy, but at least surround it with a plot that's somewhat coherent and interesting; the gags should be part of the film, not it entirely. Lastly... gotta feel for Andrea Bocelli - they really be letting anyone use his music, huh?\n\nI've not checked how this has been received yet... surely not any better than from yours truly? checks y'all too kind. If you like this then fair enough, I guess. One of the worst movies I've seen, personally.",
    "date": "2025-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A weird movie to say the least, but there is also something charming about it. Im not a huge fan of comedy and the sexual innuendos get old after a while, but I really appreciated the visual style. Wish more films would go back to traditional animation.",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The plot makes no sense for like half the movie. Honey was literally propositioning bull and bull didnt know if she liked him. It was really stupid. Also they try to make it seem like we should accept bull getting castrated even though the whole movie comes acrossed as a commentary against castration. They had a good concept but the writing ruined it.",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Comedic in ways often unexplored, this film has an interesting storyline, often visually provocative scenes, and a well-adapted style of anthropomorphizing the actions of animals with a comical twist on reality. It does use excessive fiction and conveniently timed events which can make it seem inauthentic, but also can be a relief from the sexual-oriented storyline.",
    "date": "2025-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "0/100 it's the worst movie i've ever watched. simple as that.",
    "date": "2025-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Ok, but may be a bit bizarre and uncomfortable for most casual viewers",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "It was a very lazy film , this isn't real adult animation its just mediocre sex jokes , literally all the movie its a sex joke, it was entreteinig to watch but it wasn't funny.\nit didn't have a moral of the story, a lesson, a real struggle, a real joke that wasn't heard before.\n\" at the end people love you by ho you are and you don't have to pretend you're somebody else \" bro its a childish moral of the history that i could learn in my little pony. \nFixed the movie resumed: dog want sex , dog is going to lose balls , dog runs away and has a \"party\" before losing his balls , dog has a cliche \" im sorry i was rong, it was a miss understanding i love you\" , dog has sex, weird bear at the end\n\nthis film gives a bad name to aduld animations",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "meh not that funny and kinda ugly to look at",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I can’t explain how funny this movie really is. I’ve watched it 3 times, and laughed every single time. I’ve never seen anything like this… so i don’t understand the hate it’s getting. There’s literally a reason for it being an adult movie.",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great animation! Simple story but it's a dog, so getting fixed is BIG NEWS! haha great adventure, love the soundtrack to the movie,love the ending! REALLY DIRTY! GREAT MOVIE! DONT LISTEN TO THE HATERS!",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Тупое говно тупого говна. Самые худшие полтора часа за всё лето. Не жаль никого. Я больше не хочу жить в мире где многомиллионные компании выпускают НАСТОЛЬКО дерьмовое дерьмо. Я бы лучше наиафигеннийше дристал на протяжении того же времени, смотря топ 100 пранков 2001 года. !!!!!!Я НИКОМУ НЕ РЕКОМЕНДУЮ СМОТРЕТЬ ЭТУ ПАРОДИЮ НА Я ДАЖЕ НЕ ЗНАЮ НА ЧТО!!!!!!",
    "date": "2025-08-23"
  }
]