[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie, Definately for watching with your partner. Loved the family aspect. Aimee Garcia was amazing and so well fit into her role as did Freddie Prinz jr. The chemistry between these two is off the charts.",
    "date": "2024-12-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It was ok overall for a Christmas movie, but it seemed kind of clunky in places and the main characters were not believable as a romantic couple as they seemed too different, but still enjoyable in a few scenes to watch near the end. Freddie reminded me of Stan Laurel in some scenes.",
    "date": "2022-12-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Loved this feel good movie. The music and the dancing were terrific and add to the sweet story.",
    "date": "2022-12-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Aimee Garcia does her best but the copy and paste script gives her absolutely nothing to work with.",
    "date": "2022-12-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was a very good movie.\nAs good as any on Hallmark",
    "date": "2022-12-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This Christmas rom-com was great. Aimee Garcia, Freddie Prinze Jr., Deja Monique Cruz, Zenzi Williams, and the rest of the cast did a great job in this movie. The story of the movie was dramatic, inspirational, and romantic. It's about finding what inspires you to do something great and finding true love as well. If you're a Netflix member, you should watch this movie. It's a great movie for couples.",
    "date": "2022-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Although this is a repetitive story, it was  much better than JLO and Maluma's one. It was entertaining and it passed the time",
    "date": "2022-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The differences between this movie and Marry Me was how they got together and the time of year.  I had to turn it on.  Bad movie.",
    "date": "2022-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Oof, this isn't good 🙁\nProbably give it a miss 👎🏼",
    "date": "2022-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's great to see Latinos heading this Christmas movie!! Loved the song for the movie. Aimee Garcia did a great job along side Freddie.",
    "date": "2022-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I like both these actors quite a bit. Freddie Prinz did an admirable job, but Aimee Garcia was all wrong for this role. Even the idea behind the movie wasn't awful - aging rock star trying to stay on top. But Aimee is (and I am really sorry to say this) not a leading actress. She is a great sidekick, but everything fell flat in the movie and unfortunately, it was due to her.",
    "date": "2022-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love this movie. Also I love her … such a good actress. Loved her in Lucifer lover now… ❤️",
    "date": "2022-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Freddie was so pale and old which also perfectly describes his acting.",
    "date": "2022-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Perfect Christmas movie. Like most Christmas movies it is predictable and formulaic, but that's why they work.",
    "date": "2022-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Cute but overly long and the music is awful.  Nice to see a story that's about another ethnicity for a change.  The young fan is super cute. That quincenera dress!!!!",
    "date": "2022-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I am a huge fan of Aimee Garcia, and she did great in this film. It was so lighthearted, I kept smiling and laughing :) I can't say I felt the same way about Freddie Prinze Jr., I was wondering about his casting way too many times during the film, randomly and spontaneously, the chemistry didn't quite work for me, I'm sorry. I thought the music was so lovely.",
    "date": "2022-11-18"
  }
]