[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It was a great movie but it felt a little rushed. I wish it was longer and I wish there was a second movie.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Vlad the impaler!! Awesome vampire movie! I dont see how anyone could not love it",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Dracula Untold was released in theatres in 2014 and stars Luke Evans as Vlad the Impaler (Vlad Tepes) and Charles Dance as sort of the Master Vampire. It's set in the 15th century and Evans is the ruler of Wallachia. The Turkish army invades Transylvania demanding tribute including his son. Evans refuses and seeks the master vampire's help who had earlier killed some of his best soldiers. Dance offers Vlad his blood which will give him the power of a vampire, but he can return to normal if he doesn't drink any human blood. Vlad uses his new abilities to turn a number of his soldiers into vampires and they defeat the Turks. But when his soldiers want to attack the villagers and his son he allows the sunlight to destroy them. The movie ends with Vlad in present day being watched by the master vampire. Luke Evans gave a solid performance, the CGI was good, and I liked the dark atmosphere. I think an 'R' rating would have helped but overall it was a decent Dracula movie and certainly worth a watch.",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "There have been so many tellings of Dracula/ vampires and this one is actually enjoyable.",
    "date": "2025-10-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Rivisitazione dark della nascita di Dracula, in cui oltre ad una sceneggiatura non particolarmente brillante, anche la regia non brilla per qualità.\nAl di fuori della buona scelta di Luke Evans come protagonista, c'è davvero poco da salvare se non qualche sequenza di azione che pur senza grande logica riesce ad essere discretamente soddisfacente per la sua spettacolarità.\nAnche il finale lascia estremamente perplessi, forse nel tentativo di lasciare uno spiraglio per un eventuale sequel, o forse nuovamente per la scarda qualità della sceneggiatura.\nComunque per gli amanti del genere, 90 minuti di azione da pop corn.",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Dracula Untold stands out because it’s stylish, fast, and full of energy. The visuals are sharp, the action hits hard, and the bat transformations look incredible. Luke Evans brings real presence to the role, making Dracula feel powerful and commanding. It blends medieval war, dark fantasy, and myth in a really cool way, and the movie keeps a strong, cinematic momentum from start to finish. It’s a fun, visually striking, badass take on the Dracula legend.",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A simple and intriguing movie - (Evans) was suited for the role and the story was portrayed in a great way that  does not belong to the commonly shown vampire movies. Nowadays, new movies are being taken with complexion and failed to reach its profit in collection wise. The simple flow of movie is being forgotten and that's is why ,any movies sequels after the first one does not perform very well.",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I really enjoyed this rendition of Dracula. Out of all the \"monsterverse\" movies they came out with, I felt this was the best one.",
    "date": "2025-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Might be the single most underrated film of all-time. Certainly up there.",
    "date": "2025-09-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "First half of the film is great, the second feels a little more rushed. \n\nSpoiler: The force-like powers with the flows of bats destroying an army was really not necessary. The scene looks ridiculous to me.",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great action vampire movie, have watched multiple times.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Even after 11 years later I watched this movie 2 times after gap..n I love it ....plzzz director producer I am waiting for part 2..I want to know about the further story what game that old monster wants go play...what happend after a age later in new world with vlad n her wife a new love story...",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "No entiendo como le dan 25 a esta obra de arte, definitivamente algo está mal con rotten tomatoes",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "this movie is amazing and i don't see why people are hating on it because evans carried the movie and i really hope they make dracula untold 2",
    "date": "2025-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is fantastic! It’s one of my favorites. A great watch. Make a sequel!",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is easily 100% I don’t know why in the hell y’all gave it a 25% that’s criminal.",
    "date": "2025-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It is a fun watch…..",
    "date": "2025-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very entertaining! I would love to see a sequel.",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is one of my favorite Dracula movies. It's very entertaining, beautifully shot, with phenomenal acting. It may not be the exact story of Dracula but it's a really good story. Don't trust these scores on rotten tomato because alot of them are just way off. I mean, Nosferatu got high scores and that's a pile of garbage...  There definitely needs to a second movie to this. I absolutely hate and don't understand why  studios listen to these lame critics. They are obviously being paid to give certain scores, which are almost every time, just wrong.  Listen to the people that actually spend money to watch your films and do so for entertainment, not to push a certain view or paid to give wrong scores. Hollywood still hasn't learned to listen to the people and they and us are losing out because of it.",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "one hugely entertaining vampire - & i'm hard to please",
    "date": "2025-06-16"
  }
]