[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A horror film about a divorcée and her three children fighting evil spirits in a run-down apartment somewhere in Pennsylvannia. Stars the late Omar Epps, Glenn Close, Mo'nique, and Andra Day. \n\nDirector Lee Daniels guides us through three acts of a cool premise and finally, a contemporary dialogue paints this genre film with an organic quality missing from most horror offerings. \n\nThe film gets snagged in overwrought exposition when it should have stayed with its gut instinct - more like the original genre classics Rosemary's Baby or the Exorcist. Glenn Close adds an extra dimension to every performance around her character in this film as the the mother/ possessed demon.\n\nDefinitely worth the watch.",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I just randomly decided to watch it. The story is very basic. A single mom with 3 kids moved into a new house and since then all 3 of them started to act strange until the point where they're purposely harming themselves as if something took over them. All of this gets noticed by the social workers and they are blaming the mom because she's hot-tempered and due to her childhood trauma she also has issues with alcohol. Then she meets Mrs. Tucker who believes her and helps to get rid of the evil demon that won't leave them alone. There is nothing extraordinary about this typical horror that is not even scary. I was very bored until I found out at the end that it was based on the true story.\nThat's when / almost fell off my bed. Unfortunately the movie was poorly executed tho. I was very satisfied with the cast! Overall - don't expect to be freaked out because this horror is very demure.",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Beginning was good…ending was funny. If you like horror in general, it’s a classic entertaining watch. Dialogue had me cracking tf up!!!",
    "date": "2025-10-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "WATCH THIS FREAKING MOVIE ITS INTENSE",
    "date": "2025-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The movie was amazing! The end gave me goosebumps. The symbols all the way and how smart it was just wow! I think critics and some reviewers just can not like a christian based movie and that fine but you do not have to be annoying about it ! The idea of reedming and calling God from the under the ground. Seeing herself at the end as Demon took her mom looks as she blamed her then her son which she blamed for her life as well but end up accepting that it is her who is evil and to blame and then giving Jesus and passing her childhood trauma where she lost faith. Just amazing and who do not like it, review your taste",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing movie, great characters, and all-around excellent production.  The plot is in a basic Midwest home, and makes me think, damn, this could be any of us.",
    "date": "2025-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Small minded people who think horror is just jump scares and gore obviously aren’t liking this but it mixes supernatural elements with dark drama in a captivating way. Really unique and all the main cast is really solid!",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It was boring and a waste of time.",
    "date": "2025-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I made an account just to write this review to thwart off anyone watching this. Don't get me wrong I love a bad horror movie more than anything, but this was so bad that I can't even suggest watching the trailer. There was one funny line in the whole movie and the rest of it was so mindnumbing I wanted to pick scabs off my brain. If you genuinely enjoyed this I'm happy for you but you're wrong. To whoever wrote and directed this movie, seek help, I could make something better with $5, some cardboard, and construction paper.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Really not that good.  The actors did a good job, but the paranormal aspect does nothing but drag the movie down.  It’s not scary or good horror; it would have been better without the horror altogether.  I ended up laughing at the climax, and not in a good way.  Skip it unless you really need something to watch or like the actors.",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "\"The Deliverance\" aims to be a unique horror film, but unfortunately ends up feeling more like an unintentional comedy. The director tries very hard to reinvent the genre, but the result is a confusing and often awkward take on horror. Instead of building genuine tension or fear, the film stumbles through over-the-top scenes and inconsistent tone. What could have been a chilling story ends up being more laughable than terrifying.",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Movie is very captivating IMO",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I wish people would just be honest. This is a boring Christian movie. It's not scary at all, just non-stop Bible-thumping",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie was so bad. The acting was bad. The language was awful and unnecessary. The mother was abusive and cruel so I can’t even feel happy she got her kids back in the end. She doesn’t deserve to. It was trashy. They’re trashy. Glenn close being in it was strange. It’s beneath her.",
    "date": "2025-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I do love a good horror movie/psychological thriller but this was not that. I have been watching horror films since I was 4 and it takes a lot to make it on my top 10 list. \n\nThis one doesn't even deserve the half a star. It wasn't scary, spiritual, or thrilling on any level. I do know the true story of the film and I don't think this film even did it justice. \n\nIt really just felt like the writers/producers were trying too hard and failing across the board. Nothing is more painful than watching someone who has no idea how to write in this genre do it anyway and fail miserably. The movie dragged on forever, a story that could have been told in 10 minutes was almost 2 hours long. \n\nThank god for the amazing cast, otherwise it would be completely unbearable.",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Ground breaking I’ve never felt so touched my god from a movie like this one",
    "date": "2025-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Shocked how bad this is",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I want 2 hours of my life back",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Absolutely awful. Do not waste your time.",
    "date": "2025-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "What the hell is this \"God is king\" bs? Advertised as a horror movie and the whole thing led to a \"I have faith in God\" ending. The story took 90% of it just to build up to the actual point of it, I can't figure out what a birthday party had to do with being possessed but who knows. More of a drama than anything else. \n\nActors were good though.",
    "date": "2025-06-10"
  }
]