[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Solid action flick. Gal Gadot is on fine form, and this film isn't afraid to let her get a bit of blood and grit on her, especially in her final few fight scenes. The film has heart (no pun intended). My one complaint would be that I felt it needed to be longer--a few character motivations and plot beats were left a bit thin, and with a slightly longer runtime I do think Rachel Stone's story could have reached its full potential. Still, as far as Netflix films go, this one flew by. Now if only they'd translate the French.",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The script is reasonable, the action shots and effects are good. Gal Gadot does a great job of keeping the focus on her key role. \nThe problem I had was the supporting roles were not as impactful and apart from a reasonable performance by Alia Bhatt they didn’t convince me.",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Probably one of the worst movies ever.\n\nGal galdot is so mid in particular.\n\nDon’t waste 2 hrs of your life",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It wasn't that bad but predictable & boring. Wasn't quite impressed. At this point I think I'm tired of movies where agents float to the surface dry from the ocean if you get what I mean.\nAnd somehow they always have everything handy that can save their life. Like make her suffer sometimes or smth",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Actress is just terrible...",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it! Finally, a spy action movie starring leading women. I enjoyed the storyline that balanced action with story. I would love to see this become a franchise played by the remaining actors, similar to a mission impossible or James Bond.",
    "date": "2025-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "ehhhhhhhhhhhhhhhhhhh",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Really didnt enjoy this, the acting is very wooden and distracting",
    "date": "2025-06-16"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Failure in 2 hours and 2 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! What the flying ****?!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I don't believe they were attempting to sell anything beyond a typical action movie here, so if that was their intention, they certainly succeeded! I went into it without expectations, and it turned out to be enjoyable, exactly what you anticipate from a movie like this.\n\nThe writing was a bit weak, which is a common trait in almost any action movies. However, there were two aspects that stood out and aren't typically seen in such films. Firstly, there was no excessively long fight scene where characters (especially women) are hit multiple times and keep on fighting. This was quite refreshing.\n\nSecondly, they actually addressed the injuries sustained by the characters. In many movies, the main character gets hurt, but is miraculously fine just moments later. In this film they show the character's injuries and exhaustion throughout the entire movie. I thought this was well-executed, which is why I gave it a rating of 3.",
    "date": "2025-06-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Heart of stone review I love this movie so much I love the storyline I love action fight scenes I love gal gadot in this movie she stole the movie for me if they make a sequel I am excited for the sequel \n5 star \n10 out 10 star \n100 out 100 star",
    "date": "2025-05-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Nothing worth watching it \nWhat a waste of time",
    "date": "2025-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Gal Gadot is a very very actress. My God 😳",
    "date": "2025-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Gal Gadot stars on this action thriller , kind of Mission impossible. She’s fighting a terrorist that wants to get a hold of the most powerful computer in the world. Cool action and fighting sequences and special effects. Good story and good ending. This movie didn’t get a lot of love on rotten tomatoes but I did like it. 🍿🍿🍿🍿/5 on Netflix",
    "date": "2025-02-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Impressive visuals amid decreasing action thinly struck down by aimless intel, therefore letting down Gal Gadot’s engaging showcase who appears to have given her all physically or breezed charismatically. (B-)",
    "date": "2025-02-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great acting, Great story line! Gal is fantastic as expected!!  must watch movie!!!!",
    "date": "2025-01-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Lots of action, no substance. Horrible script, will appeal to 14 year old boys.",
    "date": "2025-01-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I liked the movie a lot, but the representation of Portugal is not at all accurate.\nClaiming that you will eat 'tapas' in Portugal and referring to Fado as 'dated music for old people' shows a significant lack of cultural knowledge and interest.\nIf the intention is to film in a specific country, it would be important to dedicate some time and effort to understanding the cultural traits of that place.",
    "date": "2025-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Captured our attention from the beginning and held it throughout the movie.",
    "date": "2024-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It was entertaining but it wasn't great. Gal was fun, glams up pretty good, but she was just not James Bond..  There was no intimacy it was all non-stop action, so bordering on a little crazy.  Bond movies do stuff similar but this was not Bond-worthy.  And Gal needs a love interest.  \n\nSo, all in all, it was free to watch so it was ok, if i had to pay $20+ $20 for popcorn and a Coke, it woulda been a waste.\n\nWorth watching if you have nothing better to do.. !",
    "date": "2024-11-12"
  }
]