[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "When we first saw this movie, I thought it was the single dumbest movie I have ever seen.  But my 8 year old LOVED it.  So we’ve watched it multiple times over 3 years now and the kids still love it.  And, paradoxically it gets better every time we see it.  I don’t mind it now and even think it’s kind of cute at times..",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I dunno, man - the movie wasn't made for me. My 9 year old niece and my mum both really liked it - they liked the way it was colourized, and they thought it was funny, and they liked the location. I hated it, I thought it was terrible, I hated the way it was colourized, I didn't like the jokes, I thought the location was pretty cool. I just wasn't in the target audience and that's ok!",
    "date": "2024-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Cute and light-hearted, goofy music scenes and a touching story. Great to watch while frosting cookies",
    "date": "2024-12-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a super cute, family movie. It's funny and pretty fast moving. The kids loved the animals, the bright clothing, and the farm.",
    "date": "2024-12-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This film manages to be refreshingly chaotic while still hitting the beats of a traditional comedy. Worth a watch if you’re looking for a lighthearted story after a stressful day.",
    "date": "2024-12-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "As a family we loved it. It was laughter filled, cute, great twist at the end. Soooo many barnyard animals, so much cuteness.",
    "date": "2024-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's silly, corny, cliché and full of simple slapstick humor and absolutely fabulous. I loved it both times I saw it.",
    "date": "2024-04-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is literally the worst movie I have ever seen.",
    "date": "2023-12-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This was quite possibly the worst movie I have watched in 2023. Everyone in this room is now dumber for having watched this. I award you no points, and may God have mercy on your sole.",
    "date": "2023-12-20"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Lowest possible quality content filler.",
    "date": "2023-12-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Over the top.comedy  to much noise but the gags are thin plot line.thine",
    "date": "2023-12-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Worst movie I have ever seen",
    "date": "2023-12-16"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is like a cross between Balamory, Nativity film, Hot fuzz.  Not particularly amusing might be good for under 5s to watch on their own, anyone over that age will find it very boring.  Everything is brightly coloured and knitted which is a bit odd.",
    "date": "2022-12-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "What is it with British content these days? They seem so basic and amateurish; probably afraid to upset anyone should they do anything different or remotely funny that could be classed as entertaining. This movie is no exception, it should be named Christmas Cringe. Nothing to see here folks, move on!",
    "date": "2022-12-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This was about the worst movie I have ever seen. It makes absolutely zero sense.",
    "date": "2022-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I really wanted to watch this, on paper sounded good.  I should have watched the trailer... I wont lie, I could not make it all the way thru the movie.  It made no sense, the story just did not flow together.  The kids were cute, and performed admirably, but the adults were so all over the place that if they had been removed, I would have probably been able to watch it till the end.  I'm sure that it was meant to be over the top strange, but to strange for me to open the Holiday season.",
    "date": "2022-11-26"
  }
]