[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It had a good promise, but the structure was not great. The message was not clear which is a usual thing in such documentaries where the incidents are told by the people in the documentary.",
    "date": "2023-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "'Money Shot: The Pornhub Story' is the Netflix documentary not to watch with your parents!\n\nSYNOPSIS: 'Follow the rise of the most famous adult entertainment platform and the recent backlash it has received.'\n\nIs this the most controversial documentary on Netflix? Well I guess it depends what your sensitivities are, but being such a controversial topic, the biggest positive of this documentary is to offer as many points of view as possible on difficult subjects.\n\nThis doesn't demonise porn or the porn industry but it does show that when the pure focus is capitalism things can go horribly wrong.\n\nThe issues raised within this documentary are deeply concerning and it appears no executives have been taken to task yet.\n\nFascinating.\n\n7/10",
    "date": "2023-04-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This was like watching wall paper peel. The topics presented could have been covered in 5 minutes. I expected more. Maybe I fell asleep, but I don't remember any mention of amateur content where people make their own videos and upload them primarily for fun and excitement rather than to be professional porn stars.",
    "date": "2023-04-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A thoughtful deep dive into not just Pornhub, but the online porn industry, its workers, its leaders, and the internet framework holding it all together. I braced myself for the usual one-sided, narrow attack on Pornhub's policies. While valid, it's only a piece of the story. Consenting professional sex workers rely on platforms like Pornhub to make a living and I'm glad that side of the story was explored here. It's also refreshing to see that disingenuous parties framing themselves as advocates were exposed a bit. Sex work is real work. Consensual pornography is not immoral. There is a middle ground. There is a way to target trafficking and protect the livelihood of legit content creators. It begins with fully informed legislation that's written with both performers and victims in the room, and faith-based lobbyists watching from the sidelines.",
    "date": "2023-03-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very insightful documentary that shows the awful side of the big company, while never losing sight of the sex workers that the bad legislation and anti-porn campaigns trying to address it actually harm.\nIn any case: sex work is real work, repeal sesta-fosta!",
    "date": "2023-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very good documenrary. Let's be honest, pornography is immoral and one thing is freedom and another is debauchery. It's good that this content has been restricted in internet The \"supposed victims\", sex workers, have more options. There are many women who have no qualifications and work in factories, in the food industry, many clean floors, but of course, earning money exploiting their bodies and losing their dignity is easier. There is no justification to be a sex worker. That site promoted other crimes. Thanks to the people with common sense who fight against this social evil because that is how it is classified: social evil and this is my opinion although I was never a saint but everything has limits.",
    "date": "2023-03-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Good documental, really this is a good",
    "date": "2023-03-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Super boring. Basically a long drawn out 90 minute explanation that they do not want to put up non consensual or underage videos.  Yawn.",
    "date": "2023-03-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Sex trafficking victim's rights are human rights too — they just don't get the same multi-million dollar campaign of support funded by Pornhub (i.e. Mind Geek)",
    "date": "2023-03-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This documentary was pretty good. The entire crew did a great job on bringing this story about the porn industry to life. It shows you what the porn industry does to people and how evil it can be. People that get into this industry make a choice that they will regret later in life. They will be labeled as sex addicts and so on. If you're a Netflix member, you should this documentary sometime. It'll show you that you should never get into this kind of work.",
    "date": "2023-03-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I really wanted to be able to watch this film but whomever in that editing room thought, \"you know what? How about for every tweet and post that we are going to feature, every split second of the film for the first 20 minutes, we NEED to make the accompanying tweet sound!\" That person should be FIRED because they are the SOLE REASON I HAD TO TURN THIS FILM OFF. I could not take the CONSTANT barrage of tweets going off. Shame on you for making it SO ANNOYING that people need to shut it off for their sanity back.",
    "date": "2023-03-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Um. I don't want to even say anything.",
    "date": "2023-03-18"
  }
]