[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Dumbest storyline and plot I've come across. \nAt the first the action seemed interesting, but its so cheesy and low quality that it can't hide the lack of content. There's no real story or character development. The movie just meanders from one disjointed scene to the next. Even if you skip around you remained bored. There's nothing to hold the viewer's attention.",
    "date": "2024-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is aweful. I hate it. Thank you for making it, I truely believe I will never stop watching it.",
    "date": "2024-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Pensei que fosse ter um plot enorme nesse filme. Porém, é só mais uma dor de barriga que tive que aguentar até o fim. É a mesma dose do seu antecessor: Sem ação, filme monótono e confuso.",
    "date": "2023-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Despite being about snipers this fails to find focus or distance to take a shot at being watchable.",
    "date": "2021-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "If you enjoy action movies, particularly military movies you will enjoy this. It has a good cast; including Chad Michael Collins; (who plays the lead, Brandon Beckett,. In five of the Sniper movies), Billy Zane (he's been in many different things) and Dennis Haysbert. (who I really enjoyed seeing in 24). Many other actors and actresses give a good performance as well. It also has great scenery and good dialogue. A very enjoyable movie to watch.",
    "date": "2021-06-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "There are an estimated 553,742 people in the United States experiencing homelessness on a given night, before the coronavirus pandemic, 35 million experienced hunger in the US, this horrible movie with the estimated Budget of $3,000,000, Could of help lots of people, instead, they flew to Bulgaria 🇧🇬 to waste money.",
    "date": "2021-04-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Ok action, terrible drone CGI, bad explosion CGI, skin crawling tough guy script. A middle schooler could have written it better",
    "date": "2021-04-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it!  Nice international intrigue and good action!",
    "date": "2021-04-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Totally STUPID waste of time.  If you have a high price convoy in enemy territory and you're not using drones to seek out enemy using infrared etc. thereby providing ZERO aid, and then deal with the stupid aftermath after the enemy shoots at will at everyone, GIVE ME A BREAK!!!  And then super-b blonde thinks she's a MAN trying to act tough - again, STUPID INCORPORATED. Spare yourself 1 1/2 hours and watch something else.",
    "date": "2021-04-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Worst action/script I can remember. 10 snipers on target, only one fires and he misses. Heli gun ships fire 20mm gatlin on inflatable boats to no effect, they don't even deflate. If US forces fought like that, Osama would be president of the US by now.",
    "date": "2021-04-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "boring as hell the last was great now it went down hill the only thing selling this show is billy zane and the all state guy just a all around original film just the beginning alone is boring and ive seen it a 100 time in films the sniper doesn't want to take the shot disobeying a direct order wich is understandable considering it's a kid thats the target do these guys not have a heart and also did they ever think about taking out the guy who ordered the kid to kill thats who i would have took out if i was in that position love the blood hate the story so Brandon Beckett is hanging out with his friends after the mission then there is always the one friend who has to give the guy a hard time seen this 100 times in films then on the pier the random lady who just so happens to be at the right place at the right time so the main character wants a piece of ass of course he's going to follow her seeing this film for the first time i already knew that this lady was a main character and then a random sniper happens to know right where his target is going to be then another guy who happens to be on the main characters team just happened to know where the sniper was going to be at the right time how convenient the middle of the film was just shooting and talking nothing important and why is it that one of the bullet shots that should have been bloody wasn't the guy who was going to chop off a guys head was the least bloody shot throughout the whole film why but the rest of the enemies were bloody kills and the guy with the rpg with that guy standing behind him knowing that the sniper was going to shoot why would you keep standing directly behind this guy see tiny details like this irritated me and why is it that this series gets crappy when tom berenger isn't in the film why can't we have another sniper film with both billy zane and Tom berenger again and that ending how original the main guy who gives all the orders retires and ranks up for doing nothing and the main character still gets the girl from the beginning of the film and yep they meet again on a pier wow how original when will this series end hopefully the next one is the last and it better be good.",
    "date": "2020-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Strong movie with good story and muscular action.  One of the best sniper movies I've seen!",
    "date": "2016-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Now that this series has completed its second trilogy, maybe the producers and filmmakers can get back to basics once more. The main actors, music, action and camerawork are fun but it's all brainless. The connections are lazily tacked in and some scenes could've been utilized more efficiently.\n\n\nFor my full review of Sniper: Ghost Shooter (2016), check it out on this IMDB link: http://www.imdb.com/title/tt5090828/reviews-6",
    "date": "2016-09-05"
  }
]