[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Watchable, but not particularly good. I thought the acting was decent, but the story was not very good. The characters were not likeable. It is basically just a movie about how a woman cheats on her husband with a guy who previously cheated on his wife and then somehow they are the heroes you should root for. Not worth it.",
    "date": "2025-06-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is so amazing. Very elegant touching and emotional. Shailene woodley acting is incredible.",
    "date": "2025-04-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was such a good movie! The actors chosen for the roles was perfect, and the two storylines worked so well running parallel to each other. I would highly recommend this movie!",
    "date": "2025-03-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I don't really like romance movies, but this one I found entertaining and engaging. The what ifs of the story were heart breaking. The predictable happy ending was no surprise, but well executed. Felicity Jones was terrific. Really liked this film.",
    "date": "2024-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wonderful experience of love",
    "date": "2024-04-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Terrible casting of Shailene Woodley.  This movie could've been soooo much better if they had casted a good actress that looks at least similar to what's described in the book.  Woodley is pretty terrible as Jenny",
    "date": "2024-04-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I don't know what all these other people saw, but I saw true love in the making and two souls who just couldn't quite reach each other even when it was all their hearts desired, I saw that true love lasts a lifetime even if you are parted for half of it, I guess none of them have experienced real true deep soul love. Thats all I saw and that's what made it magic! \n\nI've seen this in real life, granted not an entire lifetime yet, but two souls madly in love who just can't quite make it. I know it's real and its heartbreaking.",
    "date": "2024-03-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Although promoting infidelity and lying, it's still not a bad movie overall.",
    "date": "2024-02-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was so good, I always watch the preview because it all such a good story. Even though she cheated on her husband that didn't really do anything it was just a loveless marriage and Callum turner is WORTH IT.  Their chemistry and the story was kept me entertained the whole time. i love it",
    "date": "2024-02-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I never lost interest in the plot.  The costumes and scenery were gorgeous.  And I cried at the end.  What more could you want?  It's a love story.",
    "date": "2024-02-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Is no one going to talk about the fact she cheated on her husband who did nothing wrong to her, she just didn't love him! And then she tries to make out he's the bad guy because he hid the letters? She even tried to run away with his child! Her husband was treated horribly, if this was about a husband who cheated on a wife they didn't love, it wouldn't he portrayed in this way. We definitely wouldn't be celebrating their affair and gunning for them to be together!",
    "date": "2023-12-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The story is neither original nor riveting, heavily drawing inspiration from Bridges of Madison County. The rendering of the 60's is rather good, overall. The \"modern\" part is less interesting. The acting is nothing to write home about, especially from Shailene Woodley. There's nothing going on in her face, no emotion. And I didn't really buy into their love story. If you're a fan of romantic movies, like me, you'll be disappointed, but it's not a complete failure either, so... up to you.",
    "date": "2023-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Loved the story and plot",
    "date": "2023-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Romanzo su due linee temporali, poco originale ma senza grandi difetti.\nI protagonisti si fanno tutti apprezzare ma la mancanza di suspense rende piuttosto piatto lo svolgimento.\nLa regia ad immagini ovattate della linea temporale più \"vecchia\" appesantisce senza motivo le sequenze ed invecchia ulteriormente l'insieme.\nIl finale con la ripetizione dell'addio tragico cerca di sorprendere ulteriormente lo spettatore ma il modo in cui i due protagonisti si incontrano nuovamente è grottesco e lascia parecchia insoddisfazione per le evidenti forzature che porta con sè.\nIl finale poi, non aggiunge nulla al film.",
    "date": "2023-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Totally Fabulous. A captivating and mesmerising love story with heart-wrenching tragedies and uplifting triumphs, this film is a must-see.",
    "date": "2023-07-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Although I was invested in the love affair, long separations are not my favourite and here we have not one, but two 🙄 Add the fact that the chemistry between both couples was seriously lacking, I was left very disappointed. How Rotten Tomatoes can rate this as high as they did and a film like Love Again, so low, just shows how misleading critical reviews can be!",
    "date": "2023-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Beautiful, so well-paced. Great performances. Heartbreaking.",
    "date": "2023-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The main historical romance was intriguing and beautiful, but the modern romance woven in felt rushed and contrived. Could've done without that and just the ONE love story. Heartbreaking miscommunication and missed timing that could really only happen in bygone times. I thought I'd leave the movie feeling \"meh\" but I DID cry at the end, which surprised me. It's a nice watch if you want something you know will be bittersweet satisfaction, but are ok with the writing not really pulling it all together.",
    "date": "2023-06-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A truly remarkable love story which manages to tug at your heartstrings without overt drama, but with breathtaking style and extraordinary attention to detail.  Shailene Woodley is stunning in her portrayal of a glamorous 60's politician's wife.  She possibly surpasses Elizabeth Taylor for raven haired ravishing ethereal beauty.  She manages to convey with her face and body what few actresses can pull off.  I felt what she felt.",
    "date": "2023-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I don't really like romance movies, but this one I found entertaining and engaging. The what ifs of the story were heart breaking. The predictable happy ending was no surprise, but well executed. Felicity Jones was terrific. Really liked this film.",
    "date": "2023-02-03"
  }
]