[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Yikes! The PG-13 one was better!",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Watched the first two Hellboy films and they made great family entertainment, sadly this cannot be said about the third film. The vulgar language, music tracks and bad choice of actors ruined this film completely, not to mention the actual storyline (if you can call it that) which did not make sense in the slightest as his father has died twice now. Bring the old cast back please.",
    "date": "2025-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's apparently that most of the \"critics\" have never read a Hellboy comic, before attempting to critique a Hellboy movie. They think the original trilogy was better, because it was flashier. This movie felt FAR more like the comics, than the originals. Harbour did a fantastic job in his portrayal of the character, and his disheveled look is much more like the original character depiction. That said.... Where the movie struggles, is the plots. Not that they're bad. But, there are just TOO MANY going on at once. They could have picked 1 arc (or even 2 shorter ones) and made a fantastic movie out of it. This is a classic example of biting off more than you can chew, and not knowing your limitations. Overall, I definitely recommend watching it at least once, if you're a fan of the character. Because, if nothing else, it does him justice.",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Neil Marshall would initially seem like the right guy to adapt Hellboy but he clearly isn't all that invested in the character (he definitely likes the specifically English mythology). Additionally Harbour is totally wrong for the part, really makes you miss Perlman who was perfect.",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This Hellboy movie is not that good. I like the original better.",
    "date": "2025-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "(CASTELLANO) Es frustrante ver cómo una franquicia con tanto potencial, con una mitología tan rica y un personaje tan carismático como Hellboy, acaba convertida en un batiburrillo sin alma. Esta versión de 2019 intenta ir por libre, desmarcarse de Del Toro y su estilo, pero en lugar de encontrar su propia voz, se pierde en un laberinto de sangre, ruido y decisiones mal tomadas.\n\nDesde el principio da la sensación de que nadie sabe muy bien qué película está haciendo. El guion es un lío: aparecen personajes sin apenas presentación, las subtramas entran y salen sin peso, y lo peor es que todo avanza a trompicones, como si alguien hubiera mezclado varias ideas en la batidora y pulsado \"turbo\". Hay escenas que podrían tener fuerza, pero la falta de dirección clara y un montaje atropellado las deja en tierra de nadie.\n\nDavid Harbour hace lo que puede, y en ocasiones logra transmitir algo de ese Hellboy cansado del mundo, pero atrapado en un guion que no le da respiro ni profundidad. La película cambia de tono constantemente: pasa del gore gratuito al chiste adolescente y luego al drama familiar sin que nada encaje de verdad. La sensación general es la de estar viendo un tráiler largo de algo que no termina de arrancar.\n\nVisualmente no está mal del todo: hay criaturas interesantes, algún diseño destacable, y la película no escatima en efectos. Pero eso no basta si no sabes por qué están ahí, qué pintan en la historia o a dónde llevan. Todo resulta superficial, como si se hubieran centrado más en hacer que \"pasen cosas\" que en contar algo con sentido.\n\nEn definitiva, un intento fallido de reinicio que no entiende al personaje ni su mundo. No es que no funcione porque sea diferente, sino porque está mal pensada desde la base. Y lo más triste es que, incluso siendo un desastre, por el simple hecho de ser Hellboy, uno intenta buscarle algo rescatable… aunque cueste mucho encontrarlo.\n\n(ENGLISH) It’s frustrating to watch a franchise with so much potential, rich mythology, and a charismatic main character like Hellboy turn into such a soulless mess. This 2019 version tries to step away from Del Toro’s legacy, but instead of finding its own voice, it gets lost in a whirlwind of blood, noise, and poor decisions.\n\nFrom the start, it feels like no one really knew what kind of movie they were making. The script is a disaster: characters show up with zero introduction, subplots come and go without weight, and everything stumbles forward as if several drafts were thrown in a blender and set to max speed. Some scenes could have worked, but the lack of clear direction and chaotic editing ruin any momentum.\n\nDavid Harbour does what he can and occasionally captures that world-weary Hellboy vibe, but the script gives him no room to breathe. The tone shifts constantly—from gratuitous gore to teenage jokes to forced family drama—without anything clicking into place. It feels like watching an extended trailer for something that never really starts.\n\nVisually, it has its moments. Some creature designs are cool, and it certainly doesn’t hold back on effects. But that’s meaningless if you don’t know why they’re there or what role they play. Everything feels shallow, like they focused more on making things “happen” than telling a coherent story.\n\nIn the end, it’s a failed reboot that neither understands the character nor his world. It’s not bad because it’s different—it’s bad because it’s poorly built from the ground up. And the saddest part? Even in the middle of this wreck, you still try to find something redeemable… just because it’s Hellboy.",
    "date": "2025-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Really Bad. The dialouge is just jokes, puns, and the other half is plot expose dumps constantly every five minutes. The villian is really bad and belongs in a bad Harry Potter or Dracula Movie. Not a comic book movie taking place in the real world. Hellboy is alright at best and annoying at worst. The makeup isn't as well done as Pearlman's and he comes off sometimes as a whiny moody emo teen. God Lizz and Abe are sooo missed from the GDT ones. The new ones are so generic and forgettable. The cinematoography is so dark half the time you can barely see it, terrible CGI that's somehow even worse than the 2004 one at its worst, uninspired direction, and half the time it doens't even look like it belongs to the same movie. This looks like half the time it was asetically ripped out of Van Helsing or Sleepy Hollow. It doesn't match at all and than it's filled with dumb scenes as well and boring ones. The music is a mix of generic cinematic stuff and rock/metal that doesn't work together at all and clashes with the dark fantasy asetics. The editing isn't good and pacing is terrible. The major strikes on top of this is the terible special effects especially the CGI and just a stupid dumb plot that walks a fine line between almost being incoherent in the second half. It's so stupid. Again it feels like and looks like two seperate movies. A comic book action flick and a dark midevil fantasy which never works at all. It's truly amazing how everything and I mean EVERYTHING here is a step down. Even the humor which got a chuckle maybe twice lacks any charm. And the makeup is a big step down. Skip This and stick with the 00's duology. God this was horrible and really shows how much of an accomplishment the 00's ones were even though they had some flaws.",
    "date": "2025-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Meg meh meh meh meh meh",
    "date": "2025-06-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Funny action packed gore fest. What's not to like?",
    "date": "2025-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love this movie!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $21,900,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Filmed in 2019 in color!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Celebrating 10 years on: April 12th, 2019!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-05-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Oh my god  what  was this tripe, the story was over complicated and just didnt work, i battled though to the end    but oh my  bring back  Ron\nand a decent story",
    "date": "2025-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "When it's just Ian McShane and David Harbour its perfectly figured ne, vut thats like fove percent of the movie. Everything else is hot garbage",
    "date": "2025-05-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The story was convoluted, and the visuals fell flat at times, but I had so much fun watching this movie. There were so many times when I was dying laughing because of how fun it was. Don't watch this movie if you want to see a good movie, watch it just to have fun. I definitely recommend it for superhero and horror fans.",
    "date": "2025-03-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Just not a good film. None of the humor or one-liners land, the sound design is awful, and there's some really poor CGI in the back half that just really pulls you out of it. Mostly it is just tedious and boring. You couldn't pay me to see it again.",
    "date": "2025-02-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Honestly my favourite hellboy movie. Its fast paced, has tonnes of action, great fight scenes, and an interesting collective of characters. And unlike the original films, which I still love, isn't bogged down by romance plot lines. I go to my action movies to see violence and gore.\n\nThe two main downsides I had were Alice's accent sounded really unnatural, it's distracting. And the movie did feel bloated, despite the pace, a LOT happens in this movie, and most of it is exposition, which usually happens when a series expects a franchise. I do think the story could have been reined in a bit!",
    "date": "2025-01-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I liked it. Pacing was good. Could have used a bit more back story but it worked.  Visually awesome. I haven't read any of the comics but the script and acting and effects seem solid to me. Deserved a much better rating.",
    "date": "2025-01-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Good, on par with the original. Harbour makes a good Hellboy and the rest of the cast is pretty good. I enjoyed Hellboy not being a depressed, lovesick puppy. The plot is true to how comic plots were written (things just happen and they don't always seem connected until the final battle). This doesn't translate the best to film and the final act seems a bit rushed but the original had the exact same issues. Overall this is a good film with gory additions.",
    "date": "2025-01-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Errm, what's with all the hate for this? It's maybe not as endearing as the excellent original Hellboy or the immediate Golden Army sequel but it's still very enjoyable and the additional gore was a welcome switch up in my book. It's not as tonally consistent and is much gorier but then it is an 'R' and was clearly advertised as one so what's the problem everyone? I personally enjoyed this and found it truer to the dark source material. It's well worth a watch and in the absence of Pearlman, Harbour made a good Red. Much better than its made out to be.",
    "date": "2025-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Holly sh*t,  this is incredible",
    "date": "2024-12-28"
  }
]