[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I love this film. I loved all of the types of action, I loved how the world of John Wick was expanded, and I love how it ended on some many possibilities for the future of this film series",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A great sequel with fantastic action scenes.",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Not only is the plot of this film phenomenal, it does a wonderful job expanding upon and answering all of our unanswered questions about the world of John Wick 1. Some would argue that this film is even better than the first. I'm not one of those people, because I prefer the laser-focused narrative of the original; however, I wouldn't say that this film is any worse. It is a master-class in action filmmaking!",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "No segundo capítulo da saga \"John Wick\" (2014-2025), a franquia começa a nos apresentar algo que veio a se tornar um de seus melhores aspectos: a energia de histórias em quadrinhos (mais especificamente, graphic novel) do seu universo. Todo o submundo existente dentro da saga — suas estrutura e regras sociais, sua cultura, seus personagens, sua história — me parece algo que eu veria em graphic novel adultas, como Watchmen, Constantine, V de Vingança ou Estrada para a Perdição. Esse é o trabalho de uma sequência: expandir e aprofundar a mitologia do universo do filme anterior. E \"John Wick: Um Novo Dia para Matar\" faz isso com excelência, além de entregar mais um espetáculo de ação e violência.",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I was really disappointed with this one after thoroughly enjoying the first. I found the plot vague and almost incidental to the action. There was nothing to develop any of the characters, and nothing to make me hate the baddies. In fact the only character I warmed to was the dog.",
    "date": "2025-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Usually a sequel is not as good as the original but in the case of John wick this movie is fantastic and is better then the first one",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Easily the weakest movie of the series for me not because it does anything wrong per say but because it simply isnt as good as the others and i think the way the story is written kinda comes off poorly. Not sure how to explain it but the movie sorta insists upon itself. Still good tho but has the least rewatch ability",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Great follow up to the first Wick film, and spoiler, the dog lives.",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "“I can assure you, that the stories you hear about this man, if nothing else, have been watered down”\n\nThis is timeless action. It’s never not going to be good.\n\nIt’s crazy to think that out of the 4 John Wicks, this could be the lowest.. but don’t get it twisted.. this is a damn good movie. \n\nThis was the bridge that allowed the rest of the franchise to be built. Instead of a sub par sequel, we get a glimpse of just how big the John Wick universe is. \n\nLayer after layer, from the continental codes of conduct to the high table being established. \n\nThis is the movie where JW realizes, to get out he might just have to kill everyone.",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Some of the most beautiful action you will ever see, it does take a bit for the movie to get going but when it does it's phenomenal, and you get to see someone kill people with a pencil.",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Filme mais ou menos, o roteiro é fraco, as cenas são mais ou menos, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom,  e as cenas de ação salvaram o filme.",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "(Masterpiece) all that needs to be said.",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Greetings from Lithuania.\n\nWhile i don't think that \"John Wick: Chapter 2\" (2017) is a better movie then a first part, here i'm talking about one of the better action films in recent years. I really enjoyed Chapter 2, it has everything a super action film should have - clear and descent plot, solid acting, superb directing and action scenes that do deliver. Sure \"John Wick\" plays more like a cartoon or a comic book if you start to think about reality of the movie - this is a fairy tale, but its a damn good one. \n\nAction scenes were superb, as good as in a first one. This film expands the universe of this \"assassins\" underworld and it does this well by not over exploring it. Also this movie was superbly paced - at running time 2 hours i wasn't bored for a second and highly enjoyed this action flick.\n\nOverall, while \"John Wick: Chapter 2\" doesn't achieve the greatness of \"The Raid 2: Berandal\" to deliver action film that leaves you exhilarated by the end, this is non less a very good action film for those who liked the first part and love good old \"shoot em up\" movies in general.",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This is an okay film, but since keanu reeves doest talk much and is just action and action heavy. Not allot time spend on story development it makes this film forgettable at best. Overall, not my favorite but it aint that bad just boring.",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's hard for me to rank the John Wick movies. I love the first one, I love the 4th one but I absolutely adore the 2nd one. For me this is what made John Wick over the top and set the pace for the whole universe. Everyone is an assassin...",
    "date": "2025-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "John Wick Chapter 2 was a great sequel to the first film!",
    "date": "2025-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This movie really is one of the best action movie sequel of all time. The writers really did well with a new story. It's not like the first movie. It's better.",
    "date": "2025-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very strong series, the amount of enthusiasm is unnatural.",
    "date": "2025-07-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Just bad. Trying to overcomplicate a simple story to lengthen the series.",
    "date": "2025-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I don't think this is quite as good as the first one mainly due to the lack of story expansion, but it definitely doubles down on the hardcore action and there's lots of it. Very good sequel nonetheless. 9/10",
    "date": "2025-06-25"
  }
]