[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I could not get past the first 5 minutes. Seinfeld again does not seem to understand that he is not funny anymore.",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Unfrosted is star stacked, is extremely silly, and definitely what we needed as a break from all the nonsense and sadness of our world. Also dances around as a political satire, comments on popular TV shows and events. Really loved Snap, Crackle, and Pop!",
    "date": "2025-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Some funny bits, kinda flat though.",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Unfrosted is a hilarious, extremely entertaining biography with a great cast, funny moments and makes you want a Pop Tart while watching it.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I don't think it's as bad as everyone says it is, but it definitely has it's flaws and it's no where near perfect",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A fun movie,  silly,  strange,  goofy.  I bet the actors and writers had too much fun while making this movie.  Probably would be more fun if I were a pot head.",
    "date": "2025-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I don’t know what people are talking about. This movie is hilarious. It doesn’t take itself seriously which makes it a random yet funny movie",
    "date": "2025-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Script a disaster, not funny very slow moving boring movie.",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie was sucked",
    "date": "2025-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I liked this movie even more than I thought I would from the trailer. What you can't tell from the trailer is that this is basically a live-action cartoon. Once you're in that mind-set you can ride along with all the wacky stuff.",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Not an avid movie-goer, nor a sophisticated reviewer, but a good friend recommended it, and it revealed that our humor threshold is VERY different. \nNot my style of humor. This movie is what \"Barbie\" would be if  Wes Anderson had made it.",
    "date": "2025-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I was sooo excited for this (and it could skewed my review) but I struggled to watch this. The story line, the characters and many of the jokes fell flat. \n\nThe very best cast, of which I have loved countless of their other movies or shows, but I just didn't get into this one.",
    "date": "2025-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved this movie it was so funny it's like a modern day Dumb and Dumber or Earnest goes to Camp",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie sucks just like Seinfeld’s standup",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "As a average movie viewer, I don't take humor seriously, I enjoyed the movie and laughed throughout, loved the casting they each brought their own energy.",
    "date": "2025-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Love this movie! I’ve seen it multiple times now, and it never fails to give me some giggles.\nThe humor is dry and subtle, but that’s what really makes it so funny",
    "date": "2025-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Ugh. Tried watching this w/ my father. The guest stars kept us watching but we couldn't finish it. Your days of being funny are behind you, Jerry.",
    "date": "2025-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It's just not funny.  The 60s nostalgia theme is fine; the appearance is nice.  The endless cameos and supporting cast is exceptional; it was great seeing some of those people again.  But the jokes just don't land.  Amy Schumer was as good as she's ever going to be in a film, but the comedic tone was in trouble from the start, given that she was a good casting choice for what they were going for.  \n\nHow could Jerry Seinfeld's comedic sensibilities shift so far from being funny?  For someone's sense of humor this had to be hilarious, but even as a middle-aged dad who finds things funny because they're not funny it all didn't work.",
    "date": "2025-05-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Jim Gaffigan is great in this. There are a couple of good gags. Not my first pick when I am looking for something to watch though.",
    "date": "2025-05-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Ever since the (hilarious) show Seinfeld, Jerry Seinfeld has been on a mission to tell us that we are too emotional. That we're all too serious by packing all those feelings and meanings into our work. And, while many comedians can lament on the challenges of their life, Jerry cuts corners and tells us his own life was mostly run-of-the-mill. While nobody can say that Jerry isn't pure class, it always feels a step too far to hear him constantly refuse to yield to the impact of emotions in our lives. \n\nJerry doubles down on the notion that our feelings are invalid by promoting the theory that there's some sort of comedy \"gene\" in many of his interviews. It's not the trauma and suffering that plays a big role in molding someone's sense of humor, it's some sort of gene that you're either born with or you're not. A very dangerous notion, especially in an age where there's a very real chance that humanity is falling backwards into barbarianism.\n\n\"Unfrosted\" is just that. Not sweet. Uninspiring. Bland. Like the cereal your parents made you eat to keep you healthy, but did a bad job selling the idea to you. Jerry Seinfeld just wants to make a movie. Like a stoic who just wants to design greeting cards. \n\nAll the cameos in the world can't save this movie from it's deliberate irrelevance. \"It's just a movie\", I can hear Seinfeld saying.",
    "date": "2025-05-07"
  }
]