[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "5 mães solteiras participam de uma reunião com a direção do colégio onde seus filhos estudam, devido a um incidente envolvendo eles. Para que eles não percam a bolsa de estudos, elas são obrigadas a organizar uma festa beneficente para arrecadar fundos. Nas reuniões que fazem, elas começam a discutir os seus problemas como mães solteiras e acabam criando uma forte amizade e uma rede de apoio. Tyler Perry é mais conhecido pela sua personagem mais famosa, a Madea. Ainda bem que este não é um filme com ela, pois o humor de baixo nível da personagem estragaria até o bom resultado do filme. Porém, como todo filme de Perry, vai haver piadas sobres sexo e duplo sentido, péssimos atores (Zulay Henao e uma porta tem a mesma expressividade, além do elenco masculino. Tirando, é claro, o Terry Crews fazendo Terry Crews), um roteiro mal construído, que corre para resolver os problemas das suas personagens. Enquanto as tramas envolvendo as personagens de Nia Long, Cocoa Brown e Wendi McLendon-Covey tem algum desenvolvimento e profundidade, as de Amy Smart e Zulay Henao não chegam nem perto do que as integrantes do Clube passam. Por fim, em relação aos trabalhos de Tyler Perry, até que é um bom trabalho, mas levando em conta o todo, é um filme regular que não se aprofunda em muitos temas que quer abraçar, ficando muito na superfície.",
    "date": "2025-05-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Bad acting, not funny, at times very corny. Didn’t enjoy for very long had to change it to a different show.",
    "date": "2025-01-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I dont care what anybody say I Loved this movie. I dont get why people are hating it",
    "date": "2025-01-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "For a film that is supposed to show the real struggles of single moms, this go out of this way to make sure all of them have a good men at their feet at all times. I don't really see this as realistic. If felt more like they were taking advantage of the men, by - literally - asking them to do work for them, than being overstressed and overloaded. \nI mean, the mom who did not have time for the eldest daughter because she was occupied \"trying to please her husband\", well I understand she was overload when she had to let go of her maid, but before that she \"didn't knew\" her daughter because she didn't wanted to. She feels disconnected and weird and it is not explained why. \nAll the struggles don't feel like real struggles - even the crack addicted dad plot line, which is a real problem - feels just flat. \nAnd it is not clear how the poor mom put her kid in the private school and all the other seem kind of rich which again minimized some of the struggles. Just so many weird choices with the plot. \nI actually like the actors and actresses mostly but the writing did them dirty, it is all to bad.",
    "date": "2024-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The dynamics among the women and of them with their children stood out from a conventional movie with a non-spoiler happy end for everyone.",
    "date": "2024-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie was so bad. The writing is bad the characters are terrible and the acting is worse. Would not recommend this movie to my worst enemy. The only reason I gave it half a star is because I couldn't give it zero stars.",
    "date": "2024-01-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Didn't really expose the challenges and was boring too.",
    "date": "2024-01-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Never enough humor and original characters because they are the best of Tyler Perry!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2022-04-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The movie had a good story line and a good sense of humour throughout. Thoroughly enjoyed watching it and all the actors and actress's performances were really well played. Loved the fact that woman were the more powerful ones and had the lead roles in the film. \n\nWould watch again.",
    "date": "2021-12-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This is my first experience with a Tyler Perry film, and I have to say that it was worse than I expected. I didn’t think it was going to be a great work of cinema, but I at least thought there would be some fun moments with a lot of heart. Sadly, there was almost nothing fun about it, with the exception of some comedy delivered by Cocoa Brown. She actually has some solid line delivery that creates humor from unfunny lines. Aside from her, even the outtakes during the credits weren’t good for a laugh. The film has too many main characters, so none of these women get to take center stage for long enough. They all have their own stories, and their own issues with their kids, but we can’t spend time to develop those plotlines because there’s always another one coming. The whole thing feels slapped together on the fly, as if no one cared about thinking through what makes a good story. Case in point, the sloppy plot device that forces the Moms to come together is ludicrous. The Single Moms Club is something they actually form in the film, after being told by their kids’ teacher they have to work together, and it lasts for a few scenes at most. Then moments later we’re supposed to be all upset that this quintet, which was hastily thrown together, has fallen apart. Perhaps the most embarrassing aspect of the film is that it spends a decent amount of time trying to empower these women, so they can run a household on their own. Then the movie spends the rest of the time making sure they all have a new man because their lives apparently weren’t complete without one after all. It’s amazing how dated this feels, and how out-of-touch Tyler Perry must be to think it’s the right trajectory for this story. The writing as a whole is terrible, almost all of the comedy falls flat, the kids don’t act like real kids, and the “heartfelt” resolutions at the end all feel hollow. On the whole, The Single Moms Club is roughly on par with a Hallmark Channel movie.",
    "date": "2020-02-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "SO cheesy and SO ridiculous. But somehow...still kind of fulfilling. Like ready a cheap fantasy paperback.",
    "date": "2016-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is just the worst film EVER.",
    "date": "2016-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "once again Tyler Perry proves he's only out for himself making these millennial blaxportation movies. Thanks for keeping the black stereotype alive.",
    "date": "2016-02-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A realistic story of a single mom trying to keep her life together.",
    "date": "2015-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It's charming in a humorous way yet doesn't seem as entertaining by the end.",
    "date": "2015-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is a decent cast and could actually have been a watchable movie with a better, less cliche storyline and a director who understood the importance of pacing. As it is, it's just too hard to watch. I made it through a half hour before turning it off...life's too short. I love the Madea movies (some of the storylines are crap but Madea is hilarious). Lesson learned: for me, a Tyler Perry movie needs Madea.",
    "date": "2015-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "it was a bit cheesy at times. \nI was wondering who was looking after the kids and doing their job when they were meeting up for drinks in the afternoons... perhaps it was over the weekends mostly?\nI was confused with Hilary, has a second child and acted like she just ended up babysitting it? like... it is your second baby, you have done this before.\nAnyway some parts were a bit too much, funny at one point and then suddenly sad at another and also at some bits eye-roll worthy.\nIt seems to be a a film about empowering women yet in the end, they are happy as they got their men (lady, however successful/happy you are, it is nothing if you don't have have a man by your side). \nAll in all, if there is nothing else on tv, not even some cartoonst hat you might watch, might as well watch it.\nP.S. Nia Long was good.",
    "date": "2015-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I very much enjoyed this movie. Loved the story lines , characters and their dynamics. One of my favorite Tyler Perry movies.",
    "date": "2015-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I enjoyed this very much. I feel it just scratched the surface of what single families face. Having friends to lean on or just to talk to works wonders. The support group idea was excellant.",
    "date": "2015-05-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The theme of this film is all over the place. At first glance it looks like a film about single moms finding empowerment by one stereotype learning from the other, overcoming misunderstandings along the way. But by the end of the film they all have boyfriends of their own who have all in their own stereotypical way helped the leading ladies find completeness in their lives.\n\nThere are a few laughs to be had along the way; but ultimately, like the  characters, the film just feels like it's missing any real substance.",
    "date": "2015-04-11"
  }
]