[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Perfectly made for a Christmas watch but, to be honest, I would rather they took these back to the short version rather than feature lengths.  The shorter films somehow seem just a bit more special and leaves you wanting more.  However, quodos to the man voicing Wallace, he really does bring back life the wonderful Peter Sallis.",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I went into this movie expecting honestly something just okay, but nothing to write home about. WOW am I glad I was wrong, they knocked it out of the park with this, and it's definitely the most cinematic Wallace and gromit project, and the emotion definitely hit home, definitely way better than I expected",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Wallace & Gromit: Vengeance Most Fowl is a direct sequel to The Wrong Trousers, which is a 1993 Wallace & Gromit short film. Like in that short film, in this one, we have a main antagonist that is truly iconic. Wallace invents an AI gnome that is basically going to ruin their world as they know it, and only Gromit see it as a problem.",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is amazing, full of funny jokes, humor, story, good villain... the only problem is that it ends!",
    "date": "2025-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Wallace inventing a garden gnome to do yard work is hilarious and ironic among many other quirky jokes. When the locked up “chicken” reprograms Norbot to be evil, it’s up to Gromit to save the neighborhood in this horror movie for children.",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Cracking film, Gromit!\nThis is such a nostalgic comeback to the franchise. I saw it on its premiere on BBC One, on Christmas Day 2024.\nThe story is brilliant, Ben Whitehead is great as Wallace, Peter Kay returns as PC Macintosh and is hilarious as always, and Feathers McGraw returns which makes it even more interesting.",
    "date": "2025-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "100% on Rotten Tomatoes! That's either an example of how good this movie is, or how broken rotten Tomatoes is.",
    "date": "2025-09-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Muito bom nota 9.0 pra mim e muito bom mesmo kkkkkkk e muito engraçado kkkkk",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It has all the lovely charm of Wallace & Gromit movies. The claymation is always fantastic and while it's a simple story it remains fun. I'm not the target demographic for these anymore so I didn't love it like I loved the movies when I was a kid but I still enjoyed it.",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie I waited so long for more Wallace and Gromit and this movie makes me want to see more.",
    "date": "2025-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Haber está película realmente está entre si y entre no pero con su encanto y anatomía la película es buena",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "What a fun & cute time with all the wacky, ridiculous antics this franchise is built on. The claymation is vibrant & creative with a great use of lighting. Full of quick witted humor that flows so well. The story is awesome with exciting plot points, unpredictable moments, & touching emotion. I wish the tone is more consistent with satire but it ultimately breaks into its own thing which is a great success.",
    "date": "2025-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Wonderful sequel to the original with a just as iconic villain",
    "date": "2025-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is easily the greatest Wallace And Gromit. It's Oscar worthy and deserved a theatrical release.",
    "date": "2025-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Cracking toast!!!!!!",
    "date": "2025-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Muito bom! Filme cheio de reviravoltas, humor e ação, amei!",
    "date": "2025-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "\"I can live without inventing, but I can't live without... me best pal!\"\n\nA delightful comeback.\n\nWallace & Gromit: Vengeance Most Fowl was an absolute joy to watch from beginning to end. I loved seeing these two characters back in action after so many years, bringing back wonderful memories of their earlier adventures. The use of stop-motion remains visually stunning, full of charm and meticulous detail, reminding us why this technique is still so special. The film is thoroughly entertaining, with genuinely funny moments, but also offers a powerful reflection on current issues that adds depth to the story. A perfect mix of humor, nostalgia, and thoughtful commentary, and I highly recommend it.",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wallace and Gromit The Curse of The Were Rabbit was one of my favorite films of all time, and I thought Nick Park would never be able to outdo himself. \nYet he did.\nComing 19 years later, as a sequel to his short film The Wrong Trousers, Vengeance Most Fowl is definitely one of my favorite animated films since...who knows when.\nWallace and Gromit are the dynamic duo that really make these films stick together. But over here, their relationship is being threatened, due to technology. Soon all of Wallace's inventions have to be taken away, making the inventor very sad, and he has even forgotten how to open teapots.\nYes, they came up with yet another great plot with lots of heart and humor for Wallace and Gromit, and I am all for it. The music, stop motion animation (besides the great CGI water effects), and characters made this film one of my top ten movies I've ever seen. I liked that there were both a silent protagonist and silent antagonist. The best of both worlds!\nAfter a disastrous attempt at a Chicken Run sequel a year before (may it never be mentioned again), Aardman is back, better than ever before!\nAnd the Norbot song was very funny, by the way.",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best sequel of all time! I love how they brought back feathers!!",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wallace and Grommit 2 was unsurprisingly a masterpiece! The stop motion is once again, PERFECT! And for some reason Wallace and Grommit makes me happy and out of all of the duo cartoon characters that exist, Wallace and Grommit are The goats! And the villain was pretty good!",
    "date": "2025-07-13"
  }
]