[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The movie is entirely predictable and unbelievable but most action thrillers are nowadays anyways. It is easy to watch - without making a whole show of it. \n\nSomething really wholesome about characters being unique individuals outside of their gender/skin color and to see that in a Netflix movie with a strong cast is impressive. \n\nA part 2 should surely do the premise more justice! \n\nP.S. I have seen action stunts that look far far more improbable in the mission impossible series- at least everyone engaging in action sequences here looked fit enough to carry them out!",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Not impressed at all",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Its actually quite impressive. The skill required to take a very strong cast and yet produce such trash should not be underestimated.",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Don't be fooled by the low rating of this movie.\nIs it implausible? Yes.\nIs it predictable? Yes.\nIs it a whole lot of action and romance and fun? Oh hell yes!\nYes, I can understand how others may rate this with a low score if they are simply looking at it as a polished work of art, which it isn't. But if you can get past its flaws and grrl power memes you will find yourself amused at its premise.\nI was impressed with the chase scenes.",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Bon c’est du déjà vu, mais l’action est sympa. Ça occupe pour un trajet en train.",
    "date": "2025-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I will admit I'm not a big Halle Berry fan. None-the-less, this movie is pretty bad even for her limited talent. Mark Wahlberg on the other hand, I do enjoy his acting. But hopefully he is embarrassed by this awful movie. You can safely skip this one.",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I only chose to watch this movie because I am a Mark Wallberg fan. I couldn’t get past the lame plot and Hit and Run Halle Berry with her Karen haircut pathetic performance!",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The Union surprised me as a fun watch. The cast has good chemistry, there are some funny moments, and even though the story is predictable and runs a bit long, it’s still entertaining. A solid choice if you just want something light and easy to watch.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Bad. Really bad! Someone has more money than brains.",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A truly awful film and a waste of a talented cast. The plot must have been written by AI. It had every cliched plot point you could imagine; the ordinary man becoming a hero; spy stuff; the beautiful ex-girlfriend; action; a foreign location. It wasn't even funny, just grim.i gritted my teal and slogged through it. I'd like to say that there were some interesting plot points that could have been done better it expanded upon, but that wasn't the case. I appreciate that companies such as Netflix need content to keep their subscribers happy, but the quality needs to be much better, even if it takes longer to produce.",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's a great comedy with great action.  Halle Berry & Mark Wahlberg are great together.",
    "date": "2025-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie has full of dialogues. Such a waste of time.",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I don’t understand all the poor reviews.  Admittedly I like Mark Wahlberg and Halle Berry.  There was plenty of action, a typical spy type plot, and on screen chemistry.  For me great fun, I was hoping for a sequel",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I found The Union entertaining enough, but the premise is just silly. Take a regular guy and train him to be an international spy/Seal Team 6 type of operative in two weeks?",
    "date": "2025-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I love Mark Wahlberg so, for me he was the only reason I wasted my time with this worthless movie. Halle Berry absolutely made me cringe, roll my eyes, gave me a headache and I had to verify that she was only awarded one Razzie. From this performance, she deserves dozens! She is physically awkward, can't deliver a believable line and has zero charisma. Even though everyone else was only passable, she completely ruined the movie! I've seen much better acting in junior high school plays.",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Funny and fresh. A great movie to watch",
    "date": "2025-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Cringey, cliche and lazy slop. \n\nI’m convinced they typed “generic spy comedy script” into an AI prompt, spent a bunch of money on the cast, and called it a day.",
    "date": "2025-06-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "La típica película de espías que nos vienen entregando los streamings hace años, en este caso con Mark Wahlberg y Halle Berry como pareja protagónica. Giros, persecuciones, traiciones, peleas, tiros, chistes, mas tiros.. todo lo que uno esperaba ver al ponerse a verla esta presente, entretenimiento pochoclero puro y duro.",
    "date": "2025-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Failure in 1 hour and 46 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Just a fun heist movie, with a lot of enjoyable action scenes in nice and likable locations. Not more, and not less. There is no depth or development of the characters, but who cares? I got what I wanted and expected: just a two hour joy ride. Very positive: Despite the many killings, there is no real graphic violence, just little blood, and very little foul language.",
    "date": "2025-05-26"
  }
]