[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Don’t waste 2 hours of your life watching this film…it was extremely hard work.",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "everything unfolds for a reason\n\nI first watched Look Both Ways back in 2023, and recently rewatched it 2025  and wow, it still hits deep. I watched it again mostly because of David Corenswet. He looked so different then—not the bulky Superman we know now—but he had that same quiet charm that draws you in. The story is simple but powerful. It beautifully shows how no matter which path life takes you, everything unfolds for a reason. It reminded me that life may not go exactly as planned, but in the end, things work out. Every version of life has meaning. Faith is faith. If you need comfort, clarity, or just a little hope—this movie is exactly that. Highly recommend giving it a watch (or rewatch). 🌿",
    "date": "2025-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Relatable!! This hit deep!! Must see 🤩",
    "date": "2025-04-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I really loved the movie and thought it was super sweet 😍",
    "date": "2025-03-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love this movie. I cried a bit. It’s so well thought out and the small details they place in the right places throughout the movie. It’s great. I feel it really captures the meaning of “ if it’s meant for you it will happen eventually” which I love as different steps in her life occur.",
    "date": "2025-02-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A Charming Exploration of \"What If...?\" (Spoiler-Free)\nLook Both Ways takes a simple yet delightful premise and spins it into a heartwarming journey of self-discovery. Lili Reinhart shines as Natalie, a college grad facing a life-altering choice. The film then cleverly splits into two paths, letting us see how her life unfolds depending on that single decision. Here's what makes Look Both Ways a pleasant watch:\n•\tRelatable Heroine: Lili Reinhart brings a genuine charm to Natalie, making her struggles and triumphs feel real.\n•\tDual-Narrative Twist: The concept of exploring two alternate realities is engaging, allowing us to ponder the possibilities within our own lives.\n•\tUplifting Message: Look Both Ways ultimately celebrates the journey, emphasizing how happiness can be found regardless of the path we choose.\nHowever, Look Both Ways might not be for everyone due to these reasons:\n•\tLighter on Plot: The focus is more on character growth and emotional exploration than intricate storylines.\n•\tFamiliar Territory: The \"sliding doors\" concept has been explored before, so the narrative might feel predictable for some.\n•\tLimited Depth: While the film is heartwarming, it doesn't delve too deeply into complex emotional territories.\nLook Both Ways is a charming and heartwarming film, perfect for a feel-good night in. It might not be a groundbreaking cinematic experience, but it offers a relatable protagonist, a clever narrative twist, and a positive message. For a light and optimistic exploration of life's choices, Look Both Ways earns a delightful 3 out of 5 stars.\nYou DO need to pay attention!  I think it’s worth the time investment.  \n\n-Matthew",
    "date": "2024-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Well this was a plot that I haven’t seen before or at least from what I can remember. If you’re going through a hard time or maybe you’re not liking the hand you’ve been dealt right now then I think this may be a movie for you. It has its highs and lows throughout the movie but in the end just shows that every story can turn itself around with a little grit and perseverance. You can still achieve your goals even if it takes a little longer than others. Give it a watch, it’s heart warming and sure may be corny at times but it’s a great flick.",
    "date": "2024-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Poignant. A beautiful story about choices in life. This film is for the person who has ever wondered \"what would my life have been if I had done something different instead\". Expect some hard questions asked but with powerful answers provides. Definitely a film meant for someone who feels deeply or has been through some tough choices in life. Others might not grasp the heart in this film.",
    "date": "2023-12-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "something new :) i like that they did something different than the usual",
    "date": "2023-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The story isn't engaging at all, the acting was terrible and was a pretty predictable end. Wasn't worth.",
    "date": "2023-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Only decided to watch it because i wanted to get a sense of the new Superman, David Corenswets acting skills, i am satisfied. The movie sucked tho, a below average romance movie.",
    "date": "2023-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Didn't care for it. The acting was fine, I didn't like the sorry.",
    "date": "2023-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I enjoyed this movie beyond my expectations. It sounded like a classic 'what if' movie but the characters were real and cute, directing was on point. Well done.",
    "date": "2023-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Good idea really poor execution. Just felt boring and flawed.. despite having a semi heavy topic at the center of the movie it just seemed emotionless throughout. It was a bit confusing at times as well",
    "date": "2023-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Shows how life diverges at crucial points and can take different courses. And in the end - you can turn out okay. From a pregnant/non-pregnant 23 yr. girl's perspective.",
    "date": "2023-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Love the two sides of telling a story. Showed true character development by having you question , which side would be the better choice.",
    "date": "2023-03-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "72% Audience score with zero reviews so far, how is that possible? this is a hard pass",
    "date": "2023-03-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What an amazingly refreshing movie that was shockingly pro-life.  A few times in the movie it was a little tough keeping track of which universe you are in, but the movie works on MANY different levels!",
    "date": "2023-02-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Cute little likeable and entertaining romance flick with an unusual parallel story line. Nice that it turned out OK even though they/she didn't kill the baby, which goes against a lot of the crap Hollywood pushes these days. Will have to bump my rating up a bit because of this.",
    "date": "2023-02-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "\"Look Both Ways\" is an okay movie with a great message. I liked the concept of this movie and think it is a clever idea. I did feel that the story could have been more interesting and engaging, but I still liked what it was trying to say. The journey is sweet and good-natured enough for a casual one-time watch. It's the type of movie that has that made for TV quality but in a way that makes sense for something to watch on Netflix. Sometimes the dialogue and situations feel a bit far-fetched, but its heart is pure and for that, I enjoyed watching the movie. Overall it is a cute movie with a strong message that makes up for any storytelling flaws.",
    "date": "2023-02-18"
  }
]