[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The book is far better than the movie. But the movie is a nice adventure with zombies thrown in.",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "such a great zombie movie ! brad pitt did so good in this role. super gory and really interesting zombie concept. one of my favorite movies ! ⭐️⭐️⭐️⭐️⭐️",
    "date": "2025-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best zombie apocalypse movies I have ever seen",
    "date": "2025-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Bad I didnt like it. I usually love end of the world movies and shows usually. What a shame",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Fast moving but simple plot. Great visuals and Pitt does what Pitt does! Loved it",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I've Watched world War Z hundreds of times and the movie was always amazing cant wait to see the 2nd movie",
    "date": "2025-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "“Based” on Max Brooks’s novel of the same name. This is as generic a Zombie film can be with mindless action, little to no gore with a PG-13 rating and Brad Pitt as the star marketing to the most popular audience they can you can tell this is a trouble production but those sequences of carnage are sometimes entertaining",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It’s not as well executed as 28 Days/Years or The Last Of Us games, but it’s a solid blockbuster flick with just enough substance to make me curious of the source material. I appreciate the whole “What if we made zombies act like ants?” but the virus had more depth than any of the characters. Still enjoyed the ride.",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was great! It was definitely one of the most intense zombie movies I've ever seen. Brad Pitt gave an amazing performance, and the story was gripping and compelling. I definitely recommend it for action, horror, and zombie movie fans!",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Best zombie movie of all time",
    "date": "2025-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Wow,  watched this zombie flick multiple times, and I'm totally blown away! Seriously, the story was so gripping; I was on the edge of my seat the entire time. The pacing was perfect, keeping me guessing what would happen next. Plus, the special effects were absolutely insane; the gore was fantastic. The makeup and the way they did the zombies were truly remarkable. They really went all out on the details. Overall, it's one of the best zombie movies I've ever seen, and I highly recommend checking it out!",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It’s not my favorite movie  that’s why I gave it a 1 star rating",
    "date": "2025-09-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Probably one of the best zombie movies out there. Make you wonder if there was ever an apocalypse you will hope its not like this one",
    "date": "2025-09-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "One of the better zombie movies and a rare film that improves as it goes on.",
    "date": "2025-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "World War Z was released in theatres in 2013 and is very loosely based on the novel of the same name written by Max Brooks. While the book was a series of short stories about the zombie outbreak that nearly destroyed the world, the movie centers around Brad Pitt's character and his attempts to keep his family on a boat. Pitt plays Gerry Lane who is an ex UN investigator caught in the initial zombie outbreak in Philly along with his family. In exchange for keeping his family on a UN boat he agrees to track down the initial outbreak location and travels to several countries. While doing so a zombie gets aboard his plane so naturally he detonates a grenade mid flight and blows up the aircraft. However his plot armor holds up and walks from the crash site to another UN base. He soon learns that zombies have sick people radar and can detect illnesses for some reason, which they avoid. Pitt therefore decides to infect healthy people so they don't get bit and end up infected by the zombies; yes this is the actual plot. In short while I really enjoyed the book this travesty was supposedly based on, this movie was terrible. I like Brad Pitt but the plot here was just dumb, the SFX were terrible, and the ending was a war crime. My only hope is that they don't make a sequel.",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "LOVEEE THIS MOVIE! I’ve been always rewatched thiss since i was a kid",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Went to watch this film on Netflix and realised it’s set in Isreal and turned it straight off without even finishing the trailer! Absolutely atrocious film",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "World War Z (2013) focuses more on the action than on the zombies themselves. The beginning of the film is quite interesting and enjoyable to watch, only the ending, which in my opinion, left a bit to be desired.",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I think it's a good movie, it has very good special effects and the actors are very professional, I'm very attracted to the story and I would like them to release a saga that explains how the virus evolves and humans adapt to the new apocalyptic world.\nMateo Campos",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Definitely my top 5-ish zombie movie!",
    "date": "2025-07-07"
  }
]