[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Shrek the Third (2007) already started to lose the quality of the first two, but it's still a fun movie to watch and enjoy.",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Disappointment. This movie had the potential to be the best, but turns out to be the worst one. The first act is okay, but the movie is on downfall afterwards. Toilet humor, none of the charm or heart of 1-2, feels like Illumination before Illumination. The animation is blander than ever. The new characters are completely forgettable, trash villain.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's a decent movie, but nothing special. Honestly, the most forgettable of the saga.",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Shrek the Third is the worst Shrek movie but still entertaining.",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Not that funny and kind of annoying.  My kid liked it.",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Shrek the Third brings more fairy tale fun and quirky humour, though it’s a bit lighter on the heart of the first two films. Still, it’s an entertaining ride with lovable characters and silly adventures.",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "66%. 9/28/25. Not nearly as good as the first two. The writing for Donkey and Puss isn't nearly as good. Pretty boring story. Didn't bring out the best of the characters. 1/5 rewatch",
    "date": "2025-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I  thought it was absolutely awful and i did not  like shrek the third it was so  terrible.  I think it was just terrible",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love all the shrek movies! They all just go together so well! \n\nThey’re all so cute, sentimental with the perfect amount of comedy and the hidden adult humor tops it off.",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "OVERHATED PEAK CINEMA",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Shrek the Third is generally considered the WORST movie in the Shrek franchise, but still enjoyable for many.",
    "date": "2025-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Shrek The Third?, More like Shrek The Turd!!!!\n\nWhen i started watching this movie i didn't think that is going to be a hellhole but now that i finished it.\n\nHear me out\n\nThis movie is super godawful and now i understand why nobody talks about it.\n\nI can't believe that dreamworks decided to ruin the and entire franchise that was so important for both childhood and adulthood\n\nIt's a babies movie. And they knew it beacuse of the vomit fetish humor\n\nThe first two Shrek films were clever, satirical fairy-tale adventures with a surprising amount of emotional depth. They balanced crude humor with sharp writing, layered characters, and heartfelt moments.\n\nShrek the Third abandons that balance entirely.\n\nThe animation isn't as impresive like the past movies the fact that the production of this movie started somewhere in 2006 makes you think it was rushed made with no love.\n\nThe jokes are incredibly boring, dull, stupid and worst of all, it's not funny. the only good joke was probably that one where donkey went to college but even with being saud i didn't even laugh, chuckle or even smile at that joke\n\nEvery single characters was somehow unlikeble \nThe welsh wizard, the princesses, shrek, puss and even donkey aren't good writing like they should\nESPECCIALY PRINCE CHARMING AND ARTHUR they are so beyond abysmal characters PRINCE CHARMING is an annoying selfish spoiled idiot that im glad he died during the end and ARTHUR does not deverve to be the king of far far away\n\nThe plot is pretty predictable at every point the fact that prince charming is the villian AGAIN and also throws a entire musical like sequense makes it one of the worst IF NOT THE WORST VILLIAN AND THE WORST SCENE IN DREAMWORKS'S FILMOGRAPHY \n\nThe story revolves around Shrek trying to avoid being king by finding Arthur to take the throne — meanwhile, Prince Charming leads a coup.\nProblems:\n\nThe stakes feel incredibly low. There’s no urgency or believable danger.\n\nThe “road trip to find Arthur” takes up most of the runtime and barely develops anyone’s character.\n\nCharming’s villain plot should’ve been tense and dramatic, but it’s treated like a side quest until the last 15 minutes.\n\nThe final resolution (Arthur giving a speech to bad guys) is anticlimactic to the point of absurdity.\n\n(Jesus Christ, they can't even write a good speech the live up the mood correctly)\n\nShrek the Third has… a few forgettable pop covers slapped into montages. Nothing that sticks in your memory or feels tied to the narrative.\n(They can't be compared to the golden musical masterpiece like All Star)\n\nShrek the third ads nothing to the shrek franchise and now i understand why people sticken it from the shrek saga\n\nDreamworks deliverd a movie that's terrible that the only \"OKAY\" thing is prince charming's death scene its kinda satisfactory\n\nThe pacing is very slow it's 90 minutes but stuff like bad jokes, pointless scenes drags a lot\n\nAnimation: 3/10\nHumor: 1/10\nCharacters: 0.5/10\nPlot: 0/10\nMusic: 2/10\nPacing: 1/10\n\nI want everyone to avoid this movie at all cost. But it's still better than Youtube rewind 2018\n\nIt's a simple, horrible cashgrab that doesn't deserve your time.\n\n0.5/10\n\n\nA",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Um bom filme para se divertir e se alegrar, mas apresenta alguns defeitos e não é igual seus antecessores",
    "date": "2025-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This was rough to watch especially after watching the sequel.",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Yes, out of the first three movies is it the weakest one but it isn't bad. Prince Charming is a threatening antagonist, Shrek as a father was a natural step into his developement and yes, King Artus wasn't the best developed character but He was fine.",
    "date": "2025-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "As I have said in my recent review of Shrek Forever After. I have been watching the Shrek movies since I was born and is still on of my favorite franchises. There's something about this one that just always make me watch it again and again, just like all Shrek movies, especially forever after. it's one of my Top 10 favorite movies, 100/100 score, and I can wait for Shrek 5 to come out.",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This third shrek movie was absolute garbage and rubbish and trash and this third movie sucks as hell and it was also a waste of time, money and a million dollar budget just like the first and second shrek movie and it sucks just like kung fu panda.",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "IT WAS HORRIBLE!!!!!!",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie single handedly destroyed the Shrek property and set up Shrek Forever after to be a failure, I saw this when I was little and was disappointed. How baby me was disappointed in this is insane the stupid boat scene and the wizard has haunted me my whole life. I hate this movie.",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This is so stupid and unfunny",
    "date": "2025-07-18"
  }
]