[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I like this character for Adam Sandler and you can tell how much he loves hoops.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Good, formulaic sports film and surprisingly the ball players turned out to not be terrible actors.",
    "date": "2025-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "One of the best sports movies ever made, definitely in the top 10. This is TOP NOTCH Adam Sandler. Hits all the major emotional senses; humor, sadness. happiness, anger, and relief.",
    "date": "2025-10-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Really suspenseful!! I had to fast forward parts and then rewatch it when I knew what happened. And I love suspense movies! Great acting. Great basketball great story.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The movie is a light and entertaining comedy drama. Cinematographically and acting-wise it is very well done. This is surprising given the great number of pro-basketball players (i.e. part-time actors). This is also where the movie shines most. It is full of real-life basketball stars that blend in seamlessly into this movie. \n\nWhat I find most interesting in this movie is the following: money. Surprised? After all, this is a basketball movie. However, the movie is not about the game! It is not about rules, not about playstyles, not about technique, not about physique, not about team chemistry. It is about \"culture\", and a poor boy that gets the chance to get rich and prestigious (the American Dream). \n\nI find this a bit upsetting because I love basketball for what it means to me: A fun leisurely activity full of complex dynamics. Why couldn't the movie have been about this? It is not (for almost anyone) a serious professional endeavour, nor should it have to be one. I also find that this is the point where the movie stretches reality a little too much: A street ball player going to the NBA? Although not impossible per se, streetball and NBA are quite different and the chances of streetball players succeeding suddenly in pro basketball settings seems close to 0.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Fun movie. Loved the cameos",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Great movie - loved it! Adam Sandler was great!",
    "date": "2025-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie just shows that Adam Sandler can take acting seriously, and he showcased a lot of talent in this movie. The writing was great and had a really good cast with great cameos. Love this one.",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A must see for every basketball fan! Amazing cast and amazing players! Story is also great",
    "date": "2025-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I never thought I'd care about a basketball movie, but this was more than that. I fully bought in on Adam Sandler's character and his relationship with Queen Latifah. Yes, it has a (nearly) predictable conclusion, but the journey was worth it. I was also pleasantly surprised by the acting ability of the NBA stars who played into the plot, especially Juancho Hernangómez. And the casting of Ben Foster as the extremely punchable-faced co-owner of the 76ers was on point.",
    "date": "2025-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Not a Sandler fan but he makes this work as a lovable lover. Feelgood shtick done really well",
    "date": "2025-06-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I watched this movie a few years ago. It was absolutely amazing.",
    "date": "2025-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Hustle on Netflix is a refreshing turn for Adam Sandler, this isn’t your typical Sandler comedy. It strikes a satisfying balance between grit, heart, and humour. The film lands emotional moments with sincerity, while its comedic beats never slip into the ridiculous. It’s compelling, uplifting, and surprisingly grounded. Highly recommend it",
    "date": "2025-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Love love love this movie! If you love basketball then this movie is a must. A really high energy, feel good, masterpiece about a pair of underdogs who work hard for a shot at the big time. Adam Sandler is brilliant and the story is exceptional. Could watch this on repeat.",
    "date": "2025-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "As a former professional athlete, I’d love this movie. Adam Sandler shows range with this and uncut gems that people don’t know about. They just think he’s a comedic buffoon.\n\nThis is about love, loyalty, perseverance, dedication, and a whole host of virtues really a great film.",
    "date": "2025-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Just a great sports movie",
    "date": "2025-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best sports movies to date.\nTruly an Inspirational movie for all viewers on what it takes to play a sport with a purpose or fight for the life that you desire.\nEven if you don’t like basketball or sports in general, you will be rooting for Sandy and Bo along the way as they fight their own mental demons to achieve their dreams.\nAdam Sandler often gets brought down by critics but this film is some of his best work.",
    "date": "2025-04-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Maybe this is more for sports fans. A worthy film with some serious drama and great acting and humour.",
    "date": "2025-04-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I honestly did not expect I would be hooked up in this Adam Sandler movie but it sure did the trick!\n5-stars 💯 I highly recommend 🫶",
    "date": "2025-03-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Serious Sandler remains an underrated great. A relevant basketball film about the current worldwide growth of the sport and the NBA’s increased interest in players across the globe for the next foreign-born phenomenon. It’s influenced by the fellow Philadelphia sports story, “Rocky”, and nails the necessary points that make a great sports film with enough deviations to make it unique. Adam Sandler is great at delivering in the drama-leaning scenes, but still has enough lines that let his humor shine through. All the NBA players who act in this film deliver serviceable performances, Juancho Hernangómez rises to the challenge of playing a prominent character and Anthony Edwards steels every scene he is in. It’s a great pure sports film and a must-watch for NBA fans.",
    "date": "2025-02-14"
  }
]