[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I think if I would have seen this when I was young I would have liked it more. I don't want to say any more without spoiling it. Let's just say it takes a lot more to surprise me now.",
    "date": "2025-10-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I've just watched this deeply unnerving film for the first time in many years and it is every bit as good as I remember it being. Won't write too much as this is one example where spoilers really do matter! A must see.",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a difficult film to review, as the less said about it, the more you will appreciate it. \n\nI will say two things. \n\nGet the DVD, and watch it with English subtitles. You need to see everything that is being said. \n\nDo not read any reviews about this film, before watching it. I cannot stress this enough. \n\nThe film is quite short, and I would recommend you watch it in one sitting. Don’t have anything you need to do after the film. You will need time to process it. \n\nThis film tackles a familiar subject in unique ways. \n\nHappy viewing. 😎",
    "date": "2025-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The script was at a whoooole other level from most and the actors embraced it. If you really focus, the brilliance of the antagonist is phenomenal. Great movie, even though I needed subtitles",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The truth will never set you free.",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "história: 8\natuação: 8,5\nfotografia: 8,5\nsom: 8\nfinal: 9,5\nmédia: 8,5",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Kubrick considered Sluizer's The Vanishing a truly terrifying film, and its power is in its unsettling simplicity as it explores the potency of its nightmare scenarios.",
    "date": "2025-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Absolute dogshit. One of the worst movies of all time...",
    "date": "2025-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Take all my money and then take it again. What a great cast. Seen this several times and love it more each time. 5/5",
    "date": "2025-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The best approach is blindness, only know that it’s a psychological thriller that irrationally dissects a maddening reason. But if you’re one of those when the film entered your radar by reading about is twist, then [separate] expectations would criticize the structural buildup to not take a more horrific turn to a similar circumstance. Though the film lost itself in age, it remains effectively haunting with a fine screenplay well executed with a level mind. (B)",
    "date": "2025-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Often referred to as one of the scariest films of all time, The Vanishing isn’t what you’d call a conventional scary film. Its not even really a horror, more of a psychological thriller about a man who’s wife has gone missing, and all the trauma and heartbreak that entails. It’s interesting in the perspective we see the case through, because unlike typical kidnapping stories where we spend the majority of time with either the victim or their loved ones, here we get a lot of time with the kidnapper himself. This has the effect of humanising him and, in a freaky way, getting us to see the events from his viewpoint. He’s not some snarly madman who constantly taunts the kidnappee, he’s a fairly ordinary family man who’s determined to commit a despicable act simply to prove something to himself. People have heaped praise on the ending, and while I certainly wasn’t left chilled to my bones by it, the lack of closure and finality, as well as how our protagonist got himself into that situation in the first pace, is what really sets it apart. Much like Funny Games, the director of this film took it upon himself to direct an American live action remake. I haven’t seen it yet so I cant pass judgement, but I’ll be very surprised if it managed to capture the same subtle terror and dread of its European predecessor.",
    "date": "2025-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Throughout the movie, but especially while watching the last 20 minutes or so, I anticipated the ending but hoped I was mistaken. I was not. Then again, what did I expect: when a sadist meets a masochist, do they drink champagne and toast to good times?",
    "date": "2025-05-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Das ist einer der Filme die man sich in Ruhe anschauen sollte aber dann vergisst man ihn nie. Ich habe noch lange über die einzelnen Szenen nachgedacht, der Film ist einfach furchtbar - im positiven Sinne.",
    "date": "2025-04-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Chilling. A slow burner but most of the horror is barely revealed. Grim and disturbing",
    "date": "2025-03-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Pretty well made film, but the ending is frustratingly terrible, especially because the reactions and choices of the main character aren't plausible. I kept reading here about how plausible it all is. Honestly, I don't feel the same at all.",
    "date": "2025-03-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The movie was great...until the ending.  I'm still waiting to be scared much less terrified.  I might have given it a higher rating if so many viewers hadn't led me to believe the ending would be great...it just wasn't.",
    "date": "2025-01-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Watched this movie because it's often brought up by directors and writers in the horror genre as one of their faves. Definitely well-made. Intense. Thoughtful. I've continued to think about it (which I think can be a mark of a good movie). The ending is abrupt, and I was surprised (because people don't usually take this route when ending a story of this nature), but it was very interesting. It's one of those movies that made me put myself in the place of various characters and consider what I would do in the same situation. I've also pondered the character motivations and the significance of those and how it applies to real life (evil exists: how do my own motivations, traits, defects play a role in resisting or connecting to evil?).",
    "date": "2025-01-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Es bastante lenta, aunque los diálogos son bastante interesantes. En ocasiones se siente esa impotencia e intriga y el final para mi, fue algo muy rápido.",
    "date": "2024-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I think that The Vanishing is a very good film, it's well-made, tense, and pretty much succeeds at what it tries to do. My main issue is that it doesn't seem to give a reason to show the things that it's showing. This is a great film, but I wasn't able to find much connection to it.",
    "date": "2024-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I don't know how I feel about this film, maybe I need to give it a rewatch on near future. \nI loved the American remake more than this version. I didn't feel the suspense everyone else raves on about.\nI get and liked his obsession on finding his friends killer killed him in the end, but it felt more of an anticlimax",
    "date": "2024-10-19"
  }
]