[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It’s bad, terrible, and stupid. This movie deserves to fall off a cliff.",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Good movie, but I can't believe we didn't find out why the two characters looked so alike! Disappointing!",
    "date": "2025-04-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the movies that you watch over and over again and continue to fascinate you.",
    "date": "2024-12-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The best frends Grace and Emma travel to Munte carlo after Quit their jubs and go to paris for a summer adventure.\nThe trip change when grace is confiused with another rich girl and they have a luxury trip.\n\nIn my opinin the actors is very good because the plot is very interesting, emma and grace  they are my favorite and Meg It's mure boring.\n\nI give Montecarlo five star, it is very good to Watch with family",
    "date": "2024-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The only great thing about the movie was Selena Gomez.\nThe story line, I hate to say, was not good.",
    "date": "2023-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I do have some mixed feelings about this film regarding how the screenplay was constructed but this has been a great comfort film for me. Have seen the film at least 3 times now. Since it has been impossible for me to go to Paris I watch this film to see the sights and sound of the city. Selena was astounding as Grace, her character seemed so nice in face of difficulties in her life. But as Cordelia, I must say that she wasn't exactly up to the mark, and it was a hammy performance. Leighton as Meg was the heart and soul of this film. The bgm and cinematography was perfect.",
    "date": "2022-12-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Completely rediculous but surprisingly fun. The actors are really solid.",
    "date": "2022-12-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A cheesy, yet funny rom-com that helped brought back memories of the 2010s where there was the uprising of talents such as Leighton Meester and Selena Gomez. There were charming moments where I can see the lesson of love is filled with sweet and bitterness. The musical arrangement by Michael Giacchino is a highlight that made the film very light and refreshing to watch. With the story being about taking someone else's identity and then the lesson about self-respect and value morals and principles, the film had its moments where the story is not really addressing Monte Carlo except by brief showing of the setting and the mentioning of it a couple times. While it is nice seeing Gomez's character as Grace, I didn't like the Cornelia character as it shows a freakishly pompous girl that doesn't know what to do with her life. It would be uncertain if I would watch this again, but I think it is a film refreshing for a younger audience.",
    "date": "2022-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Love love love this movie",
    "date": "2022-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Selena Gomez is amazing in the movie",
    "date": "2022-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The girl playing the lead role looks like a 12 year old child. The story is decent. Directing is mediocre. Acting is all over the place.",
    "date": "2022-04-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's light and fun. It's not going to win any awards, but it's a nice feel-good movie :)",
    "date": "2021-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Charming romantic comedy set in a beautiful location. Silly at points but overall a nice escape.",
    "date": "2021-01-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's an Amazing feel good Romantic comedy. Must watch!",
    "date": "2021-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent tween and teen movie!\nMonte Carlo is a charming movie for tweens and/or teens. Several other reviewers disliked the movie calling it predictable and boring but I have to vehemently disagree. If you are looking for a cute, adventurous movie with NO SWEARING, NO NUDITY, NO SEXUAL SCENES or INNUENDOS, NO SMOKING, and NO DRUGS then this is the movie for you (and us!)! This movie reminds me of some of the 1960's Disney movies that were plot-wise too old for little kids but still 'safe' for the not quite teenagers.\n\nThis is a classic movie about mistaken identity and learning to get along. The 3 main characters in the movies are all very different personalities but they grow and learn to accept each other by the end of the movie. They also have very different 'happy endings' but seeing how different they are, the characters should end happily-ever-after differently.\n\nThere are some funny moments, some thinking 'would I do that?' moments, and some 'good for her' moments. You genuinely like each of these characters (except the mean girl) by the end of the show whether you liked them at the beginning or not.\n\nThis movie is perfect for its target audience of tweens/early teens and I wish more movies like this were available with today's stars!",
    "date": "2020-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Story/Screenplay: (4/5) A fun, lighthearted comedy with a few nonsensical scenes that diminished the overall story, but not enough to leave it unenjoyable.\n\nDuration/Tempo: (4.5/5) At 1 hour and 49 minutes, it's an average length movie that felt short.  Good pacing for a playful, upbeat comedy.\n\nCast & Crew: (4.5/5) Selena Gomez and Leighton Meester were excellent.\n\nSummary: (4.5/5) The story was very good, the cast was excellent, and the film felt short.  A strong thumbs up.",
    "date": "2020-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "For its target audience is it really good. Also some genuine good acting now and then. I recommend it for young teens.",
    "date": "2020-09-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's a wonderful Great movie it was my dream to go tomorrow Carlo and this team has done very good job I love this movie it is my favourite movie in the hole hole favourite this my favourite movie ok",
    "date": "2019-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I know some might say this is a girly movie but Selena Gomez is a good singer and actress. It helps her case that during her Disney Channel tenure, she was considered one of the few genuinely good role models. Not that I was really into Disney Channel, even back then seeing how most of it is live-action sitcoms that tell you when to laugh although laugh tracks had already become old hat years ago. Anyway, Monte Carlo is formulaic and silly but it is still intermittently funny and Selena is charming in the lead role. I can't bring myself to hate this movie but I'm sure the principal demographic will be entertained.",
    "date": "2019-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I think people are way too critical in life. This movie is what it is. A feel-good, pass-time comedy with some beautiful moments. Nothing groundbreaking but definitely not horrible. It's a good film. Films are made to experience and I experienced it well without being critical of how simple the plot was. I knew how it would end, still enjoyed it. If there weren't films like these, life would be too serious. I recommend it to anyone who wants to spend a lazy weekend at home or having a sleepover with your girls.",
    "date": "2019-04-26"
  }
]