[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Ein Märchen wie von einem anderen Stern.",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved it! There were some scenes that weren't so kid friendly but overall is a very good movie.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "If you dislike this film, you dislike me.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "An important and charming movie",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Absolutely amazing, I'm glad bluesky's last movie was able to live on and finish production",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Noelle Stevenson's original graphic novel has one of the most imaginative stories I've ever seen, and this movie did an amazing job adapting it. Although there were slight modifications to the story, it was still an awesome movie, and I had so much fun watching it. The animation was beautiful, the story was compelling, and the characters were so fun and vibrant in their own unique ways. I definitely recommend it for animation and fantasy fans!",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Fast-paced, fun, emotionally powerful, and with unique animation, Nimona is great watch anyone.",
    "date": "2025-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Great and amazing movie! The only thing I didn't like about it though is the fact that two of the main characters loved each other for very small reasons. Honestly would have been better if it was suggestive or they were just very close friends.",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1 hour and 41 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated PG for Thematic Elements, Some Language, Rude Humor and Violence and Action!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It has been after a long time I am writing a review of any movie that I have watched. 'Nimona' is animated movie seen after a long time that touched my heart. The characters, the story, the animation; everything spot on. The film that is a fun right from the word go till the end. Top of the shelf Netflix animated films. It rests with Netflix another animated hit 'Klaus'. I recommend to watch it with your kids, friends, spouses. A must watch for people of all ages. Going to watch it again and again and again. Lastly, it is the first time I am watching animated film with the voice of \"Riz Ahmed\" and boy, I am not disappointed.",
    "date": "2025-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The animation/art style wasn't great, felt too minimalistic, very plain. Plot wasn't terrible, characters were okay, if you want a movie for your kids to watch for a bit I'm sure it's great but if you're watching as an adult there a better animated movies out there, this movie failed to hold my attention.",
    "date": "2025-09-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This film proves that you can successfully pack entertainment, powerful messages and respectful representation into one movie.\n\nAll the main characters are likeable, have great chemistry, and are fun to watch. The dark moments work their way naturally into an otherwise lighthearted action comedy.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Sensational!!! A masterpiece of animation, moving, adventure, action, friendship are topics of this film that made me think it is one of the best I have ever seen!!! Congratulations!!!",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This was very good but but honestly could have been better. A lot of the plot points were good but underdevelloped. For exemple, the flashback for Nimona's backstory was fast and cut short i feel like. I would have liked more time with these characters, because at the climax of the movie when Nimona dies i didnt reallly feel any emotion, because of the lack of time with these people. The animation was good but not on the level of others like Spider verse and PB2. On the representation, i dont really have an opinion. Like its good that theres rep I guess but Ballister and Ambrosius are not giving there time together that much. I like the nacho seen tho. Should see the movie if you like things in the same vein.",
    "date": "2025-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie had some very stupid characters inside, but by goodness, it was absolutely heartwarming. This movie almost brought me to tears in the end. All I can say: Absolute Cinema.",
    "date": "2025-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Excelente peli %97🍅🥇🏅✨️",
    "date": "2025-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "eu achei bem divertido!",
    "date": "2025-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was so mush fun me and my brothers watched it. 30 times over again 20/10",
    "date": "2025-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Nimona has its moments with excellent and breathtaking visuals and storytelling. I admire the diverese character gallery and some of the creative choices.",
    "date": "2025-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved this enough to make an account on this site to say how much I loved it! It was funny, exciting, unique, and a FANTASTIC overall storyline.",
    "date": "2025-05-16"
  }
]