[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A decent movie and cast ruined by Morgana Freeloader. A definite has been.",
    "date": "2025-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The cast of Last Vegas keep things amiably watchable, but the film is mostly a mellower Hangover retread for the older set.",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 44 minutes!!!!!!!!!!!!!!!!!!!!!!!!! Rated PG-13 for Sexual Content and Language!!!!!!!!!!!!!!!!!!!! The USA grossed over $63,900,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It was alright for a one time watch...",
    "date": "2025-06-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Criminally weak script combined with below average film making for such a strong cast. It's interesting seeing them act in the same scenes and Deniro and Mary are super but bar one priceless window joke, it didn't really make me laugh. Missed opportunity.",
    "date": "2025-03-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Can't believe the  low scores. Not enough boomers rated this  wonderful movie. Too many funny scenes to list, but Freeman jumping out of a window, and the hung over morning with the spinning bed are special.\nWonder if this was the beginning of Deniro becoming box office poison?",
    "date": "2025-02-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Poor script, A-list actors trying to make a poorly written and directed movie...but fail miserably.  Total waste of time.",
    "date": "2024-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Mala película, una cinta que lo mejor que tiene es su cast, y nadie sabe como consiguieron que semejantes actores acepten estar en esta cosa. Esta es una película de la que no esperaba mucho, pero por lo menos esperaba que presente una trama, porque ni siquiera trama tiene. La película empieza dentro de todo bien pero después no avanza la trama hasta pasando la mitad de la duración. Tampoco se me hizo entretenida, que era algo que por lo menos esperaba. El humor tampoco funciona en mi opinión, son chistes de que son viejos haciendo cosas que no son comunes en gente de su edad y nada mas; si es verdad que tiene un par de momentos graciosos pero son nulos en la película y no llega a ser una buena comedia. Por otro lado, como ya dije, lo mejor que tiene es el cast, conformado por Michael Douglas, Robert De Niro, Morgan Freeman y Kevin Kline; todos ellos hacen lo que pueden con el guion que les dieron y se salvan de lo mala que es la cinta. En conclusión, una mala película que no presenta trama alguna y que además se queda corta con el humor, solo zafan los actores de renombre que tiene y sin ellos la película no seria recordada por nadie. No la recomiendo.",
    "date": "2024-02-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I  do not understand why this film got poor reviews from the audience. This film was very funny, heartwarming, and had an excellent portrayal of love from all walks of life. It tells the story of friendship, lost love, new love, and it was done well. Some people can't seem to enjoy a good movie. There was a legendary cast, and great humor. I guess people were expecting the Hangover. I recommend if you're looking for something funny, a good watch.",
    "date": "2023-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Much like most others who watched this movie, I was drawn in by the A-list cast who did their best to provide a handful of entertaining scenes.  However, it feels like the writers were trying way to hard with this plot which quickly becomes silly, very corny and not believable.",
    "date": "2023-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I was going to pass on this Vegas product, but decided to give it a watch based on the stellar cast. So happy I did because I found this film to be well written, well acted fun and at times quite heartwarming. The four guys were fine, but it was Mary Steenburgen, who stole the film with her portrayal of a lounge singer. If you haven't seen it, you should .Viva last Vegas.",
    "date": "2023-10-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Even the charisma al the characters couldn't make a solid joke or an genuine interpretation. The caste was  amazing but a mediocre script is not going to validate the effort of the interpretation. Sad call for me",
    "date": "2023-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Last Vegas feels like a senior version of The Hangover, where a group of elderly individuals may not party as wild as they did in their youth, but their gathering together always evokes the warmth and affection we hold for friendships.",
    "date": "2023-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "When four friends like these take a break for their day-to-day 70-year-old lives to throw a bachelor party in Las Vegas for the remaining bachelor of the group, the result is an easy-to-watch and quite enjoyable film. While it is ultimately a celebration of friendship, there are a lot of laughs along the way as its accomplished cast of Kevin Kline, Robert De Niro, Michael Douglas and Morgan Freeman do their stuff.",
    "date": "2023-01-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Funny moments, light hearted comedy",
    "date": "2022-12-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Must be my age but enjoyed it   bit close to home",
    "date": "2021-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "When four friends like these take a break for their day-to-day 70-year-old lives to throw a bachelor party in Las Vegas for the remaining bachelor of the group, the result is an easy-to-watch and quite enjoyable film. While it is ultimately a celebration of friendship, there are a lot of laughs along the way as its accomplished cast of Kevin Kline, Robert De Niro, Michael Douglas and Morgan Freeman do their stuff.",
    "date": "2021-02-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A comedy that actually has grown-up problems.  Not bad at all.",
    "date": "2021-01-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I thought this would be a reasonable film, considering the cast which is pretty superb. Sorry guys, this was obvious, tacky and B grade writing. I wanted to like it, but I am disappointed.",
    "date": "2020-09-21"
  }
]