[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme ruim , sem plot , só discursso e nada acontrce além da vida dois patetas.",
    "date": "2025-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Content subject is wonderful. Character roles are great, redemption is 5⭐️",
    "date": "2024-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Wounds are tend to heal slowly and this movie a hint in a haystack to prove it.",
    "date": "2023-03-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Cool movie, but not so much a riveting mystery thriller, because you already knew who the killer was from the beginning. This is more of a social drama dealing with social injustice. The last 30 minutes of the movie went on a wild tangent and there were major plot twists and turns the kept the movie interesting and entertaining.",
    "date": "2023-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I don't know the who negative reviewer is but he needs to give up his day job because he's useless. The movie was brilliant on all levels.",
    "date": "2023-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Gritty, engrossing. Plenty of little plot twists and fine acting keeps you invested in this great movie. Not to everyones' taste I would imagine. Violence  and bubbling racial tension underpin this adult drama. It stays with you long after the closing credits ,as you try to process just what you have witnessed. Thoughtful and provocative but entertaining as hell. Recommend highly.",
    "date": "2022-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The protagonist(s) are the most vile, morally ambivalent and odious characters before you even start on the bad guys.",
    "date": "2022-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Interesting story and, although the characters and the screenplay aren't developed quite enough, WILD IS THE WIND still held my attention all the way through, especially Mothusi Magano's performance. This could have been a four star flick if the characters and the plot were given a little more depth. I felt it was pretty good for what it was given by the producers and writers.",
    "date": "2022-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I watched this while donating platelets and it made the hour and 40 minutes go quickly. Good acting.  It confronts the wounds still raw in South Africa.",
    "date": "2022-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Transcendent. The best movie I've seen since Parasite.",
    "date": "2022-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A good movie with a good perspective on race relations as humans continue to struggle with them. Combine that with a good crime investigation and you get an emotional, gritty and entertaining movie. Worth the watch for sure.",
    "date": "2022-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Wild is the Wind takes us to South Africa and we get a glimpse of life from both sides. John and Vusi are partners, but they are no means equal. The story is amazing. The acting is raw and haunting at times. I never felt I knew what was going to happen next. It was great to see a suspense, thriller, cop buddy movie that was so different from what Hollywood churns out. I will remember this movie for a long time.",
    "date": "2022-11-01"
  }
]