[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Abigail played by Emma Stone is characterized very interestingly. It is like you love this character and want to keep seeing her appearance but always subconsciously think something bad will happen to her and she will end up in tragedy. However, although she got bullied quite a few time in beginning, she is not the typical \"beautiful, pitiful, brainless vase;\" you can see the intelligence in her eye, which is shown more and more as the movie progresses later. Her dynamic with her later husband is also interesting: she shows desires and temptation but never fully satisfy the man, keeping him always on the hook. Later in the stories, although Abigail did some quite harmful things and you see it directly, you internally actually do not want to admit that she is bad, causing that conflict in your feeling. \n\nYorgos's film always \"pull in\" all my emotions and feeling: it is not just entertaining but also consuming in a good way as you just cannot stop thinking about the character for a while. For Abigail, it is this internal \"conflict\" that lingered with me. \n\nOverall, this movie is a absolute must-see. But it is not a easy, totally entertaining movie. It is best when your mind is clear and is ready to put in some emotions and feeling into the experience.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A different sort of period film with darkly subversive layers and impeccable comedic acting by Olivia Colman and Emma Stone. Colman's Queen Anne was hilariously brilliant and deliciously irreverent and she centers the film, even as the horrors of her (true story) unfold. Delightful, twisted, beautifully produced, I recommend you watch it.",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It’s fine I guess. Physically stunning but narratively empty imo",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "“The Favourite” is a true immersion into the mechanisms of power and the lengths people will go to get closer to the fire. It’s a sharp reminder that in politics and ambition, you always have to try — because someone else certainly will.\n\nI honestly expected Emma Stone’s character to return to the stables in the end, but the film subverts that expectation entirely. Its mix of intrigue, cruelty, and absurd humor gives it a very high rewatchability potential.",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The bright performance of Olivia Colman and Yorgos' powerful mind make it one of the best comedies of the year.",
    "date": "2025-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 2 hours flat!!!!!!!!!!!!!!!!!! The USA grossed over $34,200,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!! In British English with American English subtitles!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "One of the worst movies I’ve ever watched",
    "date": "2025-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Tacky and vicious in the best way possible. This is not your typical English costume drama. Should have won best picture at the Oscars. How was it not even the front runner?",
    "date": "2025-06-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "So frustrated that I wasted the time to watch this awful movie.",
    "date": "2025-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Highly entertaining and masterfully executed with fantastic performances all around. Eventually though you can't escape the fact that there is no one to root for.  When every character is a bit of a prick the drama looses its edge.",
    "date": "2025-04-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I walked in expecting a stilted costume drama and was overjoyed to find that it was a rather raunchy, stylized comedy of manners, sex, and power. I discovered and fell in love with Olivia Coleman on the spot as she brought to life a Queen Anne that no one ever has nor ever will see again. Brilliantly bonkers satire! (Don’t watch if you think you’ll be getting a BBC style history lesson.)",
    "date": "2025-03-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It was a bit raunchy, and a bit over the top, kind of killed through a point that wasn’t there. Was uncomfortable watching.",
    "date": "2025-02-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Buena película, buenas actuaciones pero el hecho que siempre todo se trata de sexo entre seres humanos es aburrido. Se podrían esforzar un poco más.",
    "date": "2025-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A very funny and intriguing political thriller that excels in the political chess matches, but can feel hit-or-miss in the surrealism (which can often feel like it's just done for shock value), as well as the ending feeling a bit forced and out-of-character.",
    "date": "2024-12-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great story about loyalty and betrayal, greed and sacrifice, all set against the backdrop of queen Anne's court. This is classic eye candy mixed with humor and drama, well acted and well shot.",
    "date": "2024-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "So boring. Unwatchable. Dont get the hype.",
    "date": "2024-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Scary good for a Giorgos Lanthimos film, beautiful and definitely one of his I would like to see again in the future for sure!",
    "date": "2024-09-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Brilliant absolutely Brilliant",
    "date": "2024-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I'm not sure if I liked The Favorite, but it was a very interesting film and I'm glad that I watched it. Beautifully shot and looks amazing on the big screen with it's fish eye lense shots and the seemingly yellow candlelight during the night scenes. Nevertheless it's also a very rough watch that I probably won't want to watch again.",
    "date": "2024-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Great acting overall, the costumes where amazing but it was quite boring from time to time.",
    "date": "2024-07-17"
  }
]