[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Based on a true story in 02 hours, 01 minute, and 09 seconds!!!!!!!!!!!!!!!!!! Rated R for Strong Bloody War Violence and Pervasive Language!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $125,100,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "BEST WAR MOVIE EVER MADE! BY FAR! THE EMOTION YOU FEEL FROM WATCHING THIS WILL MAKE YOU FEEL LIKE YOUR RIGHT THERE ON THE BATTLE GROUNDS WITH THEM IN THE MOMENT. YOU FEEL FOR THESE MEN, TRULY FEEL! THEY DO NOT MAKE WAR MOVIES LIKE THIS ANYMORE! I WISH THEY WOULD MAKE MORE THIS GOOD.",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "truly perfect, while fun and action packed you also feel the emotional and mental damages of witnessing your friends die in front of you one by one, mark’s performance here was truly spectacular",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A great and dark display of the brutal realities of war",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A good reminder that sometimes the enemies fight back.  And this is the enemies' home turf, which we were invading.",
    "date": "2025-10-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "War, action, history, American; those are my absolute favorite movie genres and Lone Survivor delivered all of them in the most powerful way. This movie puts you right in the action; you can almost feel the weight, the exhaustion, and the intensity of every moment as you move from scene to scene.\n\nAs the daughter of a retired military veteran, I have enormous respect for our soldiers, and this film deepened that respect even more. It’s not just a war movie, it’s a raw, emotional tribute to the bravery, sacrifice, and brotherhood of those who serve.\n\nGripping, heartbreaking, and unforgettable. Lone Survivor is a must-watch.",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The film really doesn't do a good job at being anything other than a feel good and proud patriotic product. Not that there's anything wrong with this film, but let's not pretend that this is the greatest war film ever made.",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "My favorite film of ALL TIME! I couldn't tell you how many times I have watched this film. The story of these soldiers is truly inspiring. Seeing what they had to go through portrayed by insanely talented actors that played their part PERFECTLY. The Directing, Acting, Casting, Editing & EVERYTHING is just excellent. If you have not seen this film.  You NEED to watch it. You will truly be inspired.",
    "date": "2025-03-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Brutal, gripping and emotionally devastating, Lone Survivor doesn’t flinch from the horrors of war. Peter Berg delivers a tight, relentless film that captures the chaos and heartbreak of combat without grandstanding. The violence is hard to watch, but it should be. Wahlberg, Foster, Hirsch and Kitsch give grounded, deeply affecting performances, with Hirsch especially standing out. The falls, the wounds and the slow deterioration of each man’s will to survive are shown with stark clarity. As war films go, this one leaves a mark. It’s tough, timely and completely earned its spot in the modern canon.",
    "date": "2025-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Good for patriot day off entertainment. Seasoned with heavy touch of salt with packed of bullet actions.",
    "date": "2025-02-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "What an insight into this true story packed with action, humor, & edge-of-your-seat moments.\nPainful but amazing. \nGod bless the troops of America.",
    "date": "2024-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie! Loved it!",
    "date": "2024-12-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Loved this. An intense war story with great characters and brilliant battle scene.",
    "date": "2024-12-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely amazing movie!",
    "date": "2024-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Awesome, and deep war flick. Probably Peter Berg’s best movie, right next to Patriot’s Day",
    "date": "2024-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "One of my favorite based on true event movies. Mark Wahlberg give one of his performances. The story is so the incredible. The cast is great. Peter Berg did very good job to capture the story and well made action sequences.",
    "date": "2024-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Special Effects: 1,0/Sound Effects: 1,0/Acting: 1,0/Story: 1,5",
    "date": "2024-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "ONE OF THE GREATEST WAR MOVIES OF ALL TIME!!!!!!",
    "date": "2024-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I can imagine it must be difficult to make a movie like this without slipping one way or the other into overly saccharine or macho cliches, but this one manages as well as can be expected. It probably doesn't have too much rewatch value but is slickly done and worth at least a look.",
    "date": "2024-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Lone Survivor is really a heavy war movie with spectacular stunts and amazing sounds effects from Dolby Atoms and really great strong cast and directing and a perfect film to watch on memorial day and veterans day for our troops who are fighting for their freedom and family.",
    "date": "2024-05-27"
  }
]