[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Not funny, extremely predictable, uninspired, waste of time",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Home Team is a surprisingly funny and good Kevin James movie.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The trailer was soooo embarrassing that I can't recommend a sequel",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It was fun the first time, well not the best, more of a movie you watch once and don't feel the urge to watch again.",
    "date": "2025-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Hilarious movie. Watched about 3 times. Still brings me to tears. I didn’t know such a hilarious movie can have a really touching story. The acting was great and it was sooooo funny. I know you must be tired of me saying that it’s hilarious but you have to see for yourself. 5 stars",
    "date": "2025-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Definitely a chill, feel good, comedy. Worth watching with your family.",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Una gran historia, algunas escenas graciosas, hay algunas cosas para innecesarias pero la historia es muy bonita",
    "date": "2025-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is ****ed up!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-05-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Another touchdown for Happy Madison productions! A biop of NFL Head Coach Sean Payton with a humorous twist!",
    "date": "2025-03-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Most people are mad about how this strays from the facts about the saints coach but I think its a fun movie that has a good message.",
    "date": "2024-12-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "When done right, I am a huge fan of sports movies. I am even a big fan of Adam Sandler produced comedy sports movies. Stuff like \"Happy Gilmore\" and \"Here Comes the Boom\" are really good movies. I even like Kevin James, \"King of Queens\" is an all-time great comedy. But this movie lacked any of the charm or energy that made any of those previously named comedies work.\n\nTo touch on the positive side before tearing this movie down: the movie is short, and there were 3 or 4 jokes that made me chuckle.\n\nKevin James is an interesting pick for Sean Payton. Particularly since in most scenes they set up Sean Payton to be the no-nonsense straight man for the more absurd characters to work off of. Kevin James can be funny, just let him be funny movie. Not saying that Kevin James can't do heartfelt, but this isn't the movie for that either. The actor is stuck in the realm between too serious to be funny, and too funny to be taken serious.\n\nThe running gags get run into the ground. The jokes all have the most obvious punchlines, and you as the audience are just waiting for them to be done. There is an overly long gross out portion where every kid on the team in vomiting. Disgusting? Yes. Funny? No. The main kid comes across as annoying. The movie attempts to have a hear to heart moment towards the end, with no heart. The movie teaches the same after-school special lessons that we've heard a dozen times. \"Winning isn't everything\" and \"spend more time with your family\".\n\nDon't get me started on the basic football and sports stuff they get wrong. There is no way a team can begin a season 0-6 and make it to the state championship. And if your field goal kicker can't kick, then go for the 2-point conversion.\n\nThe stakes for winning have never been lower. The whole event comes across as something that Sean Payton did with him time off because he was bored and had nothing better to do. Much like how I imagine this movie got made.",
    "date": "2024-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is one of the best movies I have ever seen! I have seen it so many times it is always a movie that I would be up to watching. My brother and I know basically the entire script we've seen it so many times. It is extremely funny and heartwarming. Even if you don't know football you are bound to love Home Team!",
    "date": "2024-03-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "What a waste of time!",
    "date": "2024-01-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "\"Home Team,\" featuring Kevin James and Taylor Lautner, is a delightful film that I found quite enjoyable. It stays true to the comedic essence of its cast while reintroducing Lautner to the mix. While it's not the kind of blockbuster that would have you rushing to the theater, it's perfect for a cozy family night in, streaming a lighthearted sports comedy.\n\nKevin James plays a coach who gets caught up in the glitz of his career, neglecting his family, only to find himself needing to rebuild those connections. The film also benefits from a vibrant supporting cast that adds unexpected layers to the story, making the journey more entertaining than anticipated.\n\nTait Blum brings fresh talent to the screen, introducing viewers to a newcomer who adds a unique perspective to the narrative. Additionally, Rob Schneider, a comedic icon, rounds out the cast. He often walks the fine line between being over-the-top and perfectly balanced in his roles, and in this film, he strikes just the right chord.\n\nI wholeheartedly recommend giving \"Home Team\" a chance. While it may not win over critics, it’s a fun, family-friendly film that deserves to be enjoyed. So, gather your loved ones and settle in for a good time!",
    "date": "2024-01-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "DUde drew brees is peak",
    "date": "2023-12-14"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This film is silly and fails to adequately explore the subject matter. It manages to be somewhat entertaining in the first half. However, it downplays the issues that led to Sean Payton's suspension, his involvement in them, and his fight against the suspension. On the other hand, it devotes plenty of screen time to the childish infatuation of a boy with a girl he knows nothing about.\n\nThe simplification of plays as Mexican food items is amusing and elicits a chuckle, but it undermines the actual achievements of the coaches and the team that overcame difficulties to reach a championship game.\n\nIt seems as though the creators of this film wanted to enhance this intriguing true story by incorporating Bad News Bears-style humor and silliness, along with a touch of drama involving Payton and his family.\n\nKevin James portrays a likable character, although he doesn't resemble Sean Payton much, unfortunately. The portion of this film that accurately depicts true events is very limited and could be summarized in a paragraph or two, which is regrettable.",
    "date": "2023-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This is a great movie, the American football looks like American football,\nAnd most characters or and easily one of Kevin james's best movies, however the thing is that I can't give movie a five star because some scenes are just Unnecessary like the foot long scene. But still a good movie.",
    "date": "2023-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This thing is so bad it doesn't even warrant a review.  Just bad on every level.",
    "date": "2023-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was surprisingly good. They need to make more movies like this. Great option for an evening movie with the family.",
    "date": "2023-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Once again, the critics can't see a nice, funny, family movie staring them in the face. Ignore the naysayers and enjoy a good, wholesome movie for the whole family, however your family is.",
    "date": "2023-07-02"
  }
]