[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I really loved this doc. I was in high school when the Redeem Team won the Gold and it was so fun getting that behind the scenes look at that team.  It even sucked in my wife who wasn't all that stoked to watch it. It also did a great job reminding me of why I loved that generation of NBA players. Finally, really made me miss Kobe.  Overall again, as a basketball fan, I really loved it.",
    "date": "2023-05-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Good overview of the team and it's time together in working towards the gold medal in '08. There's some historical context given, which was necessary but didn't overshadow in '08 team. The doc has some coverage of the previous teams back to '98 that had been  beaten  by intl. teams that continued to improve. \nSolid production values and video footage, along with interview from years later that had players talking about their experiences on the team and the Olympic games. 3.4 stars",
    "date": "2022-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "What an interesting documentary about the redeem team. I never knew that the US Olympic team ever lost the gold and won bronze. And I thought that to this day they just form random teams with no prior preparation but I guess not. I liked the interviews especially with Kobe and that he too needed redemption with his personal life. And to see lebron and Carmelo and others who were just rookies the first Olympic Games and got Bronze. Crazy to see. In the end I had a great time and it felt like the last dance doc that came out a couple years ago. Really good.\nOct 7 22",
    "date": "2022-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Terrible and pointless. How can you possibly try to make this group of guys out to be underdogs. Like the premise of the entire doc was utterly pointless. They made drama where there was none, and very obviously.",
    "date": "2022-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Documentary was so well made. It felt like a god damn movie. Went above my expectations. I highly recommend it to any sports enthusiast. I miss Kobe. Mamba mentality!!!",
    "date": "2022-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It's produced by Team USA, so you know it's not going to be too critical, but the project is done really well.  Good film to feel good and bring people together!  It also shows if you take something for granted, it can be gone before you know!  Final Score: 8/10",
    "date": "2022-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great documentary about how to build a team. This is a must watch for a coach in any sport",
    "date": "2022-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Not only did I find the movie enjoyable it was rather captivating.  I rewound it in some key scenes to laugh, applaud, or cry.",
    "date": "2022-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very much like The Last Dance, it's fun for me to return to a basketball event I know just about everything about and relive it with some added unedited flavor text. There's really not much more to it than that. The Beijing men's basketball final was an amazing game and an appropriate subject and climactic moment for a well produced documentary such as this. This ultimately plays like a feel good sports movie. It doesn't uncover any new information, but it sure is a fun ride.",
    "date": "2022-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Pointless self indulgent show, this is about a country that has won the Olympics 16 of the 20 Olympics and has the highest level basketball in the world, moaning about how they lost a couple of games, I would have much preferred to see a documentary on the Argentina team and their rise to Olympic gold.",
    "date": "2022-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This is an interesting documentary. But what it explained to me was not about basketball. This alpha male nation state competitive justification of all and about winning. It got the airtime and the big boys. Same as serve my country and kill people. So wrong and below first step on the evolutionary ladder. They the Bad Hate Stupid people.",
    "date": "2022-10-09"
  }
]