[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "actually the worst movie I've ever watched in my life. its not funny, the writing is terrible, the ending sucked, as all the characters also sucked too. they just threw around some poop jokes, and the movie had no plot.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Gross icky ew ew eeww",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The movie was ok, I feel that the actors were trying too hard to be funny. And news flash, cursing every five seconds doesn’t make you cool",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie goes hard.  Thames is a star.",
    "date": "2025-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Tried so hard to feel like an early 2000s style movie with the plot of unpopular kids trying to be popular at a party and win the love interest. Keep the nostalgia in 2000 and think of new ideas. Plus the actions of the \"kids\" in this movie was either flat out illegal or trying too hard. I get it's a movie but it doesn't have to be like this. The only new thing this movie thinks up is the criminal activity. Which really brings out the fact it's a terrible movies. Only Olson, Cannavale, and MacArthur was the best part of the movie. Would never recommend.",
    "date": "2025-10-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was great lol the Mom had me dying.",
    "date": "2025-10-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Mason z czarnego telefonu do netfliksowej wersji project x",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Project x but Netflix",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Guilty pleasure and hilarious. Definitely has a few plot holes. If you convince yourself to enjoy it you will enjoy it. Wish it was longer and had a sequel.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a modern high school comedy. A Little cliche, but the actors made a perfect perception of the characters, and it got me laughing a lot. It shows what the teenager life nowadays really is. Nothing crazy, but that's a great movie.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "mason thames is a bright young star, but this is atrocious. not a great start to his career.",
    "date": "2025-06-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This film is the biggest audiovisual atrocity I have ever seen in my entire life, cliché script, unfunny jokes and a lot of unnecessary scatology that adds nothing to the film, with forgettable characters and a shitty story construction.",
    "date": "2025-05-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Pretty sure only teenagers would like this movie and honestly, I really liked it",
    "date": "2025-05-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "i would not recomend, i was not ready for this. it was so confusing, very trauma inducing, and I couldn't make it through the last 15 minutes. it was all over the place but I love Isabella.",
    "date": "2025-04-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It’s very confusing and has storyline I wouldn’t recommend this to anyone",
    "date": "2025-04-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Deserves better reviews! This reminds me of the 80's teen romp films. Bobby Cannavale as the science teacher is hilarious too 🤣🤣🤣. \nThe stuff these kids get up to sort of reminds me of my teen years back in the 90's- except for the vaping and hard drugs. Kids should not touch that shit!\nOverall it is an entertaining romp.",
    "date": "2025-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Oh come on critics.  It is what it is.  Cute, silly, with several belly laughs.  No, it's not great, but it is well done...and yes, meant for a teen audience.",
    "date": "2025-04-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The comedy and funny moments stand out and carry.\n\nEverything else is very questionable and hard to watch.\n\nYou you have a sense of humor you might love watching this. Everything else not as much. It kinda tries to be like any high-school movies or grownups. \n\nThe ending could've been better tbh. But I enjoyed the jokes and laughs.",
    "date": "2025-04-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Fun, Enjoyable and Cool movie...",
    "date": "2025-04-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This is a classic high school comedy movie. Had a few great laughs and found myself rooting for the younger brother to get his sister's friend, classic high school drama. Was hilarious!",
    "date": "2025-03-26"
  }
]