[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is one of the best movies I've seen \nMr. Hanks played in. This movie well definitely makes you cry. I definitely would recommend this movie to everyone.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Loved this man Otto",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great Warm and Funny movie.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A Man Called Otto is a poignant, heartwarming saga of an older man struggling with the losses that life inflicts upon us when we least expect it. He wants to end his life and join his beloved wife, but the friends and neighbors he shuns give him new reasons to live. The actor playing Marisol was terrific and should be nominated for an Oscar for best supporting actress. I am a huge fan of Tom Hanks and hope he continues making movies.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's an exceptional movie,  must watch. Very emotional too. Tom Hanks never disappoints!!!\nLoved Mariana Trevino's performance too!!!",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I was hesitant to watch this movie. It didnt really look appealing . I judged a book by its cover. My man put it on and i absolutely loved it .",
    "date": "2025-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I can honestly say that I find most films are not my thing. My MO is to start watching and then stop 10 minutes in. But this: well I can't think of a film with Tom Hanks that I haven't enjoyed. It had me hooked right from the beginning. A grumpy man with a backstory and his redemption through meeting a new neighbour had me transfixed. It explores love and loss through bereavement and illness and a man who thinks his life is over finding new meaning. It had me bawling my eyes out, and that is rare. This film is not just a film, it's an experience that is poignant.",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of my favorite Tom Hanks films he's a legend for this stuff. I promise you. Go see it! ⭐⭐⭐⭐⭐",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A Man Called Otto is a heartfelt and authentic adaptation that manages to keep the soul of the original story intact. Tom Hanks brings his signature warmth and subtle humor to the role, giving a layered performance that’s both grumpy and deeply moving. What really makes the film shine, though, is how well the supporting cast complements him—each character feels lived-in and genuine, adding depth without ever feeling forced. It’s a touching, funny, and beautifully human story that proves some tales truly can cross cultures without losing their heart.",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Warm, charming movie yet utterly moving & painfully heartbreaking in places.  Beautiful acting by Tom Hanks once again.",
    "date": "2025-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This was a highly enjoyable movie Tom Hanks was EXCELENT im this movie I suggest that you go and watch this it was very good",
    "date": "2025-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "An absolutely wonderful movie, but it's definitely not a comedy. Yes, there are a lot of funny moments, but the back story (shown through flashbacks) and its impact on Otto is actually quite sad. I cried repeatedly.",
    "date": "2025-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Tom Hanks is heavily depressed and grumpy as hell towards everyone after his wife’s passing until new neighbors move in across the street. The movie is heartwarming but very slow.",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Beautiful movie, one of the few that has made me cry. All I have to say is watch it",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "If it's got Tom Hanks in it, it's bound to be a good film and this is no exception. Dark but witty, it's a poignant view on the trials and tribulations of life. well worth a second viewing.",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A real tear-jerker. I am an 80 year-old who keeps searching for relevance and associate with Otto. He lost his career and his wife and child. Marisol and Malcolm gave him relevance. There is hope, but you may need to search it out.",
    "date": "2025-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I very much enjoyed this sad/happy story of an older man bereaved and on the verge of suicide…if he could only succeed…we’ve all been there (well, I have, anyway). Tom Hanks and all the cast did a fine job with this film, and as an added bonus…no foul language!",
    "date": "2025-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Yes, it’s a remake but a remake that’s very well executed. Kudos to Hanks.",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I’ve always liked Tom Hanks, but his movies do sometimes veer towards the schmaltzy. Sadly, this movie didn’t just veer towards it, like the bus, it ran off the road and landed in the middle of Lake Schmaltz. \n\nIt felt as if it had been written by AI, with all the token minorities seemingly written in just to tick a box - and they were, of course, all tediously adorable and bearing no resemblance to any known human being.\n\nAlthough I readily shed tears at a genuinely moving story my eyes remained dry as the Sahara throughout. \n\nA clichéd and formulaic movie, cynically designed as a tearjerker, and the worst Tom Hanks movie I’ve ever seen.",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This drama was very good. Tom Hanks, Truman Hanks, Mariana Trevino, Rachel Keller, Manuel Garcia-Rulfo, and the rest of the cast did a spectacular job in this movie. The story of the movie was dramatic, tragic, and heartfelt. It's about a man that's troubled by the world and wants to end his life, but finds friendship and love and does anything he can to help them. If you haven't seen this movie yet, check it out sometime. It's a definite must see.",
    "date": "2025-07-02"
  }
]