[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Watched this movie cause Christoph Waltz was in it. Period. The setting was a bit dull, and the movie didn't hold my interest.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "One day they’ll get a Tarzan reboot right.",
    "date": "2025-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Christopher W.\n\n     No idea the agenda of the professional reviewers. Excellent movie all the way around, acting, writing, cinematography. Thoroughly enjoyed this movie when it came out. Exactly why I bought it today.",
    "date": "2025-05-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Fantastic, epic, stylish and sometimes heart breaking movie. The musical score and the photography are exquisite and the acting is powerfull. It's a must see, critics are sometimes crazy, don't listen to them, this movie is badly underrated. Perhaps the only critic I can make is the unnecessary use of poor CGI at the end of the movie.",
    "date": "2025-04-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I read all the Tarzan books. None of the Tarzan movies ever showed the apes as being different like they are in the book, this is the first movie I’ve ever seen where they actually showed that they were not Gorillas in the conventional sense. I thoroughly enjoyed the acting and thought Alexander Skarsgård did an amazing job of bringing Tarzan to life in a way that haven’t been done before. I don’t like that people seem to criticize this movie more than they just enjoy it for being fun.",
    "date": "2025-02-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A fantastic, beautifully filmed and well acted epic.\nIgnore the Rotten Tomatoes score",
    "date": "2025-02-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The Legend of Tarzan barely swings to deliver a decent continuation of its well-known story.\n\nThe cast delivers decent performances, and the CGI is alright, but the movie is slow, boring, and lacks an engaging story that would have satisfied fans of Tarzan with a solid action-adventure epic.\n\nGrading: C",
    "date": "2025-01-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "LOL!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2024-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A very enjoyable movie that I love watching. All the cast were great and memorable. Just a really good movie that is entertaining. What a movie should be. Epic scenery and Animals that were so life like. Bravo to all involved!",
    "date": "2024-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I don’t know what the hell the reviews are about previously but this movie is excellent… Action packed, romantic, beautiful scenery, absolutely incredible character portrayal… Did any of these reviewers even watch the damn movie?\n\nThis movie is nowhere near deserving of the low score it gets on this review site!\n\nZeke",
    "date": "2024-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "While I found Skarsgard and Robbie to deliver a real-feel take on Jane and Tarzan, this film clung to its colonialist history more than it explored the wild fantasy of Tarzan, leaving more to be desired as it came to a close. All in all, an enjoyable movie for its cast and shots, but these aspects were not enough to supplant its mediocrity in novelty and innovation of an age-old character.",
    "date": "2024-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I didn't think a movie about Tarzan would be much fun but finally decided to watch it. Turns out it is actually an awesome movie, technically and graphically. The scenery is gorgeous and the technical effects impressive from stampedes to 1800 european cities. It's been a while since I saw a movie this great. It is full of action so it never gets boring.",
    "date": "2024-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It is a little fantastical Tarzan more of a super hero than man but it is ok for a watch on a lazy day",
    "date": "2024-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I have watched this movie many times. I think it is a great movie.",
    "date": "2024-06-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I honestly liked the movie and thought it had a decent story! Plus Margot Robbie is in this who I still think is one the great young actress working in Hollywood today!",
    "date": "2024-05-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The best Tarzan movie ever",
    "date": "2024-04-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The Legend of Tarzan is a spectacular movie. Its acting and cast is fantastic. With a very fitting score and exciting action sequences, it is a great epic that will leave you feeling great.",
    "date": "2024-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved this movie just wanted to keep watching it over and over again.",
    "date": "2024-03-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I know we all by now know the story of Tarzan and it's another remake along the same story but is intertwined with the future. A original classic that was perfect the first time is hard to change & be successful. With that being said I still enjoyed the film & left with a smile.",
    "date": "2024-03-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Its a shame, its been rated so low here. Its a beautiful movie and an amazing love story. Both Alexndar and Margot have done a fantastic job. The cinematography is on point. The whole setting is just awe strkiking, that you cant stop loving the whole movie.",
    "date": "2024-02-13"
  }
]