[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "No where near as good as the original.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The first Knives Out was much better. Especially the cast. I'm hoping the third installment coming out in a couple of weeks can recapture the magic. The cast chemistry just wasn't there for Glass Onion.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I thought the first Knives out was great. Fun characters, actual surprise, tail end a little weaker, but overall very entertaining. This movie, on the other hand, was terrible. The whole thing is so transparent, so on the nose with all of its humor/satire/commentary, it is just painful. A classic case of someone taking all the wrong lessons from their success. \n\nOf course, it's got a great RT score, and did well financially, so in that sense I'm the one in the wrong. But comedically and artistically it is an unmitigated disaster. Hope #3 is better!",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Crazy never expected it and this was very funny and well produced",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I didn't finish the movie because it was just too stupid to continue (fortunately, it was streamed, not purchased).   But the movie gets off on the wrong foot -- another setup of clueless party people who, in the movie, just happen to be X-illionaires, visiting the King Kong of godzillionaires.   And where did they get their dinero?  Why, from 'disrupting' ... and they keep reminding us: they are all disruptors, disrupting, disrupting, disrupting all the time (even though none ever works, reads a book, or anything that might suggest they possess insight , influence or maturity beyond your average 14-year-old).  Didn't anyone tell them that the word 'disrupting' is sooooo 2015?   The movie overall has a retro vibe; kind of a 70s movie where the audience is supposed to swoon because this or that star is on the screen.  I'm sure it was an ego trip for the actors, especially since they get to play functioning members of the tech community.   Mheh!",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent. Intense, fun, humor. All around  great watch! You stay on your toes as each scene can offer a new twist or surprise. No spoilers but good luck predicting one scene to the next!",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Once again peeling back layers of a tantalizing enigma to delectable effect, Rian Johnson keeps the embers burning on the subgenre with Glass Onion: A Knives Out Mystery.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The reviews are very misleading. It's an okay movie. It was recommended to me as a comedy, but I didn't even laugh once during the whole movie.",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Plot too complicated and unreal",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It started a little slow, but when it got rolling, it totally rocked!",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Glass Onion feels like a cheap, Big‑Brother‑style orgy on steroids: loud, over‑the‑top, and utterly lacking substance, with characters who don’t even take themselves seriously. Where Knives Out ran like a finely tuned watch, here everything trips over cheap gags and spectacle — intelligence, tension, and character sharpness are completely trampled.\nOnce again, Rian Johnson shows no respect for the DNA of the character he created. Benoit Blanc bears little resemblance to the clever, sharp detective of the original. If I were the producing studio, I’d give Johnson a very stern talking‑to.\nA noisy, hollow diversion with scant regard for its own heritage — disappointing and at times almost disrespectful to the source.",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Even when it’s building up its characters prior to the murder, Johnson’s direction ensures that the suspenseful, adrenaline charged tone attributed to rollercoasters is always present.",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Some parts feel discursive from stylistic indulgent using familiar threads as the point of evident fun from both Rian Johnson and Daniel Craig with an ensemble cast, this whodunnit case plays on a lesser level but with unforeseen twists to bolster satisfactorily and solidify its instant entertainment value that hooked easily. (B)",
    "date": "2025-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It’s okay. Daniel Craig’s over the top acting and horrible accent almost ruined the movie for me. Edward Norton is bland in it. The supporting cast is good.",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "After finding it late, I absolutely adored Knives Out, a genuine play upon its genre. It had twists that made sense, with interesting, likable, and varied characters. In other words, Knives Out was everything Glass Onion was not.\nIn Knives Out, the detective is a mysterious and often sinister force. Admittedly, he is entirely one-note. However, in the context of the story, he never gains the center of our attention. That makes him a far more interesting and often sinister force, creating a great antagonist and, by the end, a very interesting friend.\nGlass Onion decides that this one-note character should be the main character, taking all the limelight as it quickly becomes clear that he is just some writing gimmick to be puppeted around. There is a reason that Sherlock Holmes is not the main character. The level of character development, insight, and growth required of a point-of-view character does not well suit the all-knowing detective. Far better is to make them a logical machine, to put obstacles in their way and allow the thoughts and emotional journeys to be held up by the real characters around them. Despite putting Blanc as the center of attention in Glass Onion, the film fails to give him failings, motivations, or hopes.\nIn Knives Out, the first twist happens approximately a third of the way into the story. It makes complete sense, and from that point on, it provides us with a main character. All the following twists are equally a surprise to us, and to her.\nGlass Onion makes the startling decision to present us with a main character who already has the depth of a fishbowl, only to say, a little bit past the halfway point, Aha! The detective has been hiding everything from you, and knows all. You thought you were following the story. No, you weren’t. And after the 30 minutes it takes the film to even explain its plot twist, when you are presented with the rest of the characters finding out, it rushes past it with practically no attention given to the characters’ reactions to what should be a shocking revelation.\nIn fact, the only thing that the main plot twist seems to do, other than reveal information it could have revealed in any other way, is to entirely eliminate one of the most compelling characters, and replace her with an albeit interesting, but poorly explored alternative, who is by nature of the plot twist, entirely removed from her role as a suspect.\nAll of this is to ignore the entirely uninteresting cast of characters. And that the suspect is the first individual who I guessed, and being such an obvious character that I assumed up until the ending credits, there must be another plot twist. And the nonsensical MacGuffin, introduced halfway through the story, which fails even the central role of a MacGuffin, by not being unimportant at the end.\nGlass Onion is an uninteresting romp through one of the many failures of the detective genre.",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Wasn't as good as first. I knew who did it right away. I knew Miles had the cell phone. The story was a little predictable, for me anyways. Still enjoyed it though. Thought ending could gave been written better than the Mona Lisa burning with the house. But, the writer wanted a neat little bow of tying the Mona Lisa back to his statement about it. Characters were under utilized too. Thry were all great with what they were given to work with. Worth a watch just for the entertainment value. Just dont expect a real who done it.  The first Knives Out was far superior. A real old fashioned who done it. This one went to rogue on the who done it.",
    "date": "2025-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Mind numbing and just entertaining enough to watch half before turning off and looking up how it ends",
    "date": "2025-09-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Daniel Craig is back in the role he was born to play. Another finely-crafted mystery with twists and turns and a fun cast.",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Not nearly as good as the first movie but still absolutely delivers the murder mystery aesthetic",
    "date": "2025-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Stylish and entertaining with a flashy cast and fun energy. The satire is sharp at moments, though the mystery itself feels thinner than Knives Out. Still, it works as a playful ride, full of spectacle more than substance.",
    "date": "2025-08-30"
  }
]