[
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "What an awful mess. Completely disorienting, and awkward. The art direction was a disaster.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It was good but not as good as the Original!",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Better then the first 🥰",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Amazing movie but ends on a to be continued",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Alr, I mean come on😘🥰☺️, The Swinging.The Friends.And Finally THE SPIDER-VERSE. I mean he is Miles so freaking good as Spider-Man. And the friends he’s around in this movie is awesome. And I think I Miguel O’Hara is the best villain for this movie, and that fight scene at the end is COOL AND INSANE. Listen i could keep milking and glazing this movie. Totally, deserves 5 stars👌",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The Greatest Spiderman Movie of all time & arguably the greatest superhero movie of all time, but hard to say that when its just part 1 and they havnt even finished the movie and its been years.",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is an absolute banger.",
    "date": "2025-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Good, but long. On the bright side, since nobody reads these audience reviews anyway, you probably have nothing to worry about. Its your opinion.",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Would be good if they finished the dang movie, and didn’t make us wait 5 years for a sequel!!!",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of THE best films I have ever watched. An animated movie has no business being this good or being able to create so much emotion. The first film was decent, but this one absolutely blew me away. Miles Morales holds all this together, but Spider-Gwen and Spider-punk are the stars!",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "An absolute blast to watch this in theaters for the first time great music, great characters, great voice acting this movie has it all yes its a first part to a two part moviethat comes out five years after it was made, but that’s what you get for a highly quality animated movie",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Love the movie but HATE Miguel being the villain of this nutty movie 😒",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Great Movie best looking movie of 2023!",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A brilliant animated movie with visuals that feel like a piece of art on their own. My teenage children adore it and are counting the days until the next one comes out!",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I really do like this movie but it really does lack in some aspects and characters. One main thing I really didn’t and honestly just don’t like for all movie so not just this Spider-Man movie but every movie that leaves you on a cliffhanger. Usability a film could take around 1 or 2 years depending on how long the film is which for this series has toke about 4,5 or 6 years to make 2 movies which is very long. Second reason why is the underdevelopment of all of the spidermen or spider-whatever’s were there. Third and final reason why is the length of the movie and what was happening which watching the movie felt like I was only watching the chase scene in the Spider-Verse which was about 40 to 60 minutes of the movie. Otherwise, I like this movie movie and enjoyed watching the movie but my few complaints.",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A visually stunning sequel that expands the Spiderverse with jaw-dropping animation and storytelling perfection",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Its a good movie, but its very stressful, and the ending just was not the greatest [part 1s good]",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "BEM inferior ao primeiro, tecnicamente maravilhoso roteiro direção animação,mais cara 2 horas e 25 minutos de filme pra acabar num continua vai se ferrar, esse filme não ter final e muito covarde cara 8/10",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Critics Consensus:\nA breathtaking visual triumph and an emotionally rich sequel, Spider-Man: Across the Spider-Verse swings even higher than its predecessor in scope and ambition. It’s a stunning blend of artistry, heart, and chaos—an animated epic that proves superhero storytelling can be as moving as it is mind-blowing.\n\nShameik Moore once again delivers a standout performance as Miles Morales, now older, wiser, and facing the weight of destiny. Hailee Steinfeld’s Gwen Stacy takes on a more central, poignant role, giving the film a powerful emotional core. The animation is nothing short of revolutionary—each universe bursting with its own distinct art style and personality.\n\nThough its sprawling narrative and cliffhanger ending may frustrate some, Across the Spider-Verse remains an audacious, deeply human adventure that pushes both animation and the Spider-Man mythos to exhilarating new heights.\n\nIt’s bold. It’s beautiful. And it’s proof that superhero cinema still has the power to surprise.",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Spider-Man: Across the Spider-Verse is an amazing animated film with stunning visuals, great voice acting, and a compelling story.",
    "date": "2025-10-11"
  }
]