[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Should have been better. Great effects and a fun ride with Iko Uwais with his killer instincts and quick moves.\nSome corny one liners, but if good martial arts is your religion, then you will enjoy it.",
    "date": "2024-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Film comes across corny, especially with the American boys one liners every 5 minutes. And the corny music. Acting isn't great. It's like the film is dubbed but it's not. The fighting seems like they're doing rehearsals. Every punch can be seen coming and both parties waiting to be hit likes its WWE wrestle mania. Other than that. The colour grade was okay. However the sound was so low I had to max out the volume to hear anything. The fast and furious ending is the icing on the cake of corny. \" to jenny \"",
    "date": "2024-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Pretty terrible across the board. Lewis Tan turns in an especially awful performance. The only reason it's not one star is the final fight is quite good. It feels like all the resources went to that one scene, and everything else was an afterthought",
    "date": "2023-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The series was good. Some humor, good character development, etc. This movie had none of that. Incomprehensible fight scenes that looked more like a square dance than a battle. And so...many...cliches!! \"I, the evil untrustworthy demonic figure will restore your dead family if only you betray all of humanity.  PSYCH!!!!\"   \n\nNot worth watching.",
    "date": "2023-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Iko uwais é o brilho do filme junto com lewis tan\nMas o filme n é tão bom quanto  a série..\nWu assassins\nSenti falta da policial da serie\nQ aqui n apareceu...\nQueira ela como o par perfeito pro iko uwias..",
    "date": "2022-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The fantasy/martial arts genre usually has built in beauty along with the fight scenes..but this revenge film seemed to be built around the fighting (which wasn't all that amazing).",
    "date": "2022-05-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Some great fights from Iko & co and some fun upbeat scenes make it a good time",
    "date": "2022-04-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The series was watchable, this film was not. While there was one shining moment of fight choreography that involved a drone, the fight choreography was generally abysmal. There's literally no point in discussing anything else about the film, because there is absolutely nothing else to discuss.",
    "date": "2022-03-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "So laughably bad, a noticeable drop in quality from the already-meh show.",
    "date": "2022-03-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I enjoyed 'Wu Assassins', the series that preceded this film, even though there were some glaring holes in the plot. However this film is a patchwork of choreographed martial art fight scenes with the flimsiest storyline trying to connect them. Terrible story, terrible script, waste of 90+ minutes. I think my 2* may be too generous.",
    "date": "2022-03-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I love the action sequences. I liked seeing Pearl Thusi as an action character. Lewis Tan has a stronger persona in this movie than Mortal Kombat and has great action choreography with THE LEAD guy - who is just ‘Jackie Chan' awesome.",
    "date": "2022-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The hype of the trailer and the story of the actual movie are miles apart. Overall, IT LACKED SERIOUSNESS.",
    "date": "2022-03-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I wanted to like this movie, being a fan of Tony Jaa, I guess my disappointment was inevitable.\nNow, allow me to clarify, I do not go into a film like this with the expectation of seeing a new best actor or best picture nominee. I do however expect, entertainment, of which I got null.\nThe acting, well was non-existing, the \"martial arts\", sub-par at best. If you are a fan of D-list actors or like sitting in a theater and reading a good book. This film was for you, if you were at home, hoped you remembered you could've changed the channel.",
    "date": "2022-03-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved it ! Great action, fun, romance, actors and actresses who spend a good moment playing their characters, everything to spend a good moment !",
    "date": "2022-03-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Fistful of Vengeance is an action packed, martial arts film that's a lot of fun to watch. The movie moves quickly so you are never bored. The script could have used a bit more depth and dialogue. There's a sex scene in the movie so you may not want to watch it with your parents (awkward!). I highly recommend this movie.",
    "date": "2022-03-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved it. From the cast and crew, to the fighting sequences, to the music. I can say one of my favorite movies of 2022 so far. I hope it will be a sequel.",
    "date": "2022-03-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "All the fight scenes are exciting! the movement of the camera with the robot looks amazing. An excellent option to see for those of us who like martial arts. PS: I loved the soundtrack",
    "date": "2022-03-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a must watch if you're someone who's into Action, Fantasy, and a good story line. The movie is packed with spectacular action scenes. As for me, I didn't knew what to watch, the amazing cast or the action in the movie. Overall, the best in market rn. What are you waiting for ? Go watch it rn ✨",
    "date": "2022-03-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fistful Of Vengeance is action packed movie from beginning to end with spectacular fight scenes. A superb ensemble of actors with outstanding martial arts skills. My favorite fight scene is the one between Iko and Lewis. The fight scene was filmed with a high speed robot Bolt camera. Epic fight scene. \n\nLewis demonstrates his impeccable acting along with his phenomenal martial arts.",
    "date": "2022-03-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "If you're looking for a great use of your time then Fistful Of Vengeance is the way to go. I recently watched this movie and to put it plainly, a NO JERKY ACTION SCENES experience.\n\nStarring Lewis tan, Fistful Of Vengeance lives up to the hype.\n\nFistful Of Vengeance is a Action movie about characters who embark on a journey of revenge. Despite the obstacles, big and small, the characters in the movie, as well as the viewers, still meet a great end. The performances from Lewis tan illustrate the narrative of this movie with such a viable effort. Consequently, this film ended up being an AMZING ACTION film",
    "date": "2022-03-01"
  }
]