[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Jenifer lopez plays an ex army sniper that had dealing with both a weapons runner and drug dealers. She gets knocked up and ends up placing her daughter on witness protection, all goes well until the daughter gets made. The concept is good but the story is predictable and cheesy. Not to mentioned that is cruel. Shows lopez hunting and talks about how she kills different animals. Reprimands the daughter for showing compassion for the animals and explains the circle of life 🙄 🍿/5 on Netflix",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "JLo is back in an action film. The last time I saw her in an action film was in the movie Enough. Just in time for mother's day, the story revolves around how a mother will do anything to keep her daughter safe. The story, however, is weak and cliche-ridden. But it is action packed and the story moves along well. I just wish there was more meat to this movie with better character development and a fresher script. You'll most likely enjoy it. It has great entertainment value and you won't waste your time watching it.",
    "date": "2025-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie. Jlo needs to do more action movies",
    "date": "2025-06-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Another Jennnifer Lopez stinker. Avoid at all costs.",
    "date": "2025-03-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Yes, there are some decent action sequences but overall the story is fragmented and at times downright stupid. For instance, immediately following daughter's rescue and during the gas station stop it took the writers about 1 minute to plow through the \"are you my mother\" question with zero lead up or explanation of how the question even came about.\nSkip this movie for your own sanity. 😉",
    "date": "2025-02-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It's alright. It's a one-time watch kind of film. Not really my favorite.",
    "date": "2025-01-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Love this movie, Jennifer is such a great actor❤️",
    "date": "2025-01-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Probably one of the worst movies I’ve ever watched pure dribble.",
    "date": "2024-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Omari Hardwick provided some ballast for the movie, which suffered after his character was killed.",
    "date": "2024-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The Mother is not just another action thriller; it’s a film that breaks barriers, and Jennifer Lopez is at the heart of it all. In a genre often dominated by male leads, Lopez stands tall as the powerhouse \"Mother,\" redefining what it means to be a woman in action cinema. She doesn’t just fit into the role; she owns it, bringing strength, depth, and authenticity to the character while seamlessly delivering the high-octane action sequences.\n\n\nLopez’s portrayal of a former U.S. military operative on a mission to save her daughter is both fierce and heartfelt. She kicks ass with the precision and grit you'd expect from a seasoned action star, all while maintaining the emotional core that makes her performance so powerful. As the center of this story, she flawlessly balances vulnerability with unstoppable force, proving that women can not only lead but dominate in an action-packed narrative.\n\n\nWhat makes Lopez’s performance even more remarkable is that she’s not just \"playing a part\"—she's shattering stereotypes. Traditionally, action films have relegated women to the sidelines or placed them in supporting roles, but The Mother places Lopez front and center. She’s not just part of the action; she is the action, and she executes every scene with a commanding presence that’s both refreshing and inspiring.\n\n\nHer role in this film is significant, not only for her career but for representation in cinema. Lopez continues to pave the way for women in Hollywood, showing that age, gender, and background are not limitations but strengths. As she delivers a relentless, physically demanding performance, she proves that women can lead thrilling, intense action films with the same grit and prowess as any male counterpart.\n\n\nBeyond the intense fight scenes and gun battles, Lopez brings emotional complexity to the character, offering a layered performance that resonates on a personal level. It’s this combination of action and heart that makes her stand out. The Mother is a film about resilience, sacrifice, and the unbreakable bond between a mother and her child, and Lopez embodies these themes with a level of commitment that makes the story not only believable but unforgettable.\n\n\nJennifer Lopez once again demonstrates why she is one of the most versatile and influential actors in the industry today. With The Mother, she doesn't just entertain—she empowers, making her mark as a true trailblazer in action cinema. This film, and her role in it, is a testament to her skill, dedication, and ability to break down barriers with grace and grit. Simply put, The Mother is a must-watch, and Jennifer Lopez is the reason why.",
    "date": "2024-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It was slow at the beginning, but the action picked up. Overall very predictable, but still entertaining. I enjoyed it.",
    "date": "2024-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Very predictable. Same story of many movies but, with a female killer.",
    "date": "2024-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I don't know, I remembered \"Anaconda\". Already made better ones, but it's ok if you try.\n\n\n\n\n\n6/10",
    "date": "2024-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Started off very slow, but it did pick up slightly. All in all it was just okay.",
    "date": "2024-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Nothing in this worth watching but Lopez.  It's enough.",
    "date": "2024-06-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Suspensful.  Holds your attention.  Some nice moments.",
    "date": "2024-06-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Every bit as good as all the other action films the critics do like and this one actually has a story.",
    "date": "2024-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It was the acting for me. Didn’t do anything",
    "date": "2024-06-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A watchable movie if you really have time, it is plain like a paper, not interesting. Acting is ok. Everything average.",
    "date": "2024-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Am Ende muss es Mami richten, auch wenn sie keine Mami sein will aber doch Mami ist weil sie ein Kind geboren hat.\n\nZerschnitten, unspannend und nerviger Teenager.\n\nAllein die Verhörszene macht aber Spaß",
    "date": "2024-05-24"
  }
]