[
  {
    "user": "John Daniel Tangalin",
    "rating": null,
    "text": "Fear Street Part Two: 1978 can be predictable, slow-paced, and yet, it’s nice to see some plot points come full circle with the previous film.",
    "date": null
  },
  {
    "user": "Jennifer Bisset",
    "rating": null,
    "text": "Of course, there's some classic R.L. Stine twists that keep you guessing until the very end...",
    "date": "2023-03-30"
  },
  {
    "user": "Keith Garlington",
    "rating": null,
    "text": "As for “1978”, it manages to be both nostalgically transporting and needlessly irritating.",
    "date": null
  },
  {
    "user": "Erick Estrada",
    "rating": null,
    "text": "A homage to '70s slasher horror films full of gore and carnage. [Full review in Spanish]",
    "date": null
  },
  {
    "user": "Linda Maleh",
    "rating": null,
    "text": "Fear Street is not just trading in nostalgia, though. It has its own unique tone, and every chance it gets either subverts or deepens classic horror tropes...",
    "date": null
  },
  {
    "user": "Therese Lacson",
    "rating": null,
    "text": "1978 ends by bringing the two stories together, giving us more questions than answers, but making us all the more excited for the final installment of the trilogy.",
    "date": null
  },
  {
    "user": "Witney Seibold",
    "rating": null,
    "text": "Less a riff on slasher tropes than '1994,' but instead a straight-up throwback. And quite a good one at that.",
    "date": null
  },
  {
    "user": "David Nusair",
    "rating": null,
    "text": "...a slow-moving endeavor that fares especially poorly within its deliberate and excessively familiar first half...",
    "date": null
  },
  {
    "user": "Jason Shawhan",
    "rating": null,
    "text": "That's the most shocking thing about this film: Not even the younger campers are spared the ax, and it hits just as hard as the hazings, bug-related pranks and (eep) compound fractures.",
    "date": null
  },
  {
    "user": "Ben Turner",
    "rating": null,
    "text": "This is at its strongest at its simplest, when it revels in its teens running from a psycho-killer. It only falters when it distracts from this with the franchise's madcap over-arching plot.",
    "date": null
  },
  {
    "user": "Rob Hunter",
    "rating": null,
    "text": "Can't live up to the highs of part one, but on its own merits, it's a competent homage to the genre's heyday through the lens of Stine's best-selling YA series.",
    "date": null
  },
  {
    "user": "Andrew Wyatt",
    "rating": null,
    "text": "A flawed but entertaining supernatural slasher epic, one that is more intriguing for its thematic and structural ambitions than its execution of horror fundamentals.",
    "date": null
  },
  {
    "user": "Steve Murray",
    "rating": null,
    "text": "Seen in succession, the film triptych develops into something more interesting than its individual parts and the passing pleasures of an on-the-nose pop soundtrack.",
    "date": null
  },
  {
    "user": "Salome Gonstad",
    "rating": null,
    "text": "This movie is actually longer than Part One, but it doesn't feel like it. It's bloody and exciting and it feels brisk. It also feels like the perfect set-up for Part Three.",
    "date": null
  },
  {
    "user": "Anya Novak",
    "rating": null,
    "text": "\"Fear Street Part Two: 1978\" repeatedly gets bogged down by its music and the atmosphere but earns its rightful place alongside the sleepaway camps and the crystal lakes.",
    "date": null
  },
  {
    "user": "Inkoo Kang",
    "rating": null,
    "text": "So much of the trilogy is dedicated to expositional scenes laying down the foundations of Shadyside's history, there's too much that's admirable in theory and flat on screen.",
    "date": null
  },
  {
    "user": "Matt Hudson",
    "rating": null,
    "text": "A few issues notwithstanding, 1978 still ends up being a deliciously brutal romp and an applaudable throwback to beloved horror movies of old.",
    "date": null
  },
  {
    "user": "John Serba",
    "rating": null,
    "text": "Fear Street Part Two: 1978 improves slightly over its predecessor, although I still struggle with my cool indifference to its post-Stranger Things algorithmic nostalgia calculations.",
    "date": null
  },
  {
    "user": "Sara Michelle Fetters",
    "rating": null,
    "text": "As love letters to 1970s and '80s slashers go, this is one of the best I've seen outside of 2015's The Final Girls.",
    "date": null
  },
  {
    "user": "Roxana Hadadi",
    "rating": null,
    "text": "Compared with 1994, in 1978, the kills were more shocking, the atmosphere more tense, the characters more believable and well-rounded, and the world-building more thoughtful.",
    "date": null
  }
]