[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved this!! Such a great watch. I loved seeing Mel back at it as Marks dad was so neat. The dynamic of Will and his father versus Mark and his is just super comical.",
    "date": "2025-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a great Christmas movie! Extended family was all laughing throughout the movie. Campy and silly but exactly the type of Christmas movie that is fun to watch each year.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "While this movie is not perfect, it is one of the funniest movies to watch. The ending has you laughing like a kid and all the characters are well thought out.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I loved this way better then the first one, this is my 3rd favorite Christmas movie, I don’t get the hate on this movie is so good and I know some people hate it because of the script and the weird scenes but like I don’t mind like not that much I would definitely recommend of least trying it",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "BIST DU EHER ERSTER FREUND ODER FRAUENVERSTEHER?\n\nBrad und Dusty sind mittlerweile ein halbwegs eingespieltes Co-Daddy-Team. Doch weil Töchterchen Megan zwei Weihnachten doof findet, soll’s diesmal ein großes, gemeinsames Fest in einem Skiort geben, inklusive der eigenen Väter Don und Kurt. Während Don jeden umarmt, der nicht schnell genug wegläuft, baggert Kurt alles an, was zwei Schenkel besitzt. Das Fest der (Be)Sinnlichkeit kann beginnen.\n\nDaddy’s Home 2 – Mehr Väter, mehr Probleme (2017) läuft etwa 100 Minuten und ist ab 6 Jahren freigegeben. Wir haben hier die Fortsetzung der Chaosväter, diesmal herrlich erweitert mit John Lithgow und Mel Gibson.\nIch mochte die Fortsetzung tatsächlich etwas mehr, vor allem wegen Gibson, der mit sarkastischem Grinsen und grimmiger Coolness genau meinen Humor trifft. Die Schneeballschlacht war pures Comedy Gold und die komplette Krippenszene hat mich laut lachen lassen.\nNatürlich gibt’s wieder schwache Gags, Leute tun sich weh, es gibt Fremdschämen en masse und alles wirkt noch ein Stück konstruierter als im ersten Teil, aber es passiert mit so viel Augenzwinkern, dass man’s gut erträgt.\nWeniger gelungen sind die Ehefrauen. Sarah bleibt die Moralbiene vom Dienst und Karen (Dustys Frau) bekommt genau zwei Sätze. Aber gut, der Film heißt ja auch nicht Mommys Home.\nDas Finale im Kino ohne Strom ist dann der große Kitschmoment, hier zeigen alle Väter, Stiefväter und Großväter ihre Gefühle, was charmant gemeint, aber eindeutig eine Überdosis Zuckerguss ist.\nUnterm Strich bleibt eine Fortsetzung, die dank Gibson noch etwas besser funktioniert als der erste Teil. Leicht, unterhaltsam und völlig harmlos, perfektes Familienfutter.\n\n6/10 Punkten. Wenn Kinder in einem Kinofilm mitspielen, kann man die eigenen ruhig mit reinnehmen, auch wenn Liam Neeson mit einer Panzerfaust auf dem Poster ist. Was soll schon passieren?",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A big letdown from the first movie. And Mel Gibson played such an unlikeable, unpleasant character that it soured most of the movie.",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Daddy’s Home 2 is probably better than the first. It is funny, has a great cast, and the holiday setting is cool.",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thought it a absolutely perfect film it even more funnier than  the first one I absolutely recommend it to you and perfect film for kids I bet you your kids absolutely loved it",
    "date": "2025-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "People hate this for no reason too",
    "date": "2025-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Lots of laughs and good feels.  Entertaining and fun.",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Almost all Christmas with all the snow, snowball fights, mistletoe, Christmas tree and family annoyingness. I tolerate this sheet, my daughter was annoyed I laughed so much at the cornyness. Plus John lithgow, what else can I say? Hilariously weird",
    "date": "2025-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Daddy’s Home 2 had a tough task following the success of the original. In my opinion, it doesn’t quite reach the same level of freshness or charm, but that doesn’t mean it’s without value. The sequel still delivers plenty of humorous and fun moments, along with the same kind of corny comedy beats that defined the first film. This time, however, the cast is expanded with the addition of Mel Gibson and John Lithgow, along with some screen time for John Cena.\n\nThe core idea is still intact: a battle of personalities and parenting styles. Will Ferrell and Mark Wahlberg continue their back-and-forth dynamic, but now it’s mirrored on a larger scale with their fathers in the mix. That’s where the sequel really finds its footing—John Lithgow’s character, for example, is one of those “embarrassing parents” you’d dread being related to, yet he’s played with such over-the-top charm that he steals the spotlight in nearly every scene he’s in. Mel Gibson brings a completely different energy, leaning into the gruff, old-school dad role and creating a funny generational clash that works better than expected.\n\nThat said, the film isn’t without flaws. The direction feels a little scattered at times, and the story occasionally stumbles as it tries to juggle too many comedic setups. It doesn’t always hit its mark, and some scenes feel like stutter steps rather than smooth transitions. Still, despite its unevenness, the movie manages to keep the humor flowing enough that you’re never truly pulled out of the experience.\n\nOne thing I will say is that the critical response to this film always baffles me. Sure, it’s not a groundbreaking comedy, and it certainly doesn’t rival the original in terms of novelty. But to call it one of the worst comedies or to treat it like it deserves to be “rotten” feels unfair. It may be flawed, but it’s far from terrible.\n\nUltimately, Daddy’s Home 2 is a mixed bag. It’s not a film I’d go back to often, but it has enough genuinely funny moments and enough strong performances from its expanded cast to make it a worthwhile watch, especially if you enjoyed the first one.\n\nVerdict: Not as good as the original, but still a fun, silly, and watchable comedy with a cast that knows how to lean into the ridiculousness.",
    "date": "2025-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 38 minutes!!!!!!!!!!!!!!!! Starring John Cena, Will Ferrell, Mark Wahlberg, Mel Gibson and John Lithgow!!!!!!!!!!!!!!!!!!!! The USA grossed over $104,000,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I think people who rated this movie below 2, are just sad with their lives and live alone. It was an absolutely laugh, these ‘critics’ must understand that comedies are exaggerated and are not real life and they don't follow real life rule. So when a critics say it’s too dumb, duh it’s a comedy movie it’s not meant to be serious. The acting was brilliant, the story line was decent, it did the job of the movie, “have a division in the family, then resolve it”. It’s unjust to criticise a movie when you do not like the genre. It’s funny how these professional critics hate it, but the general public loves it. CRITICS SHOULD NOT SAY THE MOVIE IS JUST DUMB, it a comedic genus, the way it takes a very big social problem; e.g. blended families and give those people who are effected by it a way to relate and find a way to have a laugh. DO BETTER CRITICS",
    "date": "2025-04-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Why are people taking this movie so seriously its just meant to be funny",
    "date": "2025-03-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Mel Gibson and John Lithgow only enhance the already perfect contrast between Wahlberg and Will Farrell. The sequel is almost better than the first. Perfect holiday fun about misfit in-laws’ dysfunction.",
    "date": "2025-03-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This Movie sucks so much that my dumb little brother had to turn it on while I was playing 2k and this movie is so weird I hate it",
    "date": "2025-03-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Daddy's Home 2 is a major step down from the original, with a few funny moments but an overall unnecessary sequel that fails to capture the charm of its predecessor. As a Christmas movie, it misses the mark, and the lack of John Cena is a noticeable disappointment.",
    "date": "2025-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie is kinda better than the first one, but it sucks that adult Griff wasn’t there. And it’s kinda repetitive, and the kids are still terrible characters.",
    "date": "2025-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The snowball fight near the end is worth the wait if you need a good laugh!",
    "date": "2024-12-28"
  }
]