[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I think this is actually one of the best films I've ever seen. Truly exceptional.",
    "date": "2024-04-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Heartwrenching. I am so glad I watched this. Powerful.",
    "date": "2023-12-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was so good, heart wrenching yet truthful and raw.",
    "date": "2023-03-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "While Hotel Rwanda is politically very controversial, Trees of Peace isn't. From the harrowing experience of hiding three months in a cave (that's where us viewers are taken), writer, director and actresses have created a humanist picture of the genocide. What it was, how it was perpetrated and the devastating consequences on Rwandan society, 1 million deaths. A breathtaking account for a multicultural society working toward peace.",
    "date": "2023-03-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Beautiful albeit tragic story. Unique plot. Beautifully shot!!",
    "date": "2022-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was a great film to watch. The actors were amazing and delivered intended emotions clearly. The plot was also great - as a viewer who's unfamiliar with the history of Rwanda, this was an eye-opener and a reminder that history is not that far away.",
    "date": "2022-06-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a profound story that attests to the fact that not everything needs to be romanticized or embellished beyond recognition, motive or intended impact. That is the reason pervasive apathy, complacency and obliviousness continue to prevail. This movie does an excellent job of illustrating that the Rwandan genocide was awful and that people endured suffering that was both swift and sustained. It reminds and informs viewers that for approximately 100 days, life experiences for many Rwandans were reduced to narrow views, perspectives and vantage points, i.e. limited existences contained to small spaces—be these spaces roadblocks, schools, churches, hotels, or kitchen cellars. It is unfortunate that some reviewers I've read entirely missed the essence of the film, seemingly driven by a need to be charmed and entertained that outweighs acknowledgment of the array of human responses to trauma, regard for the survival instincts trauma can activate, and empathy for victims like these amazing characters executing their personal tactical responses to it.",
    "date": "2022-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Trees of Peace does a triumphant job of meticulously telling the stories of its protagonists. Even in its contained setting the film does a wonderfully meticulous job of detailing the personal affects of atrocities of the Rwandan genocide. One may find it hard to believe that this is the directorial debut for Alanna Brown, the film's writer-director. I'm sure we'll see more important and wonderfully told stories from this filmmaker. At least one can hope. Bravo.",
    "date": "2022-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The movie was great!!!  Very powerful!!",
    "date": "2022-06-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was a very compelling story. You can see other characters and the cinematography is great",
    "date": "2022-06-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie really touched my soul. This is an excellent period piece. A must see!",
    "date": "2022-06-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The movie is absolutely outstanding. It resonates a lot to the recent events in the world. Directing, acting captivates you and brings very simple, but always important idea that only being one we can stand together against evil and keep our humility.",
    "date": "2022-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This film takes an unflinching look at the Rwandan genocide through the eyes of four very different women. I was moved to tears but also felt a sense of hope for the resilience of humanity and finding peace in unexpected moments. Brilliantly cast, shot, and edited. Do not miss.",
    "date": "2022-06-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Just finished watching this on Netflix.... wow... It's a heart-wrenching subject but approached with respect and realism. The claustrophobia and fear is palpable, but so is the love and understanding created between the very different women.",
    "date": "2022-06-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing writing on a subject that needed to be shared and phenomenal Direction from Alanna Brown. Huge kudos to the actresses in this film, making every moment stuck in that cellar felt by the audience. To the Producers, way to do your homework and getting this project over to Netflix. I wish everyone on the platform to enjoy and appreciate this film as I did. Godspeed.",
    "date": "2022-06-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very heavy subject but it helped give me hope for our country and our divisions here in the US.  We can all live side by side and find a road to peace.",
    "date": "2022-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Aside from a much younger generation of Rwandans who will emotionally be a little far removed from the events of the '94 Tutsi genocide, I doubt very much that many Rwandan locals will want to watch and relive the trauma. The 3 African actresses (Okojie, Bingwa and Umuhire) were absolutely phenomenal and truly carried the film -- sorry Ms. Cannon, you did not. People claiming it's like Hotel Rwanda? ARE YOU JOKING? Hotel Rwanda and Sometimes in April are on a league of their own. Aside from a few powerful lines and perfomances, the entire narrative was like a primary school attempt at being a full featured film like Hotel Rwanda or Sometimes in April. The film had so much promise, but damn, the last 10minutes (the ending monologue + the little information) seemed a little lazy and didnt finish strong. \n\n3 out of 5 stars just for the anticipation of the seeing the film.",
    "date": "2022-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This powerful film based on true events is set during the Rwandan genocide and tells the story of  4 women who must overcome  unimaginable circumstances in order to survive. Through vastly different backgrounds they fight to keep their sanity while navigating a claustrophobic environment.  The women must learn to trust one another and work together if they have any hope of escaping their situation alive. \nWhile brutal and gutwrenching in its storytelling at times, the film has plenty of moving moments that demonstrate the power of love and forgiveness. Moving portrayals of these women through some very amazing and talented actors.",
    "date": "2022-06-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is a rare gem in many ways; the acting, directing, story, cinematography and editing. Captures your from the beginning to the end. I could not step away, its a MUST SEE!",
    "date": "2022-06-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Trees of peace takes place durning the Rwandan genocide, also known as the genocide against the Tutsi in 1994. \n\nThe film follows four women of different backgrounds, as they take refuge in a small space below a home as militants seek to murder all Tutsi people and those who sympathize with them. \n\nWhat really stood out to me in this film was the ability to capture my attention from the very start of the film. Everything from the writing to the acting, directing production was at the highest level. The way the story kept my attention is something to behold in itself as the whole film takes place in this small space over a period of 80+ days. \n\nThis film is a reminder of the cruelty of humanity but also the kindness and love of it. I wouldn't be surprised if this gets Oscar nods. It's just that good. I'm excited to see where the careers of all involved go, especially Writer/Director Alannah Brown. I highly recommend this film!",
    "date": "2022-06-10"
  }
]