[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Blended is my all time favorite movie! It is a perfect mix of comedy and romance along with family fun. It is the best way to spend a calm Sunday in Summer when you are having a family movie night.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Blended is a good vacation movie and has a great cast and plenty of funny moments.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "16%? Really?\n\nCheesy but charming. Why does every Adam Sandler movie have an emotional gut punch? Also, Drew Barrymore should be his love interest in every movie he stars in.\n\nBest Character: Jen (I needed more of her. She was hilarious.)\nBest Quote: \"I may have misread that situation.\" - Mfana\nBest Scene: Lauren singing \"Somewhere Over the Rainbow\" in Africa",
    "date": "2025-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Sweet movie, but a surprising lack of tension. Every problem was gotten over easily and quickly.",
    "date": "2025-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Filme: Juntos e Misturados \t\t\t\tAssistido: 7-9-25\nElenco: @adamsandler @drewbarrymore @bellathorne @jessmarlo @emmafuhrmann @kevinnealon @alyviaalind @terrycrews @braxtonbeckham11 @joelmchale @zaknotwack @lurenlapkus \nModelo: #romance #comédia\nDuração: 2h \tAno: 2014\nMinha opinião: Afinado no Amor 1998, Como se Fosse a Primeira Vez 2004 e Juntos e Misturados 2014. São os filmes de Adam com Drew e outra parceira com 3 filmes temos Jennifer Aniston. Nesta comédia creio que Adam usa da mesma fórmula para o sucesso do filme. Dê uma forma onde Adam tem 3 filhas que ele cria depois da morte da mãe. Como trabalha em um loja de produtos para esporte, ele veste as meninas com roupas de esporte e leva elas para cortar o cabelo em um barbeiro e cria como se elas fossem seus filhos. Já Drew é divorciada e tem 2 filhos sendo que o mais velho esta na puberdade e com um pai ausente que não participa de nada. O filme começa com Adam e Drew em um encontro, mas nada deu certo. MAs o destino os uniu na África com toda a família. Mesmo no inicio com tudo para dar errado, já que estão no mesmo quarto, pouco a pouco um vai suprimindo a necessidade do outro principalmente em relação aos filhos. Vendo como cada um esta sendo falho na condução da educação e interação. Vendo que as meninas precisam de um toque de mulher e os meninos de um toque masculino. E assim vão se completando até que a mágia do amor toca os 2. Com vários momento hilários co um casal louco e a presença de Crew como um comercial a cada 5 minutos. \nVale apena assistir? Um filme bom para assitir e relaxar. Não é o melhor dos 2. Mas vale apena assistir comendo pipoca com a família.\nNota: 7",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is Adam Sandler's best movies, don't pay attention to the rating of the critics. They don't know the meaning of \"comedy\"",
    "date": "2025-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of my absolute favorite movies of all time!! SO funny and very rewatchable. Ignore the haters, they’re probably bots :)",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Sadly, one of Adam Sandler's worst movies.",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "La definición más pura de \"Romance forzado\".",
    "date": "2025-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Just watched it for Drew Barrymore and Adam Sandler.",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "So good to see Sandler and Barrymore together again. It’s got the same feel/charm of other Sandler comedies, but love the Easter eggs. The “Hi, I’m Tom!” callback to 50 First Dates was hysterical. Yay to Sandler comedies! Not as fun as 50 First Dates, but still worth the watch if you loved seeing these two together the last time and want to see them again. Even if you don’t care for 50 First Dates (or the Wedding Singer when they were the both leads), Terry Crews alone in this film (Blended) is comedy GOLD. I’ll watch Terry Crews in anything - he makes all movies better. Including this one!",
    "date": "2025-05-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thought this movie was absolutely hilarious.  .aybe I'm just an Adam Sandler fan, or maybe I just miss this type of humor. Either way, it's the kind of movie I would watch multiple times.",
    "date": "2025-05-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Filme mais ou menos, o roteiro é fraco, as cenas de comédia são mais ou menos, o elenco é bacaninha e alguns ajudam a melhorar o filme, e os personagens sao mais ou menos, mas eu até recomendo esse filme.",
    "date": "2025-03-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "75/100 - blended is a funny rom-com. all romcoms are comfort food. they are meant to have mediocre dialogue, jokes, acting, and plot. there are very few that break the mold but this film has some very sentimental moments that arent overshadowed or ruined by dumb jokes or bad comedic timing.",
    "date": "2025-03-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Really sorry to say that this movie has very little to entertain, and nothing to bring you back to it. Even though I am a fan of both of them.",
    "date": "2025-02-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Jim e Lauren tiveram um encontro às cegas que não deu certo e deixou uma má impressão em cada um deles. Jim é viúvo e tem três filhas. Lauren se divorciou e tem dois filhos. Aproveitando uma viagem que um casal de amigos não vai fazer, eles vão no lugar e têm uma nova chance de se reavaliarem. Drew Barrymore e Adam Sandler possuem uma excelente química em tela, já provada em filmes como The Wedding Singer e 50 First Dates. Porém aqui acabamos tendo o pior da comédia de Sandler. As participações de amigos que não servem para nada. As piadas sobre sexo. Sandler fazendo o seu personagem safo de sempre. Sinceridade, o único que me fez sorrir foi o Terry Crews, mas fazendo o personagem de sempre. Sandler já provou em outros filmes que é um bom ator, mas essa rede de conforto que ele criou em torno dele, acaba por minando aos poucos o interesse por ele.",
    "date": "2025-02-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The worst by far of the Sandler-Barrymore efforts. The gags here are mostly dead-on-arrival. Sandler seems intent to ruin every good joke with an immediate insult to the face, and he can't allow a tender moment alone without wanting to wreck it with an unwelcomed -- and unfunny -- zinger attempt, or the very, VERY overused Terry Crews running gag (it was funny the first time, but insultingly bad by the 10th time his singers appear). The movie is over produced and ... well, just overall trying too hard. This \"could\" have been a good movie, with proper editing and a little less desperation; The bones are there, and Sandler-Barrymore still have unmistakable chemistry. But this installment is just ... boring.",
    "date": "2025-02-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is one of my favourite films. A cosy comedy that my partner and I like to watch at least a couple times a year. Sure, some of the plot doesn’t add up (did they not have the same flight to Africa?), but that doesn’t take away from the charm. 5/5 looking forward to the next time we watch it.",
    "date": "2025-01-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely no doubt an outstanding comedy for the family!!",
    "date": "2025-01-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Good background movie, simple, tacky but good to forget about today's miserable world.",
    "date": "2025-01-18"
  }
]