[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Rating: 7/10. 70/100",
    "date": "2024-12-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Fairly interesting story of Einstein's relocation to England and eventually to the USA against the backdrop of the increasing horror of the uprising of Hitler's Germany. Einstein's involvement in the bomb is only briefly touched on and you are left wondering what the point of the film was. The actor in the lead doesn't suit the part and his poor makeup is a constant distraction.",
    "date": "2024-06-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The lesser known side of Albert Einstein; It is not only the reason why he fled Germany, and where he got the inspiration for his studies on relativity, it is the approximate truth of whether or not he had anything to do with the construction of the atomic bomb. The follow-up, far from being tedious, turns out to be absorbing, even for those who do not like documentaries.",
    "date": "2024-04-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I'd have preferred something more factual and less lecturing.",
    "date": "2024-03-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The trailer was enticing, the movie a great disappointment. Mostly repetitions of the same quotes with empty melodramatic filling. Provocatively bad.",
    "date": "2024-03-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I have admired Albert Einstein and his accomplishments my entire life and I was really looking forward to this Netflix documentary. I was hoping to learn more about Albert einstein, his life, and of course His Brilliant discoveries. Unfortunately, what this documentary delivered was a series of political lectures pertaining to the early 20th century in conjunction with what I thought were very awkward dramatic reenactment. Finally, Einstein's many breakthroughs in mathematics and physics were glossed over so lightly that you might think he was more of a political figure after watching this, which he was not. Finally the title itself reveals how misguided this documentary is. It focuses on something that Einstein had very little to do with (the creation of the atomic bomb) while all but ignoring some of his greatest accomplishments which were in physics, mathematics and cosmology.",
    "date": "2024-03-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Seems like this was quickly and shoddily made to take advantage of Oppenheimer fever...it has some good archival footage but the dramatic reenactments are terrible...not worth watching and I regret doing so.",
    "date": "2024-02-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Einstein and the Bomb tries to show the renowned scientist's sorrow and society's condemnation because of his participation in the Nuclear Bomb. The idea is well-thought-out, but crafting it is like a mediocre YouTube video. It could have been a movie, not a documentary.",
    "date": "2024-02-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Achieves a whole new level of \"loosely based on events...\"",
    "date": "2024-02-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It provided some new insights into Einstein's life.",
    "date": "2024-02-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A reminder of the persecution under a fascist regime as well as the important letters sent to the American President to kick start his buddy's Manhattan Engineering Project....",
    "date": "2024-02-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I recently read Fritz Stern's book \"Einstein's German World\".  This documentary depicts this tragic world in a more vivid and captivating way.",
    "date": "2024-02-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "There's just not much in this and it isn't worth watching. Einstein had nothing to do with the bomb and was excluded from the Manhattan Project - as this film admits - because he was a staunch pacifist. What does that leave you with, in a film that tries to put the two together? Nothing really.",
    "date": "2024-02-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Not so much about the bomb, but more importantly how the German people were suckered into supporting Hitler.  Then the slaughter began.  I have a feeling that many of the folks who gave a low rating were probably MAGA hats.",
    "date": "2024-02-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This documentary was beyond bad. It seems it was targeted for eight year olds. The relationship of Einstein and the bomb are too vital to give a childish attempt at telling an important story.",
    "date": "2024-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Thought the archival footage was fascinating.  For all the hand wringing on the use of the bomb, it's worth remembering a few things.  First, Japan started the war.   Also, Japan refused to surrender, contrary to attempts now to rewrite that history.   \n\nUnfortunate it had to be used, but the Atomic bombs saved the lives of hundreds of thousands of American soldiers that would have had to invade Japan.",
    "date": "2024-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It was a breath of fresh air in the sense that its only an hour long. However It does not really impact the viewer, since it lacks depth and spectacular acting.",
    "date": "2024-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Interessante ver como o holocausto influenciou a vida de Einstein quando ele estava em seu auge como físico.",
    "date": "2024-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Good historical documentary.",
    "date": "2024-02-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "In this documentary about Dr. Albert Einstein, viewers are presented with a profoundly educational experience that significantly overshadows its entertainment value, albeit the latter is still appreciably present. In an era where entertainment often trumps educational content, this documentary serves as a beacon of enlightenment, offering a rare glimpse into the mind of one of history's greatest thinkers.",
    "date": "2024-02-18"
  }
]