[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Poor acting and unreasonable storyline. I would definitely not recommend watching!!",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Keeps you guessing right to the end. Good movie.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I got frustrated with her constant deep sighs, heavy mouth breathing, and gasps. I lost count after 30. Yes, I actually counted. \n\nThe parts I do catch it didn’t feel real.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Lordy, where to start??\n\nDid you ever sit and watch a movie for the entire duration of the movie waiting for it to start? Well, that’s what you have with taken in plain sight. The acting writing and directing our all equally abominable.\n\nNot sure if the actors in this movie ever considered taking acting lessons, but they are sorely needed across the board. The writing is horrendous and the directing is pedantic. Don’t waste your time on this movie. There’s plenty of other things on Netflix to watch.\n\nI am absolutely flummoxed as to how this movie ever made it to the Netflix platform.",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "So, so bad. I like a poorly acted Lifetime movie on occasion, but this one is worse than normal. This one keeps ending up on top ten watched movies so I had higher expectations. The bad acting, the horrible decision making of the lead (girl, if you follow someone into the middle of nowhere and park in the yard by their house behind a tree, in reality they’re gonna see you), and the ridiculous overacting of the kids- it’s just bad. Save yourself some time, and don’t watch.",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Just put Lifetime Network on & call it a day. 🙄😑👎👎",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This was one of the worst movies I’ve watched that’s up to date. Terrible acting. The camera man wasn’t so good the weird transitions for each clip. Felt like I was watching like a skit. Wasted an hour and 30 minutes kept hoping it would get better.",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I created an account here for the sole purpose of saying this is the worst movie I've ever watched. I downloaded it for a plane ride, meaning I didn't have alternatives, but I honestly wish I could surgically remove it from my brain. Horrible writing, acting, plot, characters, cinematography, etc. I can't think of a single strength. It was just wretched in every imaginable way. \n\nWhoever is responsible for this atrocity should be banned from the film industry for life. Save yourselves and watch LITERALLY ANYTHING else.",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It’s sooooo bad. I only watched it because it was number 4 movie on Netflix. Acting is so bad",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Imagine if AI wrote and directed the screenplay of a bad hallmark movie mixed with a thriller written by a 3 year old and divide that by two because it's that bad.",
    "date": "2025-10-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "In psych classes I learned in most cases the perpetrator was first the victim...This movie happens non stop in a lot of criminal cases and not just child abduction.",
    "date": "2025-10-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Very unbelievable.  Bad acting.",
    "date": "2025-10-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "horrible acting. horrible plot. half the time she was js heavy breathing. the ending was bs. there was no exictment or thrill. dont waste your time watching this horrible movie. who ever the actors and dricetor is.. please dont star or dircet any more movies😊",
    "date": "2025-10-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Pore acting I feel like they all deserve a participation award…….",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I’ve never felt compelled to write a movie review—until now. This film managed to infuriate me with its relentless overuse of fade-to-black transitions, which felt less like artistic choices and more like editing malpractice. And then there was that scene: the one where the camera crew is clearly visible. Seriously? How does an entire production team miss something so glaring? It’s 2024—we should be well past this level of amateurism. The only thing taken in plain sight was two hours of my life… and not even Liam Neeson showed up to save them. 1/10",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Criminal minds meets Hallmark",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Really really really really bad",
    "date": "2025-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Like so many of the other reviewers, I’ve never written a movie review in all my years. This movie was absolutely awful. I’ve never seen such bad acting in my life. The story line made no sense and there was no emotion behind any of the characters. Spoiler: the mom finds the kid. When they’re reunited, they hug for maybe 10 seconds. The kid was missing for 6 months. If I don’t see my dog for a day, I give him a longer hug once we’re together again. I can’t say enough bad things about this movie. I think I’ll never stop thinking about how terrible it was. Suddenly, I want to become an actor because I know I could do so much better. -948284736448/10. Don’t watch.",
    "date": "2025-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "First time EVER writing a review about a movie. Don’t waste your time on watching this. Got through like 15 minutes and turned it off. Then had to check to see if I was maybe wrong about the horrible acting… which I wasn’t 😒",
    "date": "2025-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I've never reviewed a movie in my entire life, but I created this Rotten Tomatoes account solely to tell the world how bad this movie was.",
    "date": "2025-10-23"
  }
]