[
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Your standard action comedy superhero fair, not as good as the first one and I didn't even think the first film was that great.",
    "date": "2025-09-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It wasn't as good as the first movie, and the Mean Girls-style sub-plot was really unnecessary, but overall, I loved this movie. It was so much fun to watch and there were so many hilariously epic moments that made it an absolute joy to sit through. I definitely recommend it for superhero, action, and comedy fans!",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Very Underrated , Sad too see that we didn’t get a 3rd Movie",
    "date": "2025-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 43 minutes!!!!!!!!!!!!!!!!!!! Rated R for Crude and Sexual Content, Brief Nudity, Pervasive Language and Strong Violence!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $28,800,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Keeps the spirit of the original Kick-Ass. Jim Carreys' performance is underrated. \nNot a great movie, but not nearly as bad as some say.",
    "date": "2025-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "An okay follow-up that delivers some fun moments but ultimately falls short of the original’s clever mix of satire and spectacle.",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "nowhere NEAR as good as the first one and the kiss at the end seriously weirded me out",
    "date": "2025-05-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "All stars for Hit Girl. She deserves her own franchise.",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Did a good job with this sequel, hilarious in parts and nice new characters and development. So happy they made a sequel, Hit Girl rules!",
    "date": "2025-04-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Kick-Ass 2, while thankfully sanitizing the extreme storyline from the comics it’s adapting, seems to be a rollercoaster of hits and misses based on its current direction. The dynamic of the cast, the humor, and the action remain, but the story is quite convoluted and doesn’t elevate the franchise to the same level as the first. In reality, it risks portraying this version as an inappropriate teen comedy that sexualizes underaged actresses at the time and simplistically follows up on a successful first film.\n\nGrading: C+",
    "date": "2025-01-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Accurate kick ass reviews",
    "date": "2024-12-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "No where near as good or as fun as the first one.",
    "date": "2024-12-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Fun and entertaining",
    "date": "2024-09-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's ok but nowhere near as good as the first one.",
    "date": "2024-03-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It's not as bad as people think. Maybe not as good as the first film but only a little bit lacking, so my score is still the same as the first one. Though for Kick-Ass/Dave, I wish if he had a better ending and had better interactions with certain characters. Jim Carrey was pretty cool in this movie even though his role was short.",
    "date": "2024-03-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "should have ended on the first movie. Tbh, but I guess this was entertaining too",
    "date": "2024-03-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Any movie that has diarrhea as a gag will be hard to watch.",
    "date": "2024-03-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Muito bom o filme. Recomendo assistir.\nÉ um filme que entrega uma qualidade parecido com o filme que antecede este, mas tem alguns pontos que poderiam ter sido melhores.",
    "date": "2024-02-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Kick-Ass 2 Was Still Fun and enjoyable but not as good as the first. Some Really Fake Looking Moments with Blood, Vomit and Green Screen But nonetheless, you can't take these Movies seriously and I think if Matthew Vaughn directed this then it would be better but Aaron Taylor Johnson and Chloë Grace Moretz do a great job but a standout is Christopher Mintz-Plasse as Chris D'Mico aka; The MotherF******who was absolutely Hilarious! Can't Wait for thr Kick-Ass Reboot!",
    "date": "2024-01-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A great sequel to the first kick ass movie.",
    "date": "2024-01-26"
  }
]