[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie was completely predictable. So slow. And tried to paint the obvious villain in a good light. Boooooooo",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I have not been able to stop thinking about this story since I watched it. I am still confused and have several unanswered questions. However, I do believe Anna was wrong and it is hard to hear about what happened to D-man. Was he actually able to communicate? I feel like Anna took the wrong approach in trying to improve his communication skills, there are better options out there for someone with D-man’s condition. I read that the facilitated communication method was extremely unreliable and there is a lack of evidence that it produces reliable results, is that why Anna chose that specific method? If he wasn’t able to communicate, why was he in classes, writing papers and reading books with someone who was not Anna? I feel like they set him up in court in the way they were trying to prove/ disprove his level of competency. I can not imagine how hard it was for the family when they thought he would be able to thoroughly communicate with them, just for all hope to be crushed and then go on to learn that he was taken advantage of. I hope the family is doing better today.",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Firstly I feel for d-man massively. \nTo be trapped inside your own body must be horrible. \nThe family seem to pick and choose what fits their own narrative. \nHe chose what to be called. So he remembers very well.\nHis brother said he “can’t wait to kick back and have a beer” d-man replies as his brother said I like red wine. \nSo he has the ability to choose what he does and doesn’t like and can clearly understand what is being said to him.  \nThe family are clearly loving and only want the best for him. But that being said they are extremely over baring and only seeing him for what the doctors say over even their own experience with him. \nI hope one day he’s allowed to find love ❤️",
    "date": "2025-02-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Wow.  Didn't expect this movie to go this way.  From all the reviews it looks like most people side with the family.  I'm not so sure. According to the mother and the girlfriend... at one point the girlfriend asks him what he wanted to be called.  He said D-Man. The mother then confirms that this was the name his previous teacher called him.  That tells me he was able to communicate. Also, the mother put him on medication because he master bates???  So he does have sexual urges and obviously wants what all adult men want, but his Mom wants to be the only one and puts him on medication?  IDK.  I feel sorry for dude.",
    "date": "2025-01-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A fascinating story about a man without a voice and his ability, or inability to communicate - it depends who you ask.",
    "date": "2024-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I might be the first person who actually has cerebral palsy to review this documentary. Maybe not, but it definitely affected me more deeply and viscerally than most able-bodied viewers, I think. I would like to see more disabled people's opinions. I believe this story is about transference. While I absolutely think that Derrick deserves the right to a loving relationship just like anyone else, and that Anna may have believed she loved him, she was unfortunately in a position of power over him. I don't see it as very different from those stories of teachers taking advantage of students. Maybe if she hadn't been his ALREADY MARRIED TEACHER, this might have been more acceptable. I was very uncomfortable watching this, because I know that he is trapped in his own body as I am trapped in mine. I was also bothered that they didn't even TRY to get Derrick's perspective, and that his family considers masturbation a deviant behavior seemingly just because a disabled person is doing it. He will probably never have another shot at a romantic relationship, what do they expect him to do? Able-bodied people's tendency to infantilize those of us who struggle with what comes naturally to them is infuriating. This doc left me with a lot of uncomfortable questions.",
    "date": "2024-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is definitely a must see if you take care of anyone with a disability, or have a friend or family member with a disability. I can see this movie as leaving a people with mixed thoughts. You might be disgusted or happy about this movie.",
    "date": "2024-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "It's really tough and sad to watch but at same time its very good documentary. The only thing i have to say is that i don't agree on both sides one, if Anna wasn't married and like Derrek in a relationship i thought parents would been ok with that but nope in that nature. Not only Shes married but having affair by sex with him that he is over 30 years old and mother and brother against it. End up in prison for Anna but it won't matter because she out of prison early and got parole. What sad is derrek really like anna because they have a bond together and help derrek to communicate better because of her! Two, I disagree with Derek's mother nor brother about Derrek will never going to be independent because of despite of the disability for her mother has power over Derrek decisions. Lets not forget putting on Derrek medication over masturbation. Do you think that's what's best for derrek by  mother and brother to make a good choice for derrek no!",
    "date": "2024-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Really well done! Shocking, and riveting. I never heard of this story before, and they really covered the complexities well. I highly recommend this documentary.",
    "date": "2024-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie was an interesting one. We finished it 15 minutes ago and I'm still in shock and disbelief. Just like the other comments, I'm torn. I like to think I'm an open-minded person and look at different viewpoints before making a decision. I completely agree with other reviews. I think Anna was unhappy in her marriage and used Dman as a way to turn him into someone that loved her the way she wanted to be loved. Do I think she loved him? Yes. Do I think he loved her? No. What really got me was when no one else could really validate or confirm the intellect she was referring to. I understand that we want someone to have a voice who doesn't and I think she truly believed in that process. Do I think that Dmans mom was a great mom who did what she could to protect and love her son? Yes. But I do think she may have held him back or potentially could be holding him back from things he could be doing? Also yes. If he truly had the intellect of a preschooler than there is only so much you can do. What I'm still stunned about is when Dman was attending a class and they had the lady who was helping him with a report and he read the book, she didn't, and he told her what or how to write about the book? If that was the case, that was someone other than Anna that can vouch for his understanding of things. I wonder how many studies or tests they actually did on him to determine his level of intellect. I feel like if he could actually type so eloquently, his family would know. Or she would show them or something. I'm just blown away.",
    "date": "2024-06-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This is extremely disturbing, and happens more often than people realize. This can be a traumatizing watch, as you can't close pandora's box, or not see after you've seen, so caution! and something for adults only, fer sure. Let's hope the (now forced-into-retirement-) professor is in therapy, as she seems to need help thoroughly processing what happened; not only naive, (& perhaps additionally disturbed as her husband at the time described-) but her perceptions seem way off also, like someone with erotomania. Very sad all the way around, and i agree with the reviewer re medicating someone for masturbating? How about just having patience teaching them to only do this in private (or maybe medicating only when such individuals would be around others, and havent grasped the \"private\" concept yet?) Extreme viewer caution with this one; you will be forever changed..!",
    "date": "2024-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It is a really gross story.  A little too long to not hear more about what the hell is wrong with Ms. Stubblefield.",
    "date": "2024-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "So an interesting watch like a few others here have said you have to go in with an open mind. \nPersonally, I do think the family are controlling and although i understand some of their views I don’t agree with them. I think Anna was naive but I do think she did true to her word did care about Derick. As for the mum saying we had to put him on medication for showing sexual behaviours? Get a grip! it’s totally normal and healthy. Sad to think if he did really know what he was saying and doing the family have swiped away any chance of happiness for him on that front. I like to believe he did know what he was saying and doing personally and believe just because you cannot vocalise doesn’t mean you don’t have a voice.",
    "date": "2024-06-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "really well done; i'm honestly not sure what I think. i can see & understand both sides & no matter which way you look at it, it's a sad story.",
    "date": "2024-06-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I honestly watched this in shock. I want to believe Dman is not a victim and capable of understanding and knowing what he wants and can make informed decisions. However, by looking at him, and hearing that others haven't experienced the intellect she sees in him, I cannot see how this could be the case. Im aware that sounds shallow but, he needs help with everything. Feeding, washing, toileting, he can't even keep his mouth closed. His face appears bruised because he hits himself?? We are supposed to believe he's in love with his mentor, teacher, a professor and and having consensual sex. No. She should still be in prison.",
    "date": "2024-06-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Depending upon whether you believe in Facilitated Communication (FC) or not, you will come to see DMan/Derrick as a victim of sexual abuse or as man who almost becomes a thinking, feeling sexual person who is denied that by his family. Or abused by Professor Anna.\n\nHard to watch in some places and surely there are more victims in the film, as in all of the main characters, Derrick's family, Anna's family, the expert they call in for the trial makes his points. There may have been more that could be done to figured out whether FC is a complete hoax, perhaps a well-meaning  hoax but a fraud on people locked into their own minds by cerebral palsy  or other diseases.\n\nSad and confusing but that is science: no easy answers and sometimes no answers at all. Thought provoking in the extreme but a deeply saddening film with great access to all the main people involved.",
    "date": "2024-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Deeply thought provoking, such conflicting sides. Wish there was more!!",
    "date": "2024-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Just when you thought you had an idea of insanity….. prepare to go and get stuck down the 🐇 🕳️",
    "date": "2024-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Intriguing. Disturbing. \nAnna made some valid points about the importance of disabled people having their own voice. Sadly she didn't see how delusional she was becoming in her relationship with this man. How delusional she still is after all this time.",
    "date": "2024-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The professor was depraved. She was delusional and pushing her own romantic ideals on someone who had not known these things before her. The professor had no right to awaken desires in someone who had been entrusted for help. I wonder if this was some sick fetish. How would one ever know, if he would have desired someone else had she not undressed in front of him? It was very sad to see the mother cry about, the assault of her son. Any mom would protect her child at all cost.",
    "date": "2024-06-19"
  }
]