[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A worthy sequel to Accountant 1. Maintains your attention from beginning to end and has a most satisfying ending.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I like this better than the first one.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Here’s what I’ve learned: Rotten Tomatoes finally joined the hotel-review scam club, because there’s no universe where this movie deserves five stars. The first one was okay — good, not great. But this sequel? It’s so terrible and so ridiculous that we literally started laughing because we couldn’t figure out what the hell was going on. The movie itself didn’t even know if it wanted to be a comedy or be serious.\n\nI’m still in shock because the movie is just horrible. The acting’s bad, everything’s bad — and honestly, it’s not even about the acting. The story feels like the writer was on some type of  strong drug when he typed this script.\n\nSo here’s the honest review: from now on, when you read ratings, only trust the people who didn’t give five stars. There’s no way this was a five-star movie. It’s a solid two-star mess with a whole lot of problems.\n\nThank you for your time. Thats my feedback.",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I thought it was a pretty fun watch.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie! It's improved a lot, and I like the sort of comedy about these two brothers. Can't wait to watch the trilogy in the future.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This sequel was great.  The developing relationship between the brothers is endearing to watch and their banter has some really comedy.  Looking forward to the last of the trilogy in future.",
    "date": "2025-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best written movies.",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Eu sou completamente a favor de experimentar algo novo, diferente e inesperado em sequências, mas esse risco nem sempre resulta em gol. Nesse caso, por exemplo, foi uma bola fora. \"O Contador 2\" transforma o universo criado no seu antecessor em uma buddy comedy — algo que, em qualquer outra ocasião, poderia ter sido divertido, pois Ben Affleck e Jon Bernthal são ambos atores verdadeiramente engraçados e compartilham de uma boa química —, mas o resultado é algo, simplesmente, destoante demais do filme anterior. E ao final do filme, eu fui deixado com o amargo sentimento de que o interessante universo criado pelo filme original foi apenas desperdiçado em uma comédia genérica e facilmente esquecível.",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Severe lack of corgi",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Not terrible for a sequel, but not anywhere near as good as the first movie. Often times slow at random points which were unrelated to the plot development. There were some pretty funny scenes between Affleck and Bernthal. I’d give it a 70% rating overall.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A sequel crowd-pleaser that extends the gimmick across another 132 minutes of Rain Man meets Equalizer, but Affleck’s performance as Christian Wolff seemed oddly affected.  \n\n… More so than the first.  Weird.  Like his character had a stroke.  Please tell me I didn’t miss that plot point.",
    "date": "2025-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This feels like fanfic about found family with the two brothers and the detective. The villain is laughable and the main characters are different from the original. Also there was no accounting done to figure anything out. The kid hackers were overpowered and it ruined the story for me.",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very rare that the sequel is better than the first film. Great twists and turns and amazing family dynamic. Despite the violence, it’s very funny in parts. Excited for a possible 3rd installment.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The Accountant 2 is a perfect balance of humor, action, and intellect. There are parts of the movie that feel heavier, but then it shifts to more light hearted moments rather quickly. However, it is not too extreme. Ben Affleck and Jon Bernthal are a dynamic cinematic duo.",
    "date": "2025-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The Accountant 2 (2025)\nGreat Sequel\n(11,982 – 11 Oct 2025 – by Claudio Carvalho)\n\nIf you want to read my review, visit my blog. RT mysteriously did not publish it and I refuse to change it. I do not understand why. \n\nMy vote is seven.\nTitle (Brazil): “O Contador 2 (“The Accountant 2”)\nMy Blog: https://maniacosporfilme.wordpress.com/",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie is horrible compared to the first. The great Christian Wolff, who was a lethal and stealthy genius, is now brought to slums and portrayed as a pathetic dork. His brother Braxton, who was like a ninja is now portrayed as an over aggressive jerk. The storyline is incongruent, has an excessive amount of redundancy, and instead of being an amazing triumph is more of a failed attempt at a mixture of comedy and action. I would not recommend this movie for those who appreciate good films.",
    "date": "2025-10-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This film is very disconnected from the first in terms of tone. Does this film want to hold on to the seriousness and intensity of the first film or does is want to be a buddy action comedy? It has moments that are genuinely funny, but most of this story is far-fetched and unbelievable. Additionally, it makes giant leaps and is slow where it shouldn’t be.",
    "date": "2025-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The first Accountant stood out because it felt original. It wasn’t just another action thriller — it leaned into autism as the central framework for Christian Wolff’s character, showing how his worldview shaped his skills, his discipline, and even his capacity for violence. The film was at its best when it treated his neurodivergence not as a gimmick, but as a way of building tension: how does someone who processes the world differently navigate both spreadsheets and shootouts? That uniqueness gave the first movie its hook.\n\nThe Accountant 2 throws that originality out the window. Instead of deepening Christian’s inner world, it waters him down. His autism, once core to the story’s tension, is now played for quirks, awkward laughs, or “superpower” shorthand. The complexity is gone, and with it, the sense of authenticity that made the character compelling.\n\nThe sequel also drowns itself in excess. The plot crams in conspiracies, human trafficking, assassins, hacker teams, and family drama, but the through-line is lost. Where the first film was focused and character-driven, the second feels overstuffed and unfocused. Tonally, it’s all over the place — veering between grim thriller, buddy comedy, and sentimental drama. Instead of sharpening the story, the constant genre-hopping undercuts the stakes.",
    "date": "2025-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The story is a bit messy, there are segments that drag and it feels more generic in comparison to the first, bu The Accountant 2 still manages to be an entertaining film boosted by its clear-cut stakes, well-crafted action and the terrific chemistry between Ben Affleck and Jon Bernthal.",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Definitely better than the first. Easier to follow. Jon Bernthal is great as the bad brother.",
    "date": "2025-09-26"
  }
]