[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I Guess Ice Age 5 Might Be Good Sequel In My Opinion, So Am I Gonna Rate It 10/10? Yes, I will!",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Not bad, but not the greatest either",
    "date": "2025-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "THIS IS ABSOLUTELY 💯 AMAZING",
    "date": "2025-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Did not like this movie at all. It has great visuals but almost nothing else to it. I really hope they do good on the next one.",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "THIS IS ABSOLUTELY BETTER THAN THE BUCK WILD MOVIE",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Look, every story has to end somewhere, and sometimes the ending is… well, it’s not the best. Ice Age: Collision Course is, to be blunt, the worst one. It feels like they were running on fumes and just threw everything at the wall to see what would stick.\n\nThe entire plot is kicked off by Scrat, who, in his eternal quest for an acorn, accidentally sets a massive asteroid on a collision course with Earth. The whole herd has to team up to stop it, which brings them to a bunch of new locations and introduces a lot of new characters that just don't hit like the old ones did. It's a big, loud, messy adventure that feels more like a cartoon special than a real movie.\n\nThe energy and heart that made the first few movies so great just aren’t there. The jokes feel forced, the plot is all over the place, and it’s a hard time trying to care about what’s going on.\n\nBut, you know what? It wasn't all bad. The one saving grace of this movie is that Sid finally gets a girlfriend. After all the chaos and loneliness he's been through, it was nice to see the homie find some happiness. It’s a small win, but it’s the only real good thing about this one.",
    "date": "2025-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Increíble peli %84🍅🫐",
    "date": "2025-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Stupid and unfunny, Ice Age: Collision Course is the worst of the 5 films, well the worst of the 6 films actually, because of how bad it actually is! The story is completely stupid, the characters are all idiots, the comedy is crap, and tone is horrible, but the animation still looks pretty good, the voice acting is solid, the visuals are great, and the John Debney's musical score is okay. But overall, the 5th installment of the franchise sucks!!! Do not watch this movie!!!! Because it's so bad, and I think it's worse than Norm of the North!!! I hate this movie!!!! 🚫🤬",
    "date": "2025-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom, só o esquilo ajudou um pouco no filme.",
    "date": "2025-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Il secondo miglior film dell' era glaciale",
    "date": "2025-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Everybody's least favourite out of them all, but it is not unwatchable.\n\nTo start off with, it has reduced in quality of what its predecessors brought out, like some of the gags are kind of stupid such as Buck Wilde treating a little pumpkin as if it was his own child or Crash & Eddie randomly saying \"hashtag\" which was those trendy things (even they did not know what it meant).\n\nParts of the characterization was a bit bad, Manny being overprotective of his daughter when she is about to marry Julian - Julian was not horrible, if only parents found it easier to let go, TYPICAL!\n\nPart of it was out of this world: like Scrat was stuck in a spaceship & fell out to space, you would not get anything like that, would you?\n\nBut, my favourite part out of the movie was Brooke/Jessie Js song \"Superstar\" which really rounded up the whole of it.\n\nDo not complain about its existence, you always forget it is going to happen anyway.\n\nNow, how is Ice Age 6 (2026) going to work?",
    "date": "2025-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What are you all thinking?!!!!!!!!!!!!!!!!!!!!!!! I love this movie!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-05-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I just feel like it’s just that the are milking the living crap out of this series and it’s just soo corny and peaches boy friend has got to be the most annoying character on any ice age movie. I mean there were good parts of it just overall it’s not that good.",
    "date": "2025-05-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Ice Age: Frick!",
    "date": "2025-05-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This is the franchises turning point: from mid to straight-up garbage. The first movie was about a trio of animals returning a human kid to its' tribe. In this movie, the herd (+10 characters) tries to stop a FREAKIN ASTEROID HITTING EARTH. Not to mention, the asteroid is caused by SCRAT. Scrat creates the solar system!!! This is so stupid, but not in an amusing way! Most of the characters in the herd are just so annoying, stupid, flat and dislikeable they're unwatchable, others are sidelined so hard (Diego) they have like 5 lines. This movie is garbage. COMPLETE GARBAGE.",
    "date": "2025-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Characters are funny but doesn't feel like an Ice Age movie.  Corny",
    "date": "2025-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Actually kind of good don’t know the fuss, it is a bit of the same again at times though. I do like the theory of every ice age story is backwards lol. Scenes get boring, hope Ice Age 6 is a breath of fresh air and not the same old movie again",
    "date": "2025-04-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Horrible horrible movie. Don’t watch it. Also I heard that Disney is making a 6th one, oh god.",
    "date": "2025-03-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Peggior film dell'era glaciale",
    "date": "2025-03-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Trash movie, Peaches husband was the most unbearable annoying character, added out of nowhere",
    "date": "2025-03-06"
  }
]