[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Dejando de lado q los efectos prácticos han bajado un poco de siente algo nuevo, más sanguinario, más acción, los personas muy buenos y con buena sinergia",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I just love getting themes beaten over my head repeatedly and having films just have no idea what to do with them. Now I have brain damage.",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas de terror são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A return back to a entertaining action filled thrill ride. Kind of feel like The Purge is turning into the fast and furious of this genre.",
    "date": "2025-04-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Right on par with the previous few.  Not terrible but not special",
    "date": "2025-04-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Like its predecessors, The Forever Purge follows a familiar storyline – once a year for a twelve-hour period, Americans embark on a government-sanctioned crime spree.  However, this time around, the mayhem continues beyond the final buzzer as the Purge Purification Force attempts to exterminate those who they judge not to be ‘pure’ Americans.  Filled with a seemingly non-stop barrage of blood splatter and pyrotechnics, those who enjoy non-stop barrages of blood splatter and pyrotechnics will no doubt get a kick out of it.  Those who prefer something a little more sedate should look elsewhere…or maybe just settle for the original The Purge (which is actually pretty decent) and accept the fact that all that follow the first instalment are pretty much the same and probably don’t require viewing.",
    "date": "2025-03-31"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Contrived, confusing, idiotic and harebrained this mind numbing exercise in  incomprehensible tedium has no idea what it it wants to say. This is the least suspenseful and scary of the Purge films and is poorly directed with bare minimum effort. The messaging is ham-fisted when it isn't puzzling and the actors range from mediocre to terrible. The female lead does a decent enough job in her role but she too is poorly written just like everybody else in this film. This film is a catastrophic waste of time and a new low for the horror genre as a whole. Don't fry your brain cells watching this incompetent trash.",
    "date": "2025-01-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "While I enjoyed the first three Purge films and disliked \"The First Purge,\" I didn't have high expectations for this latest installment, and unfortunately, it was disappointing. The first half was lackluster, and the second half was overly predictable. It was clear that the Mexican character, who fell in love with the American guy's sister, would be killed. Additionally, during the climax, when they ran out of ammunition, they were hiding behind a bus in an open field and still managed to escape, which seemed unrealistic. Overall, the movie didn't bring anything new to the table, and I wouldn't recommend it.",
    "date": "2024-12-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Enjoyed it for what it was but nothing especially bad or good.",
    "date": "2024-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Direção: Ok\nAtuação: Ok\nRoteiro: Ok\nCaracterização: Ok\nSoundtrack: Ok",
    "date": "2024-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "By far the best in the franchise, they tried something new!",
    "date": "2024-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Easily my favourite Purge movie. It takes an timely themes and is not subtle at all (like good dystopian movies) and director Everardo Gout (Banshee, Luke Cage) brings a lot of personal experiences to the film",
    "date": "2024-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Was great. Much better than The first purge.",
    "date": "2024-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It was bad film to the franchise",
    "date": "2024-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Pretty obvious where this franchise is going, but good to see how violence is politically motivated theme.  Kinda glad that this is clearly shown.",
    "date": "2024-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I like the Purge movies. I can't remember a damn thing from any of them, but they were exciting none the less.",
    "date": "2024-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Maybe it's because I watched it immediatly after the First purge and that just made it infinitely better.\nHave to admit they cooked here both with action and characters and the acting.\nThe only complain I have about it is that the dialogues kinda suck.\nBut you can't beat Election year,you're perfect,no one will ever get where you are",
    "date": "2024-06-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Direction is just not worth praising. The series seems more low-budget than ever before. Although all these movies have been successful so far, it's unrealistic to expect any of the profits to go anywhere other than Blum's wallet.",
    "date": "2024-03-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Like all sequels it's predictable but I personally really liked it",
    "date": "2024-03-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The Purge Goes Global: A Wildly Entertaining \"Forever Purge\"\n\n\"The Forever Purge\" takes the franchise to a whole new level, ditching the single-night format for a relentless fight for survival in a world gone mad.  This final installment delivers amped-up action, social commentary with a punch, and a surprising amount of heart. \n\nEverardo Gout's direction is sharp and stylish, creating a constant sense of danger and paranoia.  The film throws our heroes, the seemingly ordinary Juarez family, into a desperate struggle against a new breed of purgers – those who believe the purge should never end.  The cast shines, with Ana de la Reguera and Tenoch Huerta bringing fierce determination and relatable vulnerability to their roles as Adela and Juan. \n\nWhile the action is relentless, the film doesn't shy away from its core themes.  The concept of a \"Forever Purge\" acts as a chilling metaphor for the rise of extremism and the dangers of unchecked violence.  The film cleverly explores themes of immigration, class warfare, and the fight for a better tomorrow.\n\nBeyond the action and social commentary, \"The Forever Purge\" also surprises with its moments of genuine connection.  The bond between the Juarez family and their unlikely allies forms the emotional core of the film.  These moments of humanity amidst the chaos make the fight for survival all the more compelling.\n\nThis isn't your typical Purge movie.  It's a wild ride with a bigger scope, a more desperate fight, and a surprising amount of heart.  \"The Forever Purge\" is a worthy send-off for the franchise, leaving audiences breathless, exhilarated, and pondering the dangers of a world that embraces violence.",
    "date": "2024-03-24"
  }
]