[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A complete success for the whole family!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Es de las mejores peliculas de fantasia-suspenso que he visto sinceramente no hagan caso a las malas reseñas denle una oportunidad",
    "date": "2025-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Perfect if you like fun, dark fantasy. Loved seeing Ritter in this role! This movie lived up to what I wanted it to be.",
    "date": "2025-05-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Masterpiece that everyone should watch",
    "date": "2025-03-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is now on my favourite movies of all time list. Such a whimsical and spooky kid friendly movie. The actors were all perfect. I was engaged the entire time and wasn’t bored once. This film also has a very unique concept and the costuming for Natacha was divine as well as the set design. Perfect for a cozy, moody, spooky movie night!",
    "date": "2024-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great family movie, finally a scary kids movie that is scary. Hoping for a sequel.",
    "date": "2024-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A boy who loves writing horror stories decides to quit after having his hobby disparaged by his peers.  After being captured by a witch, however, he is forced to tell more stories for her.\n\nBacked by strong performances, especially from Ritter, this is an imaginative film that respects both fairy tales and horror.   It does skew to a younger audience.   I loved the set design.",
    "date": "2024-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Ritter alone keeps it working.",
    "date": "2023-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I didn't really know what Nightbooks was when my daughter suggested we watch it. However, when my wife mentioned that Sam Raimi was involved with it, I figured it was worth a shot. This movie is made for older children, so the plot is pretty simplistic, but where it really shines in the visuals. It's dark, yet colorful, and the style of the storytelling keeps you engaged. It also manages to sneak in a few genuinely creepy moments that were fun for me, but maybe a little too intense for my youngest children. Nevertheless, Nightbooks was a pleasant surprise. I may have to read J.A. White's book now.",
    "date": "2023-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a modern day Hansel and Gretel with a sprinkle of 1000 Arabian night where the nights are scary stories. I was suspicious about this title because it's a PG movie and normally those are not scary at all. Nice surprise! This one was not completely scary but the story was actually pretty good ! Highly recommended. 10/10 on Netflix forgot to mention that that girl that plays Jessica Jones is on it",
    "date": "2023-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It's nothing new in the area of plot, and at times, the movie doesn't really know what to do with its characters, but \"Nightbooks\" is a reasonably solidly crafted introduction to surprisingly effective horror for kids.",
    "date": "2023-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Kind of messy at first but it gets better towards the end",
    "date": "2022-12-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Rating: 7/10. 70/100",
    "date": "2022-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was a very cleverly done movie for a younger audience. My daughter who is 15 absolutely loved it. She wondered if there was going to be a part two, if it was going to be a series. I enjoyed it right along side her. Some interesting twists with fairy tales told in a different way. Highly recommend 😄",
    "date": "2022-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Whilst not adult level scary its quite scary if kids are the target audience! Entertaining if a little straightforward however the three leads are all great.",
    "date": "2022-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Didn't know what to expect going into this, but while there isn't much that'll get you excited while watching this, it does have a fairy tale vibe but with a kind of twist. Not everyone will like this film, that's for sure.",
    "date": "2022-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "There are some really terrifying scenes but only once it feels like it goes too far for a younger audience. The near-perfect technical side of the production is only let down by some unconvincing cat CGI. Acting was excellent. Really great casting. Love the story and how it was told. The creative side of the production was only let down by some uneven pacing in the first half where it occasionally lost our attention. This is a great family horror, if you can take it! I loved the subtle The Evil Dead (1981) references.",
    "date": "2022-02-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "3 out of 5 stars. Fair family horror film that takes a different spin to a Hanse and Gretel concept with a young boy and girl trapped in a witch apartment. Which she is keeping them alive only to be useful. Boy is supposed to write scary stories and girl try to keep the place clean. While they both plot to escape. Kristen Ritter looked like she she had fun playing the witch. The kid actors are decent with there performances. The plot is cheesy. The visual effects are okay. Humor is okay except for a invisible cat going to the bathroom which is played for laughs but feels forced. Cry Little Sister has a couple of iterations which was a fun add on. Entertaining film that kids and adults will enjoy.",
    "date": "2022-01-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This actually ended up being quite different to what I had expected, which I think was somewhere along the lines of a goosebumps style horror anthology with reasonably crafted characters and center story. The result actually ended up being mainly focused on the initial story and characters, with very little of the read stories even being shown. But this ended being a for the better in some respects, as we got a great sense and depth of the characters and environment. The overall all tone is more or less family friendly, but damn does it push that factor, and I certainly respect it for that also, I mean it's not easy to make a family horror that comes off as being genuinely horrific and sinister in tone. The throw back to classic children's stories is also a nice touch, especially given how the tale focused on would be always be shown in quite a padded way, but obviously originally started as being something quite nasty, which is kind of reflected in this film.",
    "date": "2022-01-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This movie really picks up in the second half.",
    "date": "2022-01-08"
  }
]