[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Good movie with lessons about dealing with change.",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "As far as cartoons go, this one isn’t too bad. Plot is ok and so are the characters. A few jokes along the way. Watched on Amazon Prime.",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie rhymes with Grug",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Grug is the Goat bro",
    "date": "2025-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I Call It Absolute Cinema!! Rhymes With Grug.",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Esse filme proporciona diversão garantida, enquanto transmite uma mensagem secreta e um filme ambientado na Pré História!",
    "date": "2025-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I have watched it again and again. Such a fun and unique story. The character dowsing is fantastic too.",
    "date": "2025-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The Croods takes the prehistoric family comedy formula and wraps it in vibrant, inventive animation. The result is watchable and occasionally funny, but it leans too heavily on slapstick and clichés to feel truly fresh.",
    "date": "2025-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Filme divertido para assistir com familiares",
    "date": "2025-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very funny, highly entertaining and fast paced. Sharp witted and adventurous. Superbly brought to screen by Christopher Sanders. Beautifully written and executed. Whole cast really suits their characters perfectly. Lots of action, adventure and some very original ideas. Loved it, a fun watch for whole family",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is one of my favorites because it's very funny and incredible. An important aspect of the movie is that it shows the unity of the family, how they support each other through problems, and that at no moment is anyone alone.",
    "date": "2025-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "CARLOS MORENO \nI really enjoyed The Croods because it’s a fun and heartwarming movie. The characters are unique and lovable, and I liked how the story shows the importance of family, change, and working together. It’s full of adventure, humor, and colorful animation that makes it perfect for all ages",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The Croods are, to put them in one word...crude.\n\"They're practically animals\", as Guy puts it, and I think he's truthfully right about the titular family and the film itself. It is a crude film. A lot of physical crudeness, such as shaking people to make fire (which doesn't work well) add to the idea of this film being, well...crude.\nBut anyways, this film was pretty good. We have some good music by Silvestri, even if it's mostly copying the song 'Shine your way' in the end credits; some beautiful animation that is sometimes hyper-realistic (or almost); a pretty good plot; and of course the characters themselves, the Croods.\nThunk is possibly the funniest of the cast, though Belt follows close behind. Eep is the rudest, especially to her father, until her personality changes and she sort of shows her respect for him by the end. Guy is...well...Guy, and Sandy is savage. Gran is the stereotypical Gran minus the part where she tries eating people, Ugga the somewhat frustrated mother, and Grug the overprotective father. So, we have quite a clash of personalities here.\nPerhaps, besides the stars scene, my favorite part is the ending, where Grug finally gets his idea, and flies to tomorrow. If you don't know what 'flying to tomorrow' means, then go watch the film. I recommend it, even if it's not perfect.\n\n\"Dun dun dun…\"",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best Stone Age themed movies ever.",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It's a fun and enjoyable animation. It's a family movie that you might like.",
    "date": "2025-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is just one of the greatest animated films of all times, I am 15 and have always loved this movie, it’s just iconic",
    "date": "2025-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "An interesting movies and fun. 2watch",
    "date": "2025-06-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I absolutely love this film, I’m glad it’s getting attention again.",
    "date": "2025-06-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I call it a film, cause it rhymes with Grug",
    "date": "2025-06-12"
  }
]