[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Cool movie, watched it after seeing the 2nd. Very cool the Amell brothers get to work together.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Parts sci fi, part gangster movie. Decent in both parts",
    "date": "2025-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "In the future , 4% of the population has powers. Connor has the power of electricity, however to get a license to work using the powers is very expensive. He is struggling to make ends meet, while having a mom with a terminal disease. Story line is cool and it has come good twists but at the end it’s just an average super powers movie 🍿🍿🍿/5 on Netflix",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "First off, I thought the two lead actors look like they could be cousins and so it was a weird casting choice to have them not be related in the movie. Well, it turns out they literally are cousins. Okay.\n\nThe movie's fine. Even good, I guess. The world they built is cool, and I wanted more of that: the politics, the cultures, the socio-political landscape. I wanted a bigger scope, which is the kind of thing I usually want from sci-fi. Show me what the governments are up to, whether the police force is corrupt, stuff like that. In a dystopian world like this, you just know there's a lot more happening than the smaller, emotional, familial story they chose to tell.\n\nThat story, mother and son, is kind of rote, and it wasn't even executed all that well. I found myself not really caring. Robbie Amell didn’t sell the emotion for me, maybe because his character was making shady choices, which is harder to connect with.\n\nThe special effects were good, the class-based powers were interesting, but overall it felt like two movies smashed together. The first half worked better. It had world-building, newsreels, learning about powers, the drugs, the syndicate. The second half, with the son desperate to save his mother, was much smaller in scope, and I just wasn’t into it. The pacing really dragged there.",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I am writing the review whilst still watching it! I am that disengaged and bored. Predictable, I am afraid really nothing new. I would like to say something nice but I can't think of anything positive about this film.  It sometimes has nice camera shots that reminds me of District 9 that's pretty much it. Is it really only just over an hour and a half 😲",
    "date": "2025-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Watchable trash. Quite boring at times for an action thriller about mutants with super powers - I was fast forwarding certain scenes by the end. Mildly charismatic performances by several actors is probably the only positive thing I can say about this movie. Weird tone shifts between the mutants doing “badass” stuff versus trying to make the audience care about the plight of side characters we’ve spent about 3 total minutes of screen time with. Lots of telling not showing to rush through the extremely contrived plot (the movie is mercifully brief), plot threads that go nowhere left and right, nonsensical character motivations. Those with fully functional brains should steer clear.",
    "date": "2025-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Calm watch! The plot was interesting and held my attention. A cool weekend watch!",
    "date": "2025-04-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was awesome! The story was compelling and the visuals were amazing. I highly recommend it for superhero and action fans!",
    "date": "2025-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "stupid movie DO NOT SEE",
    "date": "2025-01-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "No bad, but had the potential to do more.",
    "date": "2024-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Pretty good budget sci fi. We lack good action high concept sci-fi without unfunny jokes like this one",
    "date": "2024-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A gritty dystopian movie that teaches a lesson on human nature.",
    "date": "2024-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The story is interesting and the theme very dystopian, but somehow it feels rathee realistic. \n\nThe acting of the Amell cousin however is terrible, and I don't know how he landed that job other than being Stephen Amell's cousin, sorry. His acting was borderline cringe.\n\nThe rest of the cast did good, the writing is okay (the cliché of good cop/bad cop I hoped had a certain meaning but it is way too cheesy).\n\nBut I appreciate the effort and idea of the story.",
    "date": "2024-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Good enough entertainment",
    "date": "2024-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a good movie",
    "date": "2024-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's a well crafted movie. Enough to keep you interested and not too predictable.",
    "date": "2024-04-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Enjoyed the change of pace. A powers story more about the people and world building than the action which was decent",
    "date": "2024-04-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Gritty dystopian world for certain people only. Draws parallels to some of the disenfranchised groups of today's world too. Badass robots.",
    "date": "2024-04-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "CODE 8 is a competent sci-fi indie that does a decent job of building a gritty, unique world for its story, even if the plot itself is a pretty basic crime setup. Committed yet perhaps a bit over-serious, the film offers quite serviceable if ultimately forgettable streaming fare.",
    "date": "2024-03-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This sci-fi movie was great. Robbie Amell, Stephen Amell, Sung Kang, Greg Bryk, Kyla Kane, Kari Matchett, and the rest of the cast did a great job in this movie. The plot of the movie was dramatic and thrilling. It's about doing whatever you can to help the people you love, even if you have superpowers. If you haven't seen this movie yet, check it out sometime. It's worth watching.",
    "date": "2024-03-24"
  }
]