[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "An interesting companion piece to the similarly titled Jeffrey Epstein documentary.",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This documentary about Ghislaine Maxwell is too short to go in-depth. I don't get much sense of her character. She is probably a psychopath. It seems like she just thought Jeffrey Epstein's sex crimes weren't a big deal, and her participation was all in good fun. The documentary does a convincing job persuading the audience of Maxwell's culpability in Epstein's crimes. Without her recruitment and confidence games, essentially \"grooming,\" Epstein couldn't have victimize nearly as many girls. She was more than an enabler, she was an active participant. Very creepy stuff.",
    "date": "2023-03-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "As \"Ghislaine Maxwell: Filthy Rich\" (2022 release; 101 min) opens, it is \"August 10, 2019\" and Jeffrey Epstein has just committed suicide while in jail. The immediate question: where is Ghislaine Maxwell? 18 (!) months later, she is found in New Hampshire and immediately arrested on multiple criminal charges. At this point we are less than 10 min into the movie.\n\nCouple of comments: this is a sequel or companion release to 2020's \"Jeffrey Epstein: Filthy Rich\", which I have not seen (I really don't want to know any more about that guy than I do). But when the same film makers announced this project, my interest was a little peaked: what had possessed this woman, at one time Epstein's partner, to become a relentless recruiter and groomer of young (many underage) girls to provide to Epstein? This film goes into that issue at length and offers some possible explanations. Along the way, we also hear from several of the victims themselves, and why events some of which happened as long ago as 25 years continue to haunt them. Most tellingly for me are also a number of Maxwell's acquaintances from back in the day, and the bizarre behavior she showed even then. Several of the victims state that Maxwell was in fact worse than Epstein. Most importantly, one of the victims, when asked her reaction after Maxwell's conviction, observes: \"We've finally been heard\". Very true. How is it that these terrible people were able to do what they did for DECADES, despite the numerous complains by the victims as early as the mid/late 1990s? Just shocking. Bottom line: this documentary provides a very sobering, if not outright shocking, look at a socialite who decides to become a child trafficker, all to please her (ex) partner...\n\n\"Ghislaine Maxwell: Filthy Rich\" premiered on Netflix in November. If you have any interest in learning why a woman of means decides to become a child trafficker and groomer, I'd readily suggest you check this out, and draw your own conclusion.",
    "date": "2023-02-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Unfortunately a familiar story, God bless the victims...",
    "date": "2022-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very interesting deep dive into the world of the uber wealthy and very connected circle of friends Maxwell had. The signs were on the wall well before the connection to Epstein. Sadly it seems she would do anything to please others without thinking of the damage it caused. Maxwell's life was one where what's right & wrong we're never set down. She's also a product of the elites she associated with as none of them blew the whistle when they noticed something wasn't right.",
    "date": "2022-11-25"
  }
]