[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Horrible acting. Horrible plot. Horrible ending. I could go into much more detail but I don’t feel this movie deserves that much of my time.",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Absolutely rubbish!!",
    "date": "2025-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "this movie 100% makes you think. wasn’t super terrifying or thrilling, but makes you uneasy and uncomfortable. it’s sad, funny (at certain times), and overall a little scary. the acting was great considering they had a lot of up-and-coming actors in this. overall, if you can relate to some of these subjects in this (abandonment, abuse, betrayal, not knowing how to identify) you will definitely love this movie.",
    "date": "2025-04-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Three words that for me help to sum up this hour and a half that I wish I had back are:\n\nDREADFUL.\nPREPOSTEROUS. \nYUK !!!!!!!!\n\n(ABHORRENT.\nIDIOTIC.\nand TOTALLY SHITTY come to mind as useful runners-up.)\n\n\nThere really ought to be a ZERO OUT OF 5 stars classification--or better yet, review values assignable in NEGATIVE STARS on Rotten Tomatoes for movies like this one.",
    "date": "2025-03-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Thrilling? No. Horrific? No, at least not in the way you want a horror movie to be. Uncomfortable? Yes, but I can’t quite put my finger on why. The ending deserves some recognition though, that was well done.",
    "date": "2025-01-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I always like to start with the positives so even though the cast is unknown to me, it is well acted and their are some decent scenes and a few twists and the first 20 mins offers some promise but overall the movie is a mess. I see the point it's trying to make but it moves at a plodding pace and it gets way too ridiculous to be taken seriously. In the end it's a waste",
    "date": "2024-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "\"The Strays\" on Netflix is a captivating and thrilling movie that will keep you on the edge of your seat from start to finish. The storyline is gripping, with unexpected twists and turns that will leave you guessing until the very end. The characters are well-developed and the performances are top-notch, drawing you into the dark and mysterious world of the film. The cinematography is visually stunning, adding to the overall atmosphere of suspense and intrigue. If you enjoy psychological thrillers with a touch of mystery, \"The Strays\" is a must-watch. Get ready for a rollercoaster of emotions and suspense as you dive into this gripping tale of secrets and deception. Highly recommend for those looking for a thrilling movie night on Netflix!",
    "date": "2024-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "6/10 #Recommended",
    "date": "2024-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Absolute waste of time. Terrible movie. Some would say that \"The Strays\" is one of the worst movie ever produced. I wouldn't say that, I would say that it's the worst movie ever produced.\n\nI was so bored during the movie that I've created account here just so I could review it.",
    "date": "2024-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It keeps you on from the first minute, it's definitely a must watch. Great ending.",
    "date": "2024-04-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Waste of time. Couldnt get in to the movie, never got me to care. Maby because first half I didnt know whats really happening, and is it real or in head. Ok acting gives half a star more. 5/10",
    "date": "2024-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "El final esta bueno, la hora y veinte que tenemos que atravesar hasta que llegue la ultima escena es bastante mala. Ni suspenso, ni terror, ni misterio, solo una sucesión de hechos que, por lo menos, tomaron la decisión de contarla por partes para que logre mantener algo de interés. Olvidable.",
    "date": "2024-03-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Nope, lowlife lowbrow gen xyz creation and old actors that must be desperate for work. Farrell and the rest need to just call it a day and go to the house. I won't be wasting anymore time when I see these desperate castings.",
    "date": "2024-03-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I Love will ferrell... did not enjoy this though . Mostly Fart joke humor and not captivating. You'll be reaching for your phone the whole movie...",
    "date": "2024-01-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie really fails socially and fails by sending a message like the movie was made for",
    "date": "2024-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "i did not enjoy  this movie. it was kinda funny at times but overall it had a terrible ending and it was weird",
    "date": "2023-12-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The Strays is a thriller that follows this woman who we first learn has a past that she's trying to escape from and this movie basically slowly informs us that past as it unravels and shows us the aftermath of the secrets behind this character who we know as Neve. I will be honest, this movie does start pretty slow at first as it seems Neve is hallucinating or is being driven insane by her past but when her secrets are revealed and we see the perspective of these other characters by the names of Carl and Abigail, the movie does get more interesting and suspenseful. The performances from Jordan Myrie and Bukky Bakray were really good, especially after the twist is revealed about their characters. Then, when the Final act starts, the movie really does shine and really keeps you invested as these two characters terrorize this family. The whole time you just start to really get disgusted at the main character now known as Cheryl as she's lied to her whole family, and then how the movie ends really has my jaw-dropped and it was just so nerve-wracking. Overall, The Strays is a pretty suspenseful thriller as the movie shines with the protagonist and the two antagonists while also giving us some gnarly visuals and the writing of some scenes I thought were clever and creative. The Strays gets a B-",
    "date": "2023-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's depressing seeing reviews of \"Strays\", an AMERICAN COMEDY about DOGS, here on \"The Strays\"... an ENGLISH DRAMA about ENGLISH PEOPLE.\n\nThese movies don't share anything, even THE CONTINENTS are different.\n\nThey may be so lazy to avoid reading, but there isn't a single dog picture on this movie page, and they were able to get confused all the same. Come on.\nSad, very sad.\n\nWhatever, Madekwe is great, I found The Strays quite effective, but a little too much self-indulgent and lost the grip towards the end; Martello-White knows the job, I'm pretty sure he will find a balance in next movies.",
    "date": "2023-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "More a drama about abandonment and neglect before irrationally transitioning into a home invasion thriller and picturing an unresolved cycle. Though layered, it's debatable whether that's intentional or it was lost whilst told aimlessly without a solid flow, therefore misleading and contextually insulting through a baselessly wrongful incompletion starring unlikable leads. (C)",
    "date": "2023-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The worts MOVIE. I ever seen. So stupid!!",
    "date": "2023-10-06"
  }
]