[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "'Love Is in the Air' is one I found to be surprisingly decent. Listen, it's cheesy/cliché and it's Hallmark-esque, but I actually minorly enjoyed watching it. The poster is a little misleading, it does feature a romance but I wouldn't say it's that type of romance; as in kissy/cuddly.\n\nIt's more a fish out of water sorta love story, where the leads gradually develop a bond; they don't even get romantic together until the very end. None of this is a spoiler by the way, you'd be able to tell within the first few scenes where the whole thing is heading - and that's OK, imo.\n\nThe main reason why I did like this is most certainly the cast. I wouldn't even say that they give major performances, but as a group I found them to be very likeable and I was happy to follow them onscreen. Delta Goodrem and Joshua Sasse have enough chemistry, to boot.\n\nRoy Billing and Steph Tisdell offer pleasant support, elsewhere. Another positive is where the story takes place - coastal Queensland, Australia. All locations look nice, that and the aviation angle of the plot made it feel fresher than it would've otherwise been - in, say, a big city.\n\nA pass in my books, for sure.",
    "date": "2025-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Predictable story line. But well filmed and beautiful setting",
    "date": "2025-06-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very uplifting movie. We need more of that these days.",
    "date": "2025-02-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely adorable movie. I loved it. Especially the characters and the scenery.",
    "date": "2024-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Uma versão feminina do filme \"Operation Christmas Drop\"'2020,  ou com inversão de papais, tão fofinho, bonitinho, gostosinho, romântico cozinha e com dramalhãozinho bonitinho quanto o outro… Podiam ter investido mais no dramazinho com o Ciclone tropical, mas foi apenas um subterfúgio para ponderar sobre a bondade do homem desconhecido, da comunidade unida e autruísta, com um desfecho forçado, mas tudo muito bobinho e bonitinho...",
    "date": "2024-04-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Beautiful Australian scenery, a fun, sweet story and the actress who plays BFF Nicki is a tremendous talent!",
    "date": "2024-02-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "your typical, predictable from first mins romantic movie",
    "date": "2024-01-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "30 mins in and I had to turn this off , the total cringeworthy acting and dialogue , make me want to throw something at the tv ! Pity as the scenes of the queensland tropics was lovely to look at , but I'd rather watch drone footage of Queensland than try and watch one more minute of the total mills and boon train wreck ! Don't even bother to try and watch it unless you want brain damage !",
    "date": "2023-12-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I thought the same as everyone else. Decent story told poorly. Production and the movie's story line was awful. Don't bother with this one it's not good.",
    "date": "2023-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It's a cute movie, but nothing more. It was extra annoying that the main actress had SO MUCH makeup on. She's supposedly this cool airplane pilot, living in this natural beautiful place and she has caked on makeup with fake eyelashes. It pretty much ruined it for me from the beginning.",
    "date": "2023-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Eh, it's a Rom-Com. Not in the top 50 probably not even in the top 100 but it passed the time.",
    "date": "2023-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I only watched 5 minutes of it and that was enough.  So boring and predictable.  The characters were not believable.",
    "date": "2023-10-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I have watched this love story 100 times- this is a bad version of it! It has potential but the pristiness of Delta is so irritating! Why was she wearing heeled boots all the time? And when she puts on a cap to go out in a cyclone 🤦🏻‍♀️ It all develops so quickly with no real chemistry. I managed to make it through but could have easily left it.",
    "date": "2023-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "They made magically drying shirts! \n\nThe movie is utterly terrible, I now understand how it feels when British Actors absolutely murder Australian Accents (the same is true with the opposite here), the signposts are so large that they may as-well be motorway size just outside of your house, but they invented magically drying shirts. \n\nWorth the watch just for that.",
    "date": "2023-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Typically predictable light romantic movie, and I loved it!  The actors made the movie. They all connected and all had chemistry together. So glad I watched it!",
    "date": "2023-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Love Is in the Air is a 2023 Australian romantic comedy film co-written and directed by Adrian Powers ✈️ \n\nMeh, it passed the time. \nSort of. 😕\n\nThis is basically a movie length version of Home and Away…\n\nA fiercely independent pilot fighting to keep her family business afloat starts to fall for the man sent by corporate to ground her operation forever.",
    "date": "2023-10-01"
  }
]