[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Laugh out loud hilarious. Fabulous scrip and incredible acting! Doesn't get better than this.",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Great story line, great acting, and very, very funny.",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Cross-country van travelling with a pseudo-family hasn't been this enjoyable since Scooby-Doo.",
    "date": "2025-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "My favourite comedy movie of all time. Hilarious not matter how many times I watch it.",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I liked this movie and I'm gonna keep it for my collection. It's got pretty decent humor and a weird plot but it's well acted and a fun movie for the fam.",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I don't know what's wrong with the rotten tomatoes critics they seem not to have a funny bone in them. We're the Millers was extremely funny. I was surprised to see Jennifer Aniston acting so raunchy and extremely funny at it. \n\nThe whole cast was assembled very well and it was good to see Luis Guzmán in it, he also played a very funny part in the movie. We're the Millers is the type of movie you can see over and over again. My hats off to the entire cast for making me and other people with funny bones laugh.",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is hilarious. Its one of those you cannot back, relax, and laugh. No need to think or reflect on any events, just enjoy the ridiculous events of the movie.",
    "date": "2025-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A BRILLIANTLY humorous adventure with twists and turns in their plot!",
    "date": "2025-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A solid fun film with a great cast",
    "date": "2025-07-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "4.2. this movie was actually so funny im impressed. I was not expecting it to be this good but it was. maybe cause it’s really late at night, or maybe because I haven’t seen a comedy in a while, but it was funny. also, I love (spoiler) kenny’s happy ending. that was majestic.",
    "date": "2025-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely funny and enjoyable movie...",
    "date": "2025-05-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Easy watching and pretty funny.",
    "date": "2025-05-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This is a very good movie. It’s one of the best road trip movies out there.",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is so good.",
    "date": "2025-05-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "An actually funny comedy. Enjoyed pretty much all of it. Watched on DVD.",
    "date": "2025-04-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fun, funny and easy to watch, I never understand the critics in these notes, this film is very good in all aspects.",
    "date": "2025-04-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "(CASTELLANO) Somos los Miller no intenta revolucionar la comedia, solo quiere que te rías con su humor desvergonzado y sus situaciones absurdas. La historia es sencilla, pero cumple: un tipo que se dedica a trapichear se inventa una familia falsa para pasar droga por la frontera sin que le pillen. Para eso, se junta con una stripper, un chaval que no se entera de nada y una chica con mucho carácter. Como te imaginas, todo se complica y el viaje se convierte en un desastre lleno de líos y situaciones absurdas. La película sigue el estilo de las comedias americanas gamberras, con chistes que a veces funcionan y otros que no tanto, pero en general te hace pasar un rato divertido.\n\nEl reparto es uno de sus mayores aciertos. Jason Sudeikis domina la comedia con su humor sarcástico y su habilidad para el timing cómico, mientras que Jennifer Aniston aporta carisma y encaja bien en su papel. Sin embargo, el que realmente se roba la película es Will Poulter, cuyo personaje de adolescente torpe y entrañable protagoniza algunos de los momentos más divertidos. También destaca Ed Helms, que consigue darle un punto de locura a su papel de villano.\n\nNo es una comedia refinada ni lo pretende. Somos los Miller apuesta por un humor directo, con momentos absurdos que, aunque no siempre dan en el clavo, cumplen su función. Es cierto que el desenlace es predecible y que algunas escenas podrían haber sido más ágiles, pero si buscas una comedia ligera y sin pretensiones, es una opción más que válida para pasar el rato.\n\n(ENGLISH) We're the Millers doesn’t try to reinvent comedy; it just wants to make you laugh with its shameless humor and absurd situations. The story is simple but effective: a small-time drug dealer comes up with a fake family to smuggle drugs across the border without getting caught. To pull it off, he teams up with a stripper, a clueless teenager, and a tough girl. As you can imagine, things quickly spiral out of control, turning the trip into a mess full of chaos and ridiculous situations. The movie follows the style of classic American raunchy comedies, with jokes that sometimes land and others that fall flat, but overall, it delivers a fun time.\n\nThe cast is one of its biggest strengths. Jason Sudeikis nails the comedic timing with his sarcastic humor, while Jennifer Aniston brings charisma and fits well into her role. However, the real scene-stealer is Will Poulter, whose awkward and endearing teenage character delivers some of the funniest moments. Ed Helms also stands out, adding a touch of craziness to his villainous role.\n\nThis isn’t a refined comedy, and it doesn’t try to be. We're the Millers goes for straightforward humor, with absurd moments that, while not always perfect, get the job done. The ending is predictable, and some scenes could have been tighter, but if you're looking for a lighthearted comedy without big ambitions, it’s a solid choice for a good time.",
    "date": "2025-03-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie is made by the one liners and the fantastic acting. Foolishly fun plot. Great acting. Little to no redeeming qualities. But dang fun.",
    "date": "2025-02-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Entertaining, but dumb. Through the power of performance, some weak writing and unbelievably silly plots turn out funny regardless. Some sexy scenes with an A-list star like Aniston don't hurt and in the end, I had a good time. Worth a watch or two over the years, but nothing to shout about. Unless you get bitten by a spider.",
    "date": "2025-02-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "indeed raunchy, and it has its funny moments. But when the bits get drawn out, the family is not so funny anymore.",
    "date": "2024-12-12"
  }
]