[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's the stunning imagery that keeps you invested sice the story is slow to really get going.",
    "date": "2025-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thought this was great, informative, didn’t sugar coat either side. So far the only people I see who have an issue with her or the documentary are Whiny man babies who can’t stand seeing a successful woman do something they wouldn’t dare do. A great watch for the whole family!",
    "date": "2025-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "SHARK WHISPERER is a captivating documentary—taken on its own merits, it will change how you think about sharks, and challenge how you think about conservation. It may also mislead some people and lead to some issues, but the very real existing global problems are clearly portrayed. Wisely, the docu embraces the controversy caused by Ocean and Juan's unique approach, offering an insightful study into the power and perils of influencer culture that significantly enriches and in many ways becomes an equal subject of the film. All this makes for a beautiful, intelligent, and compelling must-watch docu.",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "68%. 7/27/25. Not super exciting. It is fascinating to see her build bonds and interact with the sharks. One shark in particular seems to know her and her photographer. No need to rewatch. 1/5 rewatch.",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very interesting.........alot of respect for these two......glad I watched",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Are we learning about sharks or about Ocean Ramsey? Any time ocean is on the screen she sucks the spotlight to herself. Most things they “teach” us about sharks has been taught for years or decades on shark week. Stunning visuals but the entitlement and justifications in the name of conservation distract anyone who know anything about Sharks. All the scientific info is given by others other than Ramsey.",
    "date": "2025-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I found it an interesting film. I was a little conflicted in the fact that she made swimming with sharks look seamless and easy. She obviously has an attunement with sharks and trying to pass bills to ban shark fishing is a good end to this show. I guess my only concern was sharks aren’t all gentle like she made it appear. I did have an encounter with a bull shark on a boat many time years and years ago and they are she was a  predator so I hope there are no copycats and proceed with caution. Yes, I believe sharks need to be protected. I have a healthy respect for sharks, but no I do not want to be friends with them. I say leave them alone. Attack you happen they take a bite, but fatalities are rare. We are swimming in their backyard.\nKind of like I have this about Lions and would love to go on a Safari one day and see them, but would I go up and hang out with them probably not",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This shark documentary was really good. The entire crew did a spectacular job on what Ocean Ramsey and Juan Oliphant did to help save sharks and show that they're not as dangerous as most people say they are. It was a very insightful look into how sharks and people can co-exist. If you haven't seen this documentary yet, check it out sometime. It's a definite must see.",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I learned so much and a different perspective after watching this.",
    "date": "2025-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Oean Ramsay is fearless and tells a great story.  The ocen footage of her with the sharks is spectaular and unforgettable!",
    "date": "2025-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Most people if not 99.99% of the world's population hasn't had the experience of swimming with a shark. I have. Once in the Bahamas. Once in Monterey Bay in California. The Bahamas was a peaceful encounter. The one in Monterey wasn't as nice. It was a great white feeding on a harbor seal. We saw it all transpire.\n\nThe bottom line is this was a beautiful film and allows people to see these magnificent creatures up close. The detractors of this film are probably all Reichwing Republicans and would be happy to decimate the rest of the shark population. Her single minded approach is what drives change. That alone is well worth it. She did in fact enact a bill to protect the sharks from indiscriminate killing off the islands of Hawaii. To me, that alone is a marvelous achievement. Oh, don't fault the woman for being attractive.",
    "date": "2025-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It’s too bad there’s not more attention to this film.",
    "date": "2025-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "After watching the trailer I was not too interested in seeing the film, but it was actually a very touching and visually arresting film. I can see how the naysayers could criticize Ocean for putting herself in harm's way, but I got the sense that she genuinely cares for these beautiful creatures.",
    "date": "2025-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Ocean is one with the sharks. She shows the possibility of being in presence with them.",
    "date": "2025-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Watching this movie had a profound effect on me. I live in Oahu and have always loved the ocean, but I’ve carried a quiet fear of it for many years. I’m grateful to Ocean and Juan for their work—it inspired me deeply. It’s always powerful to witness people connecting to others and to the world around them in ways that go beyond seeing life as just objects or obstacles.\n\nI was especially moved by the stories of resilience, like the surfer who returned to the waves after a brutal attack and the friend who saved his life. And it blew my mind to see Ocean and Juan forming real relationships with specific sharks they know and love.\n\nGod’s creation is beautiful, even in a world marked by pain and suffering. I highly recommend this film. It left me inspired to connect more deeply—with others, with God, and with the natural world around me, as often as I can.",
    "date": "2025-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I have to say that this caught me off guard! Very well done with great optics. I am really happy that they took the time to tell the really store. Ocean did good. You really need to watch, you will not be disappointed.",
    "date": "2025-07-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It’s a Shark life! Great cinematography and touching story.",
    "date": "2025-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Gotta watch! Whether you agree with her or not, the sharks are just incredible creatures and the way she interacts with them is mind-blowing, not to mention death-defying. Personally, I think the sharks don't have the behavioural or social complexity she's trying to imply, like dolphins or apes clearly do, and she's anthropomorphizing them way too much. But watch and decide for yourself - they're amazing creatures either way and if she's bringing attention to conservation issues as well, that can't be a bad thing.",
    "date": "2025-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Cinematically beautiful but let’s be real, all the footage is slowed down a ton which is what makes her look graceful and the sharks not look as scary upon approach. This is dangerous, sharks are predators. Ocean Ramsey is self promoting without respect for nature. She isn’t a scientist, she is an irresponsible instagram model.",
    "date": "2025-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Ocean Ramsey and her husband are amazing people. Their conservation work is so important. The underwater photography is breathtaking.",
    "date": "2025-06-30"
  }
]