[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "While the pacing is definitely too long and can make you feel disconnected, the film still has things going for it like it's cinematography, acting, it's stellar cast, and it's bold idea of telling multiple stories into one which not many movies try to do. While this may feel like a slow burn it definitely is not since there are some fast paced action. While on that subject this movie could use more of that.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Horizon hasn't received recognition for what it is, it's a Western movie and one of the best. \n\nTime will be kinder to his movie. When it comes to Cowboy vs. Natives, this movie has the best scene in movie history. I do understand that the dialogue can get a little confusing, but it's acceptable in this genre.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This movie jumps around too much. Amazing cast but hard to figure out who is where and where is what. Maybe a little politically correct as l dont think they called the natives aboriginals or native americans back then.Someone else commented that it should have been a mini series, I think they may be right and would have worked out better. Kevin should have gotten Sheridan to write the script but I guess they were fighting. Watched but not great and I do love a good western.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Underrated movie! &lt;3",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Worth the watch, you can see the characters developing well as the story unfolds.   Green Light part 2 already!!!",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Horizon An American Saga Chapter 1.\nAfter reading all the very mixed reviews and how this Film Underperformed at the Box Office,I was really not expecting much.In the Interest of Fairness and Balance,I am the Chairman of the Swansea Branch of the Kevin Costner Appreciation Society.\nIn my humble opinion, this is the best Western Film that I have watched,I openly admit to this not being my favourite Genre. At 3 hours long,it does set the rest of the Chapters up superbly and I really do hope that Mr.Costner gets his wish and makes all 4 of them.Great Storyline, Casting and Cinematography, plus an excellent soundtrack makes this an all round epic encounter. The Action Scenes are expertly executed and I found the acting of Sienna Miller,outstanding and Oscar Nomination Worthy.The first hour of the film,we don't even see Kevin Costners Character,Hayes Ellison,but I still found the film very watchable.Go and watch the Film,Yourself and Judge it that way.Don't believe all the reviews about this film,give it a try and it did really well on the Streaming Platforms.I would have loved to watch it on the Big Screen, but sadly it did not receive a 🇬🇧 UK Cinema Release.Many Thanks For Reading This Review.\nPeter Williams.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Director Kevin Costner's generational epic about manifest destiny and the story of the indigenous resistance to the inevitable invasion of the white settler.\n\nA must-see for all Western fans.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A sense of continuous (longing) Horizon and mirage of what is still yet to come. A smart Title/Town spread from a printer. Beautifully filmed. Some warm moments from characters still trying to find a moral compass in the wild west.",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Horizon Ch. 1 has all the hallmarks of a great western. The dynamics of cowboy, native, army, and nature all blend beautifully together to create a compelling story in this period masterpiece. I eagerly await Ch. 2, and if it is never released to the public, I hope Mr. Costner will allow me a viewing!",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Another Costner misfire. The trailer makes it look so much better than the slow, boring, uneventful, confusing non-epic this is. Guess we'll never, happily see the rest of this mess. Costner, like Jackson of Lord of the Rings fame, doesn't seem to realize, not every movie needs to be three hours long.",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The plot and the characters were hard to follow. It ought to get something close to an Oscar for the wardrobe and the cinematography though. It was very beautifully filmed. It was very watchable though for those reasons.",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is an incredible film with majestic scenery and great acting. Its so disappointing that we live in a video game world now where people would rather get the cheat codes than figure out the game.\n\nThis story was just being setup and characters being introduced and developed. Telling the hard truth of an era in time is not easy, but this film to the true Western genre fan was going to be epic.\n\nSadly movies have to be made for the masses. Kinda like a theme park I loved and cherished called fantasy of flight just outside of Orlando. The owner built a world class a aviation museum, but not enough people are truly interested in our heritage and the aircraft that brought us here.\n\nI personally love this movie and hope that the true Western genre film buffs will turn out and watch this movie so we can see part two, part three and part four.",
    "date": "2025-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I don't know why people are negative about this movie. It is a good movie. I think people nowadays are spoiled and want instant gratification, they can't cope a slower start (it's only part one, building up to other parts). \nThe acting is superb and I am really hoping for the other parts to come out.",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very realistic, beautiful views, and solid story lines. Needs more action and certain scenes were drawn out. Too early to tell if this will be a notable series or not.",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I chose to be generous with two stars, although I thought Kevin Costner would be smarter than to walk away from a mega success like Yellowstone (even if I don't much care for the writer of the show) to back up and act in something as mediocre as Horizon.  I forced myself towatch the entire season and it was like having whiplash with your eyes open as the script jumped from pillar to post with no true storyline in place or anything of interest going on.  I have always loved Kevin Costner in everything he has ever done - until now.  Hopefully, they will trash can the second season and save everyone the time and money to create it so that no-one will watch it.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I loved it. It’s the most honest portrayal of the American West I’ve ever seen. And I’ve seen them all. Yes it’s long, it has lots of parallel stories, it doesn’t explain a lot and makes you pay attention. And that’s why it’s great! It’s also beautiful, violent, harsh, touching, exciting, tense, violent, and very violent. And it has Michael Rooker! As others have said, it’s part one of a four part story and this is clearly setting up the rest. It’s going to be a hell of tale when it’s all said and done. I already bought the DVD of Chapter One. Can’t wait!",
    "date": "2025-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Extremely boring and disjointed.",
    "date": "2025-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved the mix of all the stories out into this one movie!",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Couldn’t ask for a better modern day western!!!",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Yellow stoned",
    "date": "2025-07-14"
  }
]