[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "La película es un thriller muy interesante, entretenido y tensionante, los personajes son carismáticos y agradables, no me aburrí en ningún momento y el final es satisfactorio.",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The premise has been shamelessly lifted from Rear Window but it's not without a sense of fun",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Despite Shia's powerful monologue to Ashley. He gets showed up by the stellar performance that David Morse gave in this very fine thriller. David Morse really does his best and honestly is the best part of the entire film.",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best suspense thriller of it's time and even now.  It's not all blood and guts but,  it keeps you on the edge wondering what is going to happen next. Excellent movie....",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Disturbia is a thriller and horror movie. I am going to talk about this movie. It is about a boy who lives close to a serial killer. The boy starts to think that his neighbor is very weird.\nI recommend this movie because I love crime movies.",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I watched a movie in class. Its name is Disturbia.\nThe movie tells the story of a boy who is trapped in his house. He watches his neighbor and becomes obsessed with him.\nThe film was made in 2007. It has a little romance between Kale and Ashley. It is more a thriller than a comedy.\nThe movie catches your attention and gives you butterflies in your stomach.\nI like the characters and the story. It is interesting and a bit funny. I recommend it because it is shocking and crazy!",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Paranoia was published in 2007. This movie is a thriller and a mystery. It shows the complicated life of a boy. He is stuck at home because Turner (the protagonist) punched his Spanish teacher. In my opinion, this film is a five-star movie and good for people who like thriller movies because it makes you feel nervous. The actors are good, and the story is interesting.",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I liked the movie a lot. I think many people will enjoy it. It is a thriller, and it is very interesting and mysterious. The story is easy to understand, and there are fun action scenes.",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I loved the movie Disturbia. It is a thriller movie. The main character, Kale, is spying on his neighbors. He discovers that one neighbor is a killer. His friends help him, and they try to find the truth. I liked the film because it is exciting and has a lot of suspense.",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I loved the movie Disturbia. It is a thriller. The story is about a boy named Kale who is staying at home because he is under house arrest. He is bored, so he starts watching his neighbors. Then, he sees something strange and discovers a crime.",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Spoilers: go watch this before reading. OK, so to start, there was not enough ambiguity in the plot. It would have been nice if the story kept you guessing until later on as to whether he is a bad guy or not. I guess you could argue that the deer was the red herring, but come on.  Yes, the neighbor is a serial killer. That's basically the whole movie, plus some \"making out\" between shia boof and no-name actress number 1. I gotta say that this straight up rip off of Hitchcock's Rear Window left much to be desired. I suppose you could call it a \"remake\" or something, but it was very unoriginal either way. I guess maybe I'm just not that into high school love interest stories, and don't really like bs non-suspenseful suspense thrillers. This one just wasn't for me. If you want a better rear window remake with kids, try Fright Night (either version). Pass on this one.",
    "date": "2025-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "DISTURBIA expertly blends the teen coming-of-age and psychological thriller genres into a smart suspense film that's captivating from start to finish. It's an early success for writer and eventual director Christopher Landon, as well as the talented young cast. At just about 1.5 hours the film could certainly have been extended a bit, but is impressively economical and entertaining.",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the most tense horror movie I’ve ever seen. D.J Caruso did an amazing job.",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1.75 hours!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated PG-13 for Some Sensuality and Sequences of Terror/Violence!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $80,100,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Popcorn flick, as simple as that. More teen-oriented also",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "“Disturbia” ultimately falls short of its potential, delivering a thriller that feels both shallow and underdeveloped. The characters lack meaningful growth, leaving little room for the audience to form any real connection with the leads. The narrative itself suffers from thin plotting and minimal world-building, offering tension without the necessary emotional stakes. Ironically, the supposed antagonist ends up being the most engaging presence on screen, which undermines the intended suspense. In the end, the film’s lack of depth and uneven execution make it more frustrating than thrilling—a misfire not worth the time.",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Disturbia benefits from a few things, like Shia LaBouef's committed and far-from-simple performance, a crucial and accurate plot choice, and a skillfully introduced romance. But, of course, it has its flaws here and there, like its slow pace in delivering suspense, which is its main genre, and its rushed and unremarkable resolution. Other than that, it's a good film for a movie night.",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It was good, but it could have been a better experience if it wasn't so \"American\".",
    "date": "2025-06-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Disturbia does not shy away from occasional teen angst, and the influence of Rear Window is unmistakable.",
    "date": "2025-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Disturbia is a suspenseful horror-thriller starring ⭐️ Shia LaBeouf, and honestly, I think it’s one of his most impressive performances. The story follows a teenager under house arrest who begins to suspect that his neighbor is a serial killer. The twist? He can’t leave his house, so he’s forced to witness terrifying events unfold from his windows.\n\nI found the film to be incredibly engaging from start to finish. The suspense was constant, and it kept me locked in the entire time. Shia LaBeouf does a phenomenal job portraying a young man struggling to convince everyone that what he’s seeing is real—while they all assume he’s just being paranoid. His performance truly carried the emotional tension of the film.\n\nI also really enjoyed the supporting cast, the creepy villain, and especially the unnerving and clever behavior of the killer. The way everything unfolds is smart, stylish, and perfectly paced. The director nailed the atmosphere, and the writing team did a great job with the misdirection, making the audience second-guess everything right alongside the characters.\n\nDisturbia is a tightly-wound thriller with just the right amount of psychological tension and mystery. I highly recommend it to anyone who enjoys suspenseful stories with strong performances and twists that actually land.",
    "date": "2025-06-08"
  }
]