[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Amazing amazing amazing! I loved the story line, the drama, the choice of cast members... I've watched this several times now and I am still just as gripped as the first time I watched it, which I find rarer and rarer to get from action films these days. The uniqueness of the storyline is something I commend highly and definitely recommend if you want your eyes to be gripped on the screen the whole time.",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great action scenes, great cast and great music!",
    "date": "2025-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "(CASTELLANO) Michael Bay nunca engaña a nadie: si te sientas a ver una de sus películas, sabes lo que vas a encontrar. Explosiones, persecuciones imposibles, humor descarado y un montaje que no da tregua. Aquí lo lleva al extremo desde la primera secuencia, una persecución en Florencia que parece alargarse hasta el infinito y que ya marca el tono de lo que viene después.\n\nLa trama es poco más que una excusa para unir a seis personajes que actúan fuera del sistema, pero lo cierto es que la historia importa menos que el espectáculo. Bay se recrea en la violencia estilizada, en los planos imposibles y en esa estética de videoclip que tanto le gusta. El resultado puede cansar a ratos, pero también consigue que el ritmo no decaiga en ningún momento.\n\nRyan Reynolds es el ancla cómica de la función. Interpreta prácticamente una variación de sí mismo, con sus bromas rápidas y su actitud de antihéroe sarcástico. Puede que no todos sus chistes funcionen, pero encaja bien en este universo pasado de vueltas. El resto del equipo cumple sin destacar demasiado, aunque la dinámica de grupo le da algo de aire fresco a la trama.\n\nNo es una película para buscar coherencia ni profundidad. Su valor está en la energía desbordante y en lo excesivo de su propuesta. Es el Bay más desatado, para bien y para mal. Si entras en el juego, es fácil divertirse con sus ocurrencias visuales y con la escala de la acción, que solo podría costear una superproducción de Netflix.\n\nEn definitiva, una montaña rusa que entretiene mientras dura, aunque difícilmente deje huella una vez terminan los créditos. Quien busque puro escapismo lo encontrará; quien espere otra cosa, mejor que no se acerque.\n\n(ENGLISH) Michael Bay never deceives anyone: if you sit down to watch one of his films, you know exactly what to expect. Explosions, impossible chases, cheeky humor, and editing that never takes a breath. Here he pushes it to the limit right from the first sequence, a chase in Florence that feels endless and sets the tone for everything that follows.\n\nThe plot is little more than an excuse to bring together six characters who operate outside the system, but the truth is the story matters less than the spectacle. Bay indulges in stylized violence, impossible shots, and that music-video aesthetic he loves so much. The result can get tiring at times, but it also ensures the pace never slows down.\n\nRyan Reynolds is the film’s comedic anchor. He basically plays a variation of himself, with quick jokes and the attitude of a sarcastic antihero. Not all of his gags land, but he fits well into this over-the-top universe. The rest of the team does their job without standing out too much, though the group dynamic adds some fresh air to the story.\n\nThis isn’t a film to look for coherence or depth. Its value lies in the overflowing energy and the excess of its proposal. It’s Bay at his most unrestrained, for better and worse. If you play along, it’s easy to have fun with his visual flourishes and with the scale of the action that only a Netflix blockbuster could afford.\n\nIn the end, it’s a roller coaster that entertains while it lasts, though it’s unlikely to leave much of a mark once the credits roll. Those looking for pure escapism will find it; anyone expecting something else should probably stay away.",
    "date": "2025-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I found this movie to be highly entertaining. Critics use words like \"frenetic\" and \"preposterous.\" 6 Underground was that and many more such adjectives. But it was fun to watch. I think if some people would just give their pucker pressure released a bit, they might find this and other movies not perfect, but entertaining.",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Some very talented actors who didn't get a chance to shine. The humour starts to get a bit repetitive in the middle but is certainly an action movie.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Filme mais ou menos, o roteiro é fraco, as cenas são mais ou menos, a história é fraca, o elenco é mais ou menos, mas ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Thoroughly enjoyed this movie hope they make the sequel, 5 Star excellent movie",
    "date": "2025-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Ryan Reynolds + Michael Bay = Awesome!  I loved this movie.  It was exciting, fast paced, funny!  There was no time to get bored.  Reminded me of the 80s flicks when adventure movies were entertaining.  If things don't blow up, no fire, fights, gun battles... it just wasn't fun to watch.  I can't believe Netflix made a sequel to Old Guard but passed on 6 Underground.  Wow...",
    "date": "2025-07-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I think whomever the critics are obviously missed the point if this film..this kept me interested. Action was fantastic and Ryan Reynolds and the team kept the down to earth comedy keeping this alive!! Movies like Sinners was rated high, yet this one low...why i do not take heed to most of what \"critics' say.",
    "date": "2025-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not great at comedy but action is sick as hell.absolute bayhem..",
    "date": "2025-06-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I like it but the the youtube music in the action scenes puts me off.",
    "date": "2025-05-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Good movie - recommend.",
    "date": "2025-03-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Silly script and predictable plot as an excuse for an action movie along the theme  of “Mission Impossible” with mediocre acting.  Lots of logic gaps in the plot which are unrealistic fantasy.  Typical Ryan Reynolds babel dialogue which I use to assume was poor direction but now realise is his  hallmark which I find annoying.  Almost a slap stick comedy.",
    "date": "2025-03-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Shallow, over the top and certainly bringing the worst possible acting in what should be a quite good cast. Poor representation of a supposed central Asian nation, showing the lack of investment in investigating what happens in the rest of the world.",
    "date": "2025-02-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "So over-the-top that it is a total waste of time.  So much destruction it is hard to follow.  And the dialog ludicrous.  Dumb dumb dumb.",
    "date": "2025-01-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best action movies on Netflix. Already saw it 3 times. Amazing stunts and awesome filming. Where is number 2?",
    "date": "2025-01-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This is what Netflix is doing with your money.\nNon-stop violent action scenes with a love story and some comedy sprinkled throughout with a storyline you don't really have to be paying attention to follow.",
    "date": "2024-12-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Sometimes, you just want to kick back and enjoy a fun action— this movie is just that. If you want a movie that doesn’t ask much of you except to sit back, and enjoy the ride, than you’ve found it. Leave the overthinking at the door; this one’s all about excitement and entertainment.",
    "date": "2024-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie takes both the greatest weaknesses of Ryan Reynolds as an actor, and all the flaws of Michael Bay as a director and combines them into one big mess of a movie.\n\n\"6 Underground\" set a record for how quickly it could upset an audience and have them turn off the movie. In the day and age where movies try to sell themselves in the first 5 minutes, that way they don't switch what their streaming on Netflix. Thankfully this movie made it clear in the first 5 minutes that this movie was not concerned with character, story or filming with any clarity.\n\nThis would be the very example I would show to a class of how not to shoot an action scene. It is cut to pieces; camera is always moving, and the audience cannot tell what is going on.\n\nNot much to say. Bad characters, bad action and bad story, a bad time to be had.",
    "date": "2024-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "worst soundtrack for the movement of the film, a better score would have actually made it watchable.  The beginning chase scene is the best part.  After that, the soundtrack drags it through the mud.  Whoever was the post producer for the music has terrible taste, or whatever made this soundtrack happen just really killed the whole film.  It should have been scored more elegantly.",
    "date": "2024-10-13"
  }
]