[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This isn't even a real movie. It is underdeveloped, lazy, unfunny, and TOTALLY rips off Tarzan. Only for kids or diehard Pokemon fans.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie ****ed up!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Piece of **** flying around!!!!!!!!!!!!!!!",
    "date": "2025-05-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was AMAZING, it is an action-packed adventure featuring comedy,the importance of family,and elements of Tarzan. Just after watching Tarzan (One of my personal favorite movies), I loved this movie. I totally recommend this movie for people who like comedy, Tarzan, and Pokemon.",
    "date": "2025-01-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Pokemon is one of the best kid movie that envoles animals and humans. Every movies is great and awesome. This feels like kind of like Trazan in a way",
    "date": "2023-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Pokemon the Movie: Secret of the Jungle was an amazing movie. I finished it just now and it was really good. It was like Tarzan, but a Pokemon  version. If you like Tarzan, or you like Pokemon, or you like them both, then this is the movie for you. Secrets of the Jungle was a interesting movie. It was also funny, and I LOVE comedy. Also Secrets of the Jungle has a very nice family message. What a good movie. I give this a 73%.",
    "date": "2023-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Enjoyable addition to the Pokémon series as the story was creative and keeps you engaged from start to finish, enjoyable for the whole family",
    "date": "2023-06-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This Movie is Just A Tarzan And James Cameron Avatar Rip off This Movie Has no Right to Exists The Plot is Just Stupid & Forgettable there's nothing Originality if you Watch Tarzan with James Cameron Avatar and Pokémon that's how the Movie Makes Great 2/10",
    "date": "2023-04-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "4,5/10 Aburrida, me desentendí a mitad de la película para darme el lote con mi novia.",
    "date": "2023-01-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Pure unfiltered  joy with a heartwarming wholesome happy ending.10/10 watch it again and again.\n\n\nDon't listen to the cynics they need to remove the stick from their butts and lighten up",
    "date": "2022-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Unique take on the Tarzan story heartwarming concept 400/10",
    "date": "2022-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The greatest 01 hour: and 39 minutes ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2022-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Mamoru Hosoda meets Disney's beloved jungle classics, plus a little \"Avatar\" drive, as the story's more inspired than noticeably derivative purposefully sending a good message with a wondrous heart and similarly motivated performances, evolving this as one of the top best at the series' storytelling levels. (B+)",
    "date": "2022-03-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The reboot sequel had a story similar to that of jungle book, Tarzan, avatar, Pocahontas, ferngully, and many more, which may be its strength with younger viewers but it's dead point for more intellectual viewers.",
    "date": "2021-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I think it was a boring movie, I wish it was more versatile because it felt like a Tarzan 2",
    "date": "2021-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie about Zarudes.",
    "date": "2021-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is more than most Pokémon movies it has a 2 huge messages that speak to almost everyone. A message for parents and a message for deforestation. Really nice and well done!",
    "date": "2021-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Fans of Pokemon might enjoy this; But frankly speaking, it's pretty boring. It's like a mash-up of Tarzan and Pokemon in one movie.",
    "date": "2021-10-08"
  }
]