[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A sweet romance to while away an afternoon.  Nice to see an older woman younger man couple and the Moroccan scenery as well as lead actors are beautiful.  I’m assuming the low rating is due to the age of reviewers but if you are Gen X or older, then don’t let the average rating put you off.  I would give this a solid 3.5 with extra .5 for keeping close to a 90 min run time.",
    "date": "2025-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I really wanted to love this movie - it was a great concept, had a beautiful setting and great actors - but the chemistry between the two main characters felt so forced, hard as I tried I just couldn’t “believe” their romance",
    "date": "2025-06-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Spoilers - Never been so disappointed by a film that I’ve been driven to leave a review before. I hoped for a wistful, steamy, feel good romance in a beautiful setting (and honestly my standards are low, I’m easily pleased) but instead, it was boring, predictable, and entirely lacking in chemistry. I found Liam Hemsworth’s character deeply unlikeable - the mopey coal mining finance bro who broke up with his girlfriend for cheating on him the same night he tried to cheat on her didn’t charm me I’m afraid. The singular sex scene was dull. The pace was stilted, like a poor book adaptation. The acting was fine. Giving it 2 stars because it was at least visually beautiful to watch.",
    "date": "2025-05-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I gave this a higher rating than it deserves because I want the industry to keep making movies like this. But I went in knowing (after reading reviews) that it was just two normal people talking in a beautiful setting and of course the predictable outcome. But really is it terrible to watch a Hemsworth for an hour and a half...my answer is no.  :) I did agree with the lack of chemistry but they can't just cast Julia Roberts, Anne Hathaway, or Nicole Kidman for everything, so knowing what I was getting into I enjoyed it. Again just like that Netflix is doing movies that aren't really a thing in the industry so I'll support it and hope to heck they get better at it!!",
    "date": "2025-05-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It was actually a nice movie. But i just got confused why Liam was losing attention to his gf at first but the plot twist that her gf was a flirt too was giving him justice. My eyes can’t just tolerate the hot scenes between the two lead actors because of the physically obvious age difference. (But no judgement here) it’s just the hot scenes can be skipped, we already understand he needs a motherly care in the story. The lesson indeed was heard.",
    "date": "2025-03-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The movie is so cliche. Extremely predictable,  very poor dialogue.  It’s almost like they didn’t try very hard to make a good movie.  😴😴",
    "date": "2025-03-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I really like Laura Dern but overall I could see were the film was headed right from the start almost . still a nice little romance .",
    "date": "2025-03-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Beautiful and picturesque scenes shot in Morocco completely spoilt by a lack of chemistry between characters and a storyline that is tacky at best and falling on the wayside at every step of the movie at worst! Spoiler: Laura Dern milfing it with Liam Hemsworth Yuck!",
    "date": "2025-03-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I am shocked at the low rating for this film - it was beautiful visually, beautiful to listen to. I felt like I'd been whisked away on my own little romantic, inspiring get away in paradise. Love, love, love it.",
    "date": "2025-01-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I’ve never been a Laura Dern fan, and this film did nothing to change my mind. She now sports the predictable pillow face of aging actresses in Hollywood, which often replaces once-good acting technique. She has zero chemistry with Liam Hemsworth, who was the one bright spot in this tale of narcissistic women. The May-December relationship was just not believable and the movie fell flat. A Diane Lane or an Annette Benning could have pulled this off. Waste of a good-looking and charming Hemsworth.",
    "date": "2025-01-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "It felt to me like Liam Hemsworth's character was just complaining and sulking half the time while being unsupportive of his girlfriend's talent and success..but rather than him make an effort he just avoided his problems by flirting with Laura Dern yet somehow his girlfriend ended up being villainized.. I couldn't bring myself to watch until the end.",
    "date": "2025-01-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I wanted to like this movie.  The storyline could even have pulled it off, but the actors had no chemistry at all. They both just seemed like nice people.",
    "date": "2025-01-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The movie seems to have some depth at first, as you are introduced to the various writers at the conference, some of whom are quirky, interesting characters.  Plus the scenery in Morocco is beautiful.  However, the premise is ridiculous (a young hunk finance guy breaks up with his cute writer girlfriend while on a trip and immediately runs to the arms of an older, reclusive writer).  The dialogue is like that of a bad soap opera, and there is zero chemistry between the lead characters.",
    "date": "2025-01-20"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie is so stale and bland. It’s like you’ll keep waiting for something to actually happen and nothing does. Bad acting, bad plot. Bad everything.",
    "date": "2025-01-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Beautiful scenery and a perfect story line for those of us that want entertainment and not deep thoughts.  Don’t over think just enjoy🤪",
    "date": "2025-01-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Romanic and endearing.  Definitely recommended for romantics.",
    "date": "2025-01-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's not as bad as it looks. Just plausible and well acted enough to worth a watch.",
    "date": "2025-01-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Love Laura Dern, like Liam H enough. But such horrible paring. It was painful to watch. Boring. Predictable.",
    "date": "2025-01-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Like many have stated, there is no \"there\" there. No inciting incident... no discernible 2nd Act... no inciting incident to drive a 3rd Act. Our planet would be very lonely if this was the best it could muster. Generally, I think the result is often bad when a writer is writing a movie largely centered around the plot of writing. There's a scene (not really a SPOILER...) where a thief steals Laura Dern's computer and novel she's working on. To that thief I'd like to say \"THANK YOU, THANK YOU, THANK YOU!!! Otherwise, we could have been looking at a possible sequel...\n\nAs I've often said in my reviews, who finances this? Who reads this script and decides, \"yeah, let's make this.\"",
    "date": "2024-12-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Kind of just writer bullshit with stunted dialogue, paper thin characters, and no romantic chemistry at all.",
    "date": "2024-12-03"
  }
]