[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I watched the trailer on roku tv showing Adam Sandler, but when I went in yo watch the movie there was some really badly made movie that had nothing to do with him at all",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I didn't know what I was getting into but I haven't enjoyed a movie so much for quite a while. It's not a popcorn movie, it's not a cuddly shallow love story. I kept thinking \"Solaris\". Not such a masterpiece of writing. But there's a retro 70s Soviet Union space program vibe to it and I felt it is a beautiful way to tell a story of beginnings, ends and renewals. Both cosmic and personal, of personal relations with others and yourself. You feel it more than you rationally understand it. And it's not pretentious at all, there's kind of light naivete to really heavy stuff. I bet most people hated it, so now off to read other comments.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The writing is trash",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Introspettivo viaggio di un astronauta in completa solitudine, alle prese con i dilemmi e gli errori del passato nella sua relazione.\nAdam Sandler è un buon interprete, originale per il tipo di film rispetto ai solitamente più vistosi protagonisti nel genere.\nLa sceneggiatura, tratta da un libro, è piuttosto semplice, buona la regia nell'alternare i momenti all'interno dell'astronave con quelli sul pianeta, presenti e passati.\nIl finale, sicuramente emoziona, seppure concettualmente si trovano parecchie similitudini con altri film del genere.\nNaturalmente, l'aspetto più originale e vincente è la presenza di una figura immaginaria dall'altissimo QI ed in grado di esprimere una serie di concetti potenti ed interessanti, riuscendo comunque ad emozionare.\nAlcuni passaggi sono leggermente troppo lenti, il ritmo scende un po' troppo, soprattutto nelle sequenze di contorno.",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "What a bunch of tripe. Nothing about this movie makes any sense. No characters are even like able. No one would be sent into space with so much psychological baggage. If you wanted a reason to never get married watch this film.",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "So someone thought to try to make a Solaris (1972) type knockoff and put Adam Sandler in it....next time you think your idea is weird remember that. This is easily the most boring thing Sandler has ever made. Kind of crazy that despite how bad a lot of his stuff is, I can never really say I was bored with any of it until now. The acting isn't bad. Muligan has ever moments but she really isn't given much to work with. Reminds of amy Adams in the DCEU type situation. Sandler is trying as well and doing a decent job but again not given much with very muted performances the entire way. Kind of a let down they could'nt do a real spider animtronic. Everything else is just ok. It's very boring to look at in general. The biggest problem here is imagine if someone took the first act of a slow burn movie and tried making the whole film around it. You'd get this. Tons of character development but it never does ANYTHING with it into any sort of plot really. This is trying to hypnotize you and really carry based off vibes and emotions which is EXTREMELY hard to do if not the hardest type of cinema there is. And it doesn't really fail as much as it never gets going. The lack of memorable locations and being mostly in the station doesn't really do anything for it. And the direction needs to be off the charts to make something like this work and it just isn't anywhere where it needs to be. It's ok maybe stronger sometimes at points than others but for the most part it never feels like your in a trance or anything like that. Just waiting for it to do something with all the character it establishes, jumping back and forth between his wife and all, and it just doesn't. It's just very boring. Skip this.",
    "date": "2025-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I walked in knowing nothing about the movie, ready to be wildly unimpressed with Adam Sandler in this movie. I also expected it to be horror. The presence of a spider puts the viewer on edge, ready until the last moment for it to turn gorey. I liked this movie lot, I watched it stoned and had a blast giggling at all the spider's lines. Such a politely dude. Overall impressed, I liked it a lot. It was good enough for me to completely disregard the spotty Russian accent happening throughout.",
    "date": "2025-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The movie was fine, but you almost get the feeling that it could have been soo much better. Like it pulled some of its punches. I still had a fine time watching it, and surprisingly Sandler was decently somber and it made for a pretty believable protagonist. He could be so much more than just the loud mouth guy in movies. 3.5/5 stars.",
    "date": "2025-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Deep Water, or Water Boy?\n\nSandler gave this role an isolated intensity reminiscent of Ben Affleck in the aptly named Deep Water, combining this seamlessly with a soft vulnerability reminiscent of...Adam Sandler...in....Water...Boy? \n\n\nIt's this excellent casting choice that allows me to feel both his intense loneliness/ childlike joy as he embraces Hanus in the sparkly primordial space soup. How much do I need to hammer it home? Just change the film's name to Deep Water Water Boy. It literally cuts to his untethered space umbilical cord....hell, maybe we are all deep water water boys.\n\nAs I lay in bed after watching this I felt as if my own WFH home had recently become its own isolated spaceship. Watching the dark figures of the coats on my door as I drifted into sleep, I thought: \"Hanus, is that you?\" The Hanus coats replied “Da f*k u doing? All this work? What happen to love, skinny human? What happen to love?”\n\n\n\"Ending was too ambiguous”, my ass. Was Hanus real? Br0, was this film even a film, or was it the spider on 3I/ATLAS intercepting our thoughts, trying to teach us something? \n\n\nMy point is this: Deepwaterwaterboy's love is more real than the universe itself, and I have been thoroughly schooled.",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "From the moment I saw Sandler give an outstanding performance in Reign Over Me in 2007, I knew he would continue to be a great actor in more serious movies. Similar to what Robin Williams and Jim Carrey tried to do throughout their entire careers, successfully or not (I say more often than not). \n\nI have been an avid fan of high-brow science fiction for my entire life. It is exclusively what I read, and exclusively what I am most critical of in TV and film.\n\nI really like this movie. I think is a very close vision of the book that does well to tell both the story and the emotions that Jakub is facing. \nThe ambiguity of some interactions between Jakub and Hanus, and the drawn out sequences, are there for a reason; and those reasons are not to bore you, but for you to take in what is really happening here and simply observe the beauty of the cinematography.\n\nScience fiction has never been about entertaining the reader. It has, and always will be, one of purest methods by which we explore the depths of humanity's connection to the universe; both externally and internally.\n\nIf you like movies like 2001,  Solaris, and Ad Astra, you should like this too.",
    "date": "2025-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Spaceman is a slow burn, yet stunning film with an impeccable cast, stunning cinematography and an immense score that dicatates far more of the film than most realize.\n\nMax Richter is the first note that I must make on this film as I believe that the score is at the core of this film. The emotion that he brings in his simplicity, directly corresponds to the same exact simplistic emotion that Adam Sandlar embodies in this uncharacteristic role. As the score progresses, the film progresses, not the other way around. To close ones eyes and listen, or to shut ones ears and only watch-- both would be as impactful and stunning in their own right. A film that can fulfill stunning visual beauty in tandem with a stunning acompaning score cannot be over looked. \n\nSpaceman will break your heart wide open if you are open to that fracture. A love that is rare, unproductive, but warm has always been difficult to portray, but Spaceman is able to make this theme flourish. Without seeing the two that are in love interact, you see a bond that is so strong that it transcend the distance of space and time. This is a film that will make you fall back in love with being in love. \n\nWhether you like it or hate it, the film makes you feel, the visuals make you wonder, and the score makes you cry. What else could a film offer?",
    "date": "2025-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Easily one of my top 10 movies. Love is something that transcends time and space, just as Interstellar taught us",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "So bleak, lethargic, and painfully contemplative one labors to breathe.",
    "date": "2025-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "(Spoilers) Unexpectedly engaging. Never thought I'd take a giant spider in space seriously, but when you understand it's his subconscious, it makes more sense. Sandler was great.",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie feels like a huge in your soul. It's incredible how Adam Sandler can make you feel good and happy even out from his comedy facete, he's a genius.",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Spaceman n’est clairement pas le genre de film que je privilégie habituellement, je dois l’avouer. Son rythme est lent, presque contemplatif, et l’approche très philosophique demande un certain lâcher-prise. Le film est ponctué de longs moments de silence, de scènes sans dialogue, ce qui peut être un peu pesant si on n’est pas préparé à cette atmosphère introspective.\n\nCela dit, je dois reconnaître que le film m’a surpris par sa profondeur. Il m’a poussé à réfléchir, à me poser des questions sur moi-même, et à remettre certaines choses en perspective. Et pour ça, je lui tire mon chapeau. Il a réussi à provoquer une forme de résonance intérieure ce qui n’est pas si courant.\n\nVisuellement, c’est une belle réussite. L’esthétique est soignée, parfois envoûtante, et la bande sonore accompagne parfaitement cette ambiance étrange et méditative. Adam Sandler livre une performance étonnamment convaincante, tout en retenue, avec une sensibilité touchante. Mention spéciale à la voix de Paul Dano, qui donne vie à la créature fictive avec une douceur presque poétique. \n\nCependant, j’ai trouvé que le film poussait la dimension philosophique un peu trop loin, au point d’étirer son propos parfois jusqu’à l’ennui. Et l’histoire de base avec les mystérieuses lumières dans le ciel manque franchement de force.",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A masterpiece of visual, narration and life reflections that will slowly grow all over your skin and stick to it until it fully captures with the latest scenes. The intimate-life companion to Interstellar, it similarly explores how life decisions bring us away from the loved ones. Some quotes resemble a script from Charlie Kauffman, and his uranium-heavy succinct epitomes of what love is. Particularly, the \"The first moment I saw her, I knew I wanted good things for her. If I don't know anything else, I know that\" right at the peak of the main character excursus. I could tell you this quote is from \"Adaptation\" or \"Eternal Sunshine\" and you would believe me. Notice the detail: it's not \"the first time I saw her\" but \"the first moment I saw her\". \nThe visual storytelling of the Beginning is possibly the best representation of life and human experience, putting into frames Spinoza's \"deus sive natura\". Sorry, showing off my philosophy memories. I just loved this movie, how it does not shy away from sadness and stays original to its intention. Must see.",
    "date": "2025-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "One of the most painfully slow and pointless movies I’ve ever watched. I like Adam Sandler and enjoy most of his movies…this isn’t one of them.",
    "date": "2025-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "There are many ways to analyze a film obviously if you like avengers and action movies this is more deep and philosophical than that is a representation of life itself",
    "date": "2025-06-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wasn't expecting to learn things about myself, deep things, very good movie",
    "date": "2025-06-27"
  }
]