[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It really is \"a tale as old as time\". Prince meets girl from the wrong side of the tracks. They all live happily ever after. I couldn't sleep my dog has just died. I needed some fluff and this did the trick.",
    "date": "2025-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Bottle and Wine Both are Old",
    "date": "2025-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Esta horrible, literal es la historia de como una chava se metió en la relacion de un casi casado y le terminó robando el marido #angelaaguilar",
    "date": "2025-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved the movie. I thought it was refreshing to watch. The actors were great! I loved the music too. The butlers story was very touching and moving. I thought the whole movie had a great story line!! I would give it 10 ☆☆☆☆☆☆☆☆☆☆ if I could!",
    "date": "2024-05-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best movie I've seen in awhile 10/10 definitely recommend",
    "date": "2024-02-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "You can't believe a script this bad got to the filming stage and the acting is not much better.",
    "date": "2022-12-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Really liked the cartoon in the end credirs!\n\nSchmaltzy, but I love that.",
    "date": "2022-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The movie is a pleasant enough way to pass the time. Standard story of simple girl from poor neighborhood wins heart of prince. But it's a lot of fun because it is aware of its own stereotype and enjoys it. The backgrounds and costumes are all consciously like a fairy tale, even the ending is a quote from \"Pretty Woman.\" And the actors have charm. It's a fun movie and not stupid.",
    "date": "2022-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It was such an awful movie! So bad that I was able to make a 20 minute rant to my friends about it. Everything from how the main protagonists to the plucky side characters was written poorly!",
    "date": "2022-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Don't waste your time. I cannot believe this is a 2022 modern movie made by Netflix. Cringy stereotype, bad acting, bad lines, and low-budget scenes that look like a hollywood studio. I was expecting an unrealistic yet warm-hearted romance, instead I had to watch the annoying main character pretending to be the purest and kindest person in the whole world while preaching others how they should live and treat others. I really wanted to stop watching 10 mins in, but I treated this as a Hallmark satire and continued just to find out how worse it can get.",
    "date": "2022-05-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It was terrible written, terribly acted, and deeply uncomfortable to watch. Full of exaggerated accents, hackneyed stereotypes, and bizarre directing choices. Formulaic, disappointing, and nearly unwatchable.",
    "date": "2022-04-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The arrogance she displayed throughout the whole film was off-putting.",
    "date": "2022-02-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Someone pulled all the worst scenes and cliched dialog out of a bunch of Hallmark Channel movies, threw them into an AI script generator, an hired a bunch of people to act it out. So glad my girlfriend fell asleep 10 minutes into it, so I could switch to something less excruciating.",
    "date": "2022-02-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I liked the location makes me want to visit New York very believable. Not a fan of the dancing grandma and I'm curious as to what accent the mains characters are trying to pull off. However, I wish them love and light. Given me hope that I may find my own prince Thomas on Vogal street.",
    "date": "2022-02-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This was a cute movie. I love when Netflix puts out these kind of romance movies. I know people think they are cringe or whatever but I enjoy them. Not every film has to be serious..",
    "date": "2022-02-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I can never get this hour and half back! Run, don't walk…away from this movie. ~Charlotte Boda",
    "date": "2022-02-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Forgettable, Unfocused, and Annoying beyond belief, \"The Royal Treatment\" is a shining example of a horribly written romance story.",
    "date": "2022-02-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "My goddness... This is just terrible...",
    "date": "2022-01-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Hooorrible! Just horrible. Too bad for the main male actor and a couple of others, like the butler, who were nice.\nThe main actress is annnooooying, faaake, fake, fake, and totally inexpressive. Her acting is stiff, forced and that constant smile is just terrible. \nThe movie is just a huge cliche from the begining to the end, and so many cringe moments that it would take way too much time  to write them all, well, actually I would have to basically tell the movie from begining to the end. \nI truly do not understand how netflix finances such horrendous productions. \nI mean, I once wanted to submit some comedy scripts, with original plots, as far as I know (I haven't seen a movie with that plot), but I came to find out they have a closed team who writes their scripts... And to me that is mind blowing. Your a ww movie platform, you're forced to kind of make movies constantly, but you rely solely on a bunch of people to come up with ideas.. Mmmhweeel this is the result. Inbreading in movie world.... Which is extremely sad, not only for the actors but especially for the public. They have 100 movies that repeat the same story over and over, but with different actors and d\nThe Princess switch was also cringey, but this... This gets the gold medal with no efforts.",
    "date": "2022-01-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "If you want to watch a cheesy chick flick this is the movie for you!",
    "date": "2022-01-30"
  }
]