[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A Soggy Witcher Dive.\n\nSirens of the Deep is a visually fluid but narratively flaccid Witcher outing that submerges its lore in predictable skirmishes and flat voices, failing to surface the franchise's depth. Doug Cockle’s Geralt growls with authenticity, but Joey Batey’s Jaskier jars, and Jessica Henwick’s Merwyn lacks spark amid a war of shallow alliances. What could have been a refreshing plunge into aquatic myth devolves into rote swordplay and lore exposition, the 2025 animation crisp but the pacing adrift, with twists that betray without surprise. The merfolk society teases intrigue, but the story meanders without the books' philosophical heft or the games' grit, leaving a forgettable ripple in the saga's wake.",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "A Netflix conseguiu, com a quarta temporada de The wutcher , me fazer, em 20 minutos, cancelar minha conta de 20 anos da Netflix...conseguiram o impossível! A temporada faz o Gerald ser um capacho e um personagem de última relevância, enquanto as personagens femininas se tornaram superstats! Completamente diferente da obra original e do jogo! Simplesmente horrendo!",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "totally broken ass series no need to watch. Herny is king kong dont blame ur eyes on him",
    "date": "2025-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Pure Netflix garbage. The writers just prove over and over that they are incompetent and don't know what they are doing. They can't even adapt a short story. Instead, they make another little mermaid with genders reversed and assassinate characters, WTF.",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This felt like an R rated Little Mermaid movie.",
    "date": "2025-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It’s genuinely surprising how a series with such rich source material could be executed so poorly. One would almost assume there was a lack of passion or even disdain for the original story, given how far this adaptation misses the mark.",
    "date": "2025-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Netflix has done a solid job of saturating quality content in the world of The Witcher. However, The Witcher: Sirens of the Deep lacks originality and underutilizes its interesting protagonist. \n\nThe Witcher: Sirens of the Deep incorporates plot points established in previous content, but does not further or evolve the character of Geralt in any way. With majority of the voice cast returning from the live action series, I can applaud the continuity and dedication to these stories. However, The Witcher: Sirens of the Deep retells The Little Mermaid in an adult version that is void of its own style or presence. \n\nThe animation style is artistically appealing and the fight sequences are the highlight of the film, but The Witcher: Sirens of the Deep does not give the audience enough to keep them fully invested and engaged. While moments to the film are unpredictable, its similarities to The Little Mermaid are evident. The emotional notes of the film do not feel fully explored and much of the character exploration of Geralt is rehashed elements from previous projects. \n\nOverall, The Witcher: Sirens of the Deep is not a complete waste of time, but its mediocrity proves that this franchise is successful when committing to unique storytelling. The action sequences are entertaining and there is significant promise with the mystical components, but The Witcher: Sirens of the Deep does not make this story its own.",
    "date": "2025-06-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is fantastic! So happy Doug came back to voice Geralt. This is WAY better than the live action failure that is the netflix series.",
    "date": "2025-04-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I absolutely love these Netflix animated witcher films keep em coming",
    "date": "2025-04-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Yet more of Netflix's creatives seemingly having read the source material this was based on, and totally disregarding it for something far inferior they came up with themselves.\n\nThe short story this is based on is a touching, insightful, and ultimately heart wrenching tale, loosely based on the Hans Christian Anderson tale of The Little Mermaid. It intelligently explores bigotry, unrequited love, human power dynamics and more - all within an exciting and action packed narrative.\n\nThis film however, replaces all that with an inane, comedic parody of the Disney version of the story, complete with a singing octopus baddy - and the modern Disney trope of the gender flip finale.\n\nAlso one of the voice actors seemed to have never done any voice acting before - actually possibly never any acting before - it was so amateur.  The rest of the cast was actually pretty good, though as per usual with Netflix's Witcher, Dandylion is played as a fool - which he is most definitely not in the books.\n\nI'm out, not going to watch any more Netflix Witcher.  I'll wait until it gets rebooted in 10 years, hopefully with some talented people who understand and respect the source material.",
    "date": "2025-03-31"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "lost me with the first song",
    "date": "2025-03-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I think this is the closest Netflix has been of following the actual story of the books. I just hate that they decided to do so only for one chapter of a book that only covers a few short stories about the universe.\n\nThe show was entertaining but would have loved to see an animated series of the books, not an extended movie of one chapter of the short stories.\n\nThere is so much potential here. Please Netflix do the same but with the Witcher series.",
    "date": "2025-03-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "We have in this film the proof that Netflix knows the story of the witcher but deliberately sabotages it, we are teased with each trailer a little more fidelity to the original materials to end up being spat on, between the villain who starts to sing, Essi Daven who is completely anecdotal in the story, and the story which was butchered to fit into the horrible chronology of the Netflix series... (which was nevertheless my favorite) honestly let this series die and continue to reread the books that we love so much.",
    "date": "2025-03-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Netflix has really ruined The Witcher.  It started off with great promise. Sadly midway through Season 2 on wards it just really dropped.  That god awful prequel was probably the worst, but this movie isn't really much better.  Dandelion in Netflix is so poorly done.  He isn't a clown in the books.  In fact, he is actually extremely intelligent but Netflix uses him as the comical relief.  Esse's voice sounded horrible.  And while the story it is based on is based on the Little Mermaid, they undid was made it work in the Witcher universe and made it more Disney Little Mermaid like.  It just didn't work.  \n\nNetflix, just stick to the source material!!  Stop trying to make changes.  You aren't improving anything, you are doing quite the opposite.  \n\nThe ONLY reason I give this a start is because hearing Cockle back as Geralt is always a welcomed thing.",
    "date": "2025-03-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Whilst there are a lot of things wrong with this movie, the standout issue to me was Essi’s horrific accent.  Whoever voice acted here must’ve been drunk or high because that was an absolute car crash of voice acting!!!",
    "date": "2025-03-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Why this team continues to gut what makes characters remarkable and impactful is not even a mystery at this point. Don't waste your time on this maladaptation.",
    "date": "2025-03-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "They took a good short story (A Little Sacrifice), skinned it alive and draped it's skin over an abominable, gender swapped retelling of The Little Mermaid. Do not waste your time.",
    "date": "2025-03-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Absolute trash. Not worth watching at all. It's just the little mermaid in reverse but with terrible dialog. It's not even worthy of being part of the Witcher series as Geralt pretty much has nothing to do with anything other then being there to uncover the not so surprising plot. You constantly know what's coming next. And of course for no reason at all they have to have Geralt have sex with a random character during the last 5 min of the movie just to make it feel like this is really the witcher.",
    "date": "2025-03-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "They disneyfied witcher. It's little mermaid/aquaman meets witcher with terrible writing. Clearly netflix wanted to cut costs even though the the last animated witcher they made was four years ago and very successful. I think in disneyfying it they also are looking to expand the audience to include 11-17 year olds. The animation is also disneyfied. I'd like to swear at netflix in this review for ruining IP that provides such fertile ground for good storytelling.",
    "date": "2025-03-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Having been a huge fan of the TV series and the games I was so disappointed with this. It's a witcher version of little mermaid complete with their own version of the 'you poor unfortunate souls' song and the sea witch. Unless you want a more bloody version of little mermaid I wouldnt bother.",
    "date": "2025-03-05"
  }
]