[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Under the Boardwalk (2023) It's a lovely and simple animation, but it doesn't get the recognition it deserves. Paramount Pictures should have invested more.",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Ughhhhhh what a formulaic and unoriginal plot with all the standard characters and tropes that one would expect from such a movie. The songs were not good and the singing was worse- especially the male protagonist. \nWestside Story (Romeo and Juliet) except with less real characters, more overt messaging and worse music… and crabs.",
    "date": "2025-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Ok, I don t like the ORIGINAL songs and the history but the animacion is pretty good so... I recomend it BUT what it at LATAM spanish.",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A very formulaic movie that goes through all the storybeats in the way you would expect. A pocahontas like story where two lovers meet from different factions. A girl that wants to leave her sheltered live and see the world. A guy that is a little too shy and finds it hard to fit in. It has all been done before and borders the line of cliche.\n\nThe only praise I can give in terms of originality are it's setting. Some effort was put into the world building. And the very musical like structure. Though most songs are pretty standard, and not much to write home about. It does feel like a musical with some production value.",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The animation is up to standard. The story is good. The humor is very clever and plays into many classic stereotypes with the Jersey accent and is very clever, and the songs are Amazing",
    "date": "2025-05-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This has got to be the greatest movie I have ever seen. The music 10/10, Romance 10/10, Crab sex scene 10/10. Please show this movie to your kids. \nUnder the Boardwalk is a charming animated musical-comedy that brings a fresh twist to the classic tale of star-crossed lovers. Directed by David Soren (Captain Underpants: The First Epic Movie, Turbo) and co-written with Lorene Scafaria (Hustlers), the film transports audiences to the vibrant world beneath the Jersey Shore boardwalk. Here, two hermit crabs—Armen (voiced by Michael Cera), a land crab, and Ramona (Keke Palmer), a sea crab—embark on an unexpected journey that challenges their communities' deep-seated divisions.​\nScreen Rant\n+1\nCartoon Brew\n+1\nIMDb\n+2\nCartoon Brew\n+2\nScreen Rant\n+2\n\nStory and Themes\n\nThe narrative centers on the unlikely romance between Armen and Ramona, whose love defies the longstanding rivalry between their respective crab communities. When a storm sweeps them away from their homes, their adventure becomes a catalyst for unity and understanding. The film explores themes of acceptance, courage, and the importance of embracing differences, all while delivering a heartfelt and entertaining story suitable for all ages.​\nCartoon Brew\nRotten Tomatoes\n\nAnimation and Visuals\n\nThe animation, produced by DNEG Animation (Nimona, Entergalactic), is visually stunning. The vibrant colors and detailed underwater scenes effectively capture the essence of the Jersey Shore, creating an immersive environment that complements the film's lively tone. The character designs are expressive and endearing, adding depth to the storytelling.​\nCartoon Brew\n\nMusic and Soundtrack\n\nThe film's musical elements are a standout feature. Original songs composed by John Debney and Jonathan Sadoff, with lyrics by Sean Douglas, infuse the narrative with energy and emotion. The soundtrack, released as an EP by Sony Masterworks, features catchy tunes that enhance the film's themes and are likely to resonate with audiences long after the credits roll.​\nWikipedia\n\nVoice Cast and Performances\n\nThe voice cast delivers memorable performances that bring the characters to life. Keke Palmer and Michael Cera's chemistry adds authenticity to the central romance, while Bobby Cannavale, Russell Brand, and others provide strong supporting roles that enrich the film's dynamic. Their performances contribute to the film's overall warmth and appeal.​\nScreen Rant\n\nReception and Impact\n\nUpon its limited theatrical release on October 27, 2023, followed by a video-on-demand debut on November 7, the film garnered positive audience reception, with an 88% audience score on Rotten Tomatoes and strong reviews on platforms like IMDb and MovieTickets.com . Despite initial low expectations, Under the Boardwalk has emerged as a sleeper hit, particularly in international markets such as Brazil and Central America, where it topped Netflix's charts .​\nMovieTickets\n+3\nCartoon Brew\n+3\nScreen Rant\n+3\nScreen Rant\n\nConclusion\n\nUnder the Boardwalk is a delightful addition to the animated film landscape. Its engaging story, vibrant animation, memorable music, and strong performances make it a must-watch for families and animation enthusiasts alike. The film's success underscores the enduring appeal of heartfelt storytelling and the universal desire for connection and understanding",
    "date": "2025-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I’m very disappointed because of how Paramount treated this movie",
    "date": "2025-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's a very good movie",
    "date": "2025-02-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Nice movie, but the idea is not original because there are already a lot of movies about two groups fighting for some reason. The characters are very cute and also a great music selection.",
    "date": "2024-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "So much better than I was expecting. So cute! It looks so good, and moves so well. Very Premium. Well worth adding to the repeat viewing list for the whole family. Great animation, characters, unique setting. Lots to come back for.",
    "date": "2024-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "it’s a crab Romeo and Juliet story, sweet, really funny, amazing songs that made all of us sing along and we’ve watched it on repeat since it came out 🙌🏻 firm family favourite here",
    "date": "2024-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Not the best animated film of the year, it's basically Romeo and Juliet with crabs. But characters and the themes are strong, and that more than makes up for it.",
    "date": "2024-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A little feel good film for all the family to enjoy, great cast, amazing songs and even some emotional scenes which can bring a tear to the eye. This film was way better than I expected and I'm so glad i found it!",
    "date": "2024-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "HELP, this was so sweet.",
    "date": "2024-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Entertaining and made you smile.",
    "date": "2024-02-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The mucho guy characters is a cringer and musical themes not suitable for a kids animation. Visually stunning but off-beat in tone and theme.",
    "date": "2023-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It was a really cute movie about getting over your fears and having fun in life. Also to not always judge others. Only problem was that the storyline felt a like a copy of 2011 gnomeo and juliet. Enemy colonies against eachother, think they killed eachother, go to war other the killing they thought happened. Couple that weren't allowed to date show up and saves each other in-front of everyone.. \nat least this movie had a few changes and fun characters.",
    "date": "2023-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It felt more of a DreamWorks movie than a Paramount movie, still remember when DreamWorks and Paramount partnered for 7 years (late 2005-late 2012).",
    "date": "2023-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Loved it. Don't care what anyone says It's a cute little movie! Loved the voice actors and it was cute and simple and funny.",
    "date": "2023-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I really really really love this movie because this movie is the best movie ever and I love the the character and I totally love this movie a lot, and yeah, I love it 🤩🤩🤩🤩🤩🤩🤩🤩🥰🥰🥰🥰🥰🥰🥰🥰👍👍👍👍👍👍👍👍👍👍💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖",
    "date": "2023-11-08"
  }
]