[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "As a horror nerd and long time lover of the genre I can safely say this is one of the top 10 best horror films released in the past 25 years.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "genuinely if I had the chance to be Chris, I would've stomped on his girlfriends face where she layed and jump in the air and knee drop onto her neck and take the gun and wack her face constantly until she wasn't recognizable. Call me gruesome or f****d up but the fact that she did that to not only him but my other fellow dark skinned brothers I would have done the whole 9 yards all over her face. Great movie though just wouldve not left her to die in peace like that ngl.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is amazing",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "So different but so relate able as a Black person. It was really scary and creepy but gives you something to think about. Jordan is good at taking a creepy little scare in your head and making it more psychologically scary. There were little comedy bits but it wasn’t too much, they fit in perfectly.",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Loved it..something fresh for this Genre",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Get Out’s whole journey, through every tense conversation, A-plus punchline and shocking act of violence, feels totally earned. And the conclusion is worth each uncomfortable chuckle and moment of doubt. Ultimately Get Out can’t help but ask the question: How would all these white people feel if they could walk in a black person’s shoes for a day? And that’s something worth considering.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "i loved this movie, the foreshadowing is amazing.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Had high expectations. Definitely didn’t exceed them, now to understand this movie you need a deep understanding of whats happening. SPOILER: In my opinion an innocent man that got basically manipulated into a psychopathic, seemingly normal family’s house is a creepy concept. The acting was so good you felt it was infront of you. Now even for someone who had higher expectations on the movie, and was a little disappointed. This movie was creepy and had parts that freaks you out. But I didn’t get a chance to experience what everyone else did. Definitely will be re-watching. A great 4 stars for quality as of now",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Jordan Peele's one and only good movie.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Get Out Is A Movie That For Me Is Overhyped As Hell, Mainly Because I Was Expecting It To Be The Craziest Scariest Movie Ever…and it just wasn’t that! Yes it’s a fine watch but it’s just not for me personally",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Jordan peele took off from this flick and never looked back!! Original and hilarious. Sets the bar! Enough said!",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Get Out is a razor-sharp horror movie with a wicked sense of humor and an adroit perspective",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A brilliant, genre-defining horror that combines sharp social commentary, tense suspense, and outstanding performances",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I think this movie slightly exceeded my expectations. It's not that my expectations were low; in fact, they were high. But the synopsis I'd read didn't interest me that much, but it's highly rated so I decided to watch it. From the start, I liked the movie's music, especially the two opening songs. As for the acting and the characters, I found Chris, played by Daniel Kaluuya, as a likable, unpretentious, and composed individual, the sort of person who genuinely tries to avoid trouble and monitors his conduct. Also Rod, played by Lil Rel Howery, I immediately liked them, and he made me laugh a lot. He gave his character a lot of personality. Overall, I liked all the performances, but especially theirs. As for the plot, I found it to be more interesting than I expected. There were several surprises, things that at least weren't obvious or predictable to the point that I wasn't sure how the whole story would end. That said, sadly we’re used to certain tragedies happening in real life, especially in the final sequence with Chris raising his hands. I’m from Mexico and I feared something very different would happen than what actually did. I don’t know how it took me so long to watch this movie.",
    "date": "2025-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Genuinely inventive, scary, and shocking. This was an incredible first effort from Jordan Peele",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Overall, this movie really stands out with its great storytelling and strong performances. It’s engaging from start to finish, smoothly balancing moments of humor, drama, and tension that keep you hooked throughout. The characters feel real, and the story is interesting enough to hold your attention without feeling rushed.\n\nIt’s definitely worth watching if you enjoy this type of genre. The film is well-made, entertaining, and leaves a lasting impression. Even after it’s over, you’ll find yourself thinking about the story and the characters, making it a memorable experience.\n\n-flickswithmigs",
    "date": "2025-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Instant classic. Thriller and horror wrapped perfectly up for you",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best horror films ever imo. Peele hit this rookie effort way out of the park, and has understandably never matched it with his next films.",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Straight to the point. I don’t like Daniel Kaluuya acting. Is like Zoolander ,always the same face…zero expression. And the whole idea is a damn copy of “the skeleton key”….. thieves!",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Got to be the best movies I’ve watched! Definitely watch this movie",
    "date": "2025-10-13"
  }
]