[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I don't know what all the fuss is about, it's better than Captain Marvel, Eternals, Wakanda Forever, Love and Thunder, Marvels, Multiverse of Madness and Thunderbolts",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "iTs MoRbIn TiMe",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Its got an understandable plot its not out of the roof kind of good but definitely not bad",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I really enjoyed this movie, it s a fun movie.  I didn't see any of the stuff the critics were complaining about as a problem. I had no problems with it.  Not saying this is one of the best comic book movie ever but it was really good.  It's very rewatchable IMHO.   I give it a 4.5/5 👍",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "👏👏👏👏👏👏👏👏👏👏👏👏👏👏👏",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Favorate part was when jared leto said ¨I am morbius¨, and morbed all up and down on the villian. jared leto´s acting was so incredible it had me shouting Morb!Morb!Morb!Morb! the whole time 10/10 experience.",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "this is the greatest movie of all time! I felt inspired when Dr. Michael Morbius said \"First we morb, then we ius, lets morbius!\" it brought me tears  . Jared Leto performance deserves an oscar. All the scenes in the movie where Morbius morbed all those guys was not actually CGI but was real since Jared Leto is that talented!\n\n-Written by my friend.",
    "date": "2025-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I like the part where he says it's morbin time and then morbs all over the place",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Why does this have a 71% audience score",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Morbius is a movie I knew would not be very good but I thought it could possibly live in the realm of so-bad-its-good which are the Taco Bell of films and have their place. Unfortunately, Morbius is, more than anything, boring. \n\nI tried coming into this film with a fresh mentality — I wanted to view this as a standalone vampire movie, one disconnected from Sony’s interesting choice to have a Spider-man adjacent universe without Spider-Man in it. What I found here was visually uninteresting, terribly written with phoned in performances from everyone except Matt Smith who seems to have accepted his fate here and decided to make the best of it. The design for Morbius is fine at best and resembles melted plastic at worst. The story is held together by vague nonsense meant to service the introduction of our main man Morbius and the villain who, predictably, has the same powers. Watching it back, a prominent flaw here is the film has committed itself to nothing, if you make it a noir horror that could have been interesting, if it leaned more into being a genuine vampire flick that could have worked too — anything would have been better than the half hearted end result we are left with. And the cherry on top of this film, which has to be mentioned, the advertising constantly alluded to the fact that this was connected to Tom Hollands Spider-Man, Tobey’s Spider-Man and Venom but the movie ends up being connected to absolutely nothing! Again, while I do not think it HAD to be connected to be worth watching, the fact that it knew it would ultimately connect to nothing but promoted itself as such to trick fans into coming to watch it almost makes me feel like I should take legal action against the film itself. \n\nI believe films that miss the mark often have enough to talk about as films that hit the bullseye. Not here. It commits a lot of sins as a film but the ultimate sin was being completely boring and forgettable. With no standout moments, subpar performances, lackluster visuals and a paper thin story, Morbius is one of the worst films of 2022 to no one’s surprise.",
    "date": "2025-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie sucked the life out of me. (23%)",
    "date": "2025-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The movie is awesome.",
    "date": "2025-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Morbius is a complete cinematic masterpiece, blending beautiful, well crafted storytelling and amazing directing and acting. Morbius truly is a life-changing movie",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "My husband wanted to see this and reluctantly I agreed. Little did I know what it was about but started watching and was hooked. I loved it and this is only the second Jared Leto film I have seen which he does a good job portraying Morbius. Plus the action is great. One to watch over and over.",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Just rewatched it, Michael Morbius was a memorable character for me as a kid, I don't think this movie deserves the hate it has received. I think people just wanted spiderman in it... the critics are absolute garbage for giving a 15% i never trust those fools.",
    "date": "2025-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Morbius was released in theatres in 2022 and stars Jared Leto in the lead role, Matt Smith as Milo, and Jared Harris as Emil Nikols. Morbius and Milo have the same rare blood disorder that has largely crippled them and left both men physically weak and almost unable to walk. But Morbius is apparently rich and a genius so starts experimenting with vampire bat blood to cure himself. The cure works but turns him into a vampire; shocking. Milo sees Morbius all better and wants the cure too but Morbius refuses. But Milo really wants to be a vampire so he steals the virus and starts draining people of blood. Morbius discovers what Milo has done and a big CGI battle takes place with a lot of vampire bats and Milo is defeated. I remember reading this comic as a kid and I liked it. It was dark, gory, and had a good horror element to it. Unfortunately Morbius went for a PG-13 rating which killed all of that and made the movie kind of dull. Jared Leto was ok but the movie dragged, the CGI was bad, and I just didn't care about the characters. Skip this an go watch the first or second Blade movies again for some good vampire superhero action.",
    "date": "2025-10-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Morbius is a near-complete failure as a superhero film. The acting is weak, with Jared Leto and others often delivering unconvincing performances. The plot is predictable and poorly paced, with underdeveloped characters and a romance subplot that is forced, forgettable, and unnecessary. CGI and visual effects are inconsistent, often looking like low-quality video game graphics. The villain is underexplored, and major plot points — including the ending and credits scene — are rushed and unsatisfying. Overall, the movie fails to deliver excitement, emotional weight, or coherent storytelling.",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "A movie so bad that you can make memes showing how bad it is.",
    "date": "2025-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "ABSULUTE CINEMA",
    "date": "2025-09-22"
  }
]