[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This is an easily entertaining movie, especially for a family with young kids and adults who want the occasional joke thrown their way.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Extremely creative, with several cleverly-hidden jokes I did not initially pick up on. Hugh Jackman and Ian McKellen are surprisingly well-casted. It has a decently strong narrative, holding together rather well. Overall, a delightful film from Aardman Animations.",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely lovely watch with my son over the summer holidays.",
    "date": "2025-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I LOVED this movie. Idk what it was but I really liked it. \nI loved the amount of hidden adult humor they added in as well.",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Flushed away is amazing!!!!! I don't know why but this movie is so creative and never gets boring! The animation is also pretty good! (Besides the humans) that's the only nitpick I have with this movie but I still its really good!",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 25 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated PG for Some Language and Crude Humor!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $64,500,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wow!!! Flushed away is funny",
    "date": "2025-06-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Although it is not the most perfect out of AardWorks movies, this is some enjoyable movie.\nIt has adventure with a flush down the drain to a city of London where other rats created home. Roddy & Rita made a hood pair after all, he really did belong in the family of her. I wonder where they go in the future.\n\nAnd to add with it, there is comedy, such as references to other movies (📀💿 in James home) & Finding Nemo with a goldfish saying \"Have You Seen My Dad?\", slugs bringing comic relief with their singing. Even our villainous toads have had a comedic part with that one moment \"My fly's undone\" & his backstory made an impact (Charles chose a rat over him)\nAnother part to make it funny: when Tabitha arrived home (who I wanted to see the face of) showed the pet her new cat - that was Sid. She would probably realise she really did overfeed him seeing Sid's appearance & he lowkey trashed the home. The reaction.\nTo say, do we really need rats as pets?\n\nEven the soundtrack hypes me up though",
    "date": "2025-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This was a really weird but funny movie.",
    "date": "2025-05-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It had clever moments in it. But really it's just a bunch of chaos, zany characters and themes that have been done better in other movies.",
    "date": "2025-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "For a movie marketed with toilet humor it is surprisingly engaging and memorable. Flushed away was one of the most influential films in my childhood. I rewatch this film every few years expecting to be disappointed due my more developed brain, however I genuinely enjoy it more each watch. Great writing, Great voice acting, fun sets and memorable moments that are sure to make you chuckle. For a movie marketed with toilet humor its surprisingly engaging and memorable and a must watch especially for the youth.",
    "date": "2025-04-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love it, really hilarious.",
    "date": "2025-04-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This movie is underrated, this DreamWorks Film needs to be checked out again, it has great characters, great story, great visuals.",
    "date": "2025-03-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I mean it’s not the best but it’s not a bad movie, so if your bored it’s worth a watch! 👍",
    "date": "2025-03-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A funny movie with great comedy! I will admit the characters are a tad annoying, but the humor, the plot, and its creative world. It’s a really fun riot.",
    "date": "2025-03-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This and Captain Underpants are the only time toilet humor has worked",
    "date": "2025-01-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Sucks, unfunny last time me and my sisters watched it was when we wanted to get teleported to when we was little and it just sucks",
    "date": "2024-12-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "So cute. I loved this movie when I was small. Gives me back such fond memories of when I was little.",
    "date": "2024-12-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "dude the rat movie is peak fiction he gets flushed down the toilet",
    "date": "2024-12-03"
  }
]