[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "loved this movie - very atmospheric. Interesting twists!",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "So, Daisay gave such a captivating performance. Overall the story was great, and the acting of all actors was stunning. The director was good and knew how to tell a captivating story. After seeing this excellent film, I had the impression that good cinema had returned.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "How on earth did the critics give this just 34%? It baffles me. This film has so many elements to it. A solid story that is unique. A sad start to life for the protagonist, herself developing into a strong, complex, multi-faceted character. The beautiful backdrop of the marsh. Really solid acting all round. A story so beautifully romantic. Interesting court room drama. A twist in the tale. I've seen it twice and have had tears in my eyes both times and I'm hardly a soft, maudling person myself. Watch this film. Watch it again in a few years. Recommend it to your friends and family. And finally, don't forget to watch it with your lover.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This story of a young woman's survival living outside the norms of conventional society is gripping from start to end. Part courtoom drama, this beautifully filmed story goes deep into the psyche and experiences of Kya, the \"Marsh Girl\",  eminently portayed by Daisy Edgar-Jones. Her survival of abuse and abandonment comes from her relationship with nature, until she goes on trial  acused of murder.",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I haven't read the book but as a standalone movie is great. I have watched it twice and it is very emotional film with great messages. Don't know why the low critic ratings.",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I'd never heard of the book or film, so came to the film with no preconceptions or expectations.  Personally I loved it, so I'm surprised by so many negative reviews.",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Brilliant story. Stick with it until the end 99.9% good",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A beautifully told story against a serene backdrop of a young woman having to endure many different curve balls of life including abandonment and abuse. A gem to watch and will stay with you after the credits roll.",
    "date": "2025-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Left early. Just wasn’t entertained.",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "One of the best movies ever seen. No kidding. It has it all: drama, suspense, romance, and a final surprise.",
    "date": "2025-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I never read the book but I love the movie. Definitely a musty!",
    "date": "2025-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I thought the story, actors, writing, and camera work were all good. The movie may not be an all time great, but certainly worth the watch.",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This is a travesty. From the CGI bird at the start to the immaculately clean swampland and it's inhabitants this film is so glossy it makes my teeth ache. Don't waste your time , read the book, it's very good.",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Another proof that you should ignore critics. Absolutely great movie, cinematography, location, acting... 10/10 for sure.",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was a really beautiful film, heartbreaking but inspiring. I've no idea why the critics hated it so much",
    "date": "2025-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "As a cynical 70 year old male I am pretty far removed from the intended audience for this movie. After glancing at the professional reviews, I thought I would end up watching ten minutes before relegating the rest to the web abyss. Actually, the movie raises a pretty solid argument. The protagonist is attractive, but not a 10/10. The case of a poor little girl left alone to figure a way to survive is described quite convincingly. David Strathairn plays well the sympathetic lawyer who is trying to save her life. In the end, we have a revelation that changes our previous impressions.\nAnd a nice Taylor Swift song with the end credits (again, not a big fan) with lyrics directly referencing the plot.",
    "date": "2025-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I did not read the book ... This is one of those films where the professional critics are just nuts. The film was quite good; never boring. And my companion also enjoyed it very much. Watch it.",
    "date": "2025-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This is a wonderful story, well-acted and beautifully filmed. I found it easy to immerse myself in the mystery.",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "My wife and I loved this film.  The story was complimented by the beautifully filmed scenery and locations.  It was good to see a happy ending and how Kyla consistently rises above the vile prejudices of most of the local folk.",
    "date": "2025-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Not sure why anyone would rate this badly. This was one of the most incredible movies I’ve seen. Loved every minute of it. Excellent story!!",
    "date": "2025-07-21"
  }
]