[
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Interesting start but turning into very sloppy chain of interviews and superficial research\n\nStarting with slowly rolling out the fascinating story of QuadrigaCX and the death of its CEO, the documentary dives into the uncountable discrepancies regarding the circumstances of this crime story and raises question after question.\n\nCarried by interviews with victims, investigators and other involved persons the storytelling is somewhat centered around two Globe journalists that kind of provide the objective voice of reason. You then wait for the numerous mysteries to be resolved...but this is when the disappointment starts. Although they are trying to work through the alleged conspiracies, the holes in the story are so big that you could land a plane in them.\n\nLike the very suspicious circumstances of Cotten's death are solved by a journalist traveling to the hospital in India where he supposedly died and having the story confirmed by the doctor. That's it? When you fake your death and scam people of 150 Million USD I assume you would at least make sure that it takes more than a trip to the hospital where you alledegly died to uncover your scam (like, I don't know, bribing the hospital staff?) But apparently one interview with a doctor and showing him a picture of Cotten was enough for an investigative journalist.\n\nNobody is surprised by the fact that Cotten errected a detailed last will a few weeks before he died but allegedly no safeguards to access QuadrigaCX wallets and accounts were in place?\n\nThen the apparent incredibly losses Cotten supposedly suffered with his trades in a time where cryptocurrencies where going all but up? Apparently, the creators forgot that every trade has a counterparty. The question by one of the victims (How can you loose so much money?) is actually spot on: Maybe because he wanted to? This is exactly how you could easily let money vanish, but the docu does not address this issue one bit but simply is satisfied with the explanation that Cotten gambled the money away.\n\nNumerous questions spin around your head and whilst you wondering when this questions will be asked, they subtly lash out on internet investigators and the movie ends...wtf?",
    "date": "2024-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Reasonable doc. I knew the story having listened to a podcast on the subject. It's was good to see it play out with faces to names & visuals. NOT impressed by the review SPAMMER SCAMMERS on here tho… tut tut. RT - take em down…",
    "date": "2024-01-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A rather paint by numbers documentary that focuses too much on conspiracy theories rather than the unregulated nature of such cryptocurrency exchanges.",
    "date": "2023-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Reasonable documentary. What spoils it is the confusion of narratives and especially one of the interviewees with her misandrical conspiracy theories.",
    "date": "2022-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I don't understand the low reviews. I loved it. So entertaining! If you like Fyre Fest, Bikram documentary, Tinder Swindler, you will probably like this one.",
    "date": "2022-05-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a great watch if you understand the Crypto marketplaces. One of the biggest Rug Pulls in history 🧐",
    "date": "2022-05-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Trust No One: The Hunt For Crypto King - 6.5/10. Luke Sewell directs this documentary on the peculiar situation involving Gerry Cotten and the crypto currency situation he had created after his death, causing people to lose 250 million dollars worth of money. Focusing on his life and how he started his company, and also focusing on the individuals that got scammed, Trust No One dives into the murky waters of crypto, and the thirst for instant money. It is interesting to a certain extent, but falters when it tries to zone in one the story it wants to tell. Theres points in the movie where they are insinuating things to be going one way, then literally the next interview side tracks and says that those things are not true or accurate. It causes for a head scratching flow, as things get interesting, but then get stopped by ridiculous theories or assumptions by the interviewees. You feel bad for the people that lost their wealth, but you also grow frustrated at how they say one thing after another, changing their minds on what might have happened. In terms of the recent wave of cheaters and fraudster docs/productions, this one isn't as good as the other productions, but, it still delivers some sense of watchability.",
    "date": "2022-05-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A very interesting movie!\nI got a lot of new information about crypto.",
    "date": "2022-04-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A very interesting movie! I got a lot of new information about crypto.",
    "date": "2022-04-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A spellbinding true crime documentary on Netflix.\n'Greed is Good' - Gordon Gekko, played by Micheal Douglas in Oliver Stone's Wall Street, way back in 1987.\n'The year I turned 26, I made 49 million dollars, which really pissed me off because it was three shy of a million a week.' - Jordon Belfort, played by Leonardo DiCaprio in Martin Scorsese's The Wolf of Wall Street, in 2013.\n'Nobody has the patience to get rich.' - an investor in cryptocurrency, in 2022 in this documentary.\nGreed has taken a newer, uglier and sinister form. The documentary reveals how relatively easy it is to scam thousands of people online and disappear with millions of dollars. \nBut that is only the tip of the cryptocurrency-berg. There is a mysterious death in India, a man with a geometric fox mask, internet sleuths who uncover one unbelievable fact after another,  the lingering possibility of a fake death...this documentary will keep you hooked. Watch it now!",
    "date": "2022-04-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Spoiler alert: he really is dead, possibility murdered. Now you can save 90min of your life and skip this POS.",
    "date": "2022-04-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "An intriguing title that destroys Netflix's reputation for documentary films that basically relies on its' empty promises with conspiracy theories.",
    "date": "2022-04-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Mildly entertaining.  Personally I have always thought bitcoin was a scam - a fad that idiots believed in somehow.  As more idiots jump on the bandwagon, it gains momentum but in a split second, POOF! GONE!  This docu was definitely one of the most bizarre stories I think I have ever seen.  \n\nToo many loose ends still.  Canadian reporter goes ALL THE WAY to india - talks to doctor - and that's it.  Death cert has name misspelled.  Reporter should have talked to more people such as MORGUE personnel to verify they saw the infamous Gerry, etc.  Doctor was paid off...my opinion.  Definitely dig up that grave - closed casket? really? - too many cherries on top that were ignorantly never pursued.   Little innocent wife makes out like a bandit also - millions in money and properties, that came from....??  I truly feel for the people who lost money..but only to a degree. Their insatiable greed is something they need to self-reflect on.  \n\nI 'firmly' believe good ol' nerdy Gerry is still alive with his goofy grin, sippin' on a mimosa down in Aruba.  It's kind of like being a 'cheater'.  Once a cheater, ALWAYS a cheater. This dude has been a scammer for so many years, perfecting his art.",
    "date": "2022-04-01"
  }
]