[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Musicals are not my favorite, but this a great family movie and loved the storyline!",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "My son actually enjoyed the movie!",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Wonka LITERALLY milks a Giraffe… then busts out in song.. 🤦🏻‍♂️ enough said 👎",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I absolutely loathed this movie. It lacked originality and depth. The storyline was basic and gave no justice to the previous Wonka movies. They should have just left it alone.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was such a heartwarming and charming musical i really enjoyed it",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Pretty boring throughout.",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It was a whimsical story. Sabotage, inventions, and a song to go with it all. As a stand alone movie, it is fantastic. The music is catchy and the acting was phenomenal. Only issue is it may be too light hearted compared to the source material, but again, this is a reimagining of a classic story. Overall its fun for the whole family!",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Musicals always seems to force the songs in the dance numbers and singing.  This is really jammed in with sub par cgi. Closer to a live Rick and morty.",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "It is a movie that makes you dream (as cheesy as I know it sounds). It also is a decent lesson in economics of oligopoly.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Glorious, magical, mystical journey! Paul King did an extraordinary job of bringing this to screen. Extravagant, funny, witty, very cleverly written (or re-written?), amazingly adapted and very well executed. Timothée Chalamet shines in character and rest of cast also does not disappoint. Lovely adaptation and perhaps the most definitive iteration so far of this mesmerizing and intriguing tale. Brilliant cinematography and visually stunning. Great new songs as well. Absolute joy to watch",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "When this movie came out I thought that it's gonna have the same concept and story as in the previous 2 movies, just another remake with some modern twist to it. And I immediately got very skeptical because we don't need the same thing, we need a new story. It turned out to be pretty good and it's actually a prequel to the previous movies. Throughout the movie we can see what happened with Wonka before he opened his chocolate factory and became so famous. Another thing I didn't knew that it's a musical. The movie is cute, Timothee did his thang. Was it one of the best musicals I ever saw? No, it was very decent.",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is absolutely wonderful - full of whimsy, imaginative humour and fantastic music. If you’re someone who is particularly feeling creatively uninspired, this film might be what you need. Couldn’t recommend this enough, this could be my favourite 2023 film.",
    "date": "2025-10-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The movie was very good, it got the fantastical charm of the original, and also very whimsical if I would say. Overall it's a very good and enjoyable movie",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Its was amazing movie, Great story, wonderful music, and the ending was beautiful. It snap me that having a dream was not that stupid just keep dreaming and eventually you will get it just dont lose hope:-D:-D",
    "date": "2025-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Really great feel good movie thats heartfelt and fun from beginning to end.",
    "date": "2025-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The best and most book accurate portrayal of the titular character!",
    "date": "2025-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "My Charlie and the Chocolate Factory nostalgia tricked me into a saccharine, 116-minute chocolate ad — complete with a 2023 Oompa Loompa peddling booze at an ‘adult happy hour.’ Great role modeling, eh? A sweet treat with little substance.\n\nWatch out for the sugar crash.",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Trop de musiques, et pas dans le thème de Tim Burton.",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Love musical movie things",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What’s not to like? A most enjoyable film on every level.",
    "date": "2025-09-14"
  }
]