[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Bob has a fascinating story. But the director pointlessly featured himself way too much, and the editing and transitions are an annoying waste of time.",
    "date": "2025-02-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "You're stupid if you don't like this film.",
    "date": "2024-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I think we all know now that Bob’s story is fact and not fiction, it’s has been proven to be true too often. His telling of the facts have cost him and people close to him greatly but it was important for him to share those facts. Does this documentary give you all the information and facts you are searching for? Probably not, does even his interview with Joe Rogan give you the facts you are searching for? Probably not. But the take away is what your mileage is with all information given, for me I’m fascinated, like Bob, with the technology, how it could change everything. You might only care about aliens being real and the proof they exist. Whatever you want, the closest you will ever likely ever get to actual, verifiable facts right now, is Bob Lazar’s accounts of what he experienced. So from that point of view this documentary will give you some facts to help you move forward.",
    "date": "2024-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Neither the claim or the proof is the problem. Bob Lazar makes it perfectly clear - and this has been a known fact for over 30 years, The problem with this movie is it being portrayed like a documentary, while being thought of as (Yet, \"still a movie\"); just another story - narrated like just another prime time movie commercial and executed like neither of it's premises. Yet, the information in hand is too good to let slip. There's a lot to ponder.",
    "date": "2024-05-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Bob Lazar is telling the truth 100%. Its been proven now in many way by documents, testimonials of others that worked there and by different things he had said in the 80's being now proven like element 115. His name was found in the old work directory/telephone book even. The is a great abundance of proof now tgst he is telling the truth and if you don't believe that there is other worldly bio, technology, elements etc. then your mind just isn't developed enough to understand obtuse thinking. The negative reviews are by simple minded folksy people that prefer to be in the wake of laziness shadows.",
    "date": "2024-04-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This filmmaker took the incredible experience of Bob Lazar and made it even less credible by employing irritating and distracting sound effects and goofy screen shots throughout. They also used Mickey Rourke as a narrator--he slurs and mumbles his words and curses throughout. He difficult to understand and there are no captions. I find Bob Lazar's story very interesting but this documentary added no additional information. They just made Lazar's story less believable, which was not the goal of the film.",
    "date": "2024-01-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Any negative comment infuriates me.\n\nBob Lazar is telling the truth, and it really should change your reality.\n\nHe did work on UFOs, it's a fact and not an opinion.\n\nIt may take the government 3 more decades to shed a little more light on the secrets they are hiding from us.\n\nPlease do not let the government divide us on this too, like they already do with politics.\n\nOverall, thank you Jeremy for sharing his story. I found you from the Joe Rogan podcast, which the ep w/ you and Bob was truly mind blowing. I knew right away he was telling the truth, even though I didn't want to believe it. I have always been a non-believer in any extraterrestrial life.\n\nBut as a Christian, even the Bible/biblical times shed light to UFOs.\n\nThis is just another thing to add to the list of how our government is ruining our country and infuriating the citizens.\n\nThis story will be taught in science and history textbooks one day.",
    "date": "2023-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely mind blowing. I believe every word. Listen to him on Joe Rogan too. \nI'm thankful for Bob and revealing to the world how corrupt our government is. I mean, we all already know that. But not to the extent that they are withholding what our reality really is.",
    "date": "2023-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Interesting. Highly recommended 👍",
    "date": "2023-04-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Nothing new, a snooze fest. Far more interesting creepy pastas in YouTube.",
    "date": "2023-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I enjoyed this, but I agree with the other complaints, Jeremy focused to much on himself, and he drop the quick edits and flashing of ufos and nuclear explosions and missles. Like that made it so tacky and immature. Just focus on the interviews and the conversations. Get rid of all that old style out of date tacky wanna be spooky ominous vibe you were trying for. If you made it more serious and professional you'd get more respect but all that b.s. edited in is just laughable and so out of date. Alot of missed opportunities. I give it a 5 star just for Bob and his truth needs to get out",
    "date": "2023-03-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "i thought it was great some things sounded kinda dumb but he mentioned stuff that didn't exist in the 80s that exist today",
    "date": "2022-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I just watched this again recently after having watched it years ago when it was released. I would suggest this movie as a good stepping stone into the tepid waters of alien and UFO conspiracy theories. A conversation starter, facts that will leave you shocked and or puzzled -- could there really be life in this vast Universe surrounding us? We can't possibly be the only conscious life forms out there. If you enjoy watching this, you may want to then watch the Joe Rogan podcast interviewing Bob Lazar.",
    "date": "2022-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was a fascinating watch",
    "date": "2022-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Director turns fascinating story into a jumbled mess.",
    "date": "2022-05-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Just show the interviews with Bob Lazar. Don't need your dancing around or a narrator's voice from the storm pipe blubing something incomprehensible.",
    "date": "2022-03-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I hope Bob Lazar is vindicated not only with his information but another documentary. \n\nSo unfortunate the documentary featured more of this bearded guy. That I assume is the producer/director that was behind the terrible editing and green lighted the awful voice overs that seemed to be added just to increase the duration of the documentary.",
    "date": "2021-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Terrible editing! The deep voice overs not worth trying to understand.  This was more about Jeremy C, the producers and stupid comic inserts that discredit the film.  They did Bob Lazar a total dis-service.  The effects, the contant random subliminal clips, poor sound quality in every interview, the constant appearances of the documentarian bring nothing… This needs a redo to being professionalism to the topic and to honor Bob Lazar for his honesty and bravery.  Shame on the producers for such a shoddy job!  They failed to credibly represent Bob.",
    "date": "2021-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's well done and very interesting to watch, but points off because it clearly is trying to lend an air of credibility to this story that it doesn't actually have. It's pretty convincing until you read all the details they left out, on purpose.",
    "date": "2021-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The chaotic editing, the voice overs that bring nothing, the loud sound design, the annoying glitches and effects, the contant random subliminal clips, the poor sound quality in every interview, the constant appearances of the documentarian that bring nothing… I'm genuinely  invested in this topic but the editing made it really hard to enjoy.",
    "date": "2021-06-01"
  }
]