[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The animation - scary. It’s almost like Coraline. I thought this was a fun movie to show my class. I teach 2nd graders. Three of the kids asked me to turn it off after 15 minutes because they were scared. And I understand why. This is not a good kids movie! It’s super creepy with a very underdeveloped plot! The animation is creepy and the whole opening plot with gross meat contaminating waters and innocent creatures in cages being forced to cry by evil hillbillies is NOT child material. What were the directors and producers thinking when they made this???",
    "date": "2025-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "What did I watch? A pitchy movie that, at times, that was disgusting and contained too much potty humor. Like way too much potty humor. The characters are fleshed out to some extent, the animation is unique in it's own way, but the movie is crude and disturbing. A child's nightmare.",
    "date": "2025-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I am... Forever traumatized by the amount of fart jokes, and fart jokes, and fart jokes... Do they have a fart fetish..? Honestly, this movie is a joke compared to the book. Read the book instead... Also butt inflation? Really? Another fetish?",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It was like they tried to blend 5 movies into 1",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Never have I ever watched a movie so unsure of it's own ideas. It had a WHOLE BOOK with an already established and beloved plot, and decided to flush it down the toilet. Speaking of toilets, the excessive use of toilet humor was unbecoming. Pick an idea and stick with it instead of making us sit through your barfed up movie.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "O filme é divertido em algumas partes, mas é cansativo. Os pestes (The twits) sao personagens legais mais é so isso mesmo \"legais\" nada mas.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I do not find useful to teach children that to be free in this world means to be mean. The first song closed my available time for this film.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Could barely make it through 10 minutes without cringing. What a way to ruin a truly wonderful and funny piece of children's literature. Other than the name there is little to nothing linking it to the book. Truly insulting.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This movie would been mid to have much fart jokes and fetish for such a comedy movie? Yeh it’s not gonna be good, but it more mid.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "O filme tinha Potencial de contar uma história legal e este filme até que consegue Fazer algo bom, o problema dele é o Humor Nojento que atrapalha pessoas mais Sensíveis e Aspectos forçados que estraga a essência de Road Dahl",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Visually chaotic and overstimulating, made even less sense than the original Dahl novel (which is saying something). I kept thinking it was almost done and it just kept going and getting dumber.",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Su historia, personajes, animación y canciones la hacen una película chistosa y divertida además de darnos un mensaje de no odiar a los demás y la importancia de la familia, sin duda una película super recomendable a mi parecer, ustedes deberían apreciar más esta obra maestra, al menos es 100 veces mejor que Kpop Demon Hunters",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Orphans try to save Loompa Land creatures from the trickster Twits. This movie has some clever mispronunciation jokes, but the rest of the humor is mainly just fart jokes.",
    "date": "2025-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Cute but not my favorite. The animation style and the raw jokes made it hard to watch with my young children (which I assumed this was made for) some scenes were too dark and crude. Some were boring. The characters didn’t all fully make sense.",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I genuinely can't believe how terrible this film is. It has absolutely nothing to do with the original story whoever gave this film the green light needs to be sacked",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "5 stars for teaching kids how foolish and absurd Trump supporters are.",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Borderline unwatchable. What were they thinking? This is the Twits in name only. I lasted 20 mins before switching off. Garbage.",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Surreal, but in a bad way...",
    "date": "2025-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I can't believe that someone actually thought this was a worthy adaptation. It's so wrong in every way. Appalling.",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Probably the worst movie I've seen in several years. Almost unwatchable. I kept waiting for it to get better. It never does. What a disappointment.",
    "date": "2025-11-04"
  }
]