[
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Not very funny, well, that's obvious if you know Will Ferrell and Kevin Hart. Funny (funny peculiar, not funny ha-ha) storyline, ambiance and general look. Good cinematography though. Not very well written it seems, a bit over the top melodrama, even for Hollywood. Rest of cast pretty good in character, mildly entertaining",
    "date": "2025-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I really enjoyed Kevin and will's dynamic easy watch funny raunchy and fun",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "So bad. I really believe Kevin Heart is so annoying, that almost everythimg he is in becomes crap.",
    "date": "2025-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very Funny, Will Ferrell and Kevin Hart are a great duo",
    "date": "2025-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It feels like hollywood slop off a conveyor belt. Mind-numblingly unfunny, not a single joke landed. \n\nKevin Hart plays the same cardboard character he does in every movie and Will Ferrell puts in about as much effort into this roll as you'd expect (none).",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Starring Will Ferrell, Kevin Hart, and Alison Brie, and directed by Etan Cohen, Get Hard is a comedy that promised absurdity and satire but ends up feeling more uncomfortable than entertaining. The premise alone — a wealthy, naive businessman, James King (Ferrell), facing prison and hiring Kevin Hart’s Darnell to “train” him for survival behind bars — could have been a clever setup for a buddy comedy. Unfortunately, the execution misses the mark in almost every way.\n\nThe film leans far too heavily on racial stereotypes, particularly the assumption that Darnell, as a Black man, inherently knows everything about prison life. The narrative tries to spin these clichés into humor, but instead it lands awkwardly, often feeling tone-deaf and outdated. The jokes rely more on shock value than clever writing, which makes the film hard to watch without cringing at times.\n\nKevin Hart is usually the heart of his films, and here, he does his best to keep scenes lively and inject energy into the otherwise lackluster script. Yet even his considerable comedic talent can’t fully compensate for the weak structure and problematic humor. His character, despite being central to the story, is underdeveloped, leaving Hart to carry much of the film on his own shoulders.\n\nWill Ferrell’s performance as James is, unsurprisingly, over-the-top and grating. His exaggerated cluelessness dominates the screen, often overshadowing any potential humor. Ferrell’s one-note approach makes it difficult to invest in the story or the character, as his antics feel forced rather than organically funny.\n\nThe supporting cast, including Alison Brie, is underutilized and mostly serves as a backdrop to the misfiring lead performances. The film tries to wrap things up with a moral lesson about growth and understanding, but by the time it reaches that point, the audience is unlikely to care.\n\nGet Hard struggles with tone, timing, and sensitivity, turning what could have been a sharp and entertaining buddy comedy into a forgettable, uncomfortable experience. Even fans of Ferrell or Hart may find themselves wishing they skipped it entirely.",
    "date": "2025-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I enjoyed this movie 👍",
    "date": "2025-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Way more misses than hits in both the writing and delivery aspects of the film",
    "date": "2025-06-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Pretty silly but that's the point.",
    "date": "2025-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely hilarious Ferrell and hart made a great duo",
    "date": "2025-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie is a complete waste of time. Yes the writing is terrible, it's predictable and terribly acted. But what really bothered me was the lighting. Daytime soap opera lighting. I suspect there's a story here about a nephew being indulged to film his first movie with the reluctant cooperation of his uncle and unlucky friend.",
    "date": "2025-06-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "He got so hard that getting hard makes him soft",
    "date": "2025-03-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best movie ever 10/10 funny scenes absolutely underrated it was exquisite and it has been done dirty by these reviews I think it's a better movie than it has been portrayed here I'd give it a watch it's is brilliant a funny relaxing movie that you could just easily sit back to and not a need to think too deeply into it",
    "date": "2025-02-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I watched from beginning to end. Not going to lie it was funny here and there but storyline not strong.",
    "date": "2025-02-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Crude with a pinch of bad taste, but executed with enough batshit crazy humor and charism to make this a fun ride.",
    "date": "2025-01-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thought it was a great movie, laughed so much through the whole movie.",
    "date": "2024-12-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Based off the thin plot’s comedic foundation with juvenile repetition, the film failed its eponymous objective in terms of deliverance, not taking its idea seriously to connective laughable levels. Both Ferrell and Hart nonetheless tickled the funny bone rather independently based off their own signature energy being the decent success despite not at the level that initially compelled the film. (B-)",
    "date": "2024-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Absurdly funny prison comedy",
    "date": "2024-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "\"Get Hard\" starring Will Ferrell and Kevin Hart is a raucous comedy that delivers laughs aplenty. While the premise may raise eyebrows, the duo's comedic chemistry and outrageous antics keep the film entertaining. It's a wild ride filled with absurd humor that's sure to leave audiences chuckling.",
    "date": "2024-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "One of the worst movies ever. Two morons who think they are actors spend 2 hours mugging for the camera. Will Ferret and Kevin Fart are not funny, never were funny and never will be funny. They should be banned by law from.making movies. Hopefully an executive order is coming. Make movies great again.",
    "date": "2024-03-31"
  }
]