[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Nothing about Nichol’s ties to and training by Islamic extremists when he met with known terrorists in the Philippines multiple times and brought that knowledge back to Timothy Mcveigh.",
    "date": "2025-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Guy was a jerk.  Good documentary",
    "date": "2025-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Barely mentioned the kids in the daycare there.",
    "date": "2025-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "77%. 6/18/25. Didn't know anything about the story. They take you back to the events with the FBI in Waco that resulted in 76 people, including 25 children dying. These right-wing domestic terrorists wanted retribution and completed the OKC bombing on the same date 2 years later. Luckily they found these guys pretty quickly. Sad story. 2/5 rewatch - not much need to",
    "date": "2025-06-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A reasonable retelling of the 95 atrocity. Felt a bit rushed in important places and strangely slow and undramatic in others. Worth a watch but not a particularly impressive documentary. Watched on Netflix.",
    "date": "2025-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The documentary \"Oklahoma City Bombing: An American Terror,\" released in 2025 on Netflix, delves into the tragic events surrounding the bombing and examines the motivations behind Timothy McVeigh's actions. It explores how he orchestrated this devastating attack and discusses the possibility that he could have evaded capture. Additionally, the film provides context by touching on the events in Waco and their implications.\n\nFeaturing live footage from April 24, 1995, just two days after the bombing, the documentary presents a comprehensive look at the coverage from various news networks. \n\nI found the documentary to be exceptionally well-crafted; it not only recounts the harrowing events but also includes authentic documentation and live recordings, making it an invaluable resource for those unfamiliar with the subject. Overall, I thought it was an outstanding production.",
    "date": "2025-04-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A clean but underwhelming documentary. It provides a good surface level overview but really should have dove deeper into Mcveigh.",
    "date": "2025-04-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A good, generic documentary about the bombing which takes you back in time to this devastating tragedy with an assortment of interviewees who lived through it.",
    "date": "2025-04-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Watch a noble lie and you'll see they glossed over like 90% of what happened.",
    "date": "2025-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It's not as much a documentary as a chance to be political and blame all the ills of the world on the side they truly despise.  Guess which side that is?",
    "date": "2025-04-21"
  }
]