[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A Classic Remake and Horror thriller on it's own. Acting is really good. Moss is excellent in this and does a great job balancing trauma, strength, vulnerability, and courage. Dialouge over all is really good as well. Adrian is a good villian but I wish he had more personal development and was less of a symbolic boogyman. Everyone else does really good as well. First rate physical acting as well. Excellent editing and a really sharp script overall that cuts like butter the entire way. Everything else is really well done. Sometimes the lighting is a bit to dark and dull. I do get its reflective of mood and where the character is but also dear god don't be afriad of showing light so the audience can actually see. It's a great blend of Sci-Fi elements also which shows once again it's crazy the directions and elements you can take this idea. Special Effects are really good as well. This remake has absolutely 0% in common with the 1933 classic. It's a take on mental trauma, abuse, and tons of commentary on how the abuse of a spouse is a invisible villian that no one else can see. It builds perfectly as a thriller also until the final what feels like a tacked on conclusion that kind of ruined it a bit for me to give it the perfect score. It's a slow burn the entire way but again ramps up perfect until the final 10 minutes where it probably should've ended with the first climax. It just kind of feels a bit farfetched and again because we don't see Adrian the entire time really it just doesn't have the same payoff. Overall this is how you do a remake and really it feels 100% like its own thing. Anyone who is a fan of the franchise, any actors here, the director who does a really good job, fims that find creative way to explore trauma/mental health subjects, horror or thriller fans and even Sci-Fi. I would still give it to the 1933 original is still the best but without a doubt this is the best entry of the sequels and remakes.",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie all around",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Original and well-acted, it's a more contemporary take on an invisible man.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie kept me on the edge of my seat the entire time then you think you’ve got it all figured out and then BOOM…. SUPRISE, SUPRISE, SUPRISE …!!!!!!",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Another white man bad movie.",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved this movie. As a man I can only imagine the terror of not only being a woman stalked, but having things done to you to mess up your entire life and all your loving relationships. That this is all being done by an unseen force is a brilliant allegory for dealing with personal demons that no one else can see and so everyone attributes to being \"all in your mind\". Elisabeth Moss is one of the best actors to ever appear on film, and it's only the Academy's bias against horror movies that can explain why she didn't easily win the best actress Oscar for this performance.",
    "date": "2025-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Incredible cinematography and story telling… Top Notch Cinema",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Extremely good!  I loved this adaptation.\n\nThe story was very well put together, the acting was phenomenal, the cinematography did a great job at making us feel like we were either watching or being watched, and the music/editing brought it all together.\n\nMy one tiny problem was that the CGI for the invisible man wasn't the best, it didn't ruin the film for me in anyway, but it was pretty obvious.",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of my favorites",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The best modern horror film ever made",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This movie does not deserve such a high rating. Let's be real here. So many plot holes. Basically trying to be a science fiction horror but all characters are indestructible and completely illogical. \n\nSpoiler: there is a scene in the prison holding area where like 20 guards run out 2 by 2 and keep getting owned by the hollow man. But his suit is breaking, so everyone can see parts of him. Elizabeth Moss is on the ground, with a gun within reach, as she watches Hollow Man own guard after guard in different ways for about 2 minutes. Then after he owns all these guards (all of them are total dweebs btw), she gets up and chases him. Wtf. \n\nAlso, Elizabeth Moss literally stabs herself in her forearm vein and drags the pen across to bleed out. But all of a sudden, hollow man appears to stop it. Then she stabs him like 4 times. You'd think they would bleed out,  but they didn't. There was no blood on them anywhere, it was just forgotten about completely. \n\nLastly, nobody ever believes Elizabeth Moss even after they find the hollow man suit. She was saying this suit existed the whole movie. They find the suit. They still don't believe her that her ex partner Adrian is trying to kill her. They think it's Adrian's brother, who has absolutely no motive. \n\nThis movie was not well thought out. Things like this take you out of it and make it laughable. Something broken on RT that this is over a 50% audience score. \n\nSwiss out.",
    "date": "2025-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Thrilling and good and classic Blumhouse ! Blumhouse has started overproducing movies, but this was made in an era when they were all pretty good. Kept me on the edge of my seat. No dumb s3x scenes etc. This was just good classic thriller. Wish there were more movies like this.",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Intense thriller. Love having the heartbeat moments, nice twist",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "With the exception of brilliantly scored and executed first-reel music... the film stunk.",
    "date": "2025-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Deeply unnerving can’t guess what’s coming next",
    "date": "2025-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Soooooo good. Very surprised.",
    "date": "2025-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It is a good movie. Definitely worth watching.",
    "date": "2025-09-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "From what i remember this was a WTF is happening so yeah, watch it.",
    "date": "2025-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Leigh Whannell and Elizabeth Moss in a very clever project.",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Underrated gem. At least I thought so.",
    "date": "2025-08-18"
  }
]