[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It's embarrassing to hear the word \"Neolithic\" and \"Neanderthal\" in the same sentence, especially when the skeletons they found in the cave were dated to 45,000 years ago, which is _way_ before the Neolithic. In fact, 45,000 years ago puts it in the Mousterian.\n\nI thought \"just a bad mistake\" and then the guy is trying to knap a Neanderthal tool by just bashing the rock and not attempting to use any of the documented techniques of the Mousterian.\n\nIt's laughable to hear \"I'm essentially sharpening it\" while referring to the definitely *not* sharp potato he made.\n\nIt's as if the director thought \"oh, we need to show someone bashing rocks together because I saw that on another documentary\" but hadn't done the homework to be credible.\n\nWhat a bush league job, guys.\n\nFor shame.",
    "date": "2024-06-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Interesting exploration of what Neanderthals were like and how some of our misconceptions about their lives have changed after more archeological research. I think they did a good job of covering a lot of ground in a relatively short run-time. The makeup and facial prosthetics of the actors looked realistic enough. My only complaint is they could've gone into more detail about what kinds of foods Neanderthals were eating based on analyzing their tooth enamel, and it could've had some more \"action\" like showing what Neanderthal hunts might've been like.",
    "date": "2024-06-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent.  Unveiling facts about these people that were surprising and showed his human they were.",
    "date": "2024-05-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "As an archaeology student and documentary fan, I must say I was very disappointed with this movie. Like former documentaries I expected to see Neanderthals living with a voice over the film; to see how they lived and what happened to them. There was no discussion on the several theories about what happened to the Neanderthals. The film was mostly about how the archaeologists felt and their techniques. Very disappointed and not very informative at all.",
    "date": "2024-05-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's a very enjoyable documentary to watch.",
    "date": "2024-05-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "An excellent documentary",
    "date": "2024-05-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Beautifully done. Informative and humbling. It manages to tels the scientific and paleontological story very well but not at the expense of the \"human\" story and reenactments.  A kind and humane homage to our cousins. And with Patrick Stewart as narrator!",
    "date": "2024-05-03"
  }
]