[
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The premise is interesting. However, the superficial and expository dialogues take away much of the scene's emotional weight.\n\nThe chase scenes are very well shot, while the action sequences fall short.\n\nI found the contrast between the first and second film quite fascinating - the first focuses on a confined setting and a group of survivors trying to escape, while the second turns into more of a zombie movie, with generic cinematography and makeup, yet featuring a story that stands out from other zombie films.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I feel like this is a movie you watch just because the overarching story somewhat interesting. All I want to know is why the maze was important, but the coolest part of the trilogy—the maze—isn’t in this movie.\n\nOther than that, terrible score, poor writing and acting, cheesy lines, but hey, at least the zombies are kinda cool?\n\nI’m only watching this to get to the third movie. Hopefully that one is better than this.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Ce deuxième volet ne me convainc pas du tout. Je trouve que le personnage de Theresa possède quelque chose d'altruiste que tout les autres n'ont pas. Ils ne pensent qu’à eux alors que les intentions de Theresa ne sont en réalité pas mauvaises. Bien sûr, la manière n'est pas la bonne, mais elle a raison en disant qu’ils sont peut-être la solution au problème. Certains personnages introduits dans ce film sont interessants, comme le duo père-fille, mais tout le setting du film ne m’a pas convaincue.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Filme: Maze Runner 2 Prova de Fogo\t\t\t\nElenco: @imdylanobrien @samohtsangster @kayascods @willpoulter @kihonglee @dexterdarden @alexjflores_1 @amlameenbaby @rosasalazarbr @nathalieemmanuel @aidangillen @clarksonpatricia @lilittaylor \nModelo: #ficção #ação\nDuração: 2h 11m\tAno: 2015\nMinha opinião: Mazer Runner: Correr ou Morrer (2014), Prova Mortal (2015), e Cura Mortal (2018). Esta triologia que marcou os jovens teens. Neste 2º filme da triologia ocorre com o grupo liderado por Thomaz (O’Brien) e seu grupo, fugiram do labirinto e suas bestas. E agora descobrem que existe uma cidade, muito fortemente guardada e são recebidos por Jason (Gillen) e Ava (Clarkson). Apresentam todo o local e todos ficam felizes. Mas por pouco tempo. Logo Thomaz começa a desconfiar do local. Que pessoas desaparecem, mas que na verdade eram enganados dizendo que iriram para o paraiso, mas era para o laboratório e usados como cobaia. Nisso fogem e encontram um mundo pós apocalíptico. E acabam descobrindo que existem criaturas, qual? Zumbi, sim Zumbi. E assim conhecem outros humanos que vivam ao estilo Mad MAx. E fazendo novas amizades e buscar um grupo de rebeldes que luta contra os dominantes. Ao final se surpreendem quando conhecem o que os dominantes tem feito com as pessoas. Até chegar ao final deste 2ª parte e para surpresa de serem traídos Agnes (Kaya) e vários serem capturados. Assim termina.\nVale apena assistir? sim. A grande surpresa foi os zumbis. Creio que nunca imaginava. Uma boa produção e efeitos e CGI.\nNota: 7,5",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Maze Runner: The Scorch Trials is an ambitious sequel that successfully carries forward the momentum of the first film while expanding the scope of its dystopian universe. Picking up right where The Maze Runner left off, this installment dives headfirst into a world ravaged by chaos, where survival is no longer about escaping a maze—it’s about outlasting a collapsing society. The movie manages to maintain tension, intrigue, and action while introducing new layers to the ongoing mystery behind WCKD and the infected world outside.\n\nDirector Wes Ball deserves credit for keeping the energy high and the pacing tight. The film wastes no time plunging its characters into peril, delivering set piece after set piece filled with chase sequences, explosions, and moments of pure adrenaline. While some critics dismissed the sequel as overly chaotic, it actually thrives on its unpredictability. Each environment—from the desolate urban ruins to the eerie desert wastelands—feels alive and dangerous, reinforcing the idea that the world itself has become the maze.\n\nDylan O’Brien continues to shine as Thomas, bringing both strength and vulnerability to his performance. His determination to uncover the truth about WCKD gives the story its heart, grounding all the spectacle in genuine emotional stakes. The chemistry among the cast remains one of the film’s greatest strengths, especially between O’Brien and Thomas Brodie-Sangster’s Newt. Their bond feels authentic and adds depth to the ensemble dynamic.\n\nWhile the screenplay doesn’t always hit every emotional note as cleanly as it could, it still offers solid structure and purpose. The dialogue is serviceable, if not particularly memorable, but the world-building is strong enough to compensate. What truly holds the film back is not its content but its marketing. The Scorch Trials deserved a larger cultural footprint than it received. It’s a sequel that should have cemented the franchise’s place alongside The Hunger Games or Divergent, but poor promotion left it underappreciated by mainstream audiences.\n\nThere’s also an impressive balance between action and mystery here. The infected “Cranks” introduce a horror element that blends seamlessly with the series’ sci-fi roots, and the cinematography captures both the dread and desolation of a dying world. This tonal shift makes the film darker and grittier than its predecessor, which works in its favor—it’s no longer just a puzzle, it’s a fight for humanity.\n\nUltimately, Maze Runner: The Scorch Trials is a strong continuation that proves the franchise had far more to offer than it was ever given credit for. It’s not a perfect sequel, but it’s a gripping, well-directed, and visually striking one. The film’s biggest failure lies not in its storytelling, but in the lack of recognition it received. For fans of dystopian action with heart and grit, this remains one of the most underrated entries of its genre.",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Se deja ver pero no es una buena película.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "You get to see the behind the scenes story of the maze runner,  asks why the leaders do it.",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Was not a bad movie by any means however it did not live up to the first movie. I felt like not a ton happened and it kind of just dragged on, the infected were a cool piece to the movie and revealing more of the memories was cool.",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "All they did was make stupid decisions and run. The graphics were pretty tho. Love Newt (for no reason really, we just do cuz childhood crush)",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This was such a waste of time. I will always regret watching this movie, I kept watching waiting for it to get good but it never did. Do not watch.",
    "date": "2025-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "What I just saw… it doesn't look anything like it! Why did they even give it the same name if it’s nothing alike? And once again, the Messiah trope appears—they basically destroyed Aris just to make the protagonist look better. It makes no sense.\n\nIn the books, Aris was actually important. He was the equivalent of Thomas in the other group. He mattered. But in the movie, they reduced him to nothing just to boost the \"chosen one\" narrative even more.",
    "date": "2025-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "why tf is her name ava. oh and I honestly don’t understand the hate-unless it’s like a book to movie thing-because I haven’t read the books and never will.",
    "date": "2025-06-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The Maze Was Just the Beginning.\n\nMaze Runner: The Scorch Trials (stylized onscreen simply as The Scorch Trials) is a 2015 American dystopian science fiction film. The film is a direct sequel to the 2014 film The Maze Runner and the second installment in The Maze Runner film series. It was directed by Wes Ball 🏃 \n\nNot bad, but not my favourite either 😐\nMeh, it passed the time. Just. 😐👍🏼👎🏼\n\nThomas and his fellow Gladers face their greatest challenge yet: searching for clues about the mysterious and powerful organization known as WCKD. Their journey takes them to the Scorch, a desolate landscape filled with unimaginable obstacles. Teaming up with resistance fighters, the Gladers take on WCKD’s vastly superior forces and uncover its shocking plans for them all.",
    "date": "2025-05-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Weakest out of the three movies",
    "date": "2025-05-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Maze Runner: The Scorch Trials, an action-packed sequel, loses its way in the process of trying to be more exciting.",
    "date": "2025-04-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It’s a shame they named this movie “The Scorch Trials” when there is hardly a single similarity between the book and movie. At least name it differently if you’re going to write a completely new story, that way you don’t make a fool out of the incredible book by James Dashner.",
    "date": "2025-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "É legal,mas é muito maçante de assitir,uma hora é momento de ação,adrenalina pura,depois pula pra momentos tão calmos e chatos,que chega a ser desnecessário. O desenvolvimento dos personagens é quase insistente,mas pelo menos o desenvolvimento de mundo compensa.",
    "date": "2025-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The story makes perfect sense and isn't hard to follow at all. In that regard it expands on the world and all just fine. The biggest problem here is there is pretty much 0.00% character expansion. As simple as Thomas hero arc was it still was something along with basic enough arcs for the other kids as a whole. This has almost none of that. there the same as when they started for the most part. Save for the girl which comes out of nowhere. The result is an adventure that feels like mindless sort of action at points throughout. It follows a logical flow but it just feels a bit much. The music and cinematography isn't bad. It's not bad direction wise but the new settings all feel like places weve seen in other films. Oblivion, Mad Max, The Hunger Games, even Fallout games. It doesn't have that same distinction the maze did. The zombies also kind of come out of nowhere and don't even feel like they fit the movie honestly. It feels like I Am Legend or dawn of the dead remake type stuff. Everything else is just alright about it. The whole zombie part with Winston and all could've been cut because that doesn't really even contribute anything to the plot. It starts out pretty good honestly in the facility with lots of action, cool ideas, and it's just well done honestly and you think it's gonna be better than the first. But it just keeps going with action and no character development of any kind. The kids all blend in terribly because of it. Than once Harriet shows up and her and Tom become the main focus it just really takes a dive. We just abandon the main group, get more zombies, and are given hardly any reason to care or like her as the new replacement. Same with Tom who basically gets no development at all. Than the kids come back and we get to the actual rebel group and the betrayal, the enzymes, and setting up for the Mockingjay style conclusion. It kind of feels like everything in the middle was just filler honestly looking back. I mean if your a die hard fan of these kind of novels/sub genre than knock yourself out here I guess. But most could skip it. It's dissappointing because the new locales, new action, ideas all should blow away the first and yet without any character expansion, not setting up new ones well, settings that don't set themselves apart enough, ideas that don't fit, and a script that's got too much action just weigh it down.",
    "date": "2025-03-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "While the film still looks great and has some entertaining action and decent acting, Maze Runner: The Scorch Trials is a thinly plotted and generic sequel that is almost bereft of stakes alongside having poor pacing and underwhelming character development.",
    "date": "2025-03-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Original maze runner was 10 times better. There is too much action and not enough feel good moments in scorch trials. Constant chaos that never really settles down",
    "date": "2025-01-20"
  }
]