[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "(CASTELLANO) Focus es ese tipo de película que te pones para desconectar y, sin hacer magia, te mantiene enganchado lo justo. No es el gran thriller de estafadores que promete ser, pero tiene suficiente ritmo y descaro como para que el tiempo pase sin mirar el reloj. Y en un género donde es fácil aburrir a mitad de camino, eso ya es una pequeña victoria.\n\nLo que más sostiene la película es la pareja protagonista. Will Smith tiene ese encanto automático que arrastra incluso cuando el guion patina, y Margot Robbie ilumina cada escena con una mezcla de carisma y naturalidad que hace que todo parezca más sólido de lo que realmente es. Su química funciona, aunque la historia no siempre esté a la altura de ellos dos.\n\nLa trama juega a sorprender más de lo que puede soportar. Hay giros que te los ves venir desde el otro lado de la habitación, y otros que rozan lo imposible, pero como el tono nunca se toma demasiado en serio, acaba funcionando como una especie de espectáculo elegante y ligero. Es cine de estafas \"de superficie\": bonito de ver, rápido, con diálogos ágiles… pero sin ese ingenio que te deja repasando el truco después.\n\nAl final queda justo en medio: entretenida, con momentos brillantes, pero sin ese golpe final que haga memorable lo que has visto. Es una mezcla curiosa entre comedia, romance y timo clásico, y aunque no encaja del todo, sí consigue lo básico: que pases un buen rato sin pedirle más de la cuenta.\n\n(ENGLISH) Focus is one of those films you put on when you want something light, fast and uncomplicated. It never becomes the sharp, clever con-artist thriller it tries to imitate, but it moves with enough style to keep you watching without checking your phone. In a genre that easily collapses halfway through, that’s already something.\n\nThe real draw is the duo at the center. Will Smith leans on his natural charm, and even when the script gets wobbly, he holds the scene together. Margot Robbie is the real surprise here: bright, funny and effortlessly magnetic. Their chemistry doesn’t fix the film, but it makes the ride smoother and much more enjoyable.\n\nThe plot wants to be twisty, sometimes too much. You can see some turns coming from a mile away, and others stretch credibility to the limit. Still, the movie isn’t pretending to be airtight; it plays more like glossy entertainment with quick dialogue and visual polish. It’s \"surface-level\" con-artist cinema: stylish, fun to watch, but never as smart as it thinks it is.\n\nIn the end, it sits right in the middle. Entertaining, lively, occasionally clever, but far from unforgettable. It’s the kind of movie that works once and doesn’t need a second viewing — and there’s nothing wrong with that when it delivers what it promises.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This movie did not hold up as well upon a second viewing.  Smith and Robbie didn't have convincing screen chemistry to make the romantic element stick.  Robbie is a good actress, but they did not give her a character with any depth. The scams and cons were imaginative (often far fetched) as a diversion, but somehow the whole plot did not hold together that well.  In the end the parts did not add up to a satisfying whole.",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "That was fun, with good twists and solid pacing. Some plot points felt a little sloppy, especially the scenes meant to throw the viewer off the scent. They don’t fully add up once you see the whole picture. Overall, though, it's an enjoyable movie with charismatic leads. It strikes a good balance between keeping the viewer in the dark and still making them feel like they know what’s going on. The con was on and I genuinely didn't know what was going to happen. Fun time.",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Filme mais ou menos, o roteiro é fraco, as cenas são mais ou menos, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Es una buena película, para ver un fin de semana con amigos o familia. La trama es atractiva y además te atrapa.",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Nothing wrong with it! Great entertainment!",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Full of twists and turns, a brisk and sleek pacing, full of glamorous style and thanks to the chemistry of Will Smith and Margot Robbie, this film is a lot of fun to watch. It's a gem.",
    "date": "2025-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The beginning of the movie is great.  Then the story loses its focus and spark.  The ending was okay.  It had great potential.",
    "date": "2025-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Very occasionally Focus' Hollywood glamour is offset by an allusion to the idea that money can't buy happiness, but essentially this is a hustler romp with a surprisingly romantic slant.",
    "date": "2025-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Better than expected",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of bests movie , reeally like watching it",
    "date": "2025-03-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Premise was good, but the movie could not keep it together. After the pivot to New Orleans, the plot thickened. It seemed interesting at first, but once the scene shifted toward the auto racing, it took a quick detour. The plot unraveled, becoming unrealistic. The third act was unrewarding and felt like a cheat after the better writing in the 1st and middle acts. \n\nOverall a disappointment of a film with good acting and a good setup.",
    "date": "2025-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It has to be the laziest writing ever. I genuinely expected there to be some unexpected turn in second half of the movie. It turned out to be a romcom but with no comedy. The real con in this movie is the time you waste watching it.",
    "date": "2025-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I liked it despite its flaws. the twists & turns were a bit if a stretch but I was willing to ket go & enjoy them. Smith & Robbie were surprisingly charming together. In a season of dark bloodletting serious junk out there, this was a little bit of fun.",
    "date": "2025-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The twists and tactics are a bit too surreal for the theme this movie was going for.  The chemistry between Mr. Smith and Mrs. Robbie wasn't bad, but could have been better.  The movie invested a lot of screentime into it and there was enough intimacy but there wasn't really enough emotion.  Not enough smiling and laughing during conversation, which is arguably more important for more immersion into the romance of the two.  This movie should have just had Will Smith play a cold heartless mob boss that robbed people at gun point instead of these unrealistic mind games and impossible pickpocketing.  It just breaks immersion when you have so much surrealism in a movie that's supposed to be realistic.  I feel like the directors tried to use Will's charismatic smoothness to \"smoothly\" pickpocket, or gamble, and... I didn't appreciate the bridge.  It would have been better to just introduce an evil, darker, and more violent side from Will to make it more believable, and aid in immersion, even if it meant going outside of Will's main comfort zone.  Directors also relied too much of Margot's charisma and attractive appearance for the chemistry between the two, as aforementioned her role needed more smiling and laughing while talking with Will.  The sensual scenes were good but lacked emotional depth.  She did a good job with her scene of emotional devastation, but there wasn't enough connection with Margot's character at that time to connect with her.  Will had too much screentime.  There wasn't enough internal struggle between Will and Margot either during the film when they were re uniting.  I think the director realized this and made it appear that Margot wasn't going to show up to meet Will by having her come late, but that's not internal struggle with re uniting, that's a cheap attempt at trying to elicit a connection between the audience and Will, and it didn't work, at least not with me.  And it didn't work with me because, as aforementioned, there wasn't any internal struggle for there to be a buildup for emotion during that scene.  Overall, poor use of actors, and weak development.  This could have easily been a 5/5 movie.  More emotions from both characters during ordinary conversation, less surreal pickpocket tactics and more violent robbery tactics, more development and screen time on Margot's character prior to the scene she's abandoned, and more internal struggle between Margot's and Will's character when Will tried to reunite.  Wasted masterpiece.",
    "date": "2025-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It made me fall asleep for real... The story is so dragging... It didn't keep me engaged.",
    "date": "2024-12-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It was worth to watch on netflix. Will smith and margot robbie did great acting in this movie. The moments were fun.",
    "date": "2024-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's entertaining, it's clever (if a bit cliched. It's got talented actors. It turns some idea upside down, Not great art, just a fun watch. Yeah, a few plot holes here and there, but nothing that makes it unwatchable. Low bar, I guess, but I don't regret the time I spent watching it just to relac and enjoy. Will is Will. Always watchable, even in dreck (which this is not, but it's also not top tier either. Margot Robbie shines in this.",
    "date": "2024-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "idk why the rating is so low i loved this movie! and i like to think i am a movie connoisseur… i laughed, i cried, i didn’t predict most of the plot twists and wasn’t upset with the ending at all! definitely recommend!!",
    "date": "2024-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Ever since the Will Smith Oscars slap I haven’t been able to watch his films quite the same, but Netflix happened to have “Focus” on and I remember it having it some good twists, plus I forgot how it ended. I recall the football gambling scene was really well done so I knew that scene was coming and always enjoyed its outcome. It’s mostly a fun, feel good movie with an air of sophistication and class somewhat reminiscent of Ocean’s Eleven but not nearly as enjoyable. The acting between Smith and Margot Robbie is palpable making it more entertaining of a watch. Everything’s a little too slick/easy for Smith per the usual but if there’s anyone to make it look real he used to be that guy without it coming off as far-fetched (it just gets old after awhile).",
    "date": "2024-11-13"
  }
]