[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best movies I have ever seen.  The movie was so good that it made me laugh. I definitely would recommend this movie to everyone.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Why is it a 28? Its soo funny! Why do people have bad taste of movies?",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Daddy Day Care is funny and good for kids.",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I cannot in good conscience recommend this movie unless you are looking for a young family movie.",
    "date": "2025-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 32 minutes!!!!!!!!!!!!!!!!!!!!!! Rated PG for Language!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $104,100,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Filmed on May 09th, 2003, in color!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Celebrating 25 years in 2028!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Copyright 2003-2025 by Sony Pictures!!!!!!!!!!!!!!! Released by Revolution Studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I have have always loved this movie. It's funny 😄 has classic one liners that make you chuckle everytime 😃 just allow it to be what it is, a simple kids movie. Simple",
    "date": "2025-06-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom.",
    "date": "2025-05-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The tagline is funnier than the movie",
    "date": "2025-05-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The movie is very funny. I loved watching it when I was younger, now I watch it with my kids and they love it. Great movie to watch as a family.",
    "date": "2025-04-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This movie is hilarious.😂 I’ve loved it since I was a kid!",
    "date": "2025-04-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It was really funny watching a dad trying to earn money by babysitting all on his own especially seeing all the cute and naughty babies. For some of you might not like its comedy because it can get a little boring but it is worth the watch!",
    "date": "2025-04-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "One of my favourite films as a kid!",
    "date": "2025-02-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "When you think kids movie have become boring, this movie appears and proves wrong!",
    "date": "2025-01-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is an absolute classic, a definite must see. Eddie Murphy is a comedy genius and his performance is excellent. the cast is absolutely star studded and the child actors do an amazing job, this movie is adorably heartwarming and emotional, it brings me to tears every time i watch it.",
    "date": "2024-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Eddie Murphy, Jeff Garlin, and Steve Zahn were so funny in this movie. This one was way better than the sequel that came out a few years later. This movie definitely feels under appreciated",
    "date": "2024-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Exatamente o que ele deveria ser: um sessão da tarde estilo Matilda ou Esqueceram de Mim. Odeio os filmes do Eddie Murphy explodam todos.",
    "date": "2024-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Light-hearted, heartwarming, family friendly movie. It’s not breaking new ground by any means but it accomplishes what it set out to do and leaves you feeling good.",
    "date": "2024-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This film is probably the most nostalgic film you could ever watch. It warms my heart.",
    "date": "2024-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Quite a funny and good movie, overall a very nice movie to watch with the family or family. Had a nice and funny story that caused the entire family to erupt in laughter.",
    "date": "2023-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "WHATEVER YOU PEOPLE SAY ABOUT THIS MOVIE BEING SHIT, YOU'RE MENTAL IT'S GOOD",
    "date": "2023-10-03"
  }
]