[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Uninspired garbage dragging a mediocre franchise through the dirt with characters no one could possibly care about and a story both predictable and utterly ignorable at the same time.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Beginning was great. Rest of it sucked. Three stars.",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Not a bad film on its, its actually fairly entertaining. The only thing pulling this down is that it is sequel to a vastly superior trilogy.",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Is Angelica a great character? No. Other than her I loved the characters introduced. The mermaids were fantastic! Adding a missionary to be onboard a pirate ship was very comical also. Blackbeard was a great villain. As much as I love Will and Elizabeth, it was great just not having to shoehorn them in for one film and let us see Jack and Barbosa banter.",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Now the trilogy is finished, a reshuffle is needed to freshen things up and this really tries to do that.\nIt's better to free your mind of what's been before to truly settle into this but it's still a lovely looking movie with good performances from Ian McShane - brilliantly cast as Blackbeard - and Penelope Cruz who you feel should have been introduced before this such is her suitability.\nIt's not quite as epic as the previous and though it contains a lot of darkness, it's more light-hearted and has the reigns on it. Jack Sparrow feels like part of this movie rather than the heart of it but he's still very entertaining and Kevin McNally is given more to work with.\nIt's decent but not amazing",
    "date": "2025-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "What a completely forgettable installment that is bland & boring with the spark of this franchise clearly not present. The overdone hijacks of Jack Sparrow is worn out & sadly he cannot carry this franchise alone. The sexual humor/tension doesn’t fit at all & feels so forced & weird. The adventure tone is solid yet anything interesting plot wise happens offscreen & everything shown feels like a lazy spinoff for this world. A few cool moments that are filmed well but for how big the budget is, this film does not look great visually.",
    "date": "2025-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Holy let-down. The biggest issue the audience often had with Dead Man's Chest and At World's End (being the interwoven and very expansive plot line) just got completely dismantled and raggedly put together in some of the worst storyboarding I've seen in months, don't get me wrong, the gags are great and it's still a good film, it's definitely still \"Pirates\", it's just nowhere near the level the last 3 had us all stoked about.",
    "date": "2025-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "pirates of the Caribbean 4 on Stranger Tides follow Captain Jack sparrow haunted by his past and someone from his past finds him before pirates of the Caribbean 5 dead man tell no tales",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I really enjoy the additional world building each movie provides along with the new characters introduced. The action scenes are just comical by now and the plot is too eccentric.",
    "date": "2025-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not as groundbreaking as the Gore Verbinski trilogy. But “On Stranger Tides” is a solid adventure.",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Arguably the best plot of the sequels. The addition of Cruz and McShane breaths new life into the franchise.",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The only pirates i didn't gave 5 stars, this movie is entertaining but i probably won't watch it a second time.",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This movie was alright, but it also kind of sucked.",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It’s an okay movie here they could also have endet this franchise",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 2 hours and 16 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated PG-13 for Intense Sequences of Action/Adventure Violence, Innuendo, Sensuality and Some Frightening Images!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The worldwide gross is $1,046,721,266.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Worst pirates of Caribbean film without a doubt. The only reason this movie even came out was to make money for the franchise. Only watch this movie if you want to say you have seen all of the series. In my list for worst movies of all time. DO NOT WATCH!!!",
    "date": "2025-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Constantly hilarious, it makes me more interested as the story goes along",
    "date": "2025-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This Movie is worse than i thought",
    "date": "2025-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very enjoyable movie",
    "date": "2025-06-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Compared to the third part, this one had much better pacing and more entertaining in my opinion.\nRating: 7.3/10",
    "date": "2025-05-03"
  }
]