[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Good, but depressing, knowing that it is a true story. My favorite part was at the end, showing the actual survivors celebrating the reopening of the Taj.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very well done for the most part.  Some odd scenes depicting a random white woman in the hotel as blatantly problematic, hard to believe that actually happened in the midst of a terrorist attack but shame on her if it did.  And Not a single word in the film about the murder torture at Chabad location.\n\nOverall, tough gruesome film but necessary  to show the horror of that day.   The film did an excellent job of depicting the terrorists as the animals they were..",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Depicting terrorists as the sub human creatures they must be to act SUBHUMAN is needed.\nAny who want to see this,or Oct 7th in Israel as how to get a message across are blind to humanity.",
    "date": "2025-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie does exactly what it sets out to do: making the audience absolutely hate terrorists. It's also a gut-wrenchingly tension-filled depiction of true events. I was on the edge of my seat with knots in my stomach the entire time.",
    "date": "2025-05-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Went into this movie completely blind, I didn't even know that this tragedy in 2008 even occurred. Super tense all throughout the movie. \nDev Patel was amazing as per usual.",
    "date": "2025-04-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved this. Is it violent? Yes, but so is the topic. I'm sure some will claim it is ''too violent'', but I say they're wrong; it's simply accurate. Dev Patel is wonderful. The movie is very engaging, and pulls you in. \nOnly thing I don't like is the way the terrorists are portrayed as somewhat innocent, in the sense that they are portrayed in this hicks-who-don't-know-any-better way, and that is utterly ridiculous. Nobody is so stupid that they can't figure out that it's wrong to walk into a hotel and machine-gun down everyone for absolutely no reason.",
    "date": "2025-01-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It is a movie based on the true events of the 2008 Mumbai terrorist attacks. One thing I appreciate is that this movie does not shy away from how horrific the attack was. The violence is brutal and honestly difficult to watch. The film is incredibly suspenseful, tense and gripping to watch. There is terrific acting from Dev Patel who plays a staff and Anupam Kher who plays real-life head chef Hemant Oberoi.\n\nWhere the movie falters is when it focuses on the couple. Their characters make so many infuriating choices and was genuinely frustrating to watch. I wish the whole film had just focused on the Hotel staff trying to protect the guests.\n\nDespite that, this is an incredibly well-made movie and a harrowing depiction of the tragic event that is worth watching",
    "date": "2025-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie portrays horror, terror and confiution best and litteray make you watch till the end, maibe there's a bit too much of heroism but it's great movie",
    "date": "2024-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Years after seeing the film, the film still pops in my head. Five stars is an understatement.",
    "date": "2024-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A tense thriller that kept me on edge for the entire movie.  Especially good acting by Dev Patel as a waiter and \nAnupam Kher as Head Chef.",
    "date": "2024-05-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "One of the best overlooked movie 2018, based on a true thrilling story.",
    "date": "2024-04-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "it's one of the harder films to watch but packed with enough thrills and heart-wrenching emotions based on the true events of the 2008 terrorist attacks in Mumbai, India the film depicts the bombings and the siege of the Taj Hotel not only were 50 guests trapped but several staff members as well, most of whom stayed behind to keep each other safe the film wastes no time showing the terrorists fully committing to their plan of attack to honor what they've felt they lost they believe in sending their own message for the world to hear aside from Dev Petel as an employee, Armie Hammer as a father and a newlywed to Jason Issacs as a Russian elite most of the other players are unknown but they amazingly play the real-life victims desperate to escape as well as work together director Anthony Maras shows a real-life traumatic experience of ordinary individuals pulling together in desperate times in the most unexpected of dyer circumstances",
    "date": "2024-03-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Mumbai Hotel is a pretty interesting movie. A good plot mixed with shooting and tragedy gives you what you came for, a lot of emotions. The characters delve into the soul and you worry about them until the very end",
    "date": "2024-03-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "In this ROP, the only way is to submit or RIP.",
    "date": "2024-01-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I'm a big fan of films based on true events and this is one of the best I've seen. Very powerful, especially considering recent events. Only didn't get a 10/10 as (like nearly all of these sort of films) the characters make very frustrating choices from a viewer standpoint and the police were downright incompetent.",
    "date": "2023-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It was better than I thought. A little violent though.",
    "date": "2023-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Solid Film with good acting done by Dev Patel and other members if the cast. Story based on a real story had his thrilling moments but has his problems at the ending.",
    "date": "2023-07-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Good movie overall that was interesting and based on a true story of survival in Mumbai India after attacks on civilians by terrorist group. It was definitely gripping to see how they would survive and also showed how unprepared with any police or military support in that area for such an event.",
    "date": "2023-06-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Reenacting the 2008 Mumbai terrorist attack, the five-star century-old hotel fell into purgatory. The plot also proved a more cruel thing-under the ruthless surveillance of terrorists, leaving early is very likely to die earlier. . In this unbearable terrorist attack, most of the victims were employees who voluntarily stayed to take care of the guests.",
    "date": "2023-04-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "it's one of the harder films to watch but packed with enough thrills and heart-wrenching emotions based on the true events of the 2008 terrorist attacks in Mumbai, India the film depicts the bombings and the siege of the Taj Hotel not only were 50 guests trapped but several staff members as well, most of whom stayed behind to keep each other safe the film wastes no time showing the terrorists fully committing to their plan of attack to honor what they've felt they lost they believe in sending their own message for the world to hear aside from Dev Petel as an employee, Armie Hammer as a father and a newlywed to Jason Issacs as a Russian elite most of the other players are unknown but they amazingly play the real-life victims desperate to escape as well as work together director Anthony Maras shows a real-life traumatic experience of ordinary individuals pulling together in desperate times in the most unexpected of dyer circumstances",
    "date": "2023-04-05"
  }
]