[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "God, this was so cringe. DO NOT SHOW THIS TO YOUR CHILDREN!!! NOT APPROPRIATE!!! THE AMOUNT OF F-WORDS IN THIS THING IS SUPER GRATING!!! If you like insane amounts of obscene language in your movies you might like this but OMG! The F-words in this thing annoyed the HELL out of me. Again, do not watch with your kids.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Well written, amazing performances, and masterfully directed to make the movie that they wanted to make.\n\nThe trouble I have with the film is the based on a true story aspect. The movie is intent on making satire and irony out of the cautionary tale of greed and excess. However, like Fight Club, this movie tends to be embraced by far too many who think this is a guide book instead of a warning.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "the performances are to die for from DiCaprio, Margot Robbie, Matthew McConaughty. Not to mention that this madness is based on the true story of Jordan Belfort. So outrageous you would swear it wasn't real! It is!",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Based on a very hilarious true story in 03 hours, 00 minutes, and 05 seconds!!!!!!!!!!!!!!!!!!!!!! Rated R for Graphic Nudity, Drug Use, Language Throughout, Some Violence and Strong Sexual Content!!!!!!!!!!!! The USA grossed over $116,500,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Yup, the one and only. The movie your parents will always say no to (but love it themselves), but you then watch it anyway. Common sense media put it back to 18+ you dorks.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Not only is this move trying too hard to be the next quentin tarantino-esque movie with ridiculous dialogue and a mixture of comedy that could very well be from a Seth Rogan production, but fails at both. Whats left is a over pretentious mess of a film with no memorable scenes but comes across like skits from saturday night live.\n\nWhat is it with Hollywood over glorifying their criminals. You shouldn't even give a platform for such lowlife of our society. And the movie is even trying to make it look cool. Shame.",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Worth a rewatch whenever in the mood. 87/100",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The Wolf of Wall Street is a wild, unrestrained cinematic feast, reveling unapologetically in the excesses of its world — the drugs, the debauchery, the relentless adult indulgence. Rather than criticizing these elements, the film immerses the viewer in a universe of pure, chaotic energy, where every high, every outrageous scheme, and every indulgent moment feels both exhilarating and absurdly funny.\n\nYet beneath the surface of hedonism lies a complex, tense exploration of ambition, greed, and moral decay. Martin Scorsese crafts a world so extreme that it feels almost mythical, one the average person could never truly experience, yet the film makes it entertaining, darkly hilarious, and intellectually fascinating. Leonardo DiCaprio’s electrifying performance anchors the madness, transforming it into a story of both riotous spectacle and subtle, compelling insight. The Wolf of Wall Street is cinema at its most audacious — chaotic, brilliant, and unforgettable.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Felt exciting at the start",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "What a masterpiece! \n\nwild, entertaining, and brilliantly executed. The narration was insanely great — it added a whole new layer of depth and personality to the film that made the story even more engaging. It really helped capture the chaos and energy of Jordan Belfort’s world in a way that pulls you right in.\n\nLeonardo DiCaprio’s performance is top-tier, and the mix of comedy, drama, and madness keeps you locked in the entire time. Even though it’s a long movie, it never feels dull or dragged out — every scene has something that keeps you watching.\n\nOverall, I’d give this 4½ stars easily. It’s bold, over-the-top, and incredibly well made. I 100% recommend watching it if you haven’t already.",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Scorsese is fascinated by procedure, by drawing back the curtain and showing us how things happen, though he keeps the picture nimble and entertaining enough to avoid burying himself in the minutiae.",
    "date": "2025-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Martin Scorsese roars back to the screen with The Wolf of Wall Street, a three-hour marathon stuffed with dark humor, gross-out gags, a fistful of Quaaludes and one awesome performance by Leonardo DiCaprio.",
    "date": "2025-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of my favorite films of all time",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The Wolf of Wall Street is an epic visual storytelling masterpiece from Martin Scorsese.",
    "date": "2025-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Have you ever partied hard and wondered how you would party hard if you had copious amounts of money and a group of just as crazy as you friends?I think this is it and then some. Forget good taste, forget politically correct and go along for a freight train on steroids of a ride, have a good laugh along the way. Casting is spot on, have seen this over a half a dozen times and not bored yet.",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "So many solid vignettes make this a film that will be quoted forever.",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It epitomizes the corruption of the American dream in an extravagant way.",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The Wolf of Wall Street isn't a film: it's a party. But so what? We're all invited.",
    "date": "2025-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The iconic story of Jordan Belfort, portrayed by the movie icon himself, Leo. great story, timeless scenes, and an incredible performance by Leo really captures the true story of Jordan Belfort and makes you feel like you’re there witnessing it first hand.",
    "date": "2025-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Right as the credits started rolling, I was like, \"man, that was unfortunate.\" I really wanted to like this, but I was just on the fence. It was a very well crafted movie, I just didn't find it interesting. If you're into this type of subject, you'll love this movie.",
    "date": "2025-08-28"
  }
]