[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Critics are wrong yet again. It was beautiful and very interesting. Too bad so many couldn't pay attention long enough.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This movie was really great!  The designs and story was great! And I definitely agree that this movie won two Oscars! This story is a realistic fiction about women's life as a geisha. However, there was only ONE scene in which was confusing, from the main character cutting herself, and the movie not explaining why. Other than that, TOTALLY WORTH A WATCH!!!!!!",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I would give this movie a 8.6/10. The scenes displayed Japan’s beautiful landscape and integrated the music to bring out the emotional impact. The main character spoke with a well-crafted dialogue showing her intelligence. The antagonist (Hatsumomo) was quite a bully, she felt threatened by Chiyo’s water eyes. Chiyo’s arc really started from the bottom and rose to the top with years of pain and grit. Overall, I liked the movie and would recommend watching it.\n\nSPOILER ALERT:\n\nThis movie does not get a 10 because there were some things missing. What was the connection between Chiyo’s father and the Okiya? What happened to Chiyo’s sister? What happened to Hatsumomo after she had crashed out? Why did Nobu forgive Chiyo after the island? There were gaps in the movie.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "despite the succulent scoring music and beauty shots, I don't feel really indulged to this when I'm watching it",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Filmography was exceptional, acting excellent, storyline over all amazing",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "While it's an absolutely gorgeous film, and acted quite superbly by Ziyi Zhang, and the incomparable Michelle Yeoh, the film hasn't aged well in the last twenty years. Wrought with melodrama, the film only pulls the most tantalizing portions of the source material, and choosing to portray some of the books more nuanced characters as catty, contemptuous, and petty. Most of the antagonists are so comically villainous, the absurdity of it all just completely takes you out of what was supposed to be a well crafted re-telling of the complex lives of Geisha. That's the mid-2000's for ya. Make it pretty, and make it trashy. This is a story that deserves to be told again, with a far more capable director, screenwriter, and even in mini series format. And hey, here's an idea. Maybe actual Japanese women?",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I find it fascinating that the audience score differs so greatly from the critic score. Not sure as to the reason, but as someone who grew up watching this, I can say nostalgia certainly plays a part in my high opinion of the movie. I've always found it quite beautiful, and stirs within a sort of melancholy that keeps me rewatching it every handful of years.",
    "date": "2025-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a beautiful movie, I think all women should watch it at least once, it teaches good lessons about relating to men in a beneficial way and how to deal with female bullies. Even though some scenes are disturbing the traumatic impact is also on the screen! This is a beautifully artistic and spiritual viewing experience, an absolute must see!",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Memoirs of a geisha is one of those movies that leaves a lasting impression on you. Its narrative is impeccable, and the story, though predictable, is poetic. The soundtrack —by the magnificent John Williams— is brilliant.",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "This movie had some very disturbing scenes that involved mistreatment, harassment, etc.",
    "date": "2025-02-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Intriguing story line with occasionally stunningly beautiful scenes - spectacular dance performance that alone justifies watching this movie.\nExcellent performances. Held my attention throughout.",
    "date": "2025-01-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the most beautiful movies i have ever seen in my life. \nI cannot believe it took 20 years to finally see this, even tho i always suspected i would love it, due to having seen the cinematography and having heard the soundtrack.\n\nIf you are a lover of cinema, this is a must see. It's on par with any other great movie in the history of cinema.",
    "date": "2024-12-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Can we all agree on that this movie is a masterpiece! This may even be the best movie of the year 2005!",
    "date": "2024-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A 2005 epic period drama directed by Rob Marshall and adapted from the 1997 novel of the same name by Arthur Golden that tells the story of a young Japanese girl sold by her impoverished family to a geisha house (okiya) to support them by training as and eventually becoming one of Japan's most celebrated geisha. A visually stunning film with lovely music by the one and only John Williams that is just breathtaking, an entrancing and emotional tale about sacrifice and hardship and the challenges posed before and after WWII for a geisha of that time. Powerful acting despite the controversial decisions to cast non-Japanese actresses, and the cinematography is just marvellous (no wonder it won an Oscar, along with other two categories: Production and Costume Design.) Delving into Japanese history and culture through the eyes of this young girl was really beautiful and enlightening.",
    "date": "2024-05-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "is a romantic story about an imposible crush, so nice and fun to watch perfect to spend a night with a pizza and beer,",
    "date": "2024-03-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "con una fotografía buenísima y una buena historia y con personajes que puedes simpatizar, puedes conectar con todo y meterte en su mundo, lo cual hace una muy buena pelicula para recomendada.",
    "date": "2024-02-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Memórias de uma Gueixa possui uma excelente direção de arte, uma excelente fotografia e um excelente trabalho de maquiagem e figurino. Seus cenários são vívidos e representam de maneira soturna a época presente no longa. Apesar de suas qualidades acima da média, seu roteiro é simples e sua narrativa é no máximo boa, pois esse roteiro se perde em alguns momentos, descartando artifícios narrativos que aparentavam ser essênciais para a trama. Mesmo com esse problema no roteiro, o filme consegue fisgar quem está assistindo e nos apresenta um cultura totalmente diferente do convencional.",
    "date": "2023-12-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A story about a Japanese geisha where the main three leading lady parts are played by Chinese actors and in English. It looked weird from the beginning and I had to read up on it. Good thing I did and find out how much of a distorted picture of geishas the film portrays. Zang Ziyi, Michelle Yeoh, Gong Li are all great actresses who I've loved in their other works. And with Ken Watanabe too, they made a great cast to watch. The cinematography and the costumes were beautifully done. But all these are constantly making the actual story secondary with how it treats the subject. The film has enough research to make it look like it almost got it right but then changed the foundation of a lot of things as they liked. A lot of the costumes and stuff were actually recognizable to me as something so close to the actual culture but clearly different from it. It is a very Westernized view of the Japanese that doesn't wish to admit that. The story is both a more cruel and distorted version of things at times and overromanticizing of atrocities at other times. It really shows the perverted gaze of the white men who wrote it more than anything. There is an enjoyable movie underneath all these issues, but the movie constantly shows you aspects of it that say firmly that it is not meant to be sympathetic to anyone. Even if you look over everything else, the way it ends and the last monologue makes it even more despicable. Writing this much, I'm wondering if my rating is a bit liberal. It did have great acting, music and cinematography, so should give props to that. So, I'm sure that the actual book would be way worse than this.",
    "date": "2023-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What to say. This movie is sublime.\nA journey of magnificent music.",
    "date": "2023-05-29"
  }
]