[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Tediously, boring with a cliché plot.  I’ve seen after school specials done better.  Could not even finish this.",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Boring.  And I love JM!!  But this, was boring.  Poor acting, on pretty much everyone's part.  And the dialogue?  Thumbs down.  Casting for the daughter Rachel was wrong.  Even though other reviews say the chemistry between JM and Rachel was good, I disagree.  I suffered through the whole movie to the end simply because I had already invested so much time in it.  I hate to say it, but I couldn't wait for it to end.  Disappointed.  But JM was AWESOME in Game of Thrones!!",
    "date": "2025-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Underwhelming and unbelievable action movie. If you can suffer through the first half, It starts to redeem itself an hour and 20 minutes in but not enough to save it completely.",
    "date": "2025-03-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Low grade action movie with a predictable end.",
    "date": "2025-02-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a good movie because send how people feels about cancer. This is something they need to make a cure for. Towards the end was real good",
    "date": "2024-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Sweet Girl - 4/10. Brian Andrew Mendoza debuts with a clunky whimper of an action film. Starring Jason Momoa and Isabela Merced, who happen to be the only good things about the movie, star as a father and daughter team who seek out to get justice against a pharmaceutical company. Along the way, they dive deep into a corrupt system, finding out evil truths. What could have been an interesting film turns out to be a highly missed opportunity. And with an unbelievable (in a bad way) plot twist, the movie veers towards cliche and tried and tired tropes. Spoilers for anyone who will want to see the film, but the plot twist makes for a ridiculous reveal. If the story had revolved around the daughter from the beginning, this might have ended up being an interesting film. However, you get invested in the father, and it all goes down the drain with that twist. Its like baking a birthday cake and having it turn out to be a pumpkin pie. You expect one thing and you get something else in return. The film has great acting from the lead duo, who help bring the film out of gutter with convincing performances. The action is somewhat decent, though a little hard to see due to shoddy camera work. All in all, another failed star vehicle from Netflix.",
    "date": "2024-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It was a good movie until the end. It made no sense. I thought I missed something. I went through all that for nothing??? Made absolutely no sense. Who jumped? Who did all of the killing? Was it a dream? Did he die at the beginning? The ending completely lost me. Do not watch this movie, for you will be angry at the end. Utter stupidity!!!! It was really good until the end. Then she didn't even do the right thing!!!!! Kill them all.",
    "date": "2024-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A lot of action, decent storyline",
    "date": "2024-05-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Adorable, entertaining, great actors, great story!  I recommend it 100%.",
    "date": "2024-05-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Don't watch, half decent plot and action. The ending totally ruins the film it's stupid. The ending makes it a very pointless watch",
    "date": "2024-04-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is the worst movie I've seen in years, and that says a lot because I have watched so many.",
    "date": "2024-01-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's a well done action thriller with more depth and emotions than I thought it would be. The main characters are so well played by Isabela Merced and Jason Momoa. It obviously won't win any awards but I had a very entertaining watch. \nI'll keep hoping for a sequel even though it probably never happens😭😥🤧",
    "date": "2024-01-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie had the potential to be pretty decent, but missed the mark by a country mile. Terrible acting, major holes in the plot, and every cliche you could possibly imagine - to name a few, made this movie unbearable. If I could have given this movie zero stars, I would have.",
    "date": "2024-01-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Esta buena, podrían haber jugado por lo seguro e intentar hacer una película de accion genérica pero intentaron algo diferente. Aunque la historia tampoco es una maravilla el buen ritmo, la accion y los momentos de interacción padre/hija complementan muy bien y termina siendo super correcta.",
    "date": "2023-12-04"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Total nonsense and waste of time. No exaggeration. Very boring. Totally unbelievable and unrealistic events and storyline from start till finish. Careless, idiotic, and huge gaping plot holes. A skinny and tiny 18 year old girl, that would have trouble lifting a chopstick, easily kills at least 5 trained assassins....etc. blah blah blah. Terrible acting and really lame action sequences. Very stupid and unrealistic ending. Overall, this is one of the dumbest and lamest movies I have ever had the displeasure of watching.",
    "date": "2023-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's an ok action movie, with a good cast and a story that could've been better. I love action movies, so I enjoyed it for what it was.",
    "date": "2023-03-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I really enjoyed it good acting loved the plot and all the twists.",
    "date": "2023-02-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely love this movie would recommend",
    "date": "2023-02-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thought it was a very good movie. It shows the neverending struggle between patients and big pharma. Lives are continually being lost and I know if we were afected as this father and daughter were, we would want to take revenge as well.",
    "date": "2023-01-26"
  }
]