[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is my favorite movie of all time. Beautiful story. 5 stars all day",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is simply one of the most powerful and beautifully dark movies ever. No dad of daughters could watch this without being deeply impacted.  Such great performances too.  If you like \"Taken\" this was the OG and is far more gritty and realistic.",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best examples of critics not understanding the typical audience. How this only had 39% critic rating but 89% audience rating tells you everything.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Uma das melhores atuações do Denzel. Definitivamente está na lista dos clássicos do cinema.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best revenge movies ever made, ignore the critics, granted it's nothing new to the gene but entertainment wise there's nothing better, and considering it's loosely based on a true story that happened in the 1950's in Sicily when a mob bosses child was kidnapped and his bodyguard killed over 50 people single handedly before being killed himself Man on fire is not that far fetched",
    "date": "2025-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "39% is why you ABSOLUTELY NEVER trust critics reviews. ALWAYS listen to the people.",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "39% is an absolute insult to this incredible film. It's grim, sure, but it's about the criminal underworld of a Mexican kidnapping and ransom ring. Read the room. The film builds perfectly, there's a twist you DO NOT see coming, and everything about the ending is absolute perfection, the location, the score, the performances, everything, better than pretty much any film I can name. If you asked me for my list of 5 films you must see, this would be one of them.",
    "date": "2025-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This is the movie that highlights how out of touch the critics are.\n\nA near perfect story of regret, redemption, revenge and sacrifice. \n\nIt is long though.",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of my favourite movies of all-time... what are critics thinking???",
    "date": "2025-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "An overly long exercise in excessive violence that will nonetheless please fans of the now-genre that is Denzel Washington revenge movies.\n\nBig explosions are here in abundance, as unfortunately are nauseating 'edgy' camera effects that have not aged well.",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Why this movie only got a 39 % rating is beyond me. Everything and everybody in this movie is greatness. denzel just put the icing on the cake",
    "date": "2025-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wow, this movie is exceptional. The cast, the plot, the direction was perfect. It's not only a high-action film, it's also so touching how the protagonist comes alive through one encounter. I don't want to give away the plot so I won't say more. But really, watch it. I was glued from the beginning to the end. A masterpiece! Denzel Washington and Dakota Jackson were brilliant.",
    "date": "2025-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great acting by Denzel Washington. The script is good. Directing, Some brilliant camera work versus some annoying camera movements. All in all a very good film that I don't understand to get such low scores in Rotten tomatoes. It's definately worth a watch.",
    "date": "2025-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "No goosebumps action sequences no highlighted violence and no even thrill as mentioned on movie genre I don't know why I waisted my time to watch the movie. 1st half contain long dialogues and slow pacing scenes but 2nd half gets unmentionable action. Ordinary subject weak script above all very much eye disturbing camerawork DOP, I dont know why Danzel signed this movie.",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "IS IT POSSIBLE THAT OVER 400.000 REVIEWS GET IT WRONG...TRUST ME: WE ARE NOT!\n\n\nFor a criticus it is most important that their opinion differs from what the mass is saying: That is the only way to stand out. \nBoy..what are they wrong on this movie. \nGreat character built up, great camera work, grabbing scenario with top notch action and above all: Denzel & Dakota pull you right in. This is a movie that you do not watch from the outside but it pulls you in!!\nFor once: Be the judge of this movie yourself and you will not regret it! \nOne of my favorites.\n\nMy personal cv:\n1) Over 10.000 movies watched over 50 years.\n2) Big film fan.\n3) Keen eye for quality\n4) And yes: every once and a while i like to challenge \" the critics \"",
    "date": "2025-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Terrific - top notch. emotional but great action and story. hugely entertaining",
    "date": "2025-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "We loved it! Denzel is Gawd! I didn’t realize that Equalizer 3 was a reunion between the GOAT and Dakota Fanning! How did we miss that!",
    "date": "2025-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "It brings me great pleasure to love a movie that most of the movie critic snobs can’t stand. Denzel and Dakota have amazing chemistry in this movie. It’s a credit to the direction and writing that this film can be both dark and extremely tender.\n\nMy experience tell me if the critics hate it, I’ll probably love it. That’s the only use they seem to have.",
    "date": "2025-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the greatest revenge films of all time. It might even be the best. An awesome story, unique executions, and a powerful performance by Denzel.",
    "date": "2025-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is the second greatest movie of all time. Denzel, Christopher Walken, the action, the soundtrack… every part is phenomenal. I am on the edge of my seat every time I watch and forget getting anything done while this movie is on.\n\n “A man can be an artist... in anything, food, whatever. It depends on how good he is at it. Creasey's art is death. He's about to paint his masterpiece.”",
    "date": "2025-07-07"
  }
]