[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I thought it was a decent film and don’t understand the low rating…… Yes the plot is a little far fetched but I’ve watched worse films with higher ratings….. all down to personal tastes I guess!",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "So the plot makes no actual sense. I was all ready for it to be a whats real vs whats in her head kinda like Shutter Island.  Only for it to be in fact a nonsensical conspiracy hijacking thing. Also no one involved in this film has ever been on a plane before because the aircraft is insanely large and filled with nothing.",
    "date": "2025-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Strong Jodie Foster, idiotic script. Enjoy the first 60‘ and then shut off, imagining how amazing they could be. In reality the last 30’ make no sense whatsoever and border on an unintentional parody.",
    "date": "2025-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Honestly, i don't understand the bad rating. There are movies much worse than this one with better ratings.",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "So it wasn’t awful. But pretty early on clear what the plot is. No surprises.. also the actress mom for some reason made me even want to root against her. Wouldn’t recommend.",
    "date": "2025-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Even after 18yrs on; was still a good movie, to think how things used to be with travel. Also, great cast. However; story could still have been more polished.",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It ain't no Silence of the Lambs.\nThe supporting cast were hams though.",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Jodie Foster was really good, if it wasn't for her the movie would've fallen on its face. The plot has a lot of holes and if you think about it, it doesn't make a lot of sense. But it was worth a watch, just maybe not before you take a long haul flight.",
    "date": "2025-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I'm not sure why the critics gave this a lower rating than 4 because I loved it. The acting is reallly good. Yeah, a bit unrealistic but what movies aren't? Jodie Foster did an awesome job. The plot was interesting. A good thriller. Didn't expect the ending the go like it did. Was on suspense the whole time. Highly recommended!",
    "date": "2025-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Just rewatched Flightplan and honestly, it still holds up as one of those tense, contained thrillers that keeps you second-guessing yourself the whole way through. Jodie Foster is, as always, spot on, she really nails that frantic energy of a parent who just knows something is wrong, even when everyone else starts treating her like she's out of her mind. The direction does a great job ramping up the tension and never letting it drop, and the whole production feels tight, with that clean, minimal vibe you get from modern plane interiors.\n\nWhat really hit me this time, though, is how weirdly detached the rest of the passengers were. Like, a kid goes missing mid-flight and half the people on that plane act like someone lost an iPad or their headphones. There's this disturbing sense of apathy that just makes the whole situation feel more claustrophobic. The script plays with that a lot, building this wall between Foster’s character and everyone else, which amps up the paranoia. The cinematography and score both lean into the unease, with close, almost suffocating shots that keep you inside her head the whole time.\n\nAll in all, Flightplan still delivers, a solid, anxiety-fueled ride that reminds you how scary it is when no one takes your side. Plus, bonus points for how relatable it is when people are more bothered by delays than the actual crisis at hand.",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was amazing. Don’t believe the other reviews on here. \n\nTop notch acting and great story! Amazing cinematography as well. Too bad it didn’t get the praise it deserved.",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Jodie Foster shines in this underrated gem",
    "date": "2025-05-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "A remake of The Lady Vanishes. Only worse.",
    "date": "2025-04-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I was devastated when I lost $80,000 worth of Bitcoin to a fake investment company. It felt like I had nowhere to turn, and I thought my funds were gone for good. However, after contacting Anonymous ‘ maciofonespyrix gma1l com I was amazed at how quickly they were able to track down my stolen Bitcoin. They worked tirelessly to trace the fraudulent transactions, liaised with the relevant authorities, and contacted the platforms involved in the scam. Thanks to Anonymous",
    "date": "2025-02-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Flightplan is a well-executed film based on a simple yet central concept, delivering occasional eyebrow-raising twists that enhance its overall appeal.",
    "date": "2025-01-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A very predictable straight forward thriller of a movie where a women tries to find her lost daughter on a plane.......every single twist and turn you can see coming a mile away.",
    "date": "2024-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved this movie! The buildup of tension kept the audience constantly guessing who was in on it. Jodie is an amazing actor. 10/10.",
    "date": "2024-05-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Very great movie , my family and I enjoyed every bit of it.  Jodie Foster is such a great actress",
    "date": "2024-05-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The last fifteen minutes hold some bits of guilty pleasures like silly B movies from the 90s used to. It won't be enough to save this movie from an overall really stupid plot.",
    "date": "2024-05-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Una pelicula interesante, lastima que peca de no saber qué giros argumentales responder, pero me gusto.",
    "date": "2024-03-30"
  }
]