[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "good acting good story but very slow and so many flaws in script also questionable scenes. How can someone live 4 months without eating?\nwhy did girl's parents ignore her hunger and weakness.",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Great acting but the movie itself was very boring.",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Just boring. Not really appreciating the admiration for Francis Pugh is probably why I found it very overrated.",
    "date": "2025-06-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A must see! Had amazing writing and storyline that shows real history and connects to cultures. The lead actress plays this role amazingly!",
    "date": "2025-05-31"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Slow going and kind of boring, the acting on the other hand was exceptional",
    "date": "2025-03-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Interesting way of describing where the necessity of faith and believing in an afterlife due to death such as the Irish famine clash with reason and other life concepts. \n\nDeep conflict between releasing someone of a trauma through death in times of not believing in a second choice finely depicted. \n\nCineasticly and Performance of the actors impressive, confronting the viewers through breaking the fourth wall to enable an own reflection interesting and the end relieving.",
    "date": "2024-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Florence Pugh made this film special. The stroy was very interesting and kept you wondering. Film felt like it could be shorter.",
    "date": "2024-02-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I'm not convinced that the fourth wall breaking works at all but it's a small part of the movie which is mostly effective at selling its conflict between faith and reason.",
    "date": "2024-02-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The run time feels longer than it really is (the somber mood was a bit sleep inducing), but even when I drifted off and missed a few moments here and there, Florence Pugh was still there, keeping it all together until the end. Nothing about the narrative feels familiar even if the themes may be. But I must add: completely unnecessary meta- references to the film in the opening and closing scenes- it really does nothing, in fact it took away from immersive like quality of the film, but that seems to be the style these days. The thought-provoking ending was satisfying enough for it to warrant such a high score from me.",
    "date": "2024-02-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I read the book and was excited to see the movie to fill in some missing details, but the movie not only is way different from the original book, it's also terrible. The book doesn't have this dark narrative. Also, Anna is the sweetest girl, and the relationship between William and Lib is more complex than depicted in the movie. The story moves so fast that we don't get the chance to know Lib or Anna properly. Many invented scenes, such as William supposedly having lived in the village, Lib forbidding the parents from seeing the girl (when, in fact, it was Anna who wanted her space from her mother), and the force-feeding (in the book, Lib explains why she wouldn't do it), felt unnecessary. And what's up with those bizarre scenes of Lib almost having orgasms while drinking her own blood? That was totally fabricated. They changed so many facts and the characters themselves… I understand that some adaptations are needed for the screen, but they made it so terrible that I'm glad I read the book first; otherwise, I would have had a completely wrong idea about the story.",
    "date": "2024-02-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Very poor. Strongly recommend to not bother wasting your time watching. Everyone who said otherwise is simply lying to themselves and you. The underwhelming end matched the prolonged film. So many unanswered questions.",
    "date": "2024-01-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I've heard this is good and I've yet to see anything that hasn't been improved by the presence of Florence Pugh, so I'm quite looking forward to it - although I doubt I'd have got round to watching it under any other circumstances.\n\nIt starts very interestingly for a film set in rural Ireland in the 1800s - we're panning round a very modern space, which it soon becomes clear is a sound stage because the inside of an old Irish cottage comes into view which makes for a stark contrast.  And I suspect the message we're supposed to take from this is that nothing is what it initially seems - but let's see shall we.\n\nWe then start on the story with a nurse, Elizabeth Wright (Florence Pugh) who has been called over to Ireland to watch an 11 year old, Anna O'Connell (Kíla Lord Cassidy) who allegedly hasn't eaten in four months, with a view to establishing the truth of the situation.  Obviously, Elizabeth doesn't believe any miracle is occurring but Anna seems guileless and there's no obvious cheating going on.  The other person on the watch is a nun who obviously has different motivations and beliefs and additionally there are factions in the village who like the interest that Anna brings and others who would like the whole thing to go away.  And, of course, as time goes on it becomes clear that Elizabeth doesn't have the straightforward backstory that would make her job much easier for her - and no, I'm not going to give you any clues as to what was going on.  \n\nThe film makes some interesting points on being confronted by things you don't or can't believe in and how you might react.  It's also intriguing as to how it's going to end - it does a good job of ensuring that enough progress is made to keep you engaged and guessing.  And when things become clearer as what's going on, there's some very effective psychological horror elements introduced which had me quite spellbound (and appalled) - and raised some interesting points on being confronted by things you understand but can't accept.  But, to its credit and my surprise, the film finds a way to resolve the story in a very pleasing manner - I really liked the way things panned out.\n\nFlorence is, as expected, excellent in this - she gets to do some full-on acting, displaying proper emotions and everything.  And Kila more than holds her own against her - it's not her acting debut but I suspect it's a bit of step up from what she's previously done.  Tom Burke does a good enough job when making his third appearance on the list this year - a fine effort by the lad, although you'd struggle to say he was massively central to any of them.  I also thought Niamh Algar did a good job as Anna's mum - I knew I recognised her from somewhere but had to use Wikipedia to remind myself she was in Censor.  There's also a fine selection of older male actors on the committee organising the watch who are Toby Jones, Ciaran Hinds, Dermot Crowley, Brian O'Byrne and David Wilmot - all of whom you recognise their faces without necessarily recognising their names.\n\nIt is, without a doubt, a film set in rural Ireland - they do a good job in making it realistic enough to convince me it was accurate (lots of religious iconography and poverty, some digging for peat, etc).  There's obviously plenty of gorgeous scenery to work with and both the internal and external shots are all very well set-up and lit - the film has a very studied artistic feel to it (I was reminded of Portrait Of A Woman On Fire, although the subject matter is very different).  All in all, there's a lot to admire here so I'm going to give the director Sebastián Lelio a name check - I'm sure that's going to make his day!\n\nI really liked this - it felt like a proper grown-up film which has been made with full consideration to both the aesthetic and plot, with it looking beautiful and coming to a very satisfying conclusion despite the high-concept central idea.  And it's also well acted and poses some interesting questions - exactly what a film should be imho.  It's a strong recommendation from me for a film you may well have missed so go and check it out - at time of writing it's available to stream on both Netflix and Sky and to rent in all the usual locations.",
    "date": "2023-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A thrilling exorcism of beliefs",
    "date": "2023-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A 19th century English nurse is called to investigate how a young Irish girl \"miraculously\" lives without eating.  A thoroughly gripping drama and period piece.  There's a bit of a love story in there too.  Nominated for no less than 12 British Independent Film Awards.",
    "date": "2023-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A very boring and unnecessary movie. Another money Laundering production…",
    "date": "2023-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "It is a well-told story, far from the empty stories that we are always told every day, you can appreciate the layers of the characters and Pugh's great artistic ability to make us experience these types of emotions",
    "date": "2023-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The Wonder is mysterious with a disturbing story. Beautiful settings match the films perfectly slow pace as Pugh steadily reels you in to the cultish drama. I was very pleased at how the film wrapped up.",
    "date": "2023-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great plot twist! Very well done.",
    "date": "2023-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "She really is a wonder",
    "date": "2023-08-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Beautiful story telling telling stories, stories within stories. Great acting by Plough and her young co-star.",
    "date": "2023-08-05"
  }
]