[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I found the movie was not funny at all, had to fast forward through it a lot a lot pointless garbage.",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Just an all round terrible movie.",
    "date": "2025-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Better than I was expecting, though I wasn't expecting much. I decided to watch it because of Taraji, and I'm glad I did. It wasn't great, but it was fun enough to pass the time. I'd probably rate it 60% rather than 40, but I tend to be nicer to bad movies than most.",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Definitely NOT worth the watch. I was so excited to watch it knowing the cast, but honestly it barely has a plot, aaand it had the MOST cliche, corny ending ever. Super disappointing. Probably 1 or two proper funny moments the whole movie.",
    "date": "2025-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "These sex reversal films , just do not work . Atleast Mel Gibson , actually seemed like a man that most men could actually relate to in the film . In this film I really can't see many women relating to taraji's version of a woman . It more just loud brash rubbish. Cringing not funny . 1 thing men don't want is to watch this pile of rubbish.\nIt falls flat right from the beginning, and is torture every minute. I don't understand why these films are made. Next will be conana the barbarianess . It pathetic",
    "date": "2025-06-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The fact that they made this movie super freaky and a little bit of spiciness, I love it!  Personally, I would definitely put this in a very funny category to watch it with your significant other, NOT with THE FAMILY.",
    "date": "2025-05-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Doesnt seen as concernt at understanding men, instead it ftames them as either obstacles to be overcome or as villans, it aligns with the efenist narrative that sucgest women are navigating aworld rigged agaings them, for that narrative to work men haft to be portrayed as weak baffonish or rigvtdown evil, the men around ali that are her competitors are bumbling incompetent or moraly questionable, and she doesnt need to cheat to beat them bist manipulate the situatipn by using her special gift, the essence of what makes cvaracyers great the struggle and journey of growth is lost by making the competition weaker the protagonist victory becomes less meaningful, without a real challange theres no significant character arc, tverefore this story falls flat, alos triumphes over a rigged system where she bends tve rules to her advantage, she rewrites the rules to fit her narrative. Efenist driven remakes fail to resonate, its the journey not just the win that makes a character great,",
    "date": "2024-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Filme fraco, o filme todo é quase sem graça, só a cena em que ela ouve os pensamentos dos homens é bacana, de resto é ruim, os personagens são ruins, e o roteiro é ruim.",
    "date": "2024-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Waste of Henson's talent. Trecle Morgan ruins anither movie with his smug no talent act.",
    "date": "2024-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "There's a Chappelle's Show sketch that nails this concept far better than this movie ever could hope to! Shouldn't have been made.",
    "date": "2024-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Insanely boring. Bad acting. Bad directing. Bad writing. Took 30 minutes before the thing actually started.",
    "date": "2024-01-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Very poor playing or script. Actors shouting and their behaviour were maybe written to be funny but they were very annoying. Overdone grimaces and rude interactions weren't funny. No clever humour, banter and felt even offensive because the movie makers thought that we, the public are so stupid or simpleminded. I didn't finish it.",
    "date": "2023-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A funny version of mel's. quite watchable",
    "date": "2023-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "the movie: what women want was built on pure lies and delusions. but at least it said something even if it was totally crazy. the film: what men whants doesn't have that anyway, the film says nothing about what men want, is about a woman and her problems more than about the men and thus fails to tell what it should. no direct funny jokes either. watch another movie instead",
    "date": "2023-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Versão feminina do filme \"O que as mulheres gostam\", surpreendente mente divertido e como a dose leve de draminha, conquista mas não empolga, algumas boas questões levantadas, claro, a despeito patriarcado e machismo como era de esperar, leve e engraçadinho... Bom filme...",
    "date": "2022-03-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Good reversal of 'What women want' funny and good to watch",
    "date": "2022-02-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved this movie and Taraji gives a great comedy vibe. Surprised by the low ratings on this one. Although there are similar movies, this one has me laughing a lot!",
    "date": "2021-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "2.7 honestly not bad at all",
    "date": "2021-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I like Taraji P. Henson.  She has a lot of breadth as an actress.  I think she embodies what it means to be a \"beautiful black women\".  There are lots of black actresses who are beautiful, but their beauty seems very white-adjacent with petite bodies and sharp features and straight hair.   The movie is a romcom, so not terribly deep, but I enjoyed it and recommend it for some light viewing.",
    "date": "2021-09-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Had a cast of characters that could've been funny, but the jokes weren't well written or well delivered.",
    "date": "2021-08-11"
  }
]