[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I wish there was a sequel",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Some what familiar, but different still. Some unanswered questions, I wish there was a sequel. Good movie, c it.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "DON'T WANNA LIE, I EXPECTED THIS MOVIE TO END IN A COMPLETELY DIFFERENT WAY SO I HATED THE WAY IT ENDED AND NOT ONLY BECAUSE OF THAT BUT ALSO BECAUSE IT ENDED SO ABRUPTLY. THE MOVIE ITSELF IS ABOUT AS IF \"LUCY\" (2014) IS LOOKING FOR X-MEN TO JOIN THEM BUT THEY'RE NOWHERE TO BE FOUND AND SHE HAS NO SUPERPOWERS... IT WAS COOL THAT HANNA (SAOIRSE) HAS SUPER STRENGTH AND SUPER INTELLECT BUT IT WOULD'VE BEEN MUCH MUCH INTERESTING TO WATCH IF SHE HAD TELEKINESIS OR IDK IF SHE WAS ABLE TO SUMMON FIRE FROM THE PALM OF HER HANDS. SAOIRSE THROUGHT THE WHOLE MOVIE WAS SO GRACEFUL AND CONVINCING! OVERALL THE MOVIE WASN'T BAD.\nBUT IT WAS MISSING SOME DETAILS, LIKE IT WAS UNFINISHED... THEY COULD'VE SPICE THINGS UP A BIT BUT THEY KEPT IT OLD FASHIONED...",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of my favourite movies ever! Photography at its peak!",
    "date": "2025-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Despite a handful of arresting moments, Hanna ultimately fails to find the anarchic-hearty balance it so earnestly strives for, collapsing into a thoroughly directionless collection of scattered fight scenes, thin characters, and frantically uneven pacing.",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The story is ludicrous and not overly suspenseful. On the other hand it's very well cast and somehow different: some long, pensive scenes and more quiet dialog than you normally find in action films. I'm not sure what to make of this one.",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A stylish and unconventional action thriller with a strong lead, though its uneven storytelling keeps it from reaching its full potential.",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "They spent too much time explaining things.",
    "date": "2025-08-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Love the acting love the set pieces felt the movie was completely creative and innovative in its camera shots. I highly recommend this.",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Yeah. No thank you. Too much weirdness struggling to gain your attention and lacking in quality and storytelling. Character development and thoroughness severely lacking. Skip it.",
    "date": "2025-06-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A decent action/thriller.",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Weird.  No brainer that could never happen.  Dragged out.  Too many loose ends on everyone but the two main characters.",
    "date": "2025-05-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The plot of this fantasy-thriller-action heroine movie is a stretch, but the coming of age story is moving, on-the-road settings beautifully filmed, and the acting is superb. It's not hard to see why (then only 17) Saoirse Ronan has since become a star.",
    "date": "2025-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Comfortably the worst film I have watched in recent years. Redeeming features?   Hard to find any. Cate’s hair?",
    "date": "2025-04-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Stylish assassin film with some good scenes and elements that drag a little. Watched on Netflix.",
    "date": "2025-04-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Best known for period pieces like Atonement and Pride & Prejudice, Hanna feels like a bit of a departure for director Joe Wright.  Raised in isolation by her father (Eric Bana) in a remote area of Finland, Hanna (Saoirse Ronan) has been raised to be a lethal assassin, her purpose in life to kill the woman who murdered her mother.  On a journey that takes her from Morocco to Germany, the young girl tries to adapt to a world she doesn’t understand while maintaining focus on her ultimate goal of revenge.  While Ronan’s performance is the main reason to watch, it’s also impressive how Wright manages to transition from sedate, deliberately paced drama in his previous efforts to wildly unhinged action set pieces in a thriller that manages to hold the viewer’s attention throughout.",
    "date": "2025-04-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Saorise Ronan is fantastic as always, but I simply couldn't find much of a point to this shoot-em-up action thriller.",
    "date": "2025-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Quirky but not always in a good way. Frustrating and ridiculous at times but no doubt very enjoyable if you can somehow just turn off your brain and not be annoyed by the continuous flow of point to point leaping around and coincidences. The directing tries WAY too hard to be nouveau. Accents aren't great either.",
    "date": "2025-03-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The acting was decent and I didn't mind the story line, however I could have easily fast forwarded about 45 minutes of the movie without effecting the plot or enjoyability in any way (in fact it would have been far better).  It would have made a better limited series on Netflix.",
    "date": "2025-02-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Loved it. Some great cinematography and stand out performances from a really strong cast.",
    "date": "2025-02-09"
  }
]