[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Idk man. Super cool premise, horrible execution. London is wack. Why were they so concerned on catching Luther the entire time, when there was a crazy dude out killing like everyone? They should have just had the entire movie be the dude killing people on live. If i ever get sent to jail im going to make sure it’s London, because i dont even need a weapon to escape. Lame, i honestly think if this was a USA made film it would have been so much better.",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This film takes a gritty, well written london drama series and turns it into a pantomime. The plot is completely preposterous. Idris Elba does his best to lend some gravitas to this shambles. A producer somewhere decided it needed to appeal to a wider audience and required a James Bond villain. However the result is ridiculous and gets more so as the film goes on. Don’t waste your time.",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "With a fairly 'stretched for belief' plotline like this, it was like watching a Mission Impossible or James Bond the more it went on... One cannot help but wonder how it would have been as a season of Luther over four or five episodes with more time to pad it out and pull it in... \n\nIt is a shame because Idris Elba and Andy Serkis just worked so well. Whenever either is on screen you cannot turn away. And they are on screen for most of the movie, so that is what makes this a fresh tomato. Sadly, only a three star and a sigh at what could have been :)",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Our second time watching this movie. Not intentional, but glad it happened. I often forget having seen something! At the end I said, “And the next time we watch it, I will enjoy it just as much!”  Not a likely storyline at all, but just watching and listening to Idris Elba makes it worth watching. A fun movie",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The movie has some entertainment value for most of it. This is in large part because of the ominous near-perfection of the (super) villain's actions. Unfortunately, it all falls apart at the end, when the villain becomes as clumsy, incompetent and idiotic as they get, including, for example, not carrying a firearm for the final reckoning with the hero(s). Absolutely unbelievable and illogical at the end. Go do anything else rather than watch this movie. Sitting alone in the dark and silence is better... At least you'll have your thoughts to yourself.",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Action packed, but badly written characters (main bad guy is a joke), and the end was like the screenwriter had to finish in one night, but his 8 year old kid wrote it at the end, with major nonsense at several shots.",
    "date": "2025-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I cannot think of the last time I’ve watched a movie this dumb. Andy Serkis cannot act when he’s not in ape makeup. Idris continues to waste his talent. It is definitely time to shelf Luther. It is a product that has degraded season to season.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It seems a little harsh considering how much I enjoyed the premise of the movie but I just found they had to make too many logical jumps to make the story work. I thought the acting was solid from all involved, especially Andy Serkis (he's always great). The idea was good and there were some terrifying moments but I just felt like this was a movie that would have benefited from being another 3 or 4 episode long season. Some of the VFX weren't good and it showed in the actors performance. I did think the story was paced pretty well. As an experience, it was fine but to many issues with plot and logic just lost me at times",
    "date": "2025-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "While Idris is as good as ever (how could he not be), and the film itself scampers along happily, it doesn't come close to the series. Why? Nothing is believable. All  the \"crimes\" Luther is supposed to have committed had mostly already been addressed through disciplinary procedures in the series, and the stuff with Alice was undocumented - so the premise for his conviction and incarceration in a \"hi-max\" prison on the evidence of a \"dossier\" was flawed and undermined the whole narrative from the start.\nThis therefore made other discrepancies/continuity errors all the worse... the rescue divers at the end - lucky the police brought them to the arctic circle, eh? Poor overall.",
    "date": "2025-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "What a pity-the story line is terrible-it was outrageous, no cohesion. Hugely disappointing",
    "date": "2025-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Movie was solid. I hated Andy Serkis character, but who wouldn’t. I haven’t seen the show so I didn’t know much about Luther, but I’m wondering if what happened to him early in the movie was because of bad choices or he was set up. Overall I really enjoyed this movie.",
    "date": "2025-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It's stupid, from start to finish.",
    "date": "2025-06-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "So I never watched the series, so I will only speak of the movie. \nI am surprised at all the VERY bad reviews haha. Because I liked it! \nI will say the plot seemed a bit rushed. In that I mean, some parts could have been examined and explained. But I understand they need to keep it in a time frame. \nThat being said, I really enjoyed it. And as an American, I really enjoyed seeing all the fight and dramatic scenes not involve guns. I’m so used to everyone being shot at, and it didn’t happen in this film, and it showed that you don’t need it all. And without the use of them, so many more fight scenes and such were possible. \nI enjoyed the storyline. I know everyone think it’s preposterous, but sadly I find it quite possible. \nI enjoyed all the acting. Kept me on the edge of my seat. \nNow I’m gonna go watch the series!",
    "date": "2025-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Pretty good, better than the show. The character Odette is annoying and I think Cynthia is overrated in general but it's a good movie. Andy is, as always, good at playing bad but the wig they have him wear at one point in the movie is laughably bad.",
    "date": "2025-05-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Idris Elba was very good and Andy Serkis was outstanding as the psychopathic bad guy. Great story line and good plot twists. However Cynthia Erivo's plastic performance did not gel. She seemed out of place and awkward in the role. Every emotion was the same.",
    "date": "2025-04-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Absolute garbage.  Waste of time.  Bad storyline and dialogues. Some torture and really no sense in the plot.  Skip it",
    "date": "2025-04-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "An absolute waste of Idris Elba's talent and, equally frustrating, a waste of a great television character. The film can't decide if it wants to be a detective or spy film and because of this it fails to deliver. As a big fan of Luther on the BBC, the film is a damp squib lacking in plot and logic. Andy Serkis is also a huge disappointment as the film's villain.",
    "date": "2025-02-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Writer definitely could've thought of a creative way than putting 'John' to a prison and then break it the most childish way possible. It's amazing how they were on the run non-stop without food or sleep yet fighting harder than real life wrestlers. And 'John's' ability to guess the serial killer's motives without any support or history files is beyond this universe. Even the police department with all the sophisticated computers and systems couldn't make atleast a close guess. John could fight an entire prison to go very far but looked very weak against the serial killer each time they fought. This movie is not for the grown ups.",
    "date": "2025-02-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "My god! This movie is horrible! No words for this!",
    "date": "2025-02-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A decently entertaining action thriller that feels left out for non-fans of the show, but is made up for by Idris Elba and Andy Serkis’s charisma.",
    "date": "2025-01-24"
  }
]