[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I am not crying, you are!",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This film ends of a series of top 10 movies. It is heartwarming and a perfect end of an era",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A great ending to a wonderful animated film. The animation quality has clearly improved compared to the first film. The story was very good, but the bond between Hiccup and Toothless should definitely be more prominent than the bond between Toothless and Light Fury. Anyway, it is a very good animated film and I think it deserves the Oscar more than Toy Story 4.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Not as good as the first two. Still good. Anyone of any age can watch.",
    "date": "2025-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "What great and epic finale",
    "date": "2025-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The first of long time friend separation is dogged by bland and unfunny script.",
    "date": "2025-09-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "How to Train Your Dragon: The Hidden World (2019) is the last chapter of this wonderful franchise that has a magical farewell touch that many fans were very sad to say goodbye to.",
    "date": "2025-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Incredible, very overhated movie that doesn't deserve the criticism it gets",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Il miglior dragon trainer",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Toothless is a traitor",
    "date": "2025-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved the light fury, good character to add on, and It didn’t feel forced. I was a little weirded out that people thought Toothless should stay with Hiccup, but the whole franchise was about change. Hiccup relied on Toothless a lot, and Toothless relied on him, and them separating shows maturity and independence. I’m glad they moved on. Hiccup showed his great potential!",
    "date": "2025-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "There really couldn't have been a better and neater way to finish off the trilogy. The HTTYD series is honestly incomplete without this beautiful finalé, which seems to tie every ribbon with utmost finesse.",
    "date": "2025-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Sometime in the future.\n\nDream works: hey  can i take this.\n\nHttyd:ah yes httyd3 a masterpiece. what do you want to do with it?\n\nDream works:I want to give it a live action remake!\n\nHttyd yes!go! go!go! go!",
    "date": "2025-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Not as bad as HTTYD 2, but not very good either.",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "CARLOS MORENO \nI loved How to Train Your Dragon 3 because it was an exciting and very touching story. The bond between Hiccup and Toothless is stronger than ever, and seeing them grow and make tough decisions was truly inspiring. The animation is beautiful, and the ending made me cry—but in a good way. It’s a great farewell to an unforgettable trilogy",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A Great Ending to be a Great Trilogy!!",
    "date": "2025-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "this was just a merch machine. it's okay, but a lot of the action and some basic character movements seem to be half finished. we get a lot of cuts which skip the hard parts and just sort of show people magically getting away from an explosion or whatever. toothless and his gf's whole sequence felt poorly done as well, with none of the impeccable body language and choreography that went into making toothless so appealing in the first movie. they are out of ideas by the time this trilogy comes around, and it shows. we get another villain of the week, he's much less interesting than the one from the sequel. for a movie that came out around 10 years later, its weird that a lot of the animation looks worse than before. the overall quality of objects is better, there's more detail, but the natural movement is almost entirely gone. they seem to rely on a lot of physically impossible things happening off screen so that there are no real consequences to falling or getting hit, and thats fine when the movie is being cartoony, but it's not really acceptable for the serious segments.",
    "date": "2025-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The trilogy is closed elegantly.",
    "date": "2025-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This one is my favorite. I really like the love story between Toothless and Light Fury too. This one is the most special 💖",
    "date": "2025-07-03"
  }
]