[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I read the reviews and didn't know what to expect. I will say they had some great old film footage that I don't think I saw before. It did show several sides of different theories which I found interesting. It amazed me that Manson was never put back in jail after several parole violations and one of the clinics he used was linked to some CIA and FBI activity.  Overall not a bad watch if you're interested in possible reasons how and why Manson was able to engineer these crimes and how the Government may have been involved in keeping him out of jail.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I've been watching Charles Manson, pretty much my entire life trying to understand how even with LSD he could be so charismatic that people would murder for him. I emotes this film greatly. They do a nice job of crime scene investigating and archival footage with Manson, and he really was quite full of himself.",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This is a useful history of Manson and his cult and the sickening crimes they committed. There's nothing new here though - the CIA conspiracy thing looks like bunkum.",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I thought this was a pretty good documentary. I enjoyed it. It makes me glad that he is gone now. What he did was horrible.",
    "date": "2025-06-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The book deserved a ten hour series, not this half baked rubbish",
    "date": "2025-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Simply put, the book is WAY better. Read it. So much interesting info. This documentary isn't worth your time.",
    "date": "2025-04-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "There is no clear storyline; it is all over the place, and often, it leaves the viewer more confused rather than clearing up the claim to a conspiracy.",
    "date": "2025-04-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Chaos: The Manson Murders - 6/10. Errol Morris directs this documentary about Charles Manson, his life before becoming the demon of a human that he became, and his cult. Errol Morris is one of the greatest documentarians in history, and his craftsmanship and abilities as a documentarian are on full display here. But, I feel like this felt a little disconnected at times. Also, it felt a bit indulgent in its stylization the events and focus on Manson. Informative, but not amazing in my opinion.",
    "date": "2025-03-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "What happened to Errol Morris?\n\nThis so-called documentary doesn't remotely do either the book or its author justice. The book is spellbinding, truly a page-turner. What makes it so is not just the horrible murders and the new information O'Neil unearthed, but also O'Neil's own story as he obsessively pursues leads and becomes consumed by his assignment. O'Neil is forthright about what the information proves and what it merely suggests. He's candid in recognizing that his inferences might cause him to be dismissed by some as a crackpot, which he clearly is not.\n\nThe movie is junk, full of portentous images and music but lacking in suspense or interest. I only hope that O'Neil benefits from it in the form of renewed sales of his book, which deserves a far bigger audience than this flaccid film.",
    "date": "2025-03-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "What a disappointment. Rehashes the already known. Brings nothing new. Just another documentary cashing in on this tragedy. Total fail.",
    "date": "2025-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Such a disappointment. Does not deserve to be named after such a brilliantly researched and written book. I can’t believe this was made by the same director who did Wormwood. Errol Morris has clearly lost his fastball, and does such a disservice to the wonderful work Tom O’Neil did to uncover all the connections to MK Ultra, the prosecutors misconduct throughout the trial, and the CIA connections to the Haight Ashbury Project and Haight Ashbury Free Medical Clinic.\n\nI truly don’t understand what Errol Morris is trying to accomplish with this documentary.",
    "date": "2025-03-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Read the book! Tom O’Neil’s book was thorough, very well researched and captivating. This documentary did him zero justice. The amount of meat left on the bone is inexcusable. It’s almost a total misrepresentation of the effort Tom put into his research. \n\nThe book is exceptional. This is horrid.",
    "date": "2025-03-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Sorry...no. Please know this documentary left out so much information on Manson's crimes -- such as several other murders the family is suspected of commiting, including one of their own defence lawyers.  Manson used his \"girls\" by prostituting them out, maybe not for money, but to bring men into his group. This was 100% a cult and the leader was Manson. He found an opportunity in San Francisco in the late 60's. He manipulated vulnerable young people who felt lost and wanted to be part of something....during a time where the country was in perpetural angst with the Vietnam war, etc. He exploited it. He got a taste of power and he liked it. When things started to go south, he did what he could to maintain his power. This CIA angle is so flimsy.\n\nIn this doc, most of the courtroom videos show the Manson \"girls\" singing like angels and ignores many of the other insane antics that are documented as happening during the trial. One of these \"girls\" attempted to assasinate a US President a few years later. And last, I don't know much about Vincent Bugliosi. I read a couple of his books and I enjoyed them. But I was really disappointed about how the filmmakers toss him under a bus. Helter Skelter had a lot more pertinent information in it than this doc. And he obviously can't defend himself. It is so disresptful.",
    "date": "2025-03-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Ugh. Don’t even bother with this one. New CIA mind control experiment theory. But is it really new? Nope. Not much substance - just a rehash of every Charles Manson documentary. I guess the director was trying to create “chaos” with the way he spliced the footage with double images and reverse colors, and the sound with static. It worked - the film is unwatchable and gave me a headache. Chaos indeed.",
    "date": "2025-03-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Pretty boring to watch and didn’t break any new ground in helping to understand these murders. Never captured me enough to pay more than passing attention to the experts.",
    "date": "2025-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I was a teenager living in the Valley when these murders transpired.  It was a terrifying time.  I took issue that any of this madman’s music was considered for use, let alone made it in the final cut. In my opinion, the case isn’t complicated / it was heinous and sadistic.  The whole family were deranged. I do not buy the twist on Manson being a CIA asset or “helped” by anyone that had reason to experiement with mind games .   I do not recommend it.   Let the slain people rest in peace, and don’t spend time waiting for the message behind the “real reasons” for the killings  that never revealed themselves.",
    "date": "2025-03-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Don't waste your time. There's not much really new here except some crime scene footage I hadn't seen and self-serving interviews with \"family\" members decades later. Visually, it's a distracting mess of pointless video tricks that add nothing. There's an attempt to present a conspiracy of some kind by somebody but it's flimsy at best and utterly unconvincing.",
    "date": "2025-03-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The constant sound effects, camera shaking, horrible editing, couldn't watch it gave me a headache. A shame.",
    "date": "2025-03-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Unnerving and atmospheric, it uses music and an eerie tone to pull viewers into its exploration of the Manson murders. However, the documentary's structure begins to unravel midway, making it harder to follow the story. Some interviews feel scattered, detracting from what could have been a groundbreaking perspective. Despite its ambitions, it struggles to fully deliver on its promises. Visual graphics can be overwhelming at times aswell.",
    "date": "2025-03-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Adding to the Charles Manson documentary cannon with something novel is probably close to impossible and while this isn't entirely something new, it does illuminate well-worn paths of this story by filling in the finer details while outlining the familiar-- the murders and the legal case that followed--to make a case for US intelligence involvement. \n\nA lot of people seem to be bothered by some of the aesthetic choices and the editing so tolerance for that with vary. I wasn't particularly bothered by it, in fact I liked much of it as it was unique in its own way. Overall I enjoyed it very much and thought the CIA/FBI was compelling.",
    "date": "2025-03-11"
  }
]