[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Dramatic scenery and good cinematography. Feels like Eric Bana and Anna Torv were a bit underutilized in this movie. Could have been so much more, but not at all a total disaster. Some good and convincing moments, albeit few and far between.",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Who writes this stuff?  Who makes a movie with a script this poor?  Dear lord, I began writing this while the movie was still going: it gets worse at the end.  It is so bad that I actually feel sorry for Eric Bana.  I'm a huge loser who's accomplished nothing in life, yet I still feel bad for the guy.",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "An Arron Falk franchise has been born. The way the Director, Bob Connelly, made the bush the main character is astonishing.\n\nA gripping story, kept me upto midnight, even though I have a bad cold. Visually compelling. \n\nDeborah-Lee Furness and Richard Roxborough are world class. Eric Bana holds up his end well. \n\nBe silly to miss it. Come on down, Dry3!",
    "date": "2025-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "A disappointing so-called sequel to The Dry(which I rated as 4 stars). The script was lazy and clunky and the cinematography hardly took advantage of the dramatic landscape. Eric Bana and Anna Tove did the best they could considering the poor direction and script of this underwhelming movie.",
    "date": "2025-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Just as good or even better than The Dry. Hoping and wishing for The Dry 3🤞",
    "date": "2025-09-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Eric Bana torna nei panni del detective Falk in un'indagine che, esattamente come nel primo film, sfrutta molto bene le location, che diventano essenziali e centrali nello sviluppo di tutta la trama.\nLa sceneggiatura riesce abilmente a mantenere dubbio il finale e a nascondere i colpevoli sfruttando l'ampia gamma di personaggi per rendere il tutto più imprevedibile e meno noioso.\nPurtroppo alcuni personaggi risultano un po' forzati nel dimostrare le loro (poche) caratteristiche finendo per essere poco spontanei e creando qualche crepa nei dialoghi.\nEric Bana invece continua sulla falsa riga del primo capitolo con un personaggio integerrimo e serio, senza grandi scatti emotivi che lo rendono molto interessante e perfino leggermente misterioso.\nPurtroppo il finale sulla cascata è totalmente sbagliato, sia per credibilità della sceneggiatura che per la finta location trovata.\nComunque un giallo thriller ben costruito.",
    "date": "2025-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Dry was really good, that's why I watched this one.\nThis, Dry 2 Sucks! it's more of a lifetime movie. Nothing really happened other than being lost.\nThere's no storyline, plot, there was no need for the climax music.\nDon't waste your time",
    "date": "2025-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It was a big disappointment after the first film. The book has a lot of praise, so I'm not sure what went wrong in this sequel.  While the actors did a great job, I guess I didn't really care for the characters or mystery?  The first film explored trauma, buried secrets, and the prisons we build for ourselves.   But I’m not sure what The Dry 2 film was trying to say...",
    "date": "2025-06-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Not as good as the first , but still a worthy crime mystery. Would love a third.",
    "date": "2025-05-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Spoilers: I watched this because of Anna Torv. Other than that, I was lost in the woods, like the movie.",
    "date": "2025-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I like BGM, environment settings and the picture of the nature in Victoria. However, the storyline is just about some kind of desperate housewives arguing for stupid minor things that shouldn't have happened when a group entered life threatening situation. If the plot was more about deep secret in a slow burn pace, it would have brough the whole story to next level.",
    "date": "2025-03-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I liked it. A lot. I thought this was pretty good all round.  These guys obviously worked on the relationships before filming, it was v professional.  Quality cast.  Fantastically well rounded characters, it was so good.  The storyline was okay, hundreds not but the touch too long one on one conversations, at a goes some setting up the sun texts  it even the actual plot, but  the photography great, the sound effects/lighting really well done. Furness so tidy in her actions, subtle nuances that I really liked (except for the ‘are we, Alice?’ bit which you will understand once you’ve been introduced beforehand to the Alice stuff/situation, Roxburgh and Bana just s good. The Aussie casualness of these characters was so enjoyable. Well done.",
    "date": "2025-03-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Firstly it's wet and rainy the whole time and gloomy and not even dry. Nothing happens really there's no motive and they're not far into the bush really and run into NOT ANOTHER PERSON. Acting not strong from the younger cast members. I think the murder victim was bored to death.",
    "date": "2025-02-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Awful boring film about annoying shouty Australian women falling over in a forest. Kept waiting for it to start. Avoid.",
    "date": "2025-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Honestly, this was one of the less likely sequels I’d have ever expected. The ‘twists’ and reveals came as no surprise because as I was watching it I thought there was no way they could twist this and make it interesting... and I was right.  The main chracter's involvement felt watered down and far less central to the plot than the predecessor, and the duality of the story did not mesh together as well as it did in the first film.  I guess we’ll have to wait and see how it all fits in to The Dry extended universe.",
    "date": "2024-12-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Hard to describe how far fetched and boring this movie is,terrible acting & plot,definitely do yourself a favour & give this a very wide berth,oh boy ,Eric Bana looked like he wanted to be anywhere but filming this",
    "date": "2024-12-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great story telling.",
    "date": "2024-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "a classic thriller with the well-known and often used \"death on the Nile\" style. everyone is a bit of a killer. first part good, this one below average",
    "date": "2024-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This search and rescue dramatic movie is a decent story, steadily paced and edited. I wouldn't say it's life-changing or anything close to it. But it's entertaining enough of a flick to watch.",
    "date": "2024-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Bunch of different personalities, a missing person and many other entanglements sets up this thriller on a good foundation. An unfortunate mishap within a grand scheme that brings famous detective Falk into this Australian wilderness much damper than the previous instalment. Totally different circumstances but the conclusion is satisfactory could have been even better. Rich visuals of the greenery at last connects to Falks final statement of how nature reclaims no matter what we occupies our lives with all affairs are benath it. Great sound effects. Excellent performances by the cast. And this is another great instalment for Aaron Falk's adventures.",
    "date": "2024-10-28"
  }
]