[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Why did you not give me a proper ending. Trash ass movie",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's kind of your typical Dwayne Johnson action thriller. But at least it focuses on the characters, and encourages lending a helping hand in an emergency situation.",
    "date": "2025-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "As bad as any other disaster film. It’s actually quite comical in places re the near scrapes. But it gains extra bonus points for the spectacular boobs on show from mother and daughter. Great genetics and added something worthwhile to this all round boob of a film. Watched on DVD.",
    "date": "2025-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "San Andreas was a surprise for me. Going in, I assumed it would be a typical disaster movie: lots of explosions, shaky storylines, and characters who exist purely to scream while things collapse around them. What I got, however, was a high-octane, emotional, and genuinely entertaining film that managed to balance heart with spectacle in a way few disaster movies manage. From the very first scene, you’re thrown into tension and chaos, but it’s grounded by characters you actually care about.\n\nDwayne Johnson continues to prove why he’s one of the most compelling action stars working today. Here, he’s not just the muscle or the comic relief—he’s a fully fleshed-out father figure, desperate to save his family amidst catastrophic earthquakes that tear through California. What I appreciated most is that Johnson brings vulnerability to the role. You can see his fear, frustration, and determination in his eyes. This isn’t just about him dodging falling buildings or jumping out of helicopters—it’s about a father’s love and sacrifice. That emotional thread runs consistently through the chaos, giving the movie stakes beyond CGI destruction.\n\nCarla Gugino, as Emma, brings a grounded presence that balances Johnson’s intensity. She’s calm, rational, and resourceful in the face of absolute disaster. Their chemistry works really well, making their shared scenes feel realistic and emotionally resonant. Alexandra Daddario, playing their daughter, is a revelation. She manages to portray fear, bravery, and determination all at once, and her performance elevates scenes that could have easily felt cliché or overacted. You feel invested in her survival—not just because she’s the damsel in distress, but because she has agency and demonstrates clever problem-solving throughout.\n\nThe supporting cast adds even more layers to the film. Hugo Johnstone-Burt as Ben gives a grounded, heroic presence, embodying the everyday person thrust into extraordinary circumstances. Art Parkinson, who plays Ollie, shines as the younger brother—he’s genuinely brave and resourceful, providing moments of levity and hope in a film that could have easily felt relentlessly grim. These characters are not just window dressing for destruction; they are the emotional glue that makes the movie worth caring about.\n\nThe direction and pacing deserve high praise. The filmmakers understand how to build tension and then release it with spectacular payoff. The earthquake sequences are genuinely terrifying and exhilarating. Watching entire buildings crumble, fires rage through streets, and cars tossed into the air creates an immersive experience that keeps you engaged from start to finish. The way these sequences are staged shows meticulous attention to detail—every collapse, every explosion, every small human interaction feels purposeful. There’s a sense that the filmmakers understand that spectacle without story is meaningless, and they make sure you never lose sight of the people caught in the chaos.\n\nOf course, the screenplay isn’t perfect. There are moments that lean on clichés, and a few plot conveniences exist to move the story along. Some dialogue feels a little too on-the-nose or dramatic, and a few secondary characters could have been better developed. But these are minor issues when you consider the overall impact of the film. The movie’s heart is strong enough to carry it through these imperfections. The combination of personal stakes, disaster chaos, and the subtle humor sprinkled throughout makes for a surprisingly well-rounded experience.\n\nThe special effects deserve special mention. For a film that came out in 2015, the CGI is impressive and often seamless. Earthquakes, collapsing bridges, towering tsunamis, and urban destruction are all rendered with a visceral quality that makes you feel the danger. The filmmakers also wisely use practical effects and stunt work alongside CGI, grounding the spectacle in reality and making it feel more immediate and intense. This approach elevates the movie above many other disaster films that rely too heavily on digital effects alone.\n\nBeyond the technical and emotional aspects, San Andreas succeeds because it never forgets its core story: family. The earthquakes, tsunamis, and fires are terrifying, yes—but the real tension comes from watching this family navigate impossible circumstances and do everything they can to survive. That makes every moment of danger feel more impactful. You’re not just watching skyscrapers fall—you’re watching parents fight to keep their children alive, children fight to help their parents, and everyone involved face moral and physical challenges that feel grounded despite the over-the-top events.\n\nEven the smaller moments stand out. The way the film briefly pauses to allow characters to communicate, strategize, or even joke amid the destruction gives it a human touch. These pauses prevent the movie from feeling like an endless parade of explosions, which is a trap many disaster films fall into. Here, there’s room for tension, relief, and emotional resonance, and that’s why the film sticks with you.\n\nIn the end, San Andreas is more than just a thrilling action movie—it’s an emotionally engaging disaster adventure. It’s a movie that keeps you on the edge of your seat, while also giving you a reason to care about the people experiencing the chaos. From the performances of Dwayne Johnson, Carla Gugino, and Alexandra Daddario, to the careful direction, well-executed stunts, and immersive special effects, this film delivers a complete experience. It’s one of the better disaster films of its era and is genuinely fun, exciting, and emotional all at once.\n\nIf you’ve never given San Andreas a proper chance, it’s worth watching—not just for the earthquakes, but for the human stories at its core. It’s a thrilling ride, and one that proves a disaster movie can have both spectacle and heart in equal measure.",
    "date": "2025-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Cheesy action movie plot. Typical devices, man and woman separated by a loss of a daughter, seek to prevent it from happening again with their other daughter and come back together.  There were so many moments where \"if something could go wrong it would\" that by the tsunami scene when the container ship crested the wave top, I started laughing hysterically at the absurdity.\nBut, with that said - I do like Dwayne Johnson and this movie had some of the best CGI I have seen in a long long time. (and I work in computers including computer graphics). While the various premises and scenes were highly unplausible, it is a movie and it is an action movie. And what the absurdity lacks the cgi makes up for so I gave it 4 1/2 stars.",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I liked the movie because it shows how powerful an earthquake can be and how important it is to be prepared. It also shows how the main character tries to help others while always protecting his family.\nValery laiton",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Bien que le plot soit prévisible, je ne me suis pas ennuyé en regardant ce film ! Le lien de cette famille est fort et touchant, c'est un bon divertissement pour débrancher le cerveau.",
    "date": "2025-05-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The 2015 film “San Andreas” directed by Brad Peyton is a riveting disaster story that follows the aftermath of a massive earthquake that destroyed California. The magnitude 9 earthquake is triggered by the San Andreas Fault line  and tears apart the city. Dwayne (The Rock) Johnson stars as Ray Gaines, the search and rescue pilot who is fearlessly trying to find his lost wife and daughter. The film, being more recent, has much better special effects and is depicted in a somewhat believable manner. The fault line is shown in a very dramatic way to leave a bigger impact on the audience and keep them engaged. The movie features many tools used in seismology by real scientists. \n\tThough the film is exaggerated for cinematic effect, it does portray the dangers and risks associated with living on an active fault line. California is at greater risk for earthquakes being that it is located directly on the fault of the North American and Pacific plates fault line. The film, while visually impressive, does simplify many real geological processes. For example, the quick succession of earthquakes and their immediate impacts may misrepresent the intricacies of seismic activity. In actuality, earthquake magnitude and frequency can vary widely, and the aftermath is usually defined by extended recovery efforts rather than immediate chaos. Despite these misconceptions, \"San Andreas\" effectively increases awareness about the risks posed by natural disasters. \n\tSomething that really draws in viewers during this film is how humans respond in a crisis. Watching characters experience and navigate hardships that are unimaginable to many is always interesting. Ray’s determination to find his family through all the chaos highlights how important it is to have a plan in disaster situations. The movie illustrates how people come together and support one another which is an important element for survival in situations like this. One thing to learn from this film is how important it is to be prepared. During the film, characters show different levels of preparing for the impending tragedy.   This emphasizes the need for community emergency preparedness, such as evacuation routes and communication systems. The film urges viewers to think about their own readiness for natural catastrophes, promoting the fact that early preparation can save lives.",
    "date": "2025-05-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "1st movie theater experience with my wife and her 1st ever, best choice with this movie as well!",
    "date": "2025-04-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Welcome to san andreas, i am CJ from groove street, land of the heinous, gangbangers in cold heat",
    "date": "2025-02-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Even though all these catastrophic movies are over the top , they still are a fun watch. This is exactly that movie.",
    "date": "2025-02-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The Day After Tomorrow, 2012 & San Andreas are the 3 best disaster movies ever made. Super entertaining.",
    "date": "2024-12-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Really entertaining movie, I enjoyed this one a lot. I definitely recommend it.",
    "date": "2024-12-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "So corny and cheesy. Horribly done and Dawayne “the rock” Johnson is such a stupid clown. Could barely finish it. So bad and stupid. Why Hollywood casts the Rock is beyond me. He’s almost a worse actor than he is a human.",
    "date": "2024-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Una película que reúne todos los elementos clásicos del cine de catástrofes: emoción, acción trepidante y momentos de conexión humana en medio del caos. Con una narrativa esquemática pero eficaz, se apoya en un protagonista carismático que lidera la trama con solvencia, mientras que el elenco secundario, incluyendo una interpretación destacada de su coprotagonista femenina, aporta frescura y dinamismo.\n\nEl guion, aunque predecible y repleto de los tópicos habituales del género, logra mantener el interés gracias a la espectacularidad de sus efectos visuales y la intensidad de sus escenas de acción. Es una propuesta que no pretende reinventar el género, sino ofrecer entretenimiento puro y directo. Ideal para quienes buscan emociones fuertes y un rato emocionante sin mayores complicaciones.",
    "date": "2024-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "A total catastrophe. I literally felt dummer after watching this.",
    "date": "2024-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The Acting was very mediocre, almost awful even, with little to no emotion behind the characters. It didn't feel like these people were really there, but you could tell they were acting. No real wow moments/ moments which stood out. The writing was mid with a lot of cringy overly used one-liners which were way too predictable. The CGI is pretty impressive, though. The amount used is insane and is this movies' saving grace. The story it-self is well thought of, but the plot and writing really ruin the movie. A movie I would watch again, but only to see the impressive GCI and how the catastrophic events look/play out. If you want to see a cool looking movie with great film quality, this is a one to watch, just try and look past the low effort acting/writing.\n5/10",
    "date": "2024-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best natural disaster movie I have ever witnessed and the music absolutely suits the movies drama and action very emotional movie and perfect would not change a thing",
    "date": "2024-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "O filme e legal mais se perde ao passar o tempo",
    "date": "2024-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Predictable plot, cliche acting, cheesy one-liners. You'll not be surprised by anything. Giamatti is laying on his signature over-acting of serious scenes as thick as expected. And the Rock saves the day by land, sea, and air - multi-talented. Good background noise type movie while browsing the Internet, doing laundry, or watching another movie, I suppose.",
    "date": "2024-07-07"
  }
]