[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Jessica Alba is a great actress but the movie is not very well done.",
    "date": "2025-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This was a low budget film and typical where things that happen can’t really happen.  \n\nEx. Running away with a big head start and bam the person chasing catches up in no time. \n\nNot very happy with the acting. Thumbs down on this movie, not good at all.",
    "date": "2025-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I really liked the premise however, the editing and fractured story line made it hard to watch.  Towards the end, thought this was a high school movie project.  Too bad as it was a cool story line, just poor execution.",
    "date": "2025-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I guess all the focus on knives made them forget about Chekhov’s gun.",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This film illustrates the need to make multiple copies of the script.  They didn't.  It got lost.  And the screenwriter was unavailable.",
    "date": "2025-06-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I cut the movie off from the first fight scene than came back and watched the rest. I'm upset I didn't follow my first instinct!",
    "date": "2025-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Very rarely do I turn off a movie unless it's a spook one that's getting too cheesy. But this one was an exception to the norm. My wife is notoriously good at falling asleep during movies but this one put her out in less than half an hour.",
    "date": "2025-05-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I was out after the opening scene. Theirs a reason men don’t fight women in mma and why they have weight divisions. Jess is cute but she is not going to win a fight with a 240# man",
    "date": "2025-04-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Me and my sister watched this movie and we loved it. Yes, the acting is not the greatest but if you are not over analyzing it, you will enjoy it. There was plenty of action.",
    "date": "2025-02-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Astonishingly poorly written and realised film. A waste of everyone's time and effort in making it and ours in attempting to watch it.",
    "date": "2025-01-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A nice to watch film. Enough action to keep interest a nice story line. I'd watch it again and would recommend to anyone looking for a feel good action film.",
    "date": "2025-01-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "My god this was terribly written. The writer should be banned from everything in the entire industry.  I might just skip season 2 of the Night Agent now, just because the main actor is also in this heap of trash.",
    "date": "2025-01-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Horrible plot, an action movie for the sake of being an action movie. Passable acting and good filming can't recover this soggy predictable overdone plot. I would only recommend this movie if.... never. Don't watch this.",
    "date": "2025-01-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "C- at best. The story line and acting was mediocre. \n\nSo she was able to dispose of Ghost a known criminal in like 30 seconds but then gets disarmed by Elvis? Come on now",
    "date": "2025-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This is billed as an action movie but its mostly Jessica Alba looking into the middle distance while remembering her dad",
    "date": "2025-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Feels like they must have filmed hours more than made it into the movie and then when they edited it to make it under 2 hours, all the important plot bits were cut.",
    "date": "2024-12-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Cinematography is pretty decent, sets and locations quite haunting. I admit Jessica Alba was the only thing keeping me somewhat engaged. Yes a slo burn film but did not mind it, especially over the Xmas break..Nice to see a movie with a pretence of a story.",
    "date": "2024-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Action choreography unconvincing, dialogue writing amateur at best, and wardrobe really fail, Alba is a pretty woman, yet they still manage to make her ugly by dressing her ugly clothes. She doesn't look she's military trained at all.",
    "date": "2024-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I am sorry I wasted my time watching this movie. Both my friend and I thought it was the worse movie we watched on Netflix. It's horrible 👎👎👎",
    "date": "2024-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Brilliant movie good action movie brilliant fight scene s a must see movie 10 stars ✴️",
    "date": "2024-10-22"
  }
]