[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The best!!!!!!!!!!!!!",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "8/10. 87/100. | Also watched with Chloe Lainhart",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This film was as great as the first one. Enjoyed this one slightly better in terms of the action scenes. Though the new villain was slightly dodgy on the convincing side.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Eu detestava esse filme mas depois de ver o terceiro.... Meu amigo que filme bom que é esse 2",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Slow, clunky scene between Ruffalo and Freeman at movie's end was not a plus and there's a long, senseless scene earlier where the Horseman are being searched, one-by-one. Expertly hiding the item AS they are searched, the magician would (for no earthly reason) then pass the item AFTER the search was completed to someone who was next to be searched. Once the first Horseman had successfully hidden the item throughout the thorough search, wouldn't it make sense to hang on to the item? Instead of passing it on to risk possibly being found on the next Horseman to be searched? Oh well, those things aside, I enjoyed the movie well enough.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Now You See Me 2 is definitely a step down from the original, weighed down by an overcomplicated plot that tries a little too hard to fool the audience. It offers far fewer memorable moments, and Lizzy Caplan’s character unfortunately doesn’t add much to the Horsemen. Still, the premise remains fun, the action is enjoyable, and the great soundtrack makes it an easy, entertaining choice for a night in.",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Now You See Me 2 is not as enjoyable as the first one and it's also pretty predictable.\n\nThe story is disjointed and somewhat predictable. Which means I didn't know what the story was going to be after five minutes, but I figured out everything a few minutes before their reveal, which is also satisfying at times. The dialogues are sometimes cheesy or they just don't fit there. That threw me out occasionally. The characters don't always follow a visible and understandable journey, which is caused by a plot twist that doesn't really make sense having seen some stuff before. Despite all this I think overall the tricks made sense more.\n\nThe cinematography is mixed, but I enjoyed that the camera movement kept the style without overusing the chaotic scenes. The lighting is good, but the framing not so much. There were some shots where I could just feel that they switched to digital. I loved the spinning shots though. The pacing is probably the main reason I was bored with this film, so I'd say the editing is something I disliked. The casting is still wild and the actors fit into their roles a lot more. The performances aren't too special.\n\nNow You See Me 2 is the definition of a mixed experience. It's not always entertaining, it has pretty good cinematography and the story is okay.",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I LOVED this movie and I can’t wait for the next one! Daniel Radcliffe wasn’t the best actor but the rest of the cast was fantastic!!! Definitely a must see franchise that never disappoints! I hope there is a 4th movie in the works, I can’t wait! The 1-3 movies are all 5 stars for me",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The perspective shifts from that of an outsider to the inner world of the Four Horsemen; the sense of mystery in Now You See Me 2 feels somewhat diminished. However, Jon M. Chu’s directorial style and the film’s action-adventure-driven screenplay clearly steer the work toward the spy genre.",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I can’t believe this has such a low rating.   Stop taking these movies so seriously.  It’s fun!!! Love this movie.",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "What a follow-up. The street magician taps into some latent water bending powers, Isla Fishers character got replaced by \"other girl character,\" who is pretty normal except for a Mary Poppins style \"bird pocket.\" Meanwhile the psychic meets the Yin to his Yang in the form of Woody Harrelson but with some chompers and a perm now, and Dave Franco I think got some banana related power. \nOh right Harry Potter was in this one too, but he hates magic now and is trying to kill the wizards. So he comes up with this ingenious plan to lock one of them in a trick safe, without removing their belonging, and then dumped it into the water... a magician... he put a magician inside a trick/illusion and just walked away, thinking it would kill him. Then a bunch of other stuff happened and it ended. Brilliant film. 6/10",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Filme mais ou menos, o roteiro é fraco, as cenas são mais ou menos, a história é fraca, o elenco é mais ou menos, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom,  o filme agora coloca os 4 cavaleiros como heróis, e agora tem o vilão Daniel Radcliffe junto com o Michael caine, na parte final do filme, Daniel e Michael estavam no avião com os 4 cavaleiros junto com o mark ruffallo algemados, 1. Por que os cavaleiros não se soltaram das algemas rápidos? que nem eles fazem durante do filme, 2. como os 4 cavaleiros juntaram um monte de pessoas ao redor de Londres para a atração final, sem o Daniel e o Michael caine saber?, por que se o Daniel e Michael, estão a 1 passo na dos 4 cavaleiros não teve sentido ter a atração final, 5. e no final, o morgan Freeman sabia de tudo e ajudou eles enquanto ele estava na cadeia e foda-se, 6. Ele perdoou o mark ruffallo por achar que ele teve algum envolvimento com a morte de seu pai, que nem foi mencionado no primeiro filme, o filme teve uma cena excelente que foi a cena de passar a carta de pessoa para pessoa no laboratório do maluco do caralho, com tudo isso, eu até recomendo esse filme, mesmo com alguns erros ao longo do filme.",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "So much worse than the original. Nonsensical to the point of appearing random. Ruined the simple magic of the first.",
    "date": "2025-10-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Now You See Me 2 continues the story of the Four Horsemen with new conflicts and a fresh character, Lula, but falls short of the charm and magic of the first film. While the film offers fast-paced action and a polished visual presentation, it lacks the jaw-dropping tricks that made its predecessor memorable. The story feels rushed at the start and underdeveloped in terms of character depth, particularly for the new cast. Daniel Radcliffe’s role as the villain feels miscast, reducing the impact of the conflict. Despite its shortcomings, the film still provides enjoyable entertainment and sets up curiosity for a possible third installment.\n\nRead the full review here: (Indonesian version : alunauwie.com) and  (English version : uwiepuspita.com)",
    "date": "2025-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "did they have to have daniel craige as villain??",
    "date": "2025-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Functional second act that improves with the same entertainment value, only this time while divulging onto the characters through satisfying illusions of increased twists and turns it also stalled on style. (B)",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "J’avais le souvenir que ce film était mieux que ça… finalement, mise à part la scène de la carte et la révélation de fin, je me suis un peu ennuyée.",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Twists and turns abound in this heist/revenge comedy/action film. More CGI in place of \"magic\", but what the heck, it's a lot of fun to see the \"magicians\" ply their craft.",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Worse than the first, vault scene with the card was cool but everything after that sucks and has a twist that makes even less sense than the first",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "You haven't seen anything yet.\n\nNow You See Me 2 (also known as Now You See Me: The Second Act) is a 2016 American heist film directed by Jon M. Chu 🪄 \n\nAlthough there are a few slow sections, this is still a fun and entertaining movie…\n\nIt’s good 🙂\nWorth a watch. \nI’d recommend it if you like this genre 👍🏼\n\nOne year after outwitting the FBI and winning the public’s adulation with their mind-bending spectacles, the Four Horsemen resurface only to find themselves face to face with a new enemy who enlists them to pull off their most dangerous heist yet.",
    "date": "2025-08-15"
  }
]