[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is easily, probably one of the best movies I have ever watched. \nIt pulls on my heart strings so much, EVERYONE  got to escape and live the flower farm life?!? UGH had me tearing up 🥹. \n\non a side note: why do all cartoon movies make the dad die?",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 48 minutes!!!!!!!!!!!!!!!!!!!!!! Starring John Cena as Ferdinand the bull!!!!!!!!!!!!!!!! The USA grossed over $84,200,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Mala la película %28🤮",
    "date": "2025-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The childish but loveable family movie from Blue Sky that is set in another country (& also done by Carlos Saldhana).\n\nBlue Sky was very good with adapting stories & books out of different shapes & sizes - with this, it is a simple short childrens book that has turned into a big adventure.\n\nThe Story always shows never to judge a book by its cover; Ferdinand is a bull, bulls can be stubborn/tough looking but not him, he was one not into (bull)fighting, which is very wrong (everybody believes in the end) & would much rather smell the flowers.\n\nAnd it is rather incredible to cast a WWE wrestler (John Cena) as this gentle bull.\n\nWith more information I say, many of the characters are funny, even the antagonist although he was not wholesome like the others. The movie is funny although some gags are kind of silly.",
    "date": "2025-06-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A pretty barebones film that really is just for the kids....",
    "date": "2025-06-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "My daughter is obsessed with this one (she’s 18 months old and thinks the bulls are hippos) \n\nI enjoy the storyline and the quick transitioning into the next phases of each scene. For a shorter running time you get a pretty decent amount of scenes in mixed with comedy.",
    "date": "2025-01-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Although I wasn’t too impressed with the humor, I did really like the heart and care behind this movie to tell a fun story about a kind bull. The characters were fun, the voice acting was good, and the animation was upbeat and very colorful! Ferdinand’s positivity and enthusiasm was infectious and was well-needed for the heavier parts of the film. It was very well-done and his story was very entertaining, even if I wasn’t engaged with a lot of the movie.",
    "date": "2025-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "What a movie. Oddly dark themed at moments, but not bad.",
    "date": "2024-12-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This show is my favorite, very touch emotional when bulls escape from battle kills of death. Well this based on true story about a person who have friend with animal.",
    "date": "2024-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "\"Ferdinand\" is a 2017 animated feature by Blue Sky Studios. The story of Ferdinand had previously been adapted back in 1938. It as an animated short made by Disney and even won the Oscar for Best Animated Short. Unfortunately, when you take something that makes a fine 8-minute short and stretch it to a 108-minute feature...100 minutes of it is going to feel like filler.\n\nSome of the additions Blue Sky added to the story are welcome changes that add some good character depth. The backstory of Ferdinand and the other bulls is well done. There is a bit with a bull in a china shop that is well animated with some creative gags. In fact, the movie was flowing pretty well for the first 30 minutes. Then they introduce Kate McKinnon's goat character named \"Lupe\", and suddenly the movie shifts from being a nice family movie to be a mindless kids' movie.\n\n\"Lupe\" is meant to be a comedic relief character. She brings no comedy and no relief. She may be one of the worst \"comedic\" side characters ever. It is a shame because Kate McMcKinnon can be really funny. On top of her, we also have 3 wise cracking hedgehogs. 1 of them his joke is that he's the fat one, who always talks about food. The other one has a running gag of reminding people that they are hedgehogs. The other one is the girl hedgehog. There are also three German horses. Is that the joke? That they're German? Other than the extra characters. What else does this extra time add? Among other things it includes a car chase, some slapstick and a dance battle.\n\nSome of the casting decisions are strange, for example Peyton Manning plays a major role. But they all do a good job. John Cena as Ferdinand is a good pick, I can see him as a big peacemaker.(HA!)\n\nThe movie still has a good message at its core. It is sweet when it needs to be and at times can even be a bit dark. There is just too much of the usual kids' movie stuff that bogs this film down. Not that all the slapstick and jokes are bad, it is just that the bad jokes outweigh the good.\n\nMuch like the Bull himself, \"Ferdinand\" has a good heart, but it is surrounded by a lot of bull.",
    "date": "2024-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I actually like Ferdinand, this is a pretty good movie. And not just because of the fact that he's played John Cena, but just the story and plot of the film isn't cliche. Now I wouldn't necessarily say that this is one of my favorite movies of all time. But it was a good movie I could indeed watch. The critics certainly thought it was decent, but the audience, not so much.\n\nFirst off, I gotta tell you, the CGI is absolutely amazing. Blue Sky Studios cooked with this one in terms of animation and character design. Secondly, this movie does deliver a very clever and wise message. In the trailer, Ferdinand said,\"People think that they have you all figured out, based on how you look, how you talk, where you're from. But truthfully, it's not that simple. Especially when it comes to me. I'm a little bit more complex.\" What he means by this is that sometimes, don't judge someone by how the way they look, because you'll never know if they are different than you think.\n\nThe movie does have awesome characters, but I love Angus because he's played by David Tennant. And I love Scottish people thanks to How To Train Your Dragon. #SCOTLANDFOREVER!\n\nThis is another reason why I miss Blue Sky Studios. Because they may not have really made much movies, but the ones they did make were really something. And this movie proves my point. Such a good and cute film.",
    "date": "2024-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It’s a pretty average animated family movie overall.",
    "date": "2024-06-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "this movie was pretty cool",
    "date": "2024-05-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Such a positive story, well worth a watch.",
    "date": "2024-04-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Una película sobre una polémica cuesta como comedia y algo segura para los niños la verdad lo disfruté",
    "date": "2024-03-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Though the story at times feels \"How does it get there ?, how do they know that?\" and all, the voice performance and the animations made me enjoy, especially Lupe and Ferd.",
    "date": "2024-02-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "buena película con personajes bien desarrollados y sirve como critica al torneo. Solo ridiculizado por escenas donde forzadamente tienen que bailar porque parece que piensan que sin ese tipo de escenas que no funcionan los niños no se van a entretener en la Sala del cine.",
    "date": "2024-02-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Quiero más animadas como esta",
    "date": "2024-01-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fun for the whole family. Just old fashioned good fun for the kids, they love it.  I wish the new movies were like this",
    "date": "2023-12-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This animated movie was great. John Cena, Kate McKinnon, Bobby Cannavale, Anthony Anderson, Gina Rodriguez, Peyton Manning, David Tennant, and the rest of the cast did a great job in this movie. The story of the movie was entertaining and dramatic. It's about fighting for what you really want to do rather than what you're expected to do. If you haven't seen this movie yet, check it out sometime. It's a great movie for an entire family.",
    "date": "2023-10-25"
  }
]