[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The chemistry between Enola and Tewksbury was amazing",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Filme incrível, amei, continuação muito bem feita nota 10(minha opinião)",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 2 hours and 9 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated PG-13 for Bloody Images and Some Violence!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Funny and enjoyable! Great story fun and entertaining.",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Bem, é inegável que a obra é inferior a sua antecessora (Enola Holmes 1), mas possui seu valor. Os personagens do antigo filme foram, sim, desenvolvidos de forma razoável, além de trazer um bom enredo ambientado no na década de 30 no sufrágio feminino . Porém, eis o motivo de não conceder 5 estrelas à obra. Em minha opinião não houve maior mudança na protagonista, o universo dela não se expandiu, ela ainda é soluciona casos de modo muito repetitivo e tem a mesma maturidade do filme anterior, não evoluindo, ela é, fundamentalmente, a mesma Enola, imóvel no tempo. Entretanto como eu disse, o filme ainda é bom.",
    "date": "2025-06-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Not as good as the first.",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The boy/man she likes is stunning and charming I recomend to watch the 1 film before the 2",
    "date": "2025-05-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "BRILL-I-ANT \nTHE BEST!",
    "date": "2025-04-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It was cute, once again; if you enjoyed the first intallment then by all means kill 2 hours here.",
    "date": "2025-04-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I really liked the movie, especially for making reference to the struggles of the English workers of the period. It mixes romance, adventure and comedy in the right measure. The personal development of each character, comparing them, for example, to the first movie, all matured in a certain way. The plost twist of this incredibly interesting and extraordinary movie, when you start the movie, you would never imagine what would happen at the end.",
    "date": "2025-03-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Enola Holmes 2 builds on the charm and wit of the first film, offering a more mature and exciting mystery for Enola to solve. Millie Bobby Brown continues to shine in the lead role, balancing her character’s cleverness, independence, and vulnerability with ease. The dynamic between her and Henry Cavill’s Sherlock is even more engaging, and the new mystery brings more depth and suspense. While it may follow some familiar tropes, the film’s fast pace, strong performances, and empowering message make it a highly enjoyable sequel.",
    "date": "2025-02-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "What can I say? They made me laugh and enjoy myself just as much as I did during the first one.",
    "date": "2025-02-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "For me it was better than 1st movie",
    "date": "2025-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I immediately went for Dash-2 after watching the first iteration. Millie Bobby Brown is such a great actor - - a delight. This was well-written and beautifully acted and appointed. Plus Henry Cavill as the hot frosting on a solid theatrical cake...yummmm... If you enjoy period dramas, you will love this fun and lighthearted version!",
    "date": "2024-12-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This movie is not for me. I do not care for 4th wall breaking protagonists. Unless it is especially funny or charming, a 4th wall break simply takes me out of the story and ruins my emersion. I also don't care for movies that begin with action in the middle of the movie, only to freeze frame and cut back to the real beginning of the story. Unless the return to that scene gets completely recontextualized on the repeat, it just seems like a lazy way to start off with a hook.\n\nI likewise don't like it when the reveal of the story is obvious. I don't like it when the criminal behind it is introduced in such a way that they are clearly the culprit. I would say that this is a good mystery for real little kids, but the movie rocks a PG-13 rating, so the children that would be fooled are not watching the movie.\n\nI don't like it when supposedly smart characters make such stupid decisions when it comes to things that should be common sense. For example, the way the main character acts a crime scene. I don't like when characters I'm supposed to be rooting for are more unlikable than the villains. I don't like when a movie feels like it is preaching to me, they are a bit on the nose with how poorly women were treated back in those days. It communicates a fine message, but they hammer it in a little too much.\n\nSo yes, there is a LOT that I don't like in this movie. But on the positive side, the mystery isn't overly convoluted. One action leads to the next quite well. The movie doesn't waste too much of the audience's time, it is well paced. I like most of the main characters, it is just some of the side characters that get on my nerves. Cavil and Brown have good chemistry together and have more screen time together than the previous. And the final reveal isn't utter nonsense.\n\nI guess I am just a big fan of the Sherlock Holmes character, and am very particular about his portrayal. This one isn't awful, but if you're looking for a definitive Holmes mystery adventure, then this is just a red herring.",
    "date": "2024-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A superior sequel to the first film, Enola Holmes 2 builds upon its predecessor's strengths and improves upon its shortcomings with a more compelling story, additional screen time for Henry Cavill's Sherlock without hogging the spotlight from the titular character, a more memorable villain and better blending of mystery, humour and suspense making for a fun Netflix adventure that's sure to leave you looking forward to a third film once Millie Bobby Brown finishes Stranger Things 5.",
    "date": "2024-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is fantastic. Enjoyed this more than the first one",
    "date": "2024-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Enjoyed this more than the first one",
    "date": "2024-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I wish I could give this movie a six out of five!!! \nIt is my new favourite movie:)",
    "date": "2024-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Non si può certo dire che il film sia sgradevole o mal riuscito; semplicemente va ad accantonare l'idea del giallo ritmato alla ricerca di indizi per dare ampio spazio all'azione.\nLa trama entra troppo presto nel vivo, dopo un minuscolo preludio e la sceneggiatura ha una struttura troppo simile al primo film; due casi separati seguiti dai fratelli che si uniscono per un finale in sintonia a suon di sparatorie e combattimenti.\nMa ciò che più infastidisce è l'ennesimo stupido tentativo di politically correct in cui il famigerato James Moriarty diventa una donna di colore di mezza età.\nNon c'è senso e non c'è nemmeno una spiegazione; fatto assolutamente ridicolo.",
    "date": "2024-08-06"
  }
]