[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "DNF.  Written more like a play.",
    "date": "2025-09-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This would of course work better on stage. I confess ignorance to the fact it started life as an August Wilson play. Once you realise this is the play then it's best to just go with it, enjoy the language and the rich character acting. Viola is a revelation.",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "1 hour and 34 minutes based on a true story!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated R for Language, Brief Violence and Some Sexual Content!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "An affectionate tribute it might be, but it lacks any real depth to the story being told. It might have been better if there were greater depth to the key characters. Sorrow, worry, and injustice come through just enough, but it feels light on the tale of who Ma Rainey actually was",
    "date": "2025-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A filmed play. Since most of my own films are adaptations of my own plays, \"filmed play\" isn't always an insult. But \"Ma Rainey\" was kind of talky and a little tedious. I did enjoy Mr. Boseman's performance, but I knew almost from the start that he was going to die during the film. The character who wants to stretch beyond his expected place in these sorts of stories always gets stopped somehow (kind of predictable). Nicely acted, and good music.",
    "date": "2025-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "WOW! I started this movie not expecting anything. It's a short movie with a lot of power, and the acting is INCREDIBLE!",
    "date": "2024-12-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "One of those humid, sweltering summer days where the atmosphere boils over into anger and embittered rage. The music is good, the plot is taut and tense and it makes for a good story. Has all the hallmarks of a stage play rather than a film and that’s ultimately why it is good but not great. Watched on Netflix.",
    "date": "2024-12-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "2 incredible leads bring this simple film with a simple story propelling forward with great drama.",
    "date": "2024-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "空有戏剧的文本而无戏剧的形式美，想表达的内容塞得过满以至于丧失了影像的意蕴。",
    "date": "2024-06-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Fueled by an impeccable, energetic performance from Boseman and an ever powerful Davis, Ma Rainey's Black Bottom is a moving (and slightly disturbing) drama. The scope of this movie is so extensive that it doesn't quite fit into the limited setting of a single recording session. Even so, it keenly explores racism and how African-Americans simultaneously revolutionized and were marginalized by the music industry of the early Twentieth Century.",
    "date": "2023-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Fantastic cast and performance.",
    "date": "2023-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Very good movie led by Davis and Boseman! If you like the more theatrical style, it's perfect for you.",
    "date": "2023-04-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "It dragged a bit, but I did not care. The acting, shot composition, soundtrack, and flawless historical accuracy VASTLY made up for it. 95/100.",
    "date": "2023-04-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "George C. Wolfe brings one fateful afternoon to the screen in this Oscar-winning drama. Adapted from the Pulitzer Prize-winning play, 'Ma Rainey's Black Bottom' tells the story of a humid afternoon in 1920s Chicago. The film marks Chadwick Boseman's final on-screen performance before his death in August 2020. 'Ma Rainey's Black Bottom' features sensational performances from its entire cast that consists of the likes of Viola Davis, Chadwick Boseman and Glynn Turman.\n\nWhen the backing singers for the esteemed blues singer Ma Rainey (Viola Davis) arrive at a Chicago recording studio, they share stories and ideas as they wait for her to arrive. When Ma Rainey finally arrives, tensions rise as equipment failures, harrowing stories and conceited trumpeters disrupt their recording. But when the recording ends, what happens next will change the course of everyone's lives forever.\n\nViola Davis gives a sensational performance in the titular role, portraying the so-called 'mother of the blues'. Her Oscar nomination for leading actress takes her total amount of Academy Award nominations to a record-breaking four. Chadwick Boseman stars opposite Davis as the hubristic trumpet player Levee Green. Boseman's performance is emotionally raw and full of overconfidence. Colman Domingo, Glynn Turman and Michael Potts all give great performances throughout the 94 minutes.\n\nThe costumes in the film are gorgeous and incredibly detailed, so it's no surprise Ann Roth received an array of accolades for her part in making the film. The hair and makeup department do a sensational job with every character's look; the attention to detail is remarkable. When it comes to Viola Davis' wig, Ann Roth and Mia Neal, for accuracy and authenticity, decided to hand-make Ma Rainey's wig from horsehair.\n\nEven though the characters looked incredible, 'Ma Rainey's Black Bottom' can't help but drag itself to its closing credits. The fact it was all predominantly contained in two rooms didn't help either. Not even the magnificent talent heading the film can save it from becoming a mundane near-waste of time. Considering the film is about the mother of blues and her band, viewers will be surprised to learn that 90% of the film is just rage-fuelled monologues or over the top reactions - there's hardly any singing.\n\nHowever, the film does bring up issues that relate to when the film is set. Themes like racism and the LGBTQ+ community as Taylour Paige plays Ma Rainey's younger lover Dussie Mae. It shows how Ma Rainey and other BIPOC were used simply because of their talent and the profit they could provide people. At the end of the film, it's addressed when Levee's original song is sung and recorded by a group of white men instead of Levee himself.\n\nIf you want to learn more about women who don't give in to a racist, sexist patriarchy, then you should be watching 'Selena'. But if you're enamoured by Viola Davis' talent, then you should watch 'Fences' or 'The Help. Both of these films allow Davis to show off her never-ending talents. 'Fences' also stars producer Denzel Washington opposite Davis.\n\nIn conclusion, George C. Wolfe's adaptation of the August Wilson play is a mixed bag. While the performances and appearances may be spectacular, the story can't help but feel stodgy and slow.",
    "date": "2023-02-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The make or break of the movie was the cast and there all fantastic with Chadwick Boseman as the highlight, allowing it to be a fantastic watch.",
    "date": "2022-12-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A stellar film that takes place during one of Ma Rainy's most troublesome recordings, the music is wonderful, the production is great and the late Chadwick Boseman proves what a true talent he was, serving as a triumphant final performance.",
    "date": "2022-12-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The best acting performance from Chadwick Boseman! With the best movie costumes ever designed!",
    "date": "2022-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The movie is basically a day in the life of this band where everything goes wrong.  The first & only part of this movie that caught my attention { Spoiler } is when the old guy got stabbed & that's what, 10 minutes before the movie ends.  This movie feels short even though it's almost 2 hours long, It's good if you just want to pass the time but that's it.",
    "date": "2022-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "An example of how a real little masterpiece can be shot with a modest budget is this year's Oscar nominee George Wolf's movie with Viola Davis and Chadwick Boseman. Everything is there, from the choice of an always current topic, through masterful directing, to extraordinary acting.\n\nUnfortunately, the film is at least about Ma Rainey's music, as the title might interpret. But who cares about music, can watch \"The United States vs. Billie Holiday\" from February this year, which, on the other hand, has nothing else to offer but an interesting interpretation of songs and decent acting by Andra Day. Lady Day as the \"leader of the civil movement\"? No, thanks.\n\n\"Ma Rainey's...\" is a brilliant film that will be remembered primarily by the bitter story, which you have to see instead of being told, but also by the extraordinary acting of Viola Davis, as well as the fact that this is the last role of Chadwick Boseman, who, unlike the role in the greatly overestimated \"Black Panther\" from 2018, shows all his lavish acting talent here.\n\nAn interesting note is that in the original play, Levee never breaks down the closed door in the rehearsal space.",
    "date": "2022-09-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "August Wilson wrote a play set in every decade of the 20th century, ten in all. This one covers the Twenties. I watched the recent film version (2020), which captures the drama and the detailed make-up of each character well. I recommend it.",
    "date": "2022-06-19"
  }
]