[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A best animation film that kids should start believing in heroes that inspire us",
    "date": "2025-06-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "1 hour and 32 minutes of funny animation movie plots. Rated PG for Action/Violence, and Brief Thematic Material!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-05-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Aunque sea algo obvia, tiene suficiente acción, guión dramático y el encanto de China",
    "date": "2025-03-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "We watched it as a family and we had to ban it from the house for a year!\nWe will probably never watch it again, the art is pretty cool though but the storyline goes nowhere.",
    "date": "2025-01-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Honestly. this movie needs more credit then its due, cause I was watching this and was loving the artwork, the art style  everything about it.\n\nThe story behind it was a guy that only wanted to feel bigger than he actually was, along with his funny wittiness.\n\nTruly was amazing to watch. That's my own loving opinion!",
    "date": "2025-01-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is an awful adaptation of those folk tales. A raucous soundtrack, weirdly distorted, overly intense graphics, and a somewhat cruelly distorted story lens takes away from that heroic tale. To my viewpoint there is little to empathize with in this story.",
    "date": "2024-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The animation style isn't the worst yet isn't the best.\nIt's very fast paced, sometimes it's funny, but it's mostly just childish. \nThey used metal music which is.... Well... Somewhat okay?\nThere isn't almost a single minute where he isn't fighting.\nIt's full of cliches. \nIt's very colorful. It's silly and goofy. \nIt was actually a somewhat good movie until it reached the climax. \nOverall. I liked it. I'll watch it again someday. And I'm looking forward to giving the next movie a try.",
    "date": "2024-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It was goofy I like that a lot. Was it perfect? No, absolutely not. But was silly goofy and I will defenitely watch it again sometime.",
    "date": "2024-06-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The plot was way to quick",
    "date": "2024-04-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Colorful and imaginative with an abundance of energy, but with no moral message and an annoying lead character, it comes across as silly and childish.  The good mix of animation styles and quick pacing can't hide the shallow, nonsensical plot and inconsistent ideas.  The musical number towards the end was good, but the choice to use ‘metal' music was bizarre and overall, I found it tiring rather than enjoyable.",
    "date": "2024-03-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It was actually okay until the climax",
    "date": "2024-02-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Monke. Good movie overall",
    "date": "2023-12-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The final lesson is so deep. \nOh.",
    "date": "2023-12-31"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Ni para verla en familia la recomiendo, está aburrida y predecible.",
    "date": "2023-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "interesting and creative",
    "date": "2023-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I find atleast comical that this movie took inspiration of the lion king logo for his own.. (more evident on the brazilian portuguese version of the logo)\nyeah, not even even close bud",
    "date": "2023-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Fun, funny, fast-paced and a laugh for the whole family. Kinda like a prequel to the whole Journey to the West story.",
    "date": "2023-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The Monkey is sometimes funny, sometimes bland and almost always weird in both good and bad ways.",
    "date": "2023-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "One of its strong points is that it avoids copying what has been seen before, taking Chinese mythology as a reference model; what this movie lacked is a little more oomph. And modesty, like the main character.",
    "date": "2023-10-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The Monkey King was an odd character - abandoned but then grows up to be full of himself and his little staff. My understanding is that the original story has a monkey king that needs a lot of character development - but this movie didn't have it.",
    "date": "2023-09-24"
  }
]