[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "5 out of 10 the plot has to much going on the villian is meh cringey illumination animation to clean overall meh just to make money",
    "date": "2025-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I think Illumination tried too hard. It feels like some scenes are AI. Sorry, but its true.",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This movie is the weakest of the franchise but still enjoyable. Let's start with the positives: This movie is a good conclusion to the franchise and quite entertaining and fun to watch. Gru and Lucy now have a baby which I enjoyed the idea of it and find it adorable. The villain Maxime le Mal is the weakest of the franchise but I liked his design and great voice acting of Will Ferrell. He was reasonably intimidating but not as much as the previous entries in the franchise. The minions getting upgrades to mega minions feels a bit forced. But it was fun and entertaining to watch and they were still a bit funny. The ending scene of the movie is also great conclusion and I enjoyed seeing the cameos of all other villains in previous movies. The negatives: honesty I feel like the character Poppy Prescott feels forced and wasn't really worth it. But I'll give credit for her annoying but good voice acting. The main villain Maxime le Mal has weak motivations and backstory for being evil and didn't really make sense. It also feels like a rush conclusion and the pacing is off. Overall this movie was a good conclusion to this franchise and I recommended it if peoples wants to be entertained and have fun for 1 hour and 30 minutes. Don't have high expectations tho.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Now I’m not 100% sure when I watched this movie it was like 1 or 2 weeks ago but this movie was alright, it really wasn’t anything special it introduced Grus baby and the mega minions but the whole mega minions thing was kinda basic like most of the mega minions was like the fantastic four and the whole cockroach villian was just stupid and it was like how dr Connor’s in the amazing Spider-Man was trying to turn everyone into lizards the cockroach was trying to turn everyone into cockroach’s. The movie was also pretty slow so it go boring quick. But the start the movie scene was when gru is driving and double life is playing that was so aura.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Despicable Me 4 is not the best Despicable Me movie. What it is though is a funny, although sometimes cringeworthy, entertaining animated spy comedy. Also, the mega minions are absolutely hilarious",
    "date": "2025-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I feel like the point of mega minions meant nothing in this movie and was like a set up for minions movie.  The plot was a little scattered but overall a good movie.",
    "date": "2025-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I didn't feel like Despicable Me 4 felt like a Despicable Me film at all. It was more like a 'suburban dad and cowardly me' film. Gru and his family have to go undercover in the suburbs, so say bye bye to his fancy gadgets. He can't even stop a teenager from blackmailing him, and has to run away from 'Cockroach Man'. While the animation is great (the best of the franchise), as are the songs, the film just doesn't have the same tone as the previous ones in the franchise. Plus, the Minions have really started getting annoying. Though Margo does look cute in a baseball cap; I can say that. Not something I'd recommend.",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It was fun but could have been better.",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The movie lacked a story, the events were all random and desperately tried to be funny by adding more random events. The whole story was focused to nothing and nothing really happened. Was the script made by ai because if humans came up with this, its truly even more disappointing.",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Mid nothing that funny but a little fun but you could fall asleep",
    "date": "2025-10-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Not so bad, not so good",
    "date": "2025-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "this movie was not needed. it was roughly an hour too long and most of it was filler nonsense that didn't fit with the overarching plot",
    "date": "2025-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is genuinely one of the worst movies I have ever seen. The first one was iconic. The second was fun but excellently written.  The third was goofy and retro. The 4th is just, terrible.",
    "date": "2025-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Heres the thing- every despicable me movie so far is solidly great, and this one is no different, but it is also maybe my least favorite of the franchise so far. I actually saw this movie almost every single day in theaters for the month of july while it was out as a dare to myself, so im pretty intimately familiar with the film. My one big qualm is the baby- we dont need that baby, and frankly i wouldnt mind if they just forgot to add him into the next film. The entire series is thematically largely about gru building his sense of home and building a found family and his heart growing bigger. In the first film he loves all the girls so much that he takes on fatherhood for them, something that seemed very antithetical to his disposition at the beginning of the film. In the second film he falls in love and meets his wife. In the third film he meets his long lost twin brother- all of these things fit in with this idea of him building upon his internal sense of home while also being his typical gru self. A baby feels like a shiny placating sentiment that tries to add to that theme but in reality does nothing, he already has the girls, and in a way it almost feels like it detracts from his beautiful found family that the writers really needed to insert him having his own biological baby too? Its just such an unnecessary detail in the franchise and takes away air time from him interacting with the girls, which has always been the emotional meat of these movies- the big departure in this film from the rest of the franchise is that theyre not  actually building upon that theme anymore really (even though they are also kinda trying to with the baby), but instead just having a solid side adventure. And thats great, as long as it still has the great world it lives in and animation, all the great characters, heartfelt moments and the love thats put into these films, they dont have to try to keep building on that theme so literally or directly with every new movie. I almost wish they really took a risk and had a film that wasnt so focused on taking down another bad guy as the central plot, and i do think they need to remind people of how actually emotionally moving and compelling this franchise can be a bit more than they did with this film- it sorta feels like a fluff film in the despicable me catalogue- but at the same time a fluff film in the despicable me catalogue is still far greater than most other film franchises at their best. I wholeheartedly look forward to despicable me 5.",
    "date": "2025-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Worst one, if they stuck to only ONE of their like 4 B-Plots, it would be fine",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was a great movie, is it my favourite dispicable me movie??? No but it still had a great story line, the kids loved it. This was my son’s first 3D movie experience and he was so excited! Great movie over all!!",
    "date": "2025-09-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Film carino ma niente di più anche perché è un film già visto",
    "date": "2025-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "this is by far the worst movie in the despicable me franchise. the whole time I was waiting, hoping, that maybe it will get better. but it never does. I was extremely optimistic going into this film. I love Will Ferrell and I loved Despicable Me 3 and though that movie has a couple flaws I found the jokes genuinely hilarious and I would argue DM3 it is the perfect \"family movie\" the jokes were well written and there's enough to keep adults and kids entertained. DESPICABLE ME 4 however is the complete opposite. the jokes were terrible, the minions are so boring and not at all funny I don't understand why anybody finds them remotely entertaining. Will Ferrell\"s character is underwhelming and the accent is so dumb. there's about a million side stories happening in the film none of which are good, and every new character introduced is boring . this movie was a massive disappointment and some of the worst writing ive ever seen in an animated movie. this would only mildly entertain a 4 yr old and is definitely not a family movie.",
    "date": "2025-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was perfect, perfect everything down to the last details.",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I grew up with these movies and have always loved them. I thought this movie was decent but it lacks more than the other films",
    "date": "2025-08-30"
  }
]