[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A fun action movie as long as you ignore it being an adaptation.",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Wow, Sony somehow made a movie worse than Foodfight, I am surprised.\nThe story never worked, the characters are just bland and stupid and over the script is lazy. It's awful by The Emoji Movie standards. Who invented this movie. One of my least favourite movies. Don't watch this movie at all.",
    "date": "2025-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Loved it! 9/10 for me!",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Never played the original games but I enjoyed it",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "1 star is being too generous\nas a fan of the games I dint even knew what i was watching.\nfirst of the movie Doesn’t adapt one single game. Instead, it takes set pieces (like the cargo plane scene from Uncharted 3) and treasure themes (pirate gold from Uncharted 4), then stitches them into a new “first adventure” story, and they add drama to make the movie interested like the Crush Nathan have for Chloe, and the way that Sam died not respecting the source material. The game is full of puzzles and mysteries and shooting, after all its not Nate that's after this treasure, but the movie doesn't even respect that. the personalities also have changed from the characters with made me love the series in the first place",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Another movie that proves critics are most of the times right. This is an entertaining movie to watch but it's full of writing flaws, a lot of lazy writing, the main characters always find a way out, the story is not very solid. It gets very expectable and boring at times. I wouldn't rewatch it",
    "date": "2025-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Are u reading these to convince urself to watch it? Or that is near good? Go eat some spicy beans and ice cream, go to the toilet and watch what u just left behind instead",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I loved Tom Holland’s acting, but this is a bad movie. It might not even be his fault. Whoever wrote this movie did bad. The CGI is good, the acting is good, it’s just that it is so incredibly boring and hard to follow. I tried to watch it multiple different times and it was so boring it’s like my brain forgot it every time. It’s honestly that bad. Sorry was really hoping it would be good:(",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I can't take anymore of this awful conveyor belt american modern rubbish. Its as though american studios and actors don't care, they just throw enough mud at the wall and hope some of it will stick. Just like the Marvel franchise, churning the same utter mediocre stuff.",
    "date": "2025-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "5 star movie. No notes. Great action, fun story, great cast. An enjoyable popcorn flick.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Modern day Indiana Jones. Love Tom Holland and Mark Whalberg",
    "date": "2025-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The movie has a few good parts but they go WAY overboard on fighting sequences.the movie gets worse as it goes along. The acting isn’t bad but the fighting sequences make parts hard to watch.",
    "date": "2025-08-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Story is good enough. Tom Holland crushes here, but man oh man was the Mark Wahlberg casting a horrid decision. He doesn't fit the character and distorts the viewing of every scene he's in. L",
    "date": "2025-08-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Beyond bad. I hope this post saves someone 2 hours of their life they can't take back",
    "date": "2025-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I’ve played the games multiple times and I have to go with 5 stars. Don’t always listen to critics give it a chance.  It’s along the lines of national treasure. Cheesy at times lots of action and adventure.  I love when they include actual history in these types of movies.",
    "date": "2025-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Total ripoff of Indiana Jones.",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I love Uncharted the video game series but I’m not a big tom holland fan and idk about Mark Wahlberg as Sully, but I fell asleep so I can’t say much about the movie.",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Rank. Feels like it was written by an early version of microsoft's copilot",
    "date": "2025-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "My wife loves the uncharted games so we wanted it.🤷🏻‍♂️",
    "date": "2025-07-17"
  }
]