[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1 hour and 50 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Really no reason for the kidnapping and anything w the fights if she’s at the end gonna mess around w another man. Then acts like the VICTIM when she cheated?!!! Only reason they add the another  man is because they needed more sexual scenes.",
    "date": "2025-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "quem foi o retardado que faz essa continuaçãodo pior filme do mundo",
    "date": "2025-03-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The final film in the \"365 Days\" trilogy ends on a disappointing note, repeating the same flaws as its predecessors while adding little to the narrative. The plot lacks cohesion, and the conflicts, which should lead to an impactful climax, are poorly developed and hastily resolved.\n\nThe characters remain one-dimensional, with unconvincing interactions and increasingly forced chemistry. Attempts to include dramatic and emotional moments fall flat, relying on superficial dialogue and predictable scenes.\n\nDespite some beautiful locations and a pleasant soundtrack, the film fails to provide a satisfying conclusion to the story. The trilogy's finale reflects its overall approach: style over substance.",
    "date": "2024-12-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Well - it has a purpose if you are looking for lots of steamy scenes to play in your head late at night when you are um.. buzzing away.. some cool scenery was captured, and the cars were cool. Lots of infantilizing of the main female character including fits and pouting. And the immediate flip from married and in love to less than 24 hours grinding with an unknown gardener slash surfer aka undercover mafioso enemy.",
    "date": "2024-12-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "If I were in the mood to watch adult content, Netflix would definitely not be my first choice. The movie I stumbled upon was a total disaster, making me extremely uncomfortable, especially when children unexpectedly walked into the room. It was a messy experience that I strongly advise against.\n\n\"365 Days\" seems to be all about sex and trying to engage the audience solely on that basis. The sequel follows the same pattern, and both films are filled with excessive plot holes, acting issues, and seem to lack a meaningful storyline. It feels like they are veering towards the wrong direction, almost resembling pornography rather than a film with substance.\n\nDespite being somewhat enjoyable, these movies left me questioning why they were even made. I only watched the sequel because I had seen the first one and felt compelled to review both at the same time, even though I found them both to be quite terrible.",
    "date": "2024-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "There were a total of 26 songs, 11 sex scenes and 2h of constaint pain. I can't figure out how to give this a 0 star rating, so half a star will have to do. Please, if you value your brain, don't watch this movie.",
    "date": "2024-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "incoherent, the word that defines this \"film\", is literally a hate letter to cinema.",
    "date": "2023-12-28"
  }
]