[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Bad but a lot of action",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I was hoping to enjoy this movie, but it shows Victoria Vance’s meaningless backstory about blaming others for calling her a mad scientist, which her actions prove them right. Because real scientists are responsibly serious with strict safety laws, and she clearly doesn’t. Plus, she plans to crash meteors into Adventure City, then admits as she is a mad scientist, as she meant for innocent lives to suffer revengefully, making her seem completely irredeemable and psychotic. This concerns for the film too intense for younger kids especially preschoolers could've had nightmares about it, otherwise that should have banned \"Paw Patrol: The Mighty Movie\" for good.",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Paw Patrol: The Mighty Movie (2023) is a fantastic canine superhero adventure, with great humor, interesting characters, and good direction. Here we follow the dashing Paw Patrol with extraordinary super powers.",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The film was a bit jumpy with its plots. The new villain has a very weird way of introducing herself. I overall enjoyed the film as it’s wholesome and great for a family movie night, with young kids.",
    "date": "2025-09-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Once again, a really good adaptation from the show! But you know, a few problems too. One problem I have is that the villain isn’t a good one. I don’t mean like she’s such a cruel villain, I mean why she’s a villain. In the movie, she says everyone was calling her a mad scientist, which she is, but she says that she is a scientist, but she’s not mad. That’s not what a mad scientist is. She has crazy inventions that mad scientists create, because they’re crazy. I also was disappointed that Liberty didn’t get a power, but it was quite entertaining to see her coach the Jr. Paw Patrol pups who were in the program. I hope the third one is still good, but maybe not a downgrade.",
    "date": "2025-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This movie is not as good as the first Paw Patrol Movie, but still something worth seeing. The animation is mind boggling. But I can’t say I’m impressed by the sequel.",
    "date": "2025-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is the best!",
    "date": "2025-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "GOOD AND SKY IS RELATABLE AND FUN\n10/10 FILM",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Surprisingly these movies are actually really good! And the animation is great!",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best animated kids movie ever! So cute, family friendly and action packed!",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie is horrible.",
    "date": "2025-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great for my little ones! Fun story.",
    "date": "2025-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Excludes half of its audience. The programme is aimed at an audience that includes young children (eg my 4yr old has been an avid fan for a year). It's simple, it doesn't overload them, and its emotional scale is accessible by all, including the littlest ones. By contrast, the movie's emotional intensity (not helped by the music) is so high that it almost reaches MCU levels. Fine for the older members of its audience... but much too much for little ones.\nAlso, the premise is ridiculous. Throughout the series, Skye has been the one pup who can jump higher, dance better, and is generally more dextrous and physically capable than all the other pups. And she has the best vehicle (because it can fly). Most episodes could be solved by Skye. That's fine. She's the 'nippy pilot' of the team. But to then base the whole movie's premise on her always struggling because of being small is not only disingenuous but laughable. From there, it veers into silliness as Skye repeatedly lets down her teammates in search of personal validation... and ultimately gets rewarded for it.\nSo essentially, it's the 'Super Skye, make-your-kids-cry' movie.",
    "date": "2025-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "LOL, 01 hour, 27 minutes, and 43 seconds of humor!!!!!!!!!!!!!!!!!!!!!! Rated PG for Mild Action/Peril!!!!!!!!!!!!!!!!!!!!! The USA grossed over $65,100,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The animation is nice and the film overall is a pretty nice watch. A third film is scheduled for July 31st, 2026.",
    "date": "2025-03-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Epic movie, Epic action, Epic characters, still wondering how a 10 year old got a aircraft carrier.",
    "date": "2025-03-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "No job’s to big, no pup’s to small in Paw Patrol: The Mighty Movie, which continues to be one of the surprise franchises of the 2020s.",
    "date": "2025-02-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This paw patrol mighty movie was the best movie ever and I super duper loved this movie.",
    "date": "2025-02-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I fell asleep in the half of the movie, I watched the movie to dare myself 💀",
    "date": "2025-01-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "LOL!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2024-12-29"
  }
]