[
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A few parts that majority would call scary, but nothing extraordinary. The story drags.",
    "date": "2025-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "If you've seen \"The Autopsy of Jane Doe\" with Emile Hirsch and liked it, then give this a view. Both movies have similar vibes. I enjoyed both movies.",
    "date": "2025-03-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "another generic exorcism movie",
    "date": "2025-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Claro, aquí tienes la versión ajustada:\n\nIt's an entertaining movie and doesn't make the big mistake of lasting two and a half hours to tell a story that could easily be explained in 90 minutes. As a horror film, it's a complete failure, but as easy-to-digest entertainment to watch with a partner, it's recommendable.",
    "date": "2025-02-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best The Possession of Hannah Grace Comedy Horror Thriller Comedy & Mystery Comedy Funny Parody Wrestling Movie Love True Blood Like It Awkward. Teen Wolf 5 out of 5💯⭐⭐⭐⭐⭐",
    "date": "2024-12-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Some bits were a bit over the top, but that's to be expected in a possession horror.  The atmosphere of isolation combined with the jump scares nicely.  I always try to wait til the end of the run and go first thing on a Sunday, so I get the theater as near to myself as possible; this movie made me regret that decision. Not the best, sure, but in no way the worst.",
    "date": "2024-12-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I can comfortably say that The Possession of Hannah Grace is one of the worst horror movies I’ve seen in a long time—it's not even in the same league as Thankskilling 3. The plot is painfully simple, and at times, the CGI is hard to watch. With such a straightforward storyline, I found myself bored, as only the last 20 minutes of the film truly deliver any horror, which feels like a stretch. The acting is the best part, especially from the main cast, but the film fails to handle the subject of PTSD realistically, overly dramatizing it in a way that doesn’t resonate. I wouldn't recommend wasting your time on this one.",
    "date": "2024-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I enjoyed it. It was a unique angle on a possession story. I liked the atmospheric slow build. They could have done more with the environment but I wasn't too upset. Honestly the lack of chemistry/energy between the characters was the biggest drawback.",
    "date": "2024-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Fairly decent movie, simple plot, well acted, the cinematography was excellent. Some of the CGI was less than desired, but overall, a little better than some of the the usual demonic possession type films out there.",
    "date": "2024-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "“The Possession of Hannah Grace” ist ein US-amerikanischer Horrorfilm von Regisseur Diederik Van Rooijen. … Als eine Polizistin aus der Entzugsklinik entlassen wird, arbeitet sie in einem Leichenschauhaus. Dort passiert eine Reihe von schrecklichen Dingen. Diese Dinge kommen von einer schrecklichen Leiche … Ein anständiger Gruselfilm, der jedoch sehr unoriginell ist. Stellen Sie sich vor, der Lazarus-Effekt trifft auf The Autopsy Of Jane Doe. …",
    "date": "2024-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Well acted, lighting and cinematography were good, but it’s a slow build to no where that leaves you rolling your eyes at the all to obvious underlying themes. It deals with PTSD, addiction, and personal growth in a way that feels like being beaten with a baseball bat covered in foam…. A slow, torturous slog.",
    "date": "2024-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Such a linear story which left nothing to the imagination.  Don't bother.",
    "date": "2024-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Admittedly this is pretty unoriginal but I actually enjoyed it because it has a great tone and atmosphere. It reminded me of The Exorcism of Emily Rose (2005) but it’s a much more entertaining film. There are some great set-pieces. It’s a well-made production. The acting is good. The characters are a bit dull and forgettable. So it’s not memorable or bad. I really don’t have much to say but it’s a good forgettable horror.",
    "date": "2024-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Just a slow build up to nothing. Alot of repetitiveness. Relying on the 'body-horror' genre, without actually doing a good job. Great lighting and cinematography, generic actors. But overall, not worth the watch.",
    "date": "2024-04-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Having just watched this film, I'm too frightened to go to sleep. Can't believe how low this film has scored. It was a creepy tense horror, brilliant effects, good suspense, well acted, and the morgue setting is exceptional. In fact, i can't recall a better horror setting for a sense of isolation and dread since the overlook hotel.  Who needs complex characters in a horror anyway. Go watch remains if the day if you need that.",
    "date": "2024-04-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I have to be honest; after people on social media hyping me up for this movie I was so excited to finally watch it. Now that I have, I do feel quite underwhelmed. This feels as though ChatGPT was asked to create a script for a horror movie featuring the possession of a young girl. Although there are a few scary scenes, the storyline in itself, especially the climax of the plot, left a lot to wish for. So, while this movie was not terrible, I will probably not be watching it again.",
    "date": "2023-12-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "In a word: blah. I thought it started off pretty great. You had this struggling main character, in a cold, dark and grey environment, surrounded by dead people and stuck with a demon. And then it starts to get a bit...frantic? Scrambled? Like the movie was running out of time, and tried to rush stuff Started off promising, but ultimately came out an unsatisfying product.",
    "date": "2023-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very creepy! I dont know why its rated so low here.",
    "date": "2023-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "In essence, Hannah Grace will be one of the lower-ranked films among possession-themed movies. Although it excels in technical aspects and acting, its failure to establish a solid content framework prevents it from being a memorable production. In a horror film, fear must be appropriately present, and Hannah Grace fails to achieve this satisfactorily. You can try it when seeking foreign horror films in the cinema, but I advise against having high expectations.",
    "date": "2023-06-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Peppered with clichés, predictable jump-scares and horror elements, no depth in story and characters. No logical, comprehensible exchange of the individual characters. Desperate attempt to scare the viewer. Please skip this film.",
    "date": "2023-05-20"
  }
]