[
  {
    "user": "Imogen Sara Smith",
    "rating": null,
    "text": "The loss and displacement attending the promise of progress could hardly be more potently conveyed, yet Caught by the Tides, with its digressive and observational style, never feels heavy-handed or polemical.",
    "date": null
  },
  {
    "user": "Ryan Swen",
    "rating": null,
    "text": "Much of Caught by the Tides‘s extraordinary achievement rests in the way in which it manages to question every single scene that appears on screen, even as they frequently register with a grand jubilation.",
    "date": null
  },
  {
    "user": "Hoai-Tran Bui",
    "rating": null,
    "text": "It may be one of the most ambitious, immersive cinematic achievements released in this century.",
    "date": null
  },
  {
    "user": "Jay Liu",
    "rating": null,
    "text": "Interesting on a metatextual level, even if only on that level.",
    "date": null
  },
  {
    "user": "Brogan Luke Bouwhuis",
    "rating": null,
    "text": "It’s impossible to ignore the extent to which 'Caught by the Tides' is a success, and subsequently just how remarkable of a creative accomplishment this is for Zhangke.",
    "date": null
  },
  {
    "user": "Maxance Vincent",
    "rating": null,
    "text": "It’s through Zhao Tao's sullen, devastating looks that pierce the artifice of cinema and touch us so profoundly that we’re ultimately moved by this daring proposition from one of China’s greatest formalists, caught in the tides of the past and present.",
    "date": null
  },
  {
    "user": "Ray Pride",
    "rating": null,
    "text": "Marvelous catch-all... of... fiction/nonfiction/lyrical dream-drift... The kaleidoscopic dazzle of “Caught By The Tides” is heightened by Jia’s partner in life and art Zhao Tao, who remains one of the world’s greatest movie presences... Breaks the heart.",
    "date": null
  },
  {
    "user": "Mariona Borrull",
    "rating": null,
    "text": "[Caught by the Tides is] an act of love for its actors, but also for a China that was building its own history and was never just a backdrop. [Full review in Spanish]",
    "date": null
  },
  {
    "user": "Luis Martínez",
    "rating": null,
    "text": "The Korean director offers a new example of cinema that is transparent, subtle, identical to itself on the outside and torrential on the inside. [Full review in Spanish]",
    "date": null
  },
  {
    "user": "Javier Ocaña",
    "rating": null,
    "text": "Caught by the Tides is a desolate and beautiful reflection on what remains when everything changes. [Full review in Spanish]",
    "date": null
  },
  {
    "user": "Paula Arantzazu Ruiz",
    "rating": null,
    "text": "Jia Zhangke at his finest. In other words, a great movie. [Full review in Spanish]",
    "date": null
  },
  {
    "user": "Tim Grierson",
    "rating": null,
    "text": "Drawing from nearly 25 years of footage, including images from his most acclaimed films, Jia has crafted a poignant new story with an assist from fragments of old tales.",
    "date": null
  },
  {
    "user": "Robert Denerstein",
    "rating": null,
    "text": "Although I didn't grasp every detail in director Jia Zhang-ke's Caught By the Tides,...the gist of the movie is clear enough to make it worth exercising the patience Jia’s movie demands.",
    "date": null
  },
  {
    "user": "Michael J. Casey",
    "rating": null,
    "text": "\"Caught by the Tides\" is a bit too much of a good thing. It’s inscrutable at times, accessible in others. If you’ve seen other Jia movies, then there will be moments that feel familiar, but that’s not really the point.",
    "date": null
  },
  {
    "user": "Stephanie Zacharek",
    "rating": null,
    "text": "This is a quietly brilliant film, one that blends a personal story, about two young people trying to make their mark, with a more global one, about a country that, a little more than 20 years ago, began changing drastically by the minute.",
    "date": null
  },
  {
    "user": "Robert Ham",
    "rating": null,
    "text": "The real attraction is the huge canvas that the filmmaker uses to tell this story.",
    "date": null
  },
  {
    "user": "Michael Nordine",
    "rating": null,
    "text": "The power of some moments needs no context.",
    "date": null
  },
  {
    "user": "Joshua Polanski",
    "rating": null,
    "text": "[Jia Zhangke's] newest released film, Caught by the Tides, is the apotheosis of his life’s work and one of the most profound and emotional wrestlings with one’s own artistic catalogue ever released.",
    "date": null
  },
  {
    "user": "Steve Erickson",
    "rating": null,
    "text": "Caught by the Tides eludes the narcissistic congratulation found in self-referential cinema because it absorbs Jia’s early work to create something that has the shock of the new, as much as it builds on the past.",
    "date": null
  },
  {
    "user": "Lisa Laman",
    "rating": null,
    "text": "Tides constantly reflects through visually and narratively emphasizing the vulnerability of ordinary souls like Qiao Qiao. Such images are full of fascinating aching pain, as are the unseen and unspoken parts of the film’s primary relationship.",
    "date": null
  }
]