[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A brave dog, \"Indy\" (as himself) fights to protect the one he loves most Shane Jensen as \"Todd\" in \"Good Boy\".\nIt’s a unique horror movie from the perspective and point of view of a dog.\nAlso starring Larry Fessenden as \"Grandpa\" and Arielle Friedman as \"Todd’s\" sister \"Vera\" and more straight out of central casting.\n\nHowever, this film is not about the human actors.\nIn fact, you barely see their faces in a \"Toy Story\" style.\nThis is not an animation or a child friendly flick.\n\n\"Good Boy\" is suspenseful, dark and haunting.\n\nDespite the supernatural horror you’ve got to admire this feature film directorial debut of Ben Leonberg and his sense of humour for naming his production company \"What’s Wrong With Your Dog\".\n\nTheres nothing wrong with \"Indy\", but it’s long been studied that dogs have a sixth sense about danger.\n\nTheres a few genuine jump scares in the short 72 minute runtime that took 400 days to shoot, but you are working with the directors own dog and he is a better actor than half of Hollywood. \n\nIt’s a very different experience to your normal run of the mill horror movie and it really ramps up in the third act for our protagonist.\n\nFun fact: \"Indy\" is a Nova Scotia Duck Tolling Retriever who will play fetch with you till your arms fall off.\n\nWatch out for: ancient carvings on the basement staircase.\n\nSaying goodbye to my little man \"Henry\" in May this year brought the story even closer to home.\nI remember him always seeing things around our home that us humans failed to although we’ve felt and even heard strange things.\nYou'll fall in love with \"Indy\" and want to give him an Oscar!\n\nStreaming on Shudder through Prime.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Good Boy was honestly way better than I expected. It kept me hooked the whole time, and the mix of tension and weirdness made it really fun to watch. I enjoyed it a lot—definitely worth checking out!",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Boring flick. Was waiting for the dog to bark at some scary demon ghost or anything terrifying that was haunting the house. Never happened. Skip it.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A Horror film from a dog's pov is a unique concept and they mostly pulled it off! The dog Indy is fantastic, it's emotional yet unsettling at times. Could've had a little more to the story but overall it's runtime was just right for this kind of film.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Give the damn dog an Oscar.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I think this is good flick. Although I can't help thinking that making this movie could have kind of traumatized the dog. Dogs only know reality. They don't act. They do what they are told. I get the feeling that Indy got a lot of mixed messages making this film. Anyway, it was interesting since it was from Indy's perspective.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Although I can easily see why those looking for a real horror story gives this 1 star.  After much analysis I think this was an extraordinary look into the mind of a dog as it relates to his master and his ultimate demise.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Absolutely loved it! I was engaged from beginning to end! Very creative and refreshingly different. Indy deserves an oscar!",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "So unbelievably bad. Save your time seriously this is not worth it at all.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "“Good Boy” manages to acheive something extraordinary: a well-executed, ultra-low-budget haunted house movie with an actual living, breathing dog as the protagonist.\nThe story covers some well-trodden horror/suspense ground and the human performances are somewhat hampered by a clunky script.\nHowever, the utterly believable performance of Indy the dog give is the backbone of this movie. One of the best dog performances I have ever seen put to film. You will find yourself wanting to reach into the screen and hug him. He is, in every possible way, a Good Boy.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Another misleading trailer. Definitely not a Horror, but sold as one. Indy the dog is great, but that 73 minutes felt like a week. Hard pass.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie is terrible. I couldn't make heads or tails of it. First there's a monster, then there isn't. Then there's a whole bunch of shadows, then there isn't. Nothing made sense. My son felt the same way. One good thing was how the dog was looking back at the right time and all that, but ridiculous, mixed-up story.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The boy was merely Ok, not really good. There's not much there besides excellent cinematography and dog handler. The story is thin gruel at best. I kept hoping for more but it just wasn't there.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Boring and uninteresting. This was 1 hr and 13 minutes wasted. Precious time I cannot get back.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best horror film of 2025. Absolutely heart wrenching and incredibly tense. I don't think a horror film has ever made me shed tears before",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "First time writing a review. I really really loved this movie.. I cried a lot. Will never watch again because my heart can’t take it. Scary and heartfelt.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "THE worst movie since the Grudge. IDK HOW.... you guys have this a 90%. You guys had to be high on dope. Wasted 70 grand EVER in a movie.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Indy the Dog has shown better and more raw acting than every millennial and gen z actor ever. No unbearable undeserved ego or cringe. \n\nThese bone heads could actually learn from Indy. \nThe film has some pretty creepy moments. There are a couple good and genuinely frightening jump scares. \n\nIt's also a very sad film. How the dog is dealing with its owner's suffering was a bit of a tear jerker. Wasn't expecting much depth from this film. It is worth a watch.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This an unusual movie in that the story is told from the dogs perspective, and Indy does a great job. SPOILER ALERT!!!! The one thing that is missing from the other reviews that I saw is that it is a terribly sad movie, particularly if you have lost someone to cancer. Unfortunately, I have lost several. It really hits home. Indy is so expressive and intelligent, and wants so much to understand it all and to help. Just heartbreaking.  I wanted to take the good boy home and comfort him! A very lovable main character.",
    "date": "2025-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I really wanted to like Good Boy more, but as a horror fan, the movie fell flat in delivering any scares. However, the innovative concept, clever camera work, and apparent effort in creating the dog's POV without relying on CGI are commendable feats that deserve recognition.",
    "date": "2025-11-25"
  }
]