[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a fire ass movie, watched it for the second time since it dropped, thuso killed her role, Viola was amazing as always, siyabonga",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Mostly based on a true story of the African kingdom of Dahomey and the royal guard consistent on all female warriors. Real good story with twists and turns. Also good battle scenes 🍿🍿🍿🍿/5 on Hulu",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "10/10\nBased on true events\nViola Davis\nEducational\nGood for the culture\nBlack female empowerment",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Minha gente, o tanto que eu chorei com esse filme, não tá no roteiro. Simplesmente incrível. Retrataram bem o sofrimentos dos povos que eram escravizados. E também das mulheres guerreiras",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Only in hollywood would they celebrate a warrior that thrived on the enslavement of thousands africans. Show how critics loved the violence without knowing the history",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "To say the writers of this movie took liberties with the facts is the understatement of the century. The main character in this was a leading figure in maintaining the African slave trade. Slavery was the main product of her nation. It was the British navy who began dismantling the slave trade and the African characters lauded in this movie actually opposed them.",
    "date": "2025-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "A truly dreadful film that is a lie from start to finish.\n\nFilm making does not get worse than this, as does the truly appalling liberties taken with history.\nThe whole film is an example of politics replacing truth.",
    "date": "2025-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I'm really shocked, this film has such immense weight, they knew how to choose the actors for the work so impeccably, you get attached to the characters so easily, I highly recommend it, and always remember NEVER DISOBEY ISOGIE!",
    "date": "2025-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I hate when movies obsfigute the meaning of words.",
    "date": "2025-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This film may be an ode to the origins of the Black community and/or to strong women for some. But unfortunately, it piles cliché upon cliché, with weak and worn-out dialogue, simplistic characters and story structure. All of this is drenched in a sauce of semi-heroism and a kind of Disney-esque music in the background. A complete waste of time.",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Amazing movie! Kept me entertained",
    "date": "2025-08-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent. Slow at first, but worth it!",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie purposefully, intentionally, glosses over and lamp shades how horrible the Dahomey Amazons were. The film memtions some of that hideous history...briefly...but it does not tell you what the Dahomey did after (go back to their old slave trade ways after the palm oil thing did'nt work out). Furthermore, it GREATLY exaggerates their tactile effectiveness against anything but sleeping, unarmed, tribes in the dead of night. Even worse is, it demonizes surrounding tribes. Tribes who by no means were perfect or even morally equitable to our modern standards, but they were far more complex than the cartoonish villians portrayed in this film. The cast is talented but utterly wasted on the film. Ultimently this film is about as bad as \"God's & Generals\" when it comes to romanticizing an aweful group of slavers. Research the history, don't waste time watching this film. Far more entertaining and no amount of Bot-Reviews can change that.",
    "date": "2025-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The story of these lesser known amazons was so well presented. Action, emotion, acting, cinematography, music...each aspect was well presented. Great performances by all the actors. This is one of the best movies of the year for me, next to Top Gun Maverick of course. This is a highly recommended flick to watch. Don't miss it.",
    "date": "2025-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The Woman King is a rousing battle cry for freedom, womanhood, and resistance — a film with deeper layers of meaning than its surface might suggest.",
    "date": "2025-06-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "2.25 hours of success!!!!!!!!! Rated PG-13 for Partial Nudity, Brief Language, Sequences of Strong Violence, Some Disturbing Material and Thematic Content.",
    "date": "2025-05-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I know this is supposed to be a Viola Davis spectrum but I've got to be honest here. Thuso Mbedu and Lashana Lynch. Stole the show. The trailer makes you feel that this film is all Viola taking the stage to be this elite warrior that breaths the life of Annalise Keating into this late 1800's African Warrior but the real truth is that Thuso sold this film from opening  credit to closing. This review is no shade toward Viola but I've got to give credit where credit is due. This film has an incredible story line with a twist. Definitely recommend this as a great way to remind us all of the tyranny the African Slave's has to endure during the treacherous times of the European colonizers ravaged tribe after tribe. 4.1/5",
    "date": "2025-05-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I understood the ratings, but, I didn’t understand “king” like tagline besides her crowning. Not African enough.",
    "date": "2025-05-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I enjoyed this movie, raw, action-packed, great cinematography. Yes, kept me on the edge of my seat. Kudos",
    "date": "2025-04-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I wish I could give this movie 10 stars. Best movie that I’ve ever seen!",
    "date": "2025-04-25"
  }
]