[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Another bloated Netflix doc. Could have been 10 minutes. How boring.",
    "date": "2025-07-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Badly researched poorly produced propaganda piece. Jealous and envy is not a good character trait and this show embodies it. I only watch as I use to shop at A&F between 2004-2014. Best avoided.",
    "date": "2023-08-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Boring doc that struggled to fill its runtime.",
    "date": "2023-06-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This is the perfect documentary for every 90’s high school kid that chose to be awkward and then hate everyone else for it.",
    "date": "2023-01-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It's yet more fodder for the identitarian outrage mob which, in its never-ending quest to find something about which to be offended, is now picking at the carcass of a mall retailer that's been irrelevant for the better part of two decades.",
    "date": "2022-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "'White Hot: The Rise & Fall of Abercrombie & Fitch' is an interesting documentary which has recently dropped onto Netflix. \n\nSYNOPSIS: 'Abercrombie and Fitch conquered malls in the late '90s and early '00s with gorgeous models, pulsing dance beats and a fierce scent. But their \"all-American\" image shattered as exclusionary marketing and hiring practices came to light.' \n\nIn reality only people with a serious interest in the recent history of Abercrombie & Fitch or fashion itself will really get the most out of this. And therefore it was very lost on me.\n\nHowever, there is something interesting here as it's lively in it's delivery with a great soundtrack and fun graphics.\n\nQuirky.\n\n6/10",
    "date": "2022-05-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "An interesting look into something I knew extremely little about.",
    "date": "2022-05-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A not particularly interesting story poorly told. The journalists that contribute would mostly seem to have failed in their careers. One in particular sounds like she probably filled large percentages  of her reviews with \"like\". Dreadful use of music. Too much of the creators voice. An attempt at strong messaging that reaches wet fart pitch.",
    "date": "2022-05-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "it was just race baiting. no substance.",
    "date": "2022-05-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The title says it all: this is about the rise and fall of mall retailer Abercrombie & Fitch, with a particular focus on their apogee in the 1990s. After that it was lawsuits and scandal, all just desserts for their effortfully built exclusive image. This documentary skillfully interweaves insiders and outsiders to tell the story of the clothing chain.",
    "date": "2022-05-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Entertaining and at times informative, though the heavy use of cartooning and graphics seem flippant rather than satirical. Its not unlike a cringey comedy that overbalances a little too far one way.",
    "date": "2022-05-04"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Probably the worst Netflix doc flim I've ever seen.",
    "date": "2022-05-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Welcome to a typical WOKE wins in the end, the virtuous. I never knew a thing about what happened to Abercrombe. We can't live, walk, take a breath without fear of insulting someone. As for Samantha Elauf, we (USA) shouldn't have to assimilate to your culture. I wouldn't go to Iran, and expect the same. You got your attention and fame, now move along. Though I rarely went, I miss the old Abercrombe.",
    "date": "2022-04-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I don't know if the superficial fashion company Ambercrombie & Fitch deserves a better expose but a superficial documentary now on Netflix feels like a nostalgia trip that trades in too many glancing, annoying generalities. White Hot: The Rise & Fall of Ambercrombie & Fitch feels like an extended segment from one of those old I Love the 90s specials that used to dominate VH1 where a group of talking heads chatted nostalgically about whatever pop culture bon mot of the past that deserved reverence or being forgotten. I think there could be a story here too. Ambercrombie's success was built upon two men, both of them gay, creating a brand image basically around the kind of man they found most alluring and attractive: WASPy, muscular, young, and their idea of what it meant to be American (a.k.a. white frat boys). One of those men was closeted and mercurial, and the other was a prominent photographer who was also a predator, but both of these men were responsible for a largely heterosexual cultural landscape accepting their vision and wanting to match their personal preferences. There's also a story about their wantonly discriminatory hiring practices, keeping minorities in the back or with overnight shifts, wanting to maintain their CEO's image of people in stores, including hiring people based upon attraction (i.e. thin and white) and not even whether they could be a functional employee. However, director Alison Klayman, no stranger to documentaries that feel rushed and uninformative (Jagged, The Brink, Take Your Pills), would rather speed through an armada of interview talking heads for clipped sound bytes and vague explanations for what made Ambercrombie so popular and then stopped being so (\"It was really cool... and then I guess it wasn't\"). The doc completely misses relevant subjects like the online shopping revolution, the decline of malls and mall culture, or anything of actual meaningful cultural contribution beyond the rise of social media. According to the movie, because of social media, more people have voices, I guess just forgetting there was an Internet beforehand. It is strange, by today's standards, for a large fashion company to be willfully uninterested in its brand being more inclusive. By the end, the documentary even seems to sell a redemption story, so it doesn't go far enough in its condemnation because that would get in the way of its nostalgia trip and would actually push the interview subjects to confront more of their own actions or inaction. Alas, White Hot is yesterday's news without any lasting appeal or insight.\n\nNate's Grade: C",
    "date": "2022-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I was a white teenager in the late 80s and early 90s, but I never went to Abercrombie & Fitch.  Beyond a black Member's Only jacket that followed me from the eighth grade through the tenth, I never wore labels – inside or out.  I was more into self-expression, creating my own words, wearing my own ensemble (usually a pair of old jeans and a Star Wars T-shirt) and never worrying about being trendy.  I was part of the mall culture but my destinations were usually the book store, the computer store or the music store.  The Gap, Chess King, Merry-Go-Round, Abercrombie & Fitch?  They were all the same to me.  And too expensive for my blood.\n\nYet, I have to admit that whatever was going on over at Abercrombie & Fitch seemed interesting.  I can remember passing by the place one night in the late 90s, there were strobe lights flashing and smoke from a fog machine was billowing out the door.  There were no windows so you had to go inside to see what was happening.  As I learn from the new Netflix documentary White Hot: The Rise & Fall of Abercrombie & Fitch, this was part of the design.  It was meant to create an heir of mystery and intrigue.  What was happening in there?  \n\nWhat was happening in there might have seemed perfectly suited to to the times – an exclusionary business model that all but blatantly said that it was marketing clothes aim exclusively at the most beautiful white people with perfect bodies, and the documentary emphasizes the most troubling issues with creating that kind of brand.  It was only after the turn of the millennium that several employees and former employees began to publicly cry foul by calling out that the company, headed by CEO Mike Jeffries, not only pressed their ads toward beautiful white people but deliberately set hiring practices that kept beautiful white employees up front for the peak shifts and minorities in the back room working night shifts – if they weren't fired for how they looked.\n\nBut director Alison Klayman does a good job of balancing the story of Abercrombie & Fitch by slipping into the story of why the company was so toxic inside but so intoxicating outside.  How did it draw in customers?  What set it apart?  Through interviews with cultural critics, activists former executives and models we are taken into the world of the consumer who saw the appealing ads, the music, the cologne smell, the fog machine, the strobe lights.  It looked like a place both fascinating and forbidden, far from the blandness of a store with clothes on a rack.  One almost expected to be served champagne just for walking through the door.\n\nBut its enticing façade outside was matched by it's ugly interior that the consumer might have missed.  An African-American women remembers being permanently banished to the night shifts and complaining that all she did was clean windows.  She was told \"But you're a good window washer.\"  Asian-American employees remember having to work in the stockroom away from the customers, and that the only representation for Asians was a T-Shirt sold in the store with a racist logo on the front eluding the old stereotype of a Chinese laundry.  The company's excuse was that they really thought that Asians would be flattered.\n\nThe aggravation began to grow and it became a public issue in the form of protests, boycotts and bad press.  It didn't help when Jefferies began making unwise public statements about \"Fat chicks\" in response to the complaint that A&F blatantly tried to keep plus-sized people from wearing their product.  This bad press began to work its way into the culture in the form of \"MAD TV' sketches, SNL jokes, and at least one mention of the fact that Flash Thompson in 2002's \"Spider-Man\" tries to beat up Peter Parker while wearing clothes from Abercrombie & Fitch.  \n\n \nOf course, the idea of an image-focused company is not exclusive to A&F.  You could probably find fault in almost any clothing retailer for not being rather thoughtless and exclusive about their brand.  But Klayman wants to make it clear that this was the house upon which A&F was built, that it was deliberately building a brand marketed at beautiful young white people and the rest could just go to Walmart.  \"Discrimination was not just a blip,\" activist Benjamin O'Keefe says, \"They rooted themselves in discrimination at every single level.\"",
    "date": "2022-04-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The first racist comment hits within five minutes. That's when you know what it's really going to be about -- racist individuals expressing their repulsion for modern day white people. Hooray... no thanks.",
    "date": "2022-04-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "It was interesting to watch but many points like the last girl insisting on wearing a hat due to her religion is just silly. You choose your religion, if you have choosen one which contradicts with office culture like no hat policy it is your problem not mine. Private company can hire anyone they want to, they say they were not hired because of their race did not aline with the sell strategy of the company now you get hire because of your race, so it is still based on race but now you winning as you get a quote to be in a company regardless your ability to perform your duties, America is just sick. \n\nWill we ever see a documentary about how urban brands who focuse only on people of color not targeting white population? Many brands have a niche and target specific age, ethnicity, body type etc. Why was it wrong for this company to do when others can? If the brand is not targeting you and you still want to shop there you can, but don't be asked to be hired. I mean I would not go working for a sport company as I am not practicing sport and I am not fit, I will go to other place where my appearance will win over more clientel it is so logical.",
    "date": "2022-04-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "A biased documentary about a bad company that they weren't the target audience for anyway. Focused mainly on the shirtless boys for a certain target audience and completely forgot the females that were used and targeted at as well. Not good on covering all the aspects that A&F did over the years. The people who made this made it out like A&F was the only place that sold clothes and because of their \"exclusivity\" and they had to wear potato sacks. Could have been a great documentary on a very unique business setting but they were mad because they weren't the cool kids and not the audience of a clothing store.",
    "date": "2022-04-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Awful documentary with 30mins focusing on the same concept of how the brand is so famous. The main focus of this documentary is exploiting physical beauty and discrimination basely on looks. It lacks substance and it doesn't give enough credit as to why they're doing it in the first place.",
    "date": "2022-04-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Knowing what was going on with Abercrombie and fitch's employment and business model almost makes it worth having to sit through videos and pictures of shirtless white guys.",
    "date": "2022-04-24"
  }
]