[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I really enjoyed this film. The storyline is not your usual rom/com, and yes, it has a stronger sense of loss through the female lead (Chopra). That is what I enjoyed about this movie though. It really draws you into the pain Mira feels and what true love feel like, while providing the predictable sense of hope that you can go on and love…again.",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Anything else goes out of the window when it makes you feel good.",
    "date": "2025-07-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Love Again (2023) is a very interesting romance film to watch, the cast's performances are quite decent, only the script gets a little lost.",
    "date": "2025-05-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Just the greatest singer to me Celion dion thank you xx also the fantastic cast,  crew the film was amazing made me laugh,  cry just brilliant thank you xx",
    "date": "2025-03-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Were the naysayers expecting some Dr. Zhivago style epic or something? Mate, it's a feelgood, fluffy, sweet, old-fashioned romance. Admit you enjoyed it and move on.",
    "date": "2025-02-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Sweet & predictable.",
    "date": "2025-02-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Like Celine Dion but not a fan . really enjoyed this movie .I Will definitely recommend and Celine looks beautiful.feel good movie !",
    "date": "2025-02-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "honestly a really poor Love story, Jonas is not suited to this American romance story. So many other younger beautiful actresses could have been used for this role but no... it was all about what £ the celebrity will bring to the market... This will NOT be a classic, a terrible watch.",
    "date": "2025-02-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "OUtlander fanatic here...but this WAS SO BAD...a few places it was sweet but...the early set up where you just know- they will end up together came right at beginning. Sam H. who I adore played the character very shallow...never settled inot the role. \nAnd Priyanka....I've never seen her previously in anything, she was ok.\nBUT TOGETHER...they had like MINUS 0 chemistry. \nThat was the huge problem no chemistry at ALL.\n\nThe writing was poor, and I agree the Celine D. character-well she's not an actress so her delivery was PAINFUL... and why oh why would the man lie and not tell her...hey I mentioned you to Celine and she \"loves your work....\" like get the gratitude INSTEAD IT'S ANOTHER LIE HE'S TELLING. \nJUST AWFUL.",
    "date": "2025-02-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "So bad. Unbelievable story, poorly structured, really awful and contrived script, lazy direction…bad main leads…solid supporting female cast. Céline Dion was better than most in this…it’s a bad vehicle for her music though, just such a bad film.",
    "date": "2025-02-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The idea is interesting and, although it vaguely resembles \"P.S.: I Love You\", it has its touches of originality. I loved the presence of Queen Celine Dion, but the jokes about the songs and the \"therapy\" sessions with her seemed quite forced. They weren't necessary. I think it had the right touch of drama to keep the film light and I sympathized with the protagonists. I had fun and didn't have any grudges against anyone, so it's worth it!",
    "date": "2025-01-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Finally got around to watching *Love Again* after a year on my watchlist. Honestly, the only reason I was interested was Celine Dion, and she did not disappoint! Her songs fit perfectly, and she acts surprisingly well—she’s more than just a cameo, which was such a fun surprise. The plot? Cheesy and cliché, but isn’t that what we’re here for in a romcom like this? It’s cozy, lighthearted, and gave me a few chuckles. \n\nThat said, it’s definitely not groundbreaking. The pacing drags a bit in places, and with sharper writing and editing, it could’ve been so much better. Still, I was never bored, and it’s a decent pick when you’re in the mood for something romantic but not too demanding. Definitely a “background movie” vibe, but hey, sometimes that’s all you need. A solid 3-star watch for a cozy night in!",
    "date": "2024-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This film is your regular romcom which you had watched many times even without watching it. But the screenplay is very engaging which makes the film watchable and the performances are also good. Not expected much but it will not disappoint you either. A one time watch for romcom fans.",
    "date": "2024-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Well, this movie is tailor made for emotional teary audience who literally believe in the power beyond when it comes to love. Priyanka Chopra as usual tries very hard to deliver but to no avail. Her character just comes off as silly and bland and the audience rarely connects with the character over the course of the movie. The comedy is just cringey. The one good aspect of the movie is Celine Dion, even with her limited screen presence she gives some meaning to the movie especially her songs.",
    "date": "2024-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved Sam and Priya in this movie and seeing Celine was fantastic! Hearing her music has inspired me to get out all her CD’s😁",
    "date": "2024-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The critics are clueless as usual. In their own world without a thought as to what audiences appreciate. \n I wasn't sure if the  plot  could make the payoff believable but they did it just right. All the actors were great. Including Celine. \nI need to see what other movies these actors have made and this director/writer have written.",
    "date": "2024-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Que filme lindo, baseado no livro de 2009 e filme de 2016 (que não encontrei disponível), mas a execução melosa e crescente, o suficiente para nos encantar, emocionar e apaixonar, a pitada de fé, com Céline Dion, sendo ela mesma e vivendo sua própria dor da perda, (viuva após o casamento de 21 anos com seu empresário 26 anos mais velho) e um recomeço para ela, me encantei por Priyanka Chopra Jonas (linda miss mundo 2000 e mais famosa atriz indiana), tudo muito gostosinho e romântico...",
    "date": "2024-08-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I tried twice to watch this movie. Wondered why I did not finish it the first time. Now I know, it was not very good. Just proves that \"star power\" does not make a good movie. Silly screen play, jumped all over the place and really had no point. Yes they tried to do a Hallmark movie, but it was not even a good rom-com. Sorry friends, my opinion.",
    "date": "2024-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The minute I started watching I was annoyed at the  fact that there is an ensemble cast of British actors to put on fake American accent!",
    "date": "2024-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "\"Love Again\" is a theatrical release that feels more like a streaming service movie, with its lackluster storytelling and underdeveloped characters. Priyanka delivers a solid performance, but the film falls short in creating meaningful connections between the characters, especially the main character and her deceased boyfriend.\n\nThe concept of the phones being in someone else's name and the subsequent texting adds a touch of intrigue, but the execution lacks depth. The predictable and drawn-out love story fails to deliver the excitement that could have elevated the plot.\n\nCeline Dion's appearance as herself in the film adds a layer of authenticity, with many of her lines reflecting her real-life experiences with Renee. However, her portrayal comes across as cold and self-absorbed, casting her in an unfavorable light. This portrayal may alienate viewers who are not die-hard fans of Celine Dion, painting her as the villain rather than a relatable protagonist.\n\nOverall, \"Love Again\" falls short of expectations and fails to leave a lasting impression. With its unengaging plot and unlikable characters, it is not a film worth revisiting or recommending. This lackluster production earns a disappointing half-star rating.",
    "date": "2024-07-08"
  }
]