[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "If your a big fan of the original Little Nemo I'll save you the disappointment its noting like it. The characters are named the same but literally everything is different about them and not in a good way. Great actors horrible characters. Wish they would have stuck to more of the original but we got this unfortunately. If your not a fan or had no idea there was an original Im sure you will like it or your kids will. Just not Little Nemo fans",
    "date": "2025-09-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Don't worry that the critics don't get this movie; the audience does - 85% popcorn rating!\nThis is a beautiful film that has great ideas and actors. It kept my family entranced up to the end.\nGive it a go; I won't spoil the plot, and I hope you enjoy it as much as we did!",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Hermosa película. Una historia que toca el duelo de forma tierna e inocente, con una muy buena enseñanza final, relatada de forma divertida y con un ritmo atrapante. Visualmente cumple a pesar de ser streaming.",
    "date": "2025-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Slumberland features Jason Momoa in a well-played role and Marlow Barkley with her sweet character. The visuals are impressive, but the storyline is predictable.",
    "date": "2025-05-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie is fun and whimsical. My kids love it. Great for family movie night!",
    "date": "2025-04-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie exceeded my expectations. The story is simple yet deeply touching. There’s something so powerful in its simplicity - the way it blends adventure with raw emotion, making you feel both the excitement of the journey and the weight of her longing. It doesn’t try to overcomplicate things, and that’s exactly what makes it so special.\n\nAnd the effects? Waw! Absolutely stunning. The dreamscapes are mesmerizing, from the moment they sail across surreal oceans to the breathtaking rescue scene. It’s all CGI and green screen, yet it feels so real, so immersive. I won’t name names, but some massive blockbusters with sky-high budgets don’t even come close to this level of craftsmanship. Every detail is fine-tuned - even something as small as the piglet’s tiny hairs shifting when he twitches his ear. That kind of attention to detail is rare, and it shows just how much love and effort went into this film.\n\nHonestly, Slumberland delivers some of the best visual effects I’ve ever seen.",
    "date": "2025-03-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "That crap was a fever dream. Plot was confusing af.",
    "date": "2025-03-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It would have been nice for a movie where the main character was based on the creator's son for the main character to actually be a boy. Is that too much to ask when are boys going to get an imaginative outlet. Also why is lip a big muscular Samoan He's supposed to be a short bald cigar smoking clown. They completely missed any nostalgia",
    "date": "2024-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Entertaining in a TVA from Loki sort of way. Would have been more special with a bigger budget to get famous cameos for the different dreamers.",
    "date": "2024-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The use of dreams to deal with grief is not original, but it is workinv really well in slumbeland.\n\nEventhough its quite predictable, i liked it a lot.\n\nThe cinematography is gorgeous and speaks of a whimsical childlike sense of wonder and fantasy.",
    "date": "2024-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent movie very deep and profound even though it leaves room for children!",
    "date": "2024-04-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Pretty good movie. Jason Momoa rocked in his roll. It is a little on the childish side, but it is a kids movie. Gives similar vibes to BFG",
    "date": "2024-03-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A little silly themed, changing from dreamworld to reality. Didn't really know where the film was going. One of them in which once you've seen it, you probably wouldn't watch again.",
    "date": "2024-03-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Charming film. Give it a go.",
    "date": "2024-02-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Kind of baisic writing. Honestly everything was basic, interesting premise, but executed poorly.",
    "date": "2024-01-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Such a beautiful, magnificent, magical movie.. loved it !",
    "date": "2024-01-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "What a wonderful, visually rich, and delightful tale! Jason Momoa, Chris O'Dowd, and Kyle Chandler are wonderful in this story dealing with loss, and finding your inner strength, and holding on to your inner child! Marlow Barkley is delightful and a joy! This movie hits all the right notes and brought us all to tears!",
    "date": "2024-01-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Was not expecting to like this movie this much. Any role where Jason Mamoa can just have free reigns to do what he has to do is something I will always drop my remote and see. Plus the chemistry he has with the protagonist here is outstanding. Besides them 2 and the Uncle, no other character really has much depth, but the movie is entertaining enough and it looks great for its budget. Although nothing will really blow you away here, it’s a nice and cozy film you can watch with the kids also.",
    "date": "2024-01-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Was not expecting to like this movie this much. Any role where Jason Mamoa can just have free reigns to do what he has to do is something I will always drop my remote and see. Plus the chemistry he has with the protagonist here is outstanding. Besides them 2 and the Uncle, no other character really has much depth, but the movie is entertaining enough and it looks great for its budget. Although nothing will really blow you away here, it's a nice and cozy film you can watch with the kids also.",
    "date": "2024-01-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved this movie so much! Watched it with my kids and we were laughing and crying. Definitely a family movie night kind of film.",
    "date": "2023-12-31"
  }
]