[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Huge recommendation from my daughter to watch. Not terrible but I found the style it was shot in a little distracting but it was a good story.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "We need a sequel! This was great!",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I have a headache, but it was brilliant.",
    "date": "2025-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Unlikeable characters and story   Waste of my time",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It's What's Inside (2024)\nGreat Storyline, Annoying Beginning, Reasonable Development, Messy Ending\n(12,015 – 25 Oct 2025– by Claudio Carvalho)\nWhen Reuben (Devon Terrell) schedules his wedding, he organizes a party for his college friends Shelby (Brittany O'Grady), her boyfriend Cyrus (James Morosini), Dennis (Gavin Leatherwood), Maya (Nina Bloomgarden), Nikki (Alycia Debnam-Carey) and Brooke (Reina Hardesty) in the mansion he inherited from his mother. He informs their friend Forbes (David Thompson), the Game Boy, who was expelled for bringing his young sister Beatrice (Madison Davenport) to the party. Soon Forbes arrives, bringing a suitcase with a device capable of swapping bodies. The group decides to play, but soon there is a tragedy with serious consequences. \n“It's What's Inside” (2024) is a strange movie with great storyline, annoying beginning, reasonable development and messy ending. It is impossible to the viewer to understand the story in full watching only once like I did. There are too many details and swapping, and grudges arise without previous knowledge. Maybe this idea worked in a mini-series with previous development of characters but the way it is, it is impossible to be understood after only one view. My vote is four.\nTitle (Brazil): “Identidades em Jogo” (“Identities at Stake”)\nMy Blog: https://maniacosporfilme.wordpress.com/",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "\"Coherence\" vibe but in funnier way",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This was so messy a viewer would end up immersed in figuring out what's what. It's got drama, the excitement and mystery all in it. A well written story and fabulous movie. Imaginative visual effects that was perfect for the story's mood. Great cinematography to picture the crisis amidst all fun such as the trembling lips of Shelby when she sees Nikki in her reflection. Fantasic background music. Sharp audio effects. Yes it's what's inside that matters though alot of us often forgets or denies that.",
    "date": "2025-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It wasn't a horror movie as I was expecting, it was more like a confusing sci-fi thriller. The acting and the idea was good but it could've been executed much better.",
    "date": "2025-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Old college friends meet up for a game where they switch bodies and try to guess who's who. The movie is pretty slow with some hard to watch acting but the story starts to pick up when somebody dies.",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "LOVED this. Perfect if you want a mind bending movie to watch !!",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Fun movie. Passed the time.",
    "date": "2025-10-08"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It’s What’s Inside is a stylish and inventive thriller that blends sharp character drama with a clever twist on the classic “friends with secrets” setup. What begins as casual banter soon turns into a tense, unpredictable ride that holds attention until the credits roll.\n\nThe Good\n\nThe writing smartly balances humor with suspense, creating a natural rhythm that draws you in before pulling the rug out. Direction and editing keep the energy high, while the performances feel genuine and layered—particularly the leads, who handle both the light moments and the more dramatic turns with ease.\n\nThe Not-So-Good\n\nSome of the story’s reveals feel stronger than others, and the pacing drags slightly in the middle. A bit of trimming could have made the impact even sharper.\n\nThe Verdict\n\nDespite minor stumbles, It’s What’s Inside delivers a fresh and memorable take on modern thrillers. With engaging performances and a finale that sticks with you, it earns a confident 4 out of 5 stars.",
    "date": "2025-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Tonight we watched this one.\n\n'It's What's Inside'\n\nBrief synopsis;\n\nCouple Shelby, Cyrus and their friends Reuben, Dennis, Nikki, Brooke and Maya gather at Reuben's family home for a party before Reuben's wedding. Also attending is their arranged mutual friend Forbes who they have not seen since a party at college.\n\nForbes arrives at the party, carrying a suitcase. Inside the case is a device that allows them to swap bodies with one another. He explains that he and his colleagues would use it to play a game.\n\nThis game invokes trying to guess who's in who's body and things get pretty murky.\n\nHigh school crushes. Unresolved differences ect..\n\nOne thing leads to another (ov course) and two bodies with different people in them fall to their death, while having sex....\n\nWho's body has died?\nHow can this be fixed?\n\nOverall, we enjoyed this but it had more depth in its concept than its screenplay.\nGood editing and some interesting twists.\nThee classic twist at thee end was good.\n\nWorth a look.\n\nVaughn Roxx gives this 3.5 Stars\n☆☆☆/\nSun Angel Roxx gives this 4 Stars\n☆☆☆☆\n\nTotal 7.5 Stars out ov 10.\n☆☆☆☆☆☆☆/\n\nCheck it out.\n🤙😎",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I enjoyed the idea of the film, though it seemed like it never materialized. Should have focused more on the game aspect. I also was never able to remember the characters names. Not a good thing when a film is heavily focused on the characters names.",
    "date": "2025-09-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Good movie, good script. Overall i would say, yes sure its worth the watch. Nothing too amazing though but nowadays they dont make good movies, an average one is hard to come by, this is what this is and a little more",
    "date": "2025-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved how crazy it was, kept me on the edge of my seat!",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The concept is simple but, how they build up each other's emotions, the ending of the whole game is horrible, it's amazing.",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Head twisting, but 👍🏾",
    "date": "2025-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Tough one to follow.",
    "date": "2025-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It was difficult to rate this.  It has an intriguing plot, and is well-acted, but it is sad, and has a sad ending.",
    "date": "2025-08-17"
  }
]