[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "im giving 5 stars to help offset the ridiculous bad reviews people give this. I hope nobody pays attention to the loser critics. This was an overall good movie, and a new take on the robot vs human dynamic that everyone has been thinking about for the past 20 years. It's a unique, fresh story and it deserves way better reviews. I didnt expect much going in to be honest, but I just finished it with my 10 year old son and we both enjoyed it very much.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Watched the film with my family and we all enjoyed it. The main cast were all engaging, there was humour, action and emotion. Good entertainment for a family evening film. As usual the critics are always looking for something artistic and or cerebral and not asking the question ‘is it entertaining’!",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved it!  I was struck by the fact that what it was denouncing was a part of the CGI that helped make it. Stanly Tucci was excellent as always!",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I really liked it it was fun and also had a good story line the ratings aren't accurate i loved it i liked the cast but they both looked a bit strange i would recommend it",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Most reviewers seem to fault this movie for straying from the book.  Not having read it, I can't criticize based on that.  On it's own, it's intriguing and enjoyable -- the visuals, especially the robots (inventive design and motion-capture), are excellent.  The cast is top-notch, the dialogue is sharp and humorous enough times to hold attention.  Perhaps the pace drags a bit, but I didn't notice -- I wanted to see what happened next.  And Woody Norman, the young man who plays Millie Bobby Brown's brother, is outstanding in a cast that has Stanley Tucci and Giancarlo Esposito as the bad guys, Chris Pratt and Anthony Mackie as the good, and Woody Harrelson as Mr. Peanut",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Such a great and emotional movie. Loved it so much and I’m so glad I watched it",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it! I was sceptical at the beginning but the story as a whole is fun and nostalgic. Yes, there's a lot of recycled material (mostly star wars) but it's done well and doesn't try to hide it. I will read the book as that seems to be the core of the discontent. I agree with the critiques but it is still very enjoyable, especially during the holidays. Hopeful and not too heavy. Thank you Russo brothers.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The Electric State dazzles with striking visuals, and having Chris Pratt in the cast adds a welcome spark that helps make the film more enjoyable. The robots’ personalities steal nearly every scene they’re in, and the story is surprisingly easy to follow as its world unfolds. Unfortunately, the ending lands with a thud, Millie Bobby Brown’s performance never quite clicks, and the overall execution feels a bit thin, the kind of narrative that might have worked better as a longer series with more room for character and story development. Still, despite its flaws, it’s worth a watch as long as you keep expectations in check.",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Simple and entertaining. I watch it with my son and he loves it",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved it! I didn’t realize it was Marvel, but it really moved me. It has their clichés and stuff, but in this case, I loved the effects and the atmosphere; it really captivated me.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Good film.\nI am fan of Chris Pratt.",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A ideia parece boa, mas foi o mesmo caso do filme It2: tinha uma ótima ideia de remake, mas não foi bem executada. Não digo que ele é ruim, digo que ele é exagerado em questões de utilização de CGI",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Fun movie that wasn’t Marvel’s Avengers, but a solid and entertaining watch!  I kept thinking I would have thought this was the coolest thing on Earth at 10-13!  Super soundtrack and robotic effects.  Unfairly slammed as every critic treats all movies so seriously…",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A wonderful illustrated book with enormous potential for thoughtful unsettling movie. However that opportunity has been jettisoned for a light weight popularised interpretation which pleases no one really. Shame the expectation was so much more.",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fantastic movie! I'm assuming all the bad reviews are from people who are scared of AI or the people who watch Fox News. It is basically District 9 with more comedy. Definitely worth a watch!!",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "There is a small certain kind of lazily comfort in watching this. Possibly a nostalgia? Something...its a movie to hear in the background on the weekend while cleaning or watch high or drunk at 4am....however, someone, one of the reviewers said it was marvelesque only dull and recycled....I'll go a bit further and say it reeks of Tony starks child hood inventions long locked into the catacombs of the old family estate, not even hooked up to a network but somehow controlled by ultron....or even more like old Sega or Nintendo commercials without the joy of the games to play.",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It felt like the movie was rushed into completion, as if the directors had an incredible amount to express but not enough time to fully bring their vision to life. The story had so much depth and potential that it could have easily been expanded into a trilogy or even a saga. With more time, the world and its characters could have been explored in ways that made the emotional and thematic moments hit even harder. Despite that, I truly loved the film. It’s creative, powerful, and full of heart. I just wish more movies like this would come along to capture that same kind of magic.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This movie is both creepy, cute and AWESOME!!!",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Entertainment that is clearly aimed at children (it has to be!), in an adventure that is more concerned with showing cute robots than telling a good story about the Electric State.",
    "date": "2025-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Easy, funny and smart\nNot a masterpiece but worth to watch with family and friends",
    "date": "2025-10-27"
  }
]