[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Simply terrible I'm afraid. It borrows elements from Elf and maybe even Miracle on 34th Street (without the miracle), but basically it's a creepy guy and a more normal woman with no real joy in it at all.",
    "date": "2024-12-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Kept waiting for this to turn into a horror movie. Very strange.",
    "date": "2024-12-15"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "So basically a movie where a single mother is ruining the dream of a super good guy. He is way too good for her. She s just negative for no reason. But when they are separate, she dont hesitate to ask him for her daughter ' s lundge . What a mess movie.",
    "date": "2024-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie was a surprisingly worthwhile one that made my husband and I think.  The movie concept had a deeper meaning for sure—that of reconciling different opinions or beliefs—of choosing unity instead of division….and all in the fun medium of Santa.   It was one that we wholeheartedly agree with.   For the sake of families looking for a fun film for those family members that believe—this film directly challenges all those beliefs…and then it directly challenges all the nay sayers right back.  It's kind of the premise.  Some choose to believe, and some choose not to.  It's a cute story and cute way of making us all think introspectively about our beliefs or opinions, and how we treat others that have different beliefs or opinions than ours.",
    "date": "2023-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "While obviously not a great film, it had my family and I laughing hysterically and rewatching scenes over and over again because of how ridiculous they were. \"I AM A MAN!\" was our favorite line that was probably not meant to be funny, but we were laughing so hard that we had tears in our eyes. We replayed that scene probably ten times or more. So many parts of this movie are just so silly and cringey that you can't help laughing at the absurdity of it. \n\nOn the upside, it does make you think about how illogical a lot of beliefs are from the outside (i.e. believing in Santa is like believing in God), which was an interesting point. Also, the cringe factor makes this a fun movie to laugh at and comment on throughout the whole thing. \n\nOne big thing we couldn't get over was how Tom was setting off our gaydar, especially because of how little chemistry he and the female lead had, only to discover that they are married in real life. We were floored! And then we laughed some more!\n\nOverall, we had fun watching it last year and rewatching it this year. If you don't take this movie seriously and can laugh at it/ with it and appreciate its absurdity, then this movie is for you. Also, you can't be creeped out by eyes. Trust me on that one. This movie has lots of wide-eyed staring that can be uncomfortable. But again, that just adds to the funny weirdness, if you're the kind of person who enjoys that kind of thing, which I am!",
    "date": "2023-12-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I can confirm without reservation or equivocation that this is comprehensively the worst film I have ever seen. \n\nThe lead actor and purported leading love interest is a walking ick. The writing and acting is completely horrendous, to the point where you can't tell if the lead is meant to be in love with his buddy, or the single mother he somehow started dating. \n\nOne of those films that will keep you laughing, for all the wrong reasons. Enjoy watching this to roast this complete blunder with your friends !!!",
    "date": "2023-12-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This was so terrible that I made a Rotten Tomatoes account so that I could give it a 1 and safe some poor soul an hour and a half of their life.",
    "date": "2023-12-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "your typical, cheesy xmas movie",
    "date": "2023-12-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I think all the bad reviews are from folks taking this way too seriously. If I want to watch a 5 star incredible film, obviously this is not it. If I want to zone out and watch a predictable, silly Christmas movie, this is it. It's a totally fine movie. I was entertained. The actress does have weird facial expressions but whatever, not enough to impact me. Bottom line — if youre the kind of person that's into low-drama, predictable, cheesy rom coms, you'll probably like this movie",
    "date": "2023-11-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Tive expectativas maiores sobre a produção.\nÉ um filme bom.\nRecomendável para listinha do que se assistir na semana do natal.\nMas não é de super qualidade. Há melhores.\nPorém, acontecem questões na trama que deixam sim toques de encanto do filme. Por isso dei esta pontuação.",
    "date": "2023-08-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Even from a Hallmark Christmas movie standpoint, I Believe in Santa is one of the most painful films, packed to the brim with over-acting, scary eye-makeup, laughable dialogue, and cringy characters, nearly sucking the holiday spirit out of every viewer.",
    "date": "2023-06-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Cute Christmas movie with a good theme.",
    "date": "2023-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Seems like a lot of reviewers on here are just not getting it. This movie is an inventive take on faith and belief. Santa is a lucky guy.",
    "date": "2022-12-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Watching this Netflix dud, didn't so much have me struggling to believe in the magic of Christmas per se; but more so the lame story, the mediocre acting and the fact the two main actors are a real life couple when their onscreen romance wasn't even believable, did.",
    "date": "2022-12-20"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "So bad.. I'm so sorry to say but I couldn't finish it! That never happens to me. There is no possible way that this movie is the top 3rd movie in the USA!!!???? Why is Netflix lying? Yikes.",
    "date": "2022-12-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "unfunny like no other movie. There#s not one scene that drives this lame story forward.",
    "date": "2022-12-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Netflix went full Hallmark.",
    "date": "2022-12-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I was in the mood for a sweet romantic comedy but the two leads' relationship wasn't very believable. When they kissed it looked like they didn't want to. There was no chemistry there at all. That wasn't the worst part about this movie though. I didn't like how they were making comparisons between believing in Santa Claus and believing in religion as if they were the same thing. They were making it sound like someone believing in God was just as ridiculous as an adult seriously believing in Santa Claus. The whole movie came across as a dig at religion.",
    "date": "2022-12-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A bit lame but uplifting romantic Christmas yarn with a predictable happily ever after ending that's joyously done throughout.",
    "date": "2022-12-15"
  }
]