[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This Movie Was good but not my favorite",
    "date": "2025-03-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I watched it with the 3 and 7 year old grandkids.\nWe all enjoyed it. The 7 year old liked the numerous homages to Indiana Jones movies. I liked the adult jokes.\nI thought the animation was good.\nThe story was OK.\nIt is a shame that this movie did so poorly at the box office.",
    "date": "2024-03-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved this movie! Great animation and fun to watch.",
    "date": "2023-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I got very curious about this animated movie that I never even heard of so I decided to give this movie a try for myself.\n\nBased on the graphic novels of Chickenhare. Some of the scenes of the movie including the whip almost have a similar feel to Indiana Jones but set in fantasy styled setting.\n\nThe movie looks colorful as I see fit. The details like the rain for example look absolutely decent. And most of the parts are a bit cartoony though.\n\nI really like some of the character designs in the movie. Somehow some of the characters in the movie look a bit interesting like the skunk named Meg. Although she has pros like her martial arts style and her stench she did not absolutely bring much help during the pig tribe scene. While the villains like Lapin didn't have enough reasons why.\n\nAlthough the movie has plot holes. I just really want to know how a chick and a hare can actually breed for some reason.\n\nI feel like this needed to have a sequel though. There are so many plot holes and lore to cover up.",
    "date": "2023-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "muchas conveniencias de guion y trama predecible",
    "date": "2023-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Es una película entretenida con un gran mensaje de autoaceptación y autoestima , con una animación y personajes rescatables es una película divertida a pesar de ser súper cliché y contar casi la misma historia del rey leon aunque sin la muerte de papa del protagonista a pesar de ese detalle la pase muy viéndola",
    "date": "2022-12-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Incrível! maravilhoso!",
    "date": "2022-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a very fun and wholesome adventure movie, and with a message too!\nI really hope there will be Chickenhare 2.",
    "date": "2022-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Fun fantasy cartoon. Cute, and a nice change to watch.",
    "date": "2022-07-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I enjoyed this one as I thought it was a good animated adventure story that was fun for the whole family to watch. I can certainly see a sequel to this one to continue the story",
    "date": "2022-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The movie was fun, light hearted, and full of action with good animation. I recommend at least watching the movie once to see how you like it.",
    "date": "2022-06-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's pretty funny. I liked the voice acting and the music, but the animation and the plot weren't original at all. The rabbits looked like they were copied and pasted from Zootopia. The plot was predictable, but not boring. There were some jokes that really surprised me and made me laugh. I think it would have been cool if they animated this movie in 2D, to make it reminiscent of the graphic novel. Overall, a good family movie.",
    "date": "2022-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A heartwarming story of being yourself, and accepting who you are. Cute story with a very typical plot.",
    "date": "2022-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great kids movie with great production value and a good message",
    "date": "2022-06-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Really well written music which has motifs from other adventure-based films, you get to know the characters well, there's a great message and it's entertaining",
    "date": "2022-06-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "IN A NUTSHELL:\nThis colorful animation is based on a comic book series by Chris Grine.  The story is about a brave young animal explorer who teams up with two trusty friends to find a powerful artifact before his greedy uncle can get his paws on it.  Eager to fit in and feel loved in spite of his differences, he is obsessed with adventuring in spite of his clumsiness.  The film is directed by Ben Stassen and Benjamin Mousquet.  The screenplay was written by David Collard.\n\nI have 4 sons.  One of them was obsessed with hamsters so, of course, we had plenty of hamsters over the years.  He would have really enjoyed this movie when he was a little kid.\n\nTHINGS I LIKED:\nThe animation is delightfully detailed and colorful.  And the textures of things like wood and water are so impressive.\nThe voice talents include Jordan Tartakow (Chickenhare), Joe Ochman (Abe), Danny Fehsenfeld (Lapin), Mark Irons (Piggies), and Donte Paris.\nThe design of Abe the turtle, the royal servant, is totally adorable.  I loved the entertaining touch of his constantly-changing hats.  I had pet turtles for 25 years, so I guess I'm a little biased, but Abe had most of the funny lines too.\nInspired heavily by Indiana Jones and the Raiders of the Lost Ark, there are many scenes that are almost duplicated with a respectful nod to the classic.  At one point, the turtle servant quips, \"Darn tropes!\"  ha ha  Adults will recognize some of the music inspired by other movies too.  The Easter eggs come from movies like Moana, Angry Bird, Lion King, and even Star Wars The Empire Strikes Back!\nPlenty of humor, both spoken and visual.\nThe animation design of the pig soldiers was ridiculously cute and original.\n \nTHINGS I DIDN'T LIKE:\nNot all of the voices seemed to match the characters.\nA lot of the humor is geared towards adults.  Many of the jokes, references, and vocabulary will go way over the heads of young kids.\nI was hoping the hamsters were going to be cuter and more epic.\n\nTIPS FOR PARENTS:    \n\nBullying\nAnimated violence in a bar scene and other locations\nCharacters in perilous situations\nIt's a kid's movie so, yeah, there is farting (from a skunk)\nNo profanity.  Instead, we hear words like \"darn\".\nThis movie is family-friendly for all ages.\n\nTHEMES:\nSelf-identity and finding out what makes you special\nConfidence in one's self\nCourage\nFamily\nFriendship\nWorking together\nUsing one's unique talents",
    "date": "2022-06-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Maravilhoso. História e personagens muito bem desenvolvidos! Concerteza o melhor filme de animação que já assisti até hoje(ultrapassando Pets, que era o meu favorito).",
    "date": "2022-06-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Great Animation and characters. Looks like it's in the same universe as Zootopia.",
    "date": "2022-06-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "If you like Zootopia, this is is a fun one to watch.",
    "date": "2022-06-14"
  }
]