[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was like a warm hug. Reminded me of Love Actually.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Hallmark grade Christmas movie on Netflix. Cheesy and predictable. The only bonus is looking at Paris in Christmas 🍿🍿🍿/5 on Netflix",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It is superficial, unrealistic and absurd storyline. I hope it was atleast believable. Random holiday movie I would say it's a waste of time.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I will watch anything with Flula Borg in it! But everyone was so much fun in this movie. Especially the dog bubbles!",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Think of Cooks Champagne that you microwave then are forced to shotgun through a funnel.  This movie has way more than champagne problems.  Horrible acting and predictable the whole way ... How does this have a 60% rating LOL",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Nicely done scene settings and locale.  Roberto is probably the most interesting and original character. And then maybe the adorable Westie.  The rest, meh. \nSlow moving, and could not get past Minka’s fake expressions and smile, and what is up with her drunken dialog delivery, every single scene? Like, almost incoherent.  Ugh. \nSwitched off.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I tend to rank holiday movies compared to other holiday flicks and this one is certainly better compared to many of the other newer ones. Plenty of good laughs, especially from the German guy, and it’s rather enjoyable overall",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved this movie. It had such a big heart and left me in such a good mood. I will see it again!",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved. Minka Kelly is a sweetheart. Roberto stole the show!",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Super corny And predictable.  Stopped watching after 30 mins.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a truly joyful movie. Everything ended so perfectly. I want to stay there with these characters forever.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Enjoyable Christmas movie with great use of setting. Story works well with good writing for the genre. Actors brought the characters to life and leads were compelling.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Tolerable because it's set in Paris and I have nothing better to do on a Saturday night.   BUT....\n\nI have to make this one point.  Perhaps irrelevant to others, but when it occurs less than 10 minutes into the movie, I have to wonder just how ill-informed or just plain lousy the writer(s) are (sorry).  Sister says to leading lady that they promised each other they would \"see the world\" when they grew up and then she brags:\n\n\"I walked the Great Wall of China\" and....and....(wait for it)....\n\n\"I HIKED THE PYRAMIDS OF MACHU PICCHU\".   Pyramids?   seriously.  Pyramids?    no can hike the pyramids at Machu Picchu.  There ain't a single one at Machu Picchu.  It was the bucket list trip of my life so I can say w/o a doubt.  Ain't no pyramids.  You can hike for sure.  But you're hiking up a mountain trail.  (I didn't. I took the train.  I was 75 when I visited).  Writers!!  C'mon.  it's not hard to google about places.  \n\nSorry for the ramble.  But this one really bothered me.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Dreadful- Hallmark meets Netflix\nAh but Minka - to use a champagne term- a rack that needs riddling",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "a horrible train wreck of a movie that felt like the director typed into chatgpt, \"make me a script that sounds like the worst christmas hallmark movies all combined.\"And then on top, let’s add awful tropes and be extremely judgmental about private equity. Watching tik tok brain rot would have been better for my sanity. Easily the worst movie i’ve ever watched.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I was honestly stunned that the critics liked this. I can usually trust Rotten Tomatoes.  I kept watching waiting for it to get beyond just a bad romcom. Admittedly, I like a bit of substance with my movies, so I should have known better. The scenery is pretty and Roberto's character was a delight.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Lovely scenery all around, sympathic and/or charming or funny characters, lots of humour. The mostly predictable story does not reduce the good feelings this movie gave me all around ! The makers also came up with a few anachronistic characters and even a few less expected twists that added to the overall entertainment.  \n\nI had never heard of the main actors before but really loved their performance. I do not want to go into developments here because of spoiling surprises, save for one: an Italian billionaire son turns up who is actually not at all serious about wine making or running a business, but just into having fun with all his money. The comic relief ? Or is that intended to be the very stiff and clumsy German... well, just go see it if you have not already and enjoy the anachronistic add-ons, the very charming very nice French Father with the equally charming accent (thank heaven for French speaking English and God forbid the English speaking French with a fat English accent !) and the chemistry between the very goodlooking (of course) main actors.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Perfect cheesy holiday romance! The vibes were impeccable!",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Entertaining and mindless .. very much enjoyed this movie setting gorgeous .. Paris chateaux's \nLovely .. and funnier than hallmark movies",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I just finished watching Champagne Problems on Netflix and I absolutely loved it. First of all, the setting was in Paris which felt so refreshing since most Christmas movies are always in New York or Chicago. It was beautiful to see a different city for once and the Paris backdrop made the whole film feel extra magical. My  favourite was Roberto played by Sean Amsing. I have always been an enormous fan of the actor John Lovitz and Roberto’s hilarious personality gave me total John-Lovitz! He absolutely stole every scene he appeared in. One of my favourite quotes from the movie is when Roberto says, \"Doesn’t matter if your glass of champagne is half full or half empty, as long as the glass is refillable.\" That line alone deserves an award. Overall this movie has the perfect mix of witty silliness, a bit of cheese (or should I say fromage), a sweet storyline and gorgeous scenery. Five stars from me. A must-watch for the holidays. Oh, and let’s also give five stars to the dog bubbles 🍾🥂",
    "date": "2025-11-28"
  }
]