[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I found this to be an unexpected gem, and very enternaining.",
    "date": "2025-10-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It takes two actors you would never think to put together ... reworks and restructures the genre's conventions and puts the puzzle pieces together to make a picture that is completely different than the one on the box.",
    "date": "2025-10-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I am an easy mark for these types of films. Just two cool guys who are good at what they do, going around pulling off cool action set pieces. The two men are chased around by Edward James Olmos leading the cartel, James Marsden of the Navy and Bill Paxton of the CIA. All these opposing forces colliding in on our two main characters leads to some entertaining action.\nThe two main problems come from the film not bringing much new to the table and having an overly convoluted story.\nOverall, it is still a fun time.",
    "date": "2025-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "On a scale of 1-10 , I’d rate it 5.5",
    "date": "2025-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Denzel Washington and Mark Wahlberg are very funny in this underrated buddy cop film.\n\nDirector Baltasar Kormákur’s buddy cop action-comedy 2 Guns (2013) is a lot of fun thanks to Denzel Washington and Mark Wahlberg’s lightning fast line delivery and sheer charisma. Kormákur’s quick and playful direction kept me on my toes as we went from shootout to shootout. He keeps upping the intensity and stakes.\n\nSteven Grant’s story about an undercover DEA agent and Naval officer working together to rob a bank in an attempt to defeat a drug lord is fascinating. It’s all very complex and hard to follow at first, but all the characters and clues come together neatly. Screenwriter Blake Masters came up with dozens of jokes and humorous character quirks. Every character is memorable and playful. 2 Guns reminded me of The Nice Guys, Kiss Kiss Bang Bang, and The Other Guys. It’s a wild mixture of drug lords, DEA, CIA, and the Navy.\n\nDenzel Washington is a riot as the tough DEA Special Agent Bobby Beans. His annoyed manner with Wahlberg is a blast to watch. He brings dramatic gravitas, but also a sense of humor. Mark Wahlberg is a scream as U.S. Navy Petty Officer Stigman. His one liners are increasingly hysterical as 2 Guns goes along. He brings such levity and cool quick draws to 2 Guns.\n\nPaula Patton is unbelievably sexy and intriguing as SEA Special Agent Deb Rees. Her scenes with Denzel are amazing. Bill Paxton is cast against type as a terrifying killer named Earl hunting down Beans and Stig. He’s actually deranged and intimidating here. James Marsden is fun as the smirky Navy Lieutenant Quince. Fred Ward’s cameo as Rear Admiral Tuwey is amazing and hits hard opposite Wahlberg in one of the best scenes. Edward James Olmos’ angry and vindictive drug lord Papi Greco is fantastic. He adds a ton to his scenes.\n\nEditor Michael Tronick carefully cuts to keep us in suspense, but also guessing the mystery that gradually unfolds. Cinematographer Oliver Wood uses every angle to make the shootouts more exciting and unexpected. Composer Clinton Shorter’s score is very amusing and adds more excitement.\n\nIn all, Denzel Washington and Mark Wahlberg elevate a funny action-comedy into a memorable buddy cop film. It’s also a cool 109 minutes.",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Successfully funny in 1 hour and 49 minutes!!!!!!!!!!!!!!!!!!!!!!!! Rated R for Language, Brief Nudity and Violence Throughout!!!!!!!!!!!!! The USA grossed over $75,600,000.00!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Dubbed and subtitled in worldwide studios!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-08-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It's a slick piece of escapism that gets by largely on its star power -- not a bad thing when that star power is Denzel Washington and Mark Wahlberg.",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "doesn't delve into any unexplored territory, but it delivers precisely what the it promises, shootouts and wise cracks.",
    "date": "2025-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Gostei muito desse filme, achei muito bom!",
    "date": "2025-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Because Marky Mark and Denzel, that's why!",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "\"There is no code.\"\n\nIf you feel like a buddy action comedy, you could do a hell of a lot worse.  Not super deep of course, but a nice down to Earth hook, some clever lines, solid acting - fun, clean stuff all in all.  And the CIA/cartel dialogue, though brief and still faily-superficial, is just downright good cinema.  3.25/5",
    "date": "2025-04-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "2 Guns    Fun popcorn movie with Denzel and Marky...   3.5*",
    "date": "2025-04-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "An buddy action film that has some good laughs and one liners throughout.",
    "date": "2025-03-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Super fun to watch. Great acting, cool story, the performances were awesome, great action scenes. It was way better than I thought it would be and I thought it would be pretty good.",
    "date": "2025-02-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "3.0 stars; Denzel Washington and Mark Wahlberg pull off a pretty good action movie. They, of course, rely on the old 'bad chemistry between them' formula to add the proper level of humor. What was unique about this plot was that both were undercover agents working for agencies that were trying to rip off a forty-three-million-dollar heist.",
    "date": "2024-12-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A good buddy cop movie that left me a few good surprises that kept engage throughout this film run time.",
    "date": "2024-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Loved that I didn't have it figured out in the first 10 minutes.  The story unravels on its own terms.",
    "date": "2024-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Better writing and editing could have made it a classic. As it is, I loved the chemistry of these characters, Denzel and Wahlberg are great together.  And the late great Bill Paxton was great, too. There are some beautiful classic cars, too.",
    "date": "2024-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Yes, there have been cops and robbers movies. Yes, there have been `buddy-cop' movies and yes, there have been a tonne of movies where the protagonists fall foul of the mob and end up `owing them big-time.' However, very few of those manage to pull of those generic plotlines off in one movie (and, more amazing still, make it work).\n\nThe two of them play a pair of bank robbers.  Or do they?  Maybe they're really working for different law enforcement agencies and are just trying to infiltrate the crininal underworld?  And maybe they don't know each other's motivations!  This 'uncertainty' (for the characters, at least - we, the audience know what's going on - it's not rocket science) about who's working for who gives the two A-list leads plenty of opportunities to engage in great banter.\n\n'2 Guns' is nothing original, but it is fast-paced, slick, stylish and, best of all, entertaining. This is probably down to the two leads - the ever-reliable Denzel Washington and the mainly-reliable Mark Wahlberg. Perhaps without these two heading the bill, the film would have been as sub-standard as the plot suggests. The two actors play off each other brilliantly and save every scene from ever slipping into mediocrity. There's a real `Pulp Fiction' vibe between them with all the banter and general chit-chat which helps establish their characters.\n\nThere are plenty of good performances from the supporting cast, too. The long forgotten Bill Paxton (still best known for `Hudson' in Aliens) is great as the villain.  There's a minor 'love interest' thrown in for Denzel Washington and, yes, it could probably have been removed completely, but at least it doesn't get in the way of the general action andd carnage.\n\nBasically, if you like cops and robbers, crime, gangsters, or just generally action movies, you can't go far wrong with this one. Grab the popcorn, ignore the odd plothole and just enjoy the ride.  Oh, and if you're not into multiple cursing and violece, you may want to steer clear of this one.",
    "date": "2024-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "‘2 Guns’ delivers a series of comedic thrills, yet one might anticipate a film graced by such a stellar cast to delve deeper into the complexities of its narrative. Despite this, it remains an entertaining endeavor worthy of viewing.",
    "date": "2024-06-12"
  }
]