[
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I… I don’t know what I just watched… but the girl she remains so calm the entire movie and so seductive, she’s so provocative even though the movie’s supposed to be about her getting kidnapped… it just makes no sense to me to be honest.",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Simply don't watch this. Rewatch another movie instead.",
    "date": "2025-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Worst movie for me in last 5 years. The main actress was so ugly.",
    "date": "2025-02-15"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Wait... This was a movie?!?! I thought it was a really long (pun intended)  porno with some tossed in party scenes! Had me fooled.",
    "date": "2024-12-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The sequel to \"365 Days\" worsens the issues of the original, delivering an even more superficial and incoherent narrative. The characters remain shallow, with unconvincing motivations, while the plot feels like a series of disjointed scenes designed solely to shock.\n\nEmotional development is nonexistent, and attempts to deepen the protagonists' conflicts fail, relying on clichés and weak dialogue. The romanticization of toxic relationships remains a highly problematic aspect.\n\nAlthough the production retains a flashy aesthetic, it is not enough to make up for the lack of substance. The sequel reinforces that its focus is on provocation rather than telling a meaningful story.",
    "date": "2024-12-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Porn but with a better soundtrack. No real plot. Conversations are just music overlaid. I have no idea what the storyline is at this point other than lots of clubbing and someone finally got a big girl job running a fashion company...all you see is her sketching designs.",
    "date": "2024-12-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Of all the pointless and absurd movies I've watched, this one takes the top spot. It's supposed to be a love story, but it fails miserably. By the end, it's still unclear whether the main characters end up together or not. The plot is confusing and poorly developed, leaving you with more questions than answers. Instead of wrapping things up, it feels like the film just stops abruptly. This lack of resolution makes the whole experience frustrating and unsatisfying. Overall, it's a complete waste of time and fails to deliver any meaningful or coherent storyline. The characters lack depth and their relationships are underdeveloped, which only adds to the confusion.",
    "date": "2024-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "If I were in the mood to watch adult content, Netflix would definitely not be my first choice. The movie I stumbled upon was a total disaster, making me extremely uncomfortable, especially when children unexpectedly walked into the room. It was a messy experience that I strongly advise against.\n\n\"365 Days\" seems to be all about sex and trying to engage the audience solely on that basis. The sequel follows the same pattern, and both films are filled with excessive plot holes, acting issues, and seem to lack a meaningful storyline. It feels like they are veering towards the wrong direction, almost resembling pornography rather than a film with substance.\n\nDespite being somewhat enjoyable, these movies left me questioning why they were even made. I only watched the sequel because I had seen the first one and felt compelled to review both at the same time, even though I found them both to be quite terrible.",
    "date": "2024-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "She did not end up with the right guy so it is a 0/10",
    "date": "2024-04-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A trama mudou da água para water... acho que só brasileiros vão entender a piada, mas enfim... eu tenho que admitir que chorei e não foi de prazer. FINALMENTE ACABOU.",
    "date": "2023-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "What is this ? just shown on sex scene more and more action aggresive sexual content not many viewer confortable to see it.",
    "date": "2023-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "can a movie series get worse?  yes, yes it can.",
    "date": "2023-04-05"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I watched all 3 parts. This is the third and, supposedly, last part. All of this trilogy was terrible. Nonexistent script and dialogue. Terrible acting. Stupid, unconvincing, and unbelievable plot and storyline. Just boring, neverending, and meaningless nudity and sex with mostly the same 3 unlikeable and despicable characters. The worst thing ever was that every 2 to 5 minutes a new idiotic song was played from an extremely annoying soundtrack of very untalented singers. The directors must have thought they were filming a music video. This was the case in all 3 parts. The neverending barrage of songs became so unbearable and annoying that I was going to switch the movie off many times. The only reason I continued to watch this trainwreck till the end, when I should have quit, is that I had invested too much time watching the first two parts- which were also disasters. This whole trilogy is unwatchable and is depraved nonsense.",
    "date": "2023-03-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Please, no more sequels to this terrible series!",
    "date": "2022-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "--- 4,5/10 --- La vi con mi novia porque quería verla y sorprendentemente me entretuvo, cuando no daba nada por ella. Aunque hay veces que no hay por donde cogerla.\n\nReparto: 3,5/10 (Películas para chicas, los tíos son pivonazos y las chicas muy normalitas)\nPersonajes: 5/10 (Me saca de quicio la protagonista, aunque los otros personajes hacen un papel discreto pero correcto)\nVestuario y ambientación: 4/10 (No es mi estilo, ambientación de barcos y putas)\nGuion: 4,5/10 (Previsible y muy cliché)\nRitmo de la trama: 7/10 (Entretenida)\nEscenas eróticas: 3/10 (Utilizan el elemento sexual de una forma muy recurrente y barata, y a veces incluso turbias)\nBanda sonora: 3/10 (Meh)",
    "date": "2022-10-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I had a lot of fun watching it. I am sorry, but it was so bad that I had to laugh the whole time, well done! \nActors were obviously good-looking, but their acting was so bad, and that slow motion walks… I can't even… Just too much... too much… (would have been a nice fragrance commercial, though).\nThey obviously had a budget and nice locations, so I don't understand how is it possible to make such a bad movie. \nMoney not well spent, Netflix!",
    "date": "2022-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Waste of time, worst of the three. Don't watch.",
    "date": "2022-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Cliffhanger to cliffhanger, it's just a film that makes you want more because of how much of a cliffhanger it is. This movie should be fast-forwarded to the next movie instead of staying in the midst of the unknown and then leaving us there not knowing whom she will pick. Basically, it's getting to the point that you'd rather just watch the ending than waste your time watching the whole movie filled with uncertainty of the main character.",
    "date": "2022-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Znowu baba upierdliwie przeszkadza mu w pracy. To zbiór teledysków. Szczątkowa fabuła. Ładny wizualnie, estetyczny. Brak odgłosów seksu. Płytkie wartości",
    "date": "2022-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Can't wait for number 4",
    "date": "2022-09-01"
  }
]