[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Raw Acting. Though it is more of an enlightenment to the long-standing problem of harassment and abuse. However at the end some kind of inexplicable possibility happened.Overall, the beauty here is the message and awareness it passes.",
    "date": "2025-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This was an interesting movie. It used the basis of an actual true story. The director changed it up a bit. I think the acting was a bit lazy from the male lead. However, there wasn't a lot of dialog built up, either.\nCould they have used a younger looking cop for the story? Probably. The purpose of the story was to make you dislike him. He was supposed to come off scummy, so that worked to create a sense of unease from him. I really enjoyed the native folklore aspect and how it ended. It was more of what we wish would happen to the bad guy if this happened. The interviews were a bit unusual, but you get where it was going. For me, I understood it as a literal take on what normally happens in society when there is a fem victim where there isn't a good ending. All in all a decent movie. This is not a top dollar film but delivers a decent story line. It also does not give the ending away easily throughout the movie. The director appears to want the audience to be lured by the interviews. This is what happens in real life when there is a victim that is left for dead and the investigators seek to solve the mystery. However, there is no mystery as we see what happens with an unexpected ending. So, it is a little reality with a bit of vengeful fiction.",
    "date": "2022-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Very boring and pretty predictable. Lifetime-esk.",
    "date": "2021-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Poorly cast. Age difference kinda gross. The movie's pace is too fast to attach any sort of real suspense or attention to the plot. The guy literally screams \"If I can't have you, no one will.\" Ridiculous last-minute montage of some dream/story that somehow makes everyone wake up and realise the victim might be alive. Please. :( Ending was unsatisfying and a poor attempt to make the antagonist appear even more evil. The shock value twists wouldn't even be needed if the plot had moved effectively. Loosely based on a real life case, it was not given justice. Not great.",
    "date": "2021-04-21"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "What a stupid film. True story yet ironic he stopped her from speeding yet that's how a year after the attack she died.. by speeding. Honestly a terrible film. It's flat and lacks any sort of energy and did I mention how bad the acting is? The lead girl clearly fancies herself and the others show such bottom level acting but you just don't get good points in the film it's just so boring. This script should have been so much better. Ah dear, shocker.",
    "date": "2021-04-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Horrible. Horrible acting. Just, plain horrible. It wasn't realistic, at all. Not to mention, it went from 0 to 100, insanely fast. That's not how any of that works.",
    "date": "2020-10-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This was an interesting story and pretty good movie. 'David' was not a police officer in real life, and Julie did not kill him. He's still in jail thank God, however...sadly, 'Julie' , after a long hospital stay recovering from her gunshot wounds, was killed in a car accident a year later..I enjoyed the movie. I wish they had left the racial/bad white cop implications out. From my research. It has no bearing on the true story, and we truly don't need to throw gas on this fire.. plus the story didn't need it to be good.",
    "date": "2019-05-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "So bad in every way. Disgusting.",
    "date": "2019-04-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Although it's acted well by the lead, it's a pretty big waste of time",
    "date": "2019-03-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "1980 production quality. Not really based on a trued story. Bad acting. Unreal jumps in logic!",
    "date": "2019-03-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "mmm; this was fine. predictable & nothing special, but i enjoyed the interview/mockumentary parts that were sprinkled in along with the \"plot twist\".",
    "date": "2019-02-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Brett Zimmerman is sexy but this movie had some of the worst acting I have ever seen",
    "date": "2019-02-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I dont know why they tried to fairy tale this sad story but spoiler, they changed a lot from the original story and that girl did not get a happy ending",
    "date": "2019-02-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "True life story happens to many of us women.so dont libe to tell their story and people just dont know what lead up to the main event because some women are afraid to tell or always think its their fault.Jupie thought it was her fault this guy was a weirdo a d being mean when he could reach herby phone he loved her to much to soon a love with hate attached to it.Iâ(TM)d say but thats it gotta see for yourselves.",
    "date": "2019-02-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Creepy, slow and predictable. A bad marriage of Sleeping With The Enemy and Unlawful Entry.",
    "date": "2019-02-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Bad. Bad......\n\nJust all the bad things.",
    "date": "2019-01-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Horrible acting, silly plot line, unbelievable characters",
    "date": "2019-01-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Terrible acting, I cringed watching it. The story is rushed to the point that you're left with alot of unanswered questions.",
    "date": "2019-01-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Thrilling, on the edge of your seat viewing.  Terrific acting..",
    "date": "2019-01-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Well if you have read the summary of the plot, you know the only twist in the movie. Paired with the atrocious acting and you have got yourself a real loser here. Skip it. You are not missing anything.",
    "date": "2019-01-23"
  }
]