[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Everyone who likes horror films should see Scary Movie. Shorty was funny. As for the other ones... go ahead and indulge if you like, but you'd mostly be wasting your time. I'm glad this genre exists though. Just one more spoof genre people can contribute too which is always cool.",
    "date": "2025-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very very funny. Shorty best character",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Filme:\tTodo Mundo em Pânico\t\t\tAssistido: 11-11-25\nElenco: @annafaris @marlonwayans @morereginahall @therealdjsw1 @keenenivorywayans @carmenelectra @shannonelizabeth @lochlynmunro @simonrex415 @therealjonabrahams\nModelo: #comedia #trash\nDuração: 1h 28m\tAno: 2000\nMinha opinião: Será que este filme trash deu certo? Teve sequência I (2000), II (2001), III (2003), IV (2006), V (2013). Imitando os filmes \"Pânico\" e fazendo não só dela, mas diversos filmes de forma cômica, tirando o sarro literalmente. E tendo Faris que só sua cara ja ganha a bilheteria, temos os irmãos Wayans de \"As Branquelas\" + Hall + Munro. Prepare a pipoca e a poltrona para dar boas gargalhadas e o mais improvável, será seu maior a certo. kkkkkk \nVale apena assistir?: sim e com pipoca. E esta experiência deu certo.\nNota: 8",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The humor is outrageous, often leaning into slapstick, absurd dialogue, and adult jokes. Anna Faris stands out in her debut as Cindy Campbell, delivering a funny and surprisingly charming performance amid the chaos. The Wayans brothers bring their trademark energy and comic timing, making the film both ridiculous and entertaining from start to finish.",
    "date": "2025-11-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Holds up surprisingly well, still funny.",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Yeah twin this was peak. It was enjoyable, entertaining, and really funny. It was a better scream and I know what you did last summer. It had the best cast I could ever ask for and was so peak. It’s probably one of the best parody moves I’ve ever seen.",
    "date": "2025-10-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A cult classic still to this very day",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Yes.",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Me encanta esta película y también la escena del wasaaaaaaaaa",
    "date": "2025-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "La comedia es buena la trama es sumamente divertida pero es un poco lenta la película",
    "date": "2025-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Scary Movie 1 relies on its sharp, over-the-top humor and questionable jokes, featuring mindless yet oddly charming characters while tipping its hat to iconic references like Scream and The Blair Witch Project. The ridiculously intentional bad effects actually make the movie better. If you’re a fan of Scream and enjoy laughing at immorality and (reproductive organs) jokes, this one’s definitely for you.",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This was literally Scream scene for scene but much more of a comedy, this is easily the best Scary Movie in the franchise.",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "PEAK. People looking for a story are weird",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A fun watch, if you are in the mood for some mindless entertainment. It pokes fun at all the lazy cliches we have seen in countless horror movies.\nThe immature jokes are hit or miss, depending on personal taste - some of them timeless, while others aged like milk.",
    "date": "2025-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "There isn't one single laugh in the entire movie.",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Crazy funny! Great cast and a must see.",
    "date": "2025-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "An incredibly hilarious parody that lead the way to more in the future!",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Hilarious and raunchy. Perfect fit.",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The funniest movie of the 2000s. Keenen Ivory Wayans was the best director of the franchise and mixed 'Scream' and 'I Know what you did last summer' with mastery. The smartest decision was casting Anna Faris, Regina Hall and his two brothers to also help writing.",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "4/4 It may be the funniest film I have ever seen in the movie theater.  In the vein of slapstick parodies its top 10 for damn sure.",
    "date": "2025-07-07"
  }
]