[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Vivo what an amazing Sony pictures, animated film it has amazing story. Amazing, animation great characters, and amazing songs. And my rating is a. 10/10",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "the best movie ever!",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "What a touching musical with a great adventure story. Lin-Manuel Miranda is so talented and his songs are always amazing",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Loved it!! ❤️ Worth to see!!! 💯",
    "date": "2025-06-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1 hour and 38 minutes, starring Lin-Manuel Miranda as Vivo!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated PG for Some Thematic Elements and Mild Action!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-06-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Well, having a Kinkajou as the main character, it is obviously extremely infantile. But the graphics, especially of Havanna's and Miami's city views are absolutely astonishing, especially as they use camera swings, focus, off-focus as if it would be a live-action movie. What unfortunately puts one off this movie is the excess of songs, even more so than any Disney movie. Thus 3/10 points for adults. Probably 6/10 for kids!",
    "date": "2025-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I liked this movie, but my sister was addicted to it for like 2 years, and because of that, it got old and kinda ruined it a bit for me. But before that’s happened, I would have probably given it a 4/5. So that’s what I’ll go with.",
    "date": "2025-05-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A heartfelt movie with gorgeous animation and catchy songs by Lin-Manuel Miranda",
    "date": "2025-02-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A colorful tale about fulfilling old and new promises alike.",
    "date": "2024-12-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Lin-Manuel Miranda had a busy year in 2021. Along with directing a Best Picture nominee in \"Tick...Tick...Boom!\" he provided the music for two animated movies. One of these was \"Encanto\" which went on to win \"Best Animated Picture\" as the Oscars. The animated film was this one, \"Vivo\". One advantage this film has over \"Encanto\" is that Lin actually does the singing in this film. Miranda is such a unique talent, no one can write songs the way he does, and no one can perform them the way he does. Not only is he great singer, he is a great voice actor as well. There are so many jokes in this movie that are sold by his delivery. He provides a lot of pained screams that are comedy gold.\n\nThe songs throughout the movie are all good, some of them being stuck in your head for weeks after hearing them. The animation is also very good, the character designs are distinct and the movements smooth.\n\nThe story ebbs and flows in quality. The opening 30 minutes and ending 30 minutes are very good. They hit all the emotional beats just right and move characters forward in a believable way. I even enjoy the twist they do on the kids' buddy road trip formula. Typically, there are two characters that don't get along and they gripe the whole time. That happens here as well, but since one character can't understand the other, they are able to be as brutally mean as they like without it offending the other. They just naively go along like they are the best of friends, and it leads to some funny jokes.\n\nIt is just that pesky middle 30 minutes that feels like a series of plot contrivances in order to make the movie happen. There are plenty of ways to fix the problem in a quick and painless way, but to make the story last for 94 minutes, needless complications arise. It is all basic animated movie stuff, and there are some funny jokes interlaced throughout, but it doesn't rise to the quality of its opening or closing.\n\nThe first 30 minutes gives the movie its emotional core. The final 30 minutes give it is satisfactory ending. The middle 30 minutes give it typical kids' movie shenanigans. But there is good animation, music and humor throughout the whole runtime.",
    "date": "2024-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing movie and fantastic music selection.",
    "date": "2024-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I like the animation and the songs. The mission that the characters have to do is heart warming. It's great to have Gloria Estefan singing in it too. and Lin-Manuel Miranda is SO GREAT as Singing And As VIVO",
    "date": "2024-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "i love it when the rating i give is the only thing i have to say💖",
    "date": "2024-04-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Vivo's pedestrian storytelling and animation show, but Lin-Manuel Miranda's unmistakable melodies keep it bouncing to the beat of its own drum.",
    "date": "2024-03-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Music is great. It's sad but funny. I love the adventure and the meaningfulness of it all. The Miami song is what brought me  to the  movie and the movie was more than what I thought it would be.",
    "date": "2024-03-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Prepare yourself for a musical that manages to sing its way into your heart! Vivo is a music-loving kinkajou who is trying to deliver a song for his former partner Andres, who had sadly passed away, with the help of his Andres's grand-daughter Gabi as they travel through the Florida everglades. Vibrant animation and infectious songs make this film a must watch for any music lover!",
    "date": "2024-03-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Originalmente le iba a dar un 7.9 a esta peli, por la trama algo predecible, y por algunos personajes, pero por la animación y sobre todo el soundrack, es lo que esta se convierte en una gran pelicula, le doy un 8.8/10",
    "date": "2024-01-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "La animación es increíble la canciones son buenas solo una los personajes están tan bien desarrollados y trama es decente los personajes secundarios son olvidables es un 7 de 10",
    "date": "2023-10-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A great animated movie for enjoy with the hole family, it's very good!",
    "date": "2023-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Vivo was an amazing movie. I watched it kind of a long time ago, but I remember it was really good. I remember this lovely musical was really funny, and I LOVE funny. Also I remember that Vivo was really interesting. But I have a question to all those movie makers and book makers out there. Why is the main character always in middle school, or the age for middle school. It doesn't  make sense to me, it really doesn't. Anyway, Vivo was an amazing movie. What a good movie.",
    "date": "2023-06-21"
  }
]