[
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Very slow and very boring. Not recommended.",
    "date": "2025-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It has its moments, but in the end it's unsatisfying.  There is no resolution to the various storylines.",
    "date": "2023-04-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "No me gusto porque el final deja mucho que desear esa pisca de misterio esta muy bien pero el final daña todo 1/5 no pierdan su tiempo viéndola",
    "date": "2023-03-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It's a great movie ! It's a movie about hope ! We'll crafted, the movie is fictional as much as real ! It's a classic inspirational story.",
    "date": "2022-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The enjoyed the story as it was great and very suspenseful, but the ending was terrible. It builds you up, but then leaves you hanging at the end with lots of unanswered questions. Is the waterman real? did the water man find the body of his beloved that he was searching for? was he able to help his mother which was the whole point of the journey? What happened to the other characters? hopefully, there is a sequel to sort this all out.",
    "date": "2022-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Seriously? Not sure how this got such a good review. If you want to watch a movie that leads to nothing with stuff that happens for no reason watch this movie.",
    "date": "2021-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "it is super original, which is hard to come by these days. this show brings me hope for original movies.",
    "date": "2021-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Es una nueva película familiar en Netflix; la trama es decente y las actuaciones son pasables; David Oyelowo tiene mucho potencial como director de cine.",
    "date": "2021-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "3 out of 5 stars. The Water Man is a fair drama film about a young boy who is searching for the water man to help save his mother from a disease. The water man has a stone that can save anyone. It is a decent story that tries to be a bit fantasy and magical. But the direction lacks its tone its trying to be. The acting is decent. The film does lose its tone with what its trying to be. But entertaining.",
    "date": "2021-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "It felt like a dumber version of \"A Monster Calls\".\n\nThe script makes no sense, really. And the ending was as disapointing as stupid.",
    "date": "2021-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Another movie without one African American woman discrimination in the u.s is a disease",
    "date": "2021-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Though it's a little murky towards the end, The Water Man tackles a hard subject (death) from a young man's perspective.  On a quest for hope and a cure for his mom, he searches out the truth of The Water Man legend.",
    "date": "2021-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Watched with the family after a stunning review on the one show and was sorely disappointed. A waste of 90 minutes of my life. Unimpressed.",
    "date": "2021-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Just ok. Very slow and a bit depressing. It had a few interesting moments. It passed the time, but again, just ok.",
    "date": "2021-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "[SPOILERS] the story of the family is fine, the ending is moving. But I was disappointed with the movie because when you see a boy with a sword on the advertising you expect a different kind of movie.",
    "date": "2021-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not quite enough substance here for me, but it's pretty entertaining nonetheless.",
    "date": "2021-06-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A good message about hope, well directed and acted albeit on a budget.",
    "date": "2021-06-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Solid family adventure thrill",
    "date": "2021-06-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The Water Man is a very entertaining family adventure. The young boy in the lead was great. David Oyelowo and Rosario Dawson also play their parts well. The story was consistently interesting. I liked the themes of the film and how they were handled. The film was kid friendly without alienating adults. There were a few moments that felt childish but it felt natural. I was one step ahead of the plot at times, but Oyelowo’s direction keeps things engaging. Overall, I really liked this. It’s just a very sweet and charming film. I’m excited to see what Oyelowo does next behind the camera.",
    "date": "2021-05-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It was a sweet, sad movie. I was hoping for more \"mystical\" and less sadness. It reminded me of a Hallmark movie...not worth spending 50.00 on (yes..including popcorn)",
    "date": "2021-05-25"
  }
]