[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Entertaining for all ages, great music, great comedy (keep an eye out for the Here Comes the Cud video!) and a very good satire on falseness and exploitation in the pop music industry",
    "date": "2025-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "One word. \"NOPE.\"",
    "date": "2025-06-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Bueno película maravillosa",
    "date": "2025-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie isn't even that good",
    "date": "2025-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I couldn't even finish it. Yeah it was pretty god dang awful. I don't even think they tried while making this movie! Who asked for this! The acting sucks, not funny, it sucks! If you want an animated movie with animals, just watch Zootopia, or the bad guys, or even Over the hedge! Yeah this movie is straight up trash. 1/10 trash movie never watch it.",
    "date": "2025-05-23"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Terrible. Just Terrible.",
    "date": "2025-05-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I'm A #THELMAHATER !!",
    "date": "2025-05-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I found this to be another good animated film by netflix . great songs and it had a great message in the film .",
    "date": "2025-03-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I was enjoying the 30 minutes but until it keeps going and going! 3/10",
    "date": "2025-01-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is the best animated movie I have ever seen! The subtle humor and unique animation were a nice change from the cookie cutter films of the last five years. It’s one of those films that the closer you pay attention the better it is. Oh, and the music ROCKS!!\nLoved this movie!",
    "date": "2025-01-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Made an account just to say how terrible this movie is, what did I just watch. #THELMAHATER",
    "date": "2025-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I love insulting this movie so much. The songs are bad. Thelma looks ugly. All the characters look UGLY. Also the plot was really boring and uninteresting. I just like making fun of this movie for its song ‘here comes the cud’ what were they thinking!",
    "date": "2024-12-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Another netfix garbage animated movie...",
    "date": "2024-12-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Looking at the surface, there should be no reason to have high expectations for this movie. But it was the behind-the-scenes talent that got me intrigued. It is directed by Jared Hess, the man who brought us \"Nacho Libre\" and the Oscar nominated Animated Short \"95 Senses\". The movie is based off the same author of \"The Bad Guys\", which was a surprisingly good time. And even has a writer from the hit and miss show \"Teen Titans Go!\". So, I actually went into this film with optimism. Too much hope for what this movie deserves.\n\nThis movie is the very definition of a (5/10). It is a completely average animated film. At the 5-minute mark of the story, you can guess EXACTLY what's going to happen. It is one of the most tired and clichéd kids' movie story you can imagine.\n\nWhat's ironic about it is that the same writer already did a spoof of this exact same premise in \"Teen Titans Go\". The writer goes from making fun of the tropes, to making a sincere version of the same story with no variation or twist on the formula.\n\nIt's nothing offensive, it has a few good jokes. The world of talking animals and people living together leads to some fun possibilities. Even the flies in this world can talk, that's something.\n\nThe music in this is just fine. Not great, not bad... you may have noticed that as a common theme for this review.\n\nBut it's also nothing special. It is not a rarity, it does not sparkle or glimmer, it just...is.",
    "date": "2024-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I like the animation, but I don't like the jokes",
    "date": "2024-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Terrible.",
    "date": "2024-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This is just a dumb movie for kids not for adults, they only reason you should be watching this thing its.",
    "date": "2024-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "come on guys it's brittany howard!! \nfun + worth a watch :)",
    "date": "2024-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I could not watch this movie all the way through . Absolutely terrible movie. The entire thing was just so cringey .this is one of the most forgettable pieces of film I have ever watched.",
    "date": "2024-08-31"
  }
]