[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It kept my focus the whole time. I loved it. I don’t get why others (including my friends) weren’t big fans of it.",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "A example on why Netflix originals are so hated. The story is so stupid, it's confusing and leads to nowhere, bad characters, alwfully dumb deaths.. The only good thing about \"Curs>r Choose Or Die\" is the music that combines with the failed Matrix inspiration. This movie has a LOT to do to be bad. Avoid watching this garbage.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing movie, Don't understand the negative reviews.",
    "date": "2025-08-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Success in 1 hour and 25 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-06-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "(CASTELLANO) Elige o muere, parte de una idea prometedora , pero no termina de aprovecharla del todo, aunque entretener, entretiene. Su premisa, con tintes de nostalgia ochentera y un videojuego maldito que obliga a tomar decisiones extremas, daba para más. Sin embargo, lo que arranca con fuerza se va desinflando poco a poco, dejando la sensación de que podía haber sido mucho más.\n\nLa película juega bien sus cartas al principio, generando una atmósfera intrigante y algunas escenas con un punto de tensión bastante efectivo. Pero a medida que avanza, el guion se vuelve más predecible y cae en lugares comunes que restan impacto. No es que aburra, porque mantiene un buen ritmo, pero se nota que desaprovecha parte de su potencial. Hay momentos que parecen hechos a medida para construir una posible franquicia, aunque sin la convicción suficiente como para justificar más entregas.\n\nVisualmente, la película tiene aciertos. Juega bien con la estética retro y algunos efectos funcionan, sobre todo en las secuencias más perturbadoras. No se excede con el gore, pero lo usa en el momento justo para reforzar la sensación de peligro. Aun así, hay un cierto aire de producción contenida que impide que el impacto visual sea mayor.\n\nEl reparto hace un trabajo decente, con Iola Evans al frente, logrando transmitir la angustia de su personaje. Y, por supuesto, la presencia de Asa Butterfield es un buen reclamo, aunque su papel no tenga tanto peso como podría esperarse. En general, los personajes cumplen, pero sin demasiada profundidad, lo que impide que la historia cale más allá de su concepto inicial.\n\nAl final, Elige o muere es un thriller de terror que entretiene lo justo, sin arriesgar demasiado. Con una ejecución más ambiciosa y un guion que explotara mejor su premisa, podría haber sido una propuesta mucho más sólida. Tal como está, deja la puerta abierta a secuelas, pero sin una necesidad real de que existan.\n\n(ENGLISH) Choose or Die starts with a promising concept, but it doesn’t fully take advantage of it. That being said, it does manage to entertain. Its premise—filled with '80s nostalgia and a cursed video game that forces players to make extreme choices—had the potential for much more. However, what begins with strength gradually loses momentum, leaving the feeling that it could have been something bigger.\n\nThe film plays its cards well at the start, creating an intriguing atmosphere and delivering a few moments of effective tension. But as the story progresses, the script becomes more predictable and falls into familiar tropes that lessen its impact. It’s not boring, as it keeps a solid pace, but you can tell that much of its potential goes untapped. Some moments seem designed to set up a possible franchise, but they lack the conviction to truly justify more sequels.\n\nVisually, the film has its strengths. It makes good use of its retro aesthetic, and some of the effects work well, especially in the more unsettling sequences. It doesn’t overdo the gore, but it uses it at the right moments to enhance the sense of danger. Even so, there’s a certain low-budget feel that prevents it from having a greater visual impact.\n\nThe cast does a decent job, with Iola Evans effectively conveying her character’s distress. And, of course, Asa Butterfield’s presence is a solid draw, though his role doesn’t carry as much weight as one might expect. Overall, the characters work but lack depth, preventing the story from resonating beyond its initial concept.\n\nIn the end, Choose or Die is a horror thriller that entertains just enough without taking major risks. With a more ambitious execution and a script that fully embraced its premise, it could have been a much stronger film. As it stands, it leaves the door open for sequels, though there’s no real need for them.",
    "date": "2025-03-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "it´s a matrix copy but of horror, the vibe and the aesthetic it's similar to matrix",
    "date": "2025-02-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Regardless of everyone else and the 31% I thought this was a great concept! And also Liam Hewlett on music, where do you go wrong... sorry?! Only thing that annoyed me was English actors, filmed in London, but American setting...",
    "date": "2024-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Movie was good, it had me cringing and wanting to look away at times. I liked the story line, easy to follow and interesting, Original and good actors.",
    "date": "2024-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I actually enjoyed this movie. It was original, and was definitely worth the watch.",
    "date": "2024-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Another intriguing concept. Another bad movie.",
    "date": "2024-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Has the elements to be a great movie but falls just short of great. Solid movie and enjoyed watching it.",
    "date": "2024-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The plot was horrible. Acting was pretty good which is the only thing that saved that movie from being unwatchable. I think it could have been really good but just missed the mark. I would recommend skipping it, but up to you.",
    "date": "2024-06-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Nice concept but done poorly.",
    "date": "2024-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's really good, I'm satisfied",
    "date": "2024-02-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Here we have yet another example of a thriller with a very nifty and potentially interesting premise that can't decide what to do with it. The set-up to this movie is quite strong and intriguing, especially for those of us who grew up with video games in the 80s. I remember specifically playing a similar choose-your-own-adventure type of game as CURS>R at my cousins' house during a family reunion. The concept is cool, but I could tell even before the halfway mark that the filmmakers had no idea what path to take. Blood and gore here are thankfully limited with a couple exceptions, particularly a scene toward the end involving hypodermic needles. Evans is a game protagonist, and if anyone ever makes a movie about Jimmy Fallon, they must cast Butterfield. The ending is an absolutely shameless open door for a sequel or series of sequels. By the one hour mark, I was so weary of trying to make sense of what was going on, that I felt exhausted. Tone and atmosphere are strong, but the finished product is yet another wasted opportunity.",
    "date": "2024-01-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I really like the retro-concept, much like Jumanji, but this is much more sinister. Curs<R is a great title too. The trailer looks great, but the actual film is just not put together well. It has some interesting ideas, such as the strange audio code affecting reality, but nothing is explored, as if this is the first of a franchise. The acting was great, it was just the script gave very little for them to connect in any way to the audience. Sadly, this was a bit of a disappointment.",
    "date": "2023-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "I think that the idea is really cool but some part mainly at the end made totally no sense and dramatisation in some part wasn't that good, i mean at the end what do you expect from a movie made by Netflix :)",
    "date": "2023-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fantastic movie, original and excellently executed. Can only imagine the negative reviews are from people who are thicker than two short planks.",
    "date": "2023-09-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I mean it's ok, and that's all I have to say about it.",
    "date": "2023-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Some acting is really bad with some effects being worse, but the concept is really good and I was entertained by this movie.",
    "date": "2023-06-17"
  }
]