[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thought the movie was heartwarming.  There were several moments that had me crying.  This movie reminded me of Homeward Bound, a favorite movie of mine.  5/5 imo.",
    "date": "2025-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I just loved it. I cried more than 3 times, it is sad but also very heartwarming.",
    "date": "2025-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Lo primero que pienso al recordarla es en lo feo que eran los modelos, bastante incomodo en muchas partes.\nMas allá de la fantasia de un perro viajando tanto sin morir en el intento me parecio super entretenida. Lo peor fue el nudo de la misma, no tiene sentido, cada vez que decian algo al respecto me causaba rabia de lo ridiculo que era.\nNo me terminá de convencer, no me sentí mal por nadie mas que por la pareja de la nieve. Lo de la cadena de metal fue inesperado, si tan solo todo eso no pasara en 5 minutos quizas y si me sentia re mal, pero solo daba rabia.\nEs entretenida si estas con alguien mas.",
    "date": "2025-06-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "me gustó que el chico se haya preocupado por todos los animalitos que habían ahí abajo y haya adoptado a la perrita, también me gustó la parte de la gatita grande, si bien da pena decir adiós es lo mejor en ese caso, me gustó mucho el reencuentro con el prota y que luego hayan echado a ese rancio",
    "date": "2025-06-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love dog movies so much.",
    "date": "2025-06-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Cute movie, but the narrator for Bella was so awful. Voice didn't fit a cute dog character, and had ZERO personality, you can tell she was just reading a script.",
    "date": "2025-06-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "LOVED the real dog.  If the dog wasn't injured, I would give it a much higher rating.  A few things didn't ring true. Spoiler Alerts: The mean neighbor seemed cliche and it didn't make sense that the Animal Control wouldn't just remove the remaining cats especially since the main animal control character was all over Bella.  Lucas is studying for the MCAT but is a case manager and no reference is made to him studying to be a physician.  They could have used real footage of the mountain lion and wolves and just used the CGI for certain scenes. Real animal footage would have enhanced the film greatly. Appreciated the Veterans and the value of therapy dogs. Touching film but too much dog suffering.",
    "date": "2025-05-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I absolutely love this movie. The dog is absolutely beautiful, and I fell in love with her. Highly recommended!",
    "date": "2025-05-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The movie works for the whole family.  Very worth watching.  The definition of Pit Bull seems to be universally confused.  Bella looked to me like a Pit Bull crossed with something else, which would fit the story line.  I like that there were credits given to the canine actors.",
    "date": "2025-04-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "No spoilers\n\nThe scenes where it was just Bella or Bella and big kitten were very good. Impressive composition and scenes involving no CGI (save for big kitten, who looked oooh kaaaaay,) the dog was the best actor in the show. The problem came from the humans, it felt like a Disney channel movie when they were on screen. The final act felt sudden and rushed, bad pacing like a lot was cut out. Also, no explanation on how she traveled 400 miles suddenly. It could have been better, but it was ok. The CGI was a little cringe worthy, especially in the first 10 mins being able to see the line around cgi puppy Bella, and the scene where she grows up made me laugh out loud from how stupid it looked. Still cried the whole time. I love you Bella 😭😭",
    "date": "2025-04-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "lots of obvious CGI.",
    "date": "2025-04-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Just a great dog movie. 5/5 Stars.",
    "date": "2025-03-19"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Me encanto la película",
    "date": "2025-03-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A heartfelt tale from the perspective of a dog.",
    "date": "2025-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved the movie i cried soo hard it was sad but sooo good it is my new favorite movie it just is the best thing I have ever seen",
    "date": "2024-12-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The Dogs Purpose is wonderful  but this movie was FANTASTIC.  I LOVE THE DOG!! The plot and interactions with both animal and human are very empathetic and causes raw emotion to stream from your eyes and heart. I fell in love with this sweet film. THE BEST!!!",
    "date": "2024-12-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This movie was an overall really great watch!! It was super action packed, really touching and super sweet!! i loved every minute of it! i will say it’s a little unrealistic and kinda corny, but i still love it and would like to imagine the story is real! Not anything crazy good but definitely a solid watch !!",
    "date": "2024-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A good slasher movie",
    "date": "2024-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It was a pretty good movie. I really enjoyed it many years ago. Letter Grade: C",
    "date": "2024-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "HATED THIS MOVIE!! made me sob and cry throughout the whole movie!! jokes aside, the movie is pretty good, would recommend",
    "date": "2024-02-10"
  }
]