[
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Made for streaming level attempt at world building on forgotten ip about 5 years too late. Skip unless you get excited about chick's fighting with swords.",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie absolutely dumped on the first one, it's like adding magic, demons, changelings, angels, monsters to fast and furious, it would absolutely diminish the movie & dump on the previous ones, it would also stop any future films from being produced because they'd have to follow in these footsteps to do another film, it would destroy the public's view & trust of the films, it wouldn't be worth it to continuing the saga, so, they did dump on it and destroy any chance of any future films from being produced.",
    "date": "2025-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Watched it for Anna cause I loved her YT channel and was excited to see her act but this was not the role for her. She is not an action star. Storyline sucked. The era shift was a bad call. Magic wasn’t everywhere in the first movie but this one had just enough shitty sfx to give the illusion of being in the same world but still fails at it somehow. A lot of the characters were written extremely horribly and mostly all characters are unlikable. Forced myself through half the movie and then tapped out. Also the costume for Anna made her looked bowlegged and the fact that they gave her knee pads through the whole movie only highlighted that and it bothered me deeply lol. Fire the costume dept",
    "date": "2025-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I'm giving half a star because i can't give less than that the protagonist the punk stupid girl is so annoying one of the worst movies ever just horrible",
    "date": "2025-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "A try hard revival of an epic movie. Cinematography and visual effects were lousy as well as the acting of the young bloods. Storyline was focused on just killing but not as well executed as John Wick. I get that it was taking into consideration the modern setting but they should have let the 47 Ronin a classic as it is. Just got through the movie for the sake of the latter",
    "date": "2023-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I quite enjoyed it.  B movie for sure with too many sword fights but it was fun, the acting was quite good,  you liked the characters,  and felt good at the end.  Worth a watch.",
    "date": "2023-05-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Made for tv schlock. This movie is horrible.",
    "date": "2023-02-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Watched it coz Anna Akana, whom I admire as a person but whose character has cheesy lines and bad attitude. Nothing at all to like about this movie.",
    "date": "2022-12-06"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This was one of the most amateurish movies I have seen in years. It tried to be witty and failed. The last descendant was a terrible actress. I watched the first third and finally had to turn it off.",
    "date": "2022-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "one of the best sword fights in movies",
    "date": "2022-11-06"
  }
]