[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was a great movie from start to finish, it has one of the greatest scenes ever in cinema which is Lance Corporal Schofield running through the battlefield to delivering the message to stop the battle, it’s truly heart pounding to see movies like this, you can’t beat it, this is definitely one of the greatest Dreamworks films ever made.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Cinematography and music are amazing but overall not quite what I expected.",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the best war movies ever made. I've watched this movie probably 20 times now and it never ceases to amaze me. This is one of the most important movies of our generation and I think everyone should watch it.",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Moved me to tears. Wow. Got me. Powerful, immersive and compelling.",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Had no idea what to expect from this movie going in....was shocked and moved to tears during multiple scenes. Im not a filmmaker but noticed that there were lots of scenes that didn't seem to have cuts (like Birdman).  And it made you feel like you were right there with the characters as things unfolded. Specifically the farm scene... Omg!",
    "date": "2025-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "My favorite film. Had to rate it and review. A nonstop edge of your seat tour of war from a unique point of view perspective. Gut wrenching and beautiful. This is cinema!",
    "date": "2025-10-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Having just watched DUNKIRK, this is a better War film\n\nAfter watching Dunkirk about a month ago, after reading \"The Great War and Modern Memory\", I must say this far succeeds Dunkirk as far as realistic portrayals of the actual daily life of World War I. Yes, it was daily life for hundreds of thousands of British and French people fighting the authoritarian German government. Like today's America, the country of Germany was swayed and rocked by authoritarian rulers. This movie hit home as scary, for these reasons. Trench warfare; going from trench to trench, is a big part of this one-shot film that was directed with skill by Sam Mendes of American Beauty. The problem with the one-shot is that it minimizes the struggles that were seemingly endless, rather than capsulated. Where the film said that the characters traveled 11 miles, it looked more like a mile and half in real life (as a trained cross-country runner, I'm very good with distances). The surrealness of the film weighed it down. However, the realistic aspect did actually outweigh it. The fact that generals for Britain often exaggerated their battalions'' abilities and sent them to die was exonerated by the fact that in this movie, the general undermines the colonels. However, like in real life, the colonels would often say to themselves \"We're losing a battle, and should retreat\". This movie was moving and brilliant. Like great epics of the past, it focuses on singular moments that inspire awe from the audience. So, while Dunkirk's high flying aviation battles are a must-see, I highly recommend 1917 as the superior film.",
    "date": "2025-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great historical film.",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Unbelievable movie!!",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "One of the best ww1 movies i ever watched!",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Good visuals but boring story",
    "date": "2025-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Forse il meglio di Sam Mandes. Regia ottima accompagnata da un'altrettanto eccellente fotografia. Questo film vanta di interpretazioni eccezionali e dialoghi scritti con attenzione. Tralasciando il dolore della guerra che prova il protagonista, è forse un po' piatto moralmente.",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Yessssssssssssssssssssss",
    "date": "2025-07-18"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "FIRE MOVIE, I really like how it’s shot to look like it’s one continuous shot with NO cuts.\nAMAZING",
    "date": "2025-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Excellent movie! Shot in a super cool way and themes hit hard.",
    "date": "2025-07-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Well worth a look if you like war and/or WWI era stuff. The jaded lieutenant at the front scene is cinema magic",
    "date": "2025-06-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "me sigue impresionando el film con esa cámara que acompaña al protagonista es cine🥹📽️",
    "date": "2025-06-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A masterpiece. This goes into my top 15",
    "date": "2025-06-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "One of the best War movies of all time! Both this, and Saving Private Ryan are just fantastic War movies that I never get tired of. I am amazed on the cinematography in this movie. Every camera shot is just magnificent!",
    "date": "2025-06-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "1917 It is a war drama about two friends who have to go on a risky mission to deliver a message before the war begins....This film is brilliant in every sense, script, direction and acting.",
    "date": "2025-06-02"
  }
]