[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Bastante inapropiada, cochina, no tiene sentido común, en exceso tonta, da pena que algo así sea creado",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Goated stacked cast funny asf",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I firmly believe alll these idiots dont understand what a fun excitimg amd fummy movie this truly is i hope u all watch this amazing movie ana have a laugh.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Grown Ups has an amazing cast and funny moments which make this one of my favorite Sandler movies.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It is a perfect family movie with adult humour and plenty of humour for the kids so if you're looking for a movie to watch would really recommend it",
    "date": "2025-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Rewatched with my family over a hundred times easily",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Not funny and lame there are attractive people in it",
    "date": "2025-09-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I swear these critics are so dumb",
    "date": "2025-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Lots of laughs and lots of heart.",
    "date": "2025-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Absolutely loved this film, got lots of laughs out of it. It’s my comfort film!",
    "date": "2025-09-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Super funny if you like comedy you would love it",
    "date": "2025-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Not a cinematic masterpiece, but a hilariously fun film with a loveable cast and some good old slapstick humor. It's one of those movies you can watch over and over again.",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I actually like Grown Ups, yes some of the jokes are very crass and tasteless and there is a lot man child syndrome in the film, which is why I can relate. Yet clearly all the cast are having fun, some of the jokes do land better than others. The arrow roulette scene did raise a laugh as did the joke about old televisions.\n\nOverall it was amiable with enough jokes which weren't tasteless to get by sure it's low brow humour but sometimes that's all you need.",
    "date": "2025-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love these movies as it dosnt care about the haters and ends up with a amazing family comedy with jokes even adults will laugh it I wish they made a third",
    "date": "2025-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Adam Sandler, Kevin James, Chris Rock, David Spade, and Rob Schneider absolutely kill it in Grown Ups. Love it!",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "An amazing movie with many great messages and comedy.",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Such a great cast but such an awful movie.  There is nothing funny about it.  It's like the movie was intended to be terrible and that was the joke.  More like a prank, they got me to waste 2 hours of my life watching this.  Ha ha they got me.",
    "date": "2025-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Fun for the whole family",
    "date": "2025-08-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great summer movie. Just have fun and ignore negativity towards this film",
    "date": "2025-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Not bad! Sandler and James makes a good combo",
    "date": "2025-08-01"
  }
]