[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A frustrating level of mediocrity. The only redeeming part of this movie is the soundtrack",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The depth of personality you see and the character building is great. If anything, has the perfect balance of story and feeling with action. Michael Bay movies had about 80% action and less story….this director actually knows what he is doing with the Transformers franchise",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "After being a Transformers fan…this could be the worst movie I’ve ever seen sadly.",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Boring sometimes and the characters weren’t all that enjoyable except bumblebee and Optimus.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It was okay nothing amazing for transformers but that’s been an expectation for years now I think it’s probably one of the best even though it’s not that good too.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Missed potential. Could've been great, but turned out pretty flat and boring. It's really feels just another addition to the trash Bay-verse. Well, maybe the only difference is that it feels like they tried to make something decent, unlike Bay.",
    "date": "2025-11-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I really enjoyed this movie. It was fun and well done.",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Good seeing the optimals!",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This is so lame! Say what you want about the bay films. At least those had a soul. This movie is so corporate, unoriginal, and uninteresting.",
    "date": "2025-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "All the final battle needed was “Like A Prayer” in the background, THEN it would have 5 stars.",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "wtf is this corny ahh movie, when I was a kid I grew up with baddass transformers, way better detail looked sick af. Now they look so blocky and so weak. And the actors are okay just their voice lines are so cringe. I don’t know how the cgi’s gotten worse from 2007 but put more time into making watchable movies! Please bring back the og transformer movies. Get Shia leaubouf back",
    "date": "2025-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Certainly boring with characters that has no substance and the average cannot relate to. As usual, the autobots appear to be a helpless weak group of robots.",
    "date": "2025-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Horrible movie. Only value it has is good special effects. Storyline is horrible, acting is sub par and the most cheesy movie lines. \n\nDont you just hate when a two bit director comes in and messes up an entire movie franchise? Thats exactly what you get here. I don’t recommend watching.",
    "date": "2025-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Transformers rise of the beast is a thrilling, nostalgic new chapter for the franchise one that includes fan favorites beast war characters while delivering the explosive robot action fans expect. With Anthony Ramos’s grounded lead performance, slick visuals, and a strong mix of old and new, it’s one of the stronger entries in the series despite uneven pacing. A fun, crowd-pleasing blockbuster that keeps the Transformers saga rolling forward.",
    "date": "2025-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The CGI in the original transformers is better and that’s saying a lot. This feels like a budget sequel to appease 11 year old kids. I miss the old transformers movies with  their epic car to bot transformations and epic detail. To be honest, Optimus and bumble bee don’t even look the same as the old ones. Flat movie, but yeah we gonna watch it anyway to stay up to date I guess :/",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Totally awful script and boring dialogue. Totally missed Optimus Prime's grandness that fully stands out in the comics and in the past movies",
    "date": "2025-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I think their budget went towards CGI instead of acting. Terrible.",
    "date": "2025-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This movie was really fun to watch. The CGI for the Transformers was not as good as Michael Bay's movies (which is tragic to me, seeing as this film came out years after), but the visuals were still really good. Peter Cullen once again gave us an outstanding performance as Optimus Prime, and the Maximals are some of the best looking characters I've seen in the Transformers movies. Unicron is my favorite Transformers villain, and I think the movie did an amazing job portraying how menacing he is. I definitely recommend it for sci-fi and action fans, and of course for fans of the Transformers franchise!",
    "date": "2025-08-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Cheesy, fake, and way too rushed. Nothing feels real or grounded, the plot moves so fast there’s no time to care, and it’s just a mess of bad writing and CGI. One of the worst movies I’ve seen in this series.",
    "date": "2025-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "To be completely honest, The movie seemed sociopolitically motivated which I believe is just not what anyone was looking for in a transformers movie. In addition, the introduction of Gi.Joe was completely unnecessary, and not what I think anyone was looking for. Not to mention that it seems to really contradict the plot of the earlier transformer movies that take place (chronologically) before this one.",
    "date": "2025-08-26"
  }
]