[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This movie? Nah. Everybody in here making terrible choices and acting confused when it backfires. \n\nHandle that on your own time.\n\nAlso Brandy pulled up in the end, but she should’ve stayed home. Like fam, don’t connect with these people. Make other plans for the summer.\n\nOne star. Keep it pushing.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It's watchable, A bit of a cross between Friday the 13th and Final Destination.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Ok so I had iffy feelings on watching this. Decided to watch it tonight. I was hopeful it was going to be decent, loved Sarah Michelle geller part. But the twist at the end just ruined the whole movie for me.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Nostalgia was good but not good enough to drag along the new story.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Good mixture of old generation and new generation. Follows same plot.",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Danicas face pissed me off the whole time, the lip pout is definitely unfavorable, its like a child trying to get their way. The fact she did not die had me somewhat in a spiral considering the fact that the killer didnt have any problem killing innocents who werent even involved. She also cuddled up with her friend after her husband just died. The fact ray’s character was ruined at the end after he was portrayed to be someone who cares about people’s emotions was also crazy. Netflix having this locked as if it’s anything to upgrade your subscription about is insane too. Poor quality and low thought went into this movie I feel.",
    "date": "2025-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Full of awful dialogue and writting. The main characters are brain-dead and cant be taken seriously at all. The horror and suspense is predictable, and the end scenes are pathetic much like the actual plot that is a slap in the face to the original.\n\nshould never have been made really.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Terrible! Fascinating how they could do a remake that bad! impressive",
    "date": "2025-11-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Some movies are just meant to be left alone this was for sure one the deaths were kinda cool but the story  was all over the place also not a fan of them turning a hero into a villain…the actions  scenes were kinda bad movie was just mid never got over the hump destroyed a good series",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "If you saw the original in the 90s, you will hate the everything about the reveal. If you know nothing about the original, you probably won’t mind this movie.",
    "date": "2025-11-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "DER WASSERMANN IST IM PLUTO AN DER SPRITZBAR\n\nVor einem Jahr haben Danica und ihre Freunde einen Mann zum Sterben liegen lassen. Heute, auf ihrer Verlobungsfeier, landet ein Brief in ihrem Schoß, \"Ich weiß, was du letzten Sommer getan hast\". Die Runde reagiert darauf mit absoluter Überzeugung, „Wow, creepy – lass uns das ignorieren.\" Bis der erste stirbt. Ups.\n\nIch weiß, was du letzten Sommer getan hast (2025) geht ca. 110 Minuten und ist ab 16 Jahren freigegeben. Wir bekommen die altbekannte Story, nur diesmal mit Dumm und Dümmer Figuren, die so unbegreiflich dämlich handeln, dass man wirklich glaubt, die hätten ihren Schulabschluss in einer Grabbelkiste gefunden.\nDie Handlung ist die gleiche wie immer, nur ohne Spannung, ohne Kreativität und ohne irgendwas, das wie ein Gehirn aussieht. Statt gruseliger Kills bekommt man Slapstick Dummheit am laufenden Band.\nWirklich, man könnte meinen, man sieht Figuren die sich alle ein und die selbe Gehirnzelle teilen.\nDie Figuren laufen gemütlich vor dem Killer weg, gehen nachts alleine raus, statt drinnen die Tür abzuschließen und lassen ihn entkommen, wenn er am Boden liegt, samt Messer. Pro dummer Entscheidung ein Shot, man wäre nach 20 Minuten klinisch tot.\nDer Killer selbst kann wahlweise stampfen wie ein Wasserbüffel oder sich lautlos teleportieren. Je nachdem, was der Plot gerade braucht.\nDas Finale ist dann die absolute Krönung, die Enthüllung ergibt keinen Sinn, ist an den Haaren herbeigezogen und so unwürdig, dass man fast Mitleid mit dem Drehbuch bekommt. Kaum zu glauben das jemand bezahlt wird sowas zu schreiben.\nUnterm Strich bleibt ein Werk ohne Horror, ohne gute Kills und mit Figuren, die man von Minute eins an eigenhändig erwürgen möchte wenn sie den Mund auf machen.\n\n2/10 Punkten. Wer bitte benutzt eine Badebombe, die aussieht wie ein Periodenbecken? Genau. Diese Leute.",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Doesn`t hold a candle to the original (which is not saying much). A couple of good scenes, but a waste of potensial. \nThe script and the direction is the real problem (and Freddy Prinz jr who can`t act is way out of a paper bag). The twist is silly as f. \nJust watch the chase scene with Sarah Michelle Gellar in the original instead.",
    "date": "2025-11-18"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "As a die hard fan of the original IKWYDLS and the sequel, I was excited to see this because it seemed promising! While I appreciate this film going back to the films roots, following suit with some of the kill styles, and homages to the Croaker Queen... it overall was a disappointment. The new characters were not likeable, and they also ruined Jennifer Love Hewitt and Freddy Prinze Jr characters and felt completely wrong for the ending. You can't make a hero character suddenly go villain just because you're out of ideas. I wish Hollywood would either stop reboots or stop adding the original cast and ruining it for the fans.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Just.. why?..........",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Really bad writing. Most of the movie made no sense. The whole movie seemed to be about girl power and not an actual plot. I loved seeing the old actors return though. The new actresses were annoying, unattractive, and lacked any acting talent.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I wanted to like it. Such a disappointing ending. Completely out of character. Uncreative writing.",
    "date": "2025-11-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I was super excited to see this movie, especially with Madelyn Cline being in the movie. I was super into it at first, especially with the original characters being in the movie. However, once the podcaster got killed and said \"Its you\" I knew it had to be one of the original characters. I was HOPING it was not Ray as I was team Ray & Julie from the original. Well, I was at first not disappointed that it was Stevie, however it clicked when Ava said \"I don't know how she did it all herself.\" Then, I got very sad and knew it had to be Ray due to their connection. I did not like how easily they exposed Stevie on the boat, considering in the original it took FOREVER to show the killer whereas this one she literally just took off the hat. UGH. Then I HATED the excuse that Ray had for why he did it. Especially since in the original he was NOT about the fame or anything to do with the killings, especially after what he lost. However, Jennifer Love Hewitt KILLED IT! Love her and she hasn't aged! BUT, they did loop it back around and leave it at a good cliffhanger.",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Shoulda never made it",
    "date": "2025-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The acting was mediocre, could tell Freddy hadn't been in a big role for a while, maybe it was my TV but the make up on some of them was drastic and made them all look like they were already dead. Sarah was awesome tho, she looked good, delivered her limes good. Jennifer was also not cringe worthy. Over all it just didn't feel like the product we should have gotten after all the hype that went into it.",
    "date": "2025-11-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Great if you’re a fan of the franchise. It pays homage to the original with plenty of nods. Unfortunately, it doesn’t quite deliver as expected, with weak performances and a predictable plot. Still, a fun watch overall.",
    "date": "2025-11-10"
  }
]