[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very good. Very well filmed. Touching. Heart goes out to the families.",
    "date": "2025-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Visually stunning, this film is equal teaser for the majesty and beautiful of nature, and a warning against taking the destructive power of nature too lightly. \n\nI am both jealous of those who got to visit such a grand and volatile location on Earth, and feel for those who took what they felt was a 'safe' cruise excursion and ended up losing their lives or getting horribly burned. \n\nIn the end, as with all tales like these, it makes you appreciate what you have, take stock in your life and what it is worth to you, and marvel at the willingness of most people to reach out to those in dire need of help.",
    "date": "2025-03-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "When several groups of tourists head out on an excursion to a volcanic island off the coast of New Zealand, they never take into consideration the possibility that their questionable judgement is going to come face-to-face with horrifically bad timing.  The Volcano: Rescue From Whakaree is a terrifying documentary of unimaginable circumstances, a harrowing story of survival and heroism, presented primarily through cellphone footage shot by the victims of the catastrophe as it happened.  With plenty of remarkable footage and some compelling personal stories, The Volcano is a memorable and impactful viewing experience.  The music score does get a bit tiresome at times, but that’s a minor complaint about an otherwise solid documentary.",
    "date": "2024-05-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Great story, beautifully shot, just poorly produced. The background music is overwhelming to the point of muting the participants voices. I ended up having to use subtitles to get around the swelling orchestra. And, so unnecessary because this story is dramatic enough.",
    "date": "2024-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "If you want to watch a truly terrifying documentary this year then let me recommend 'The Volcano: Rescue From Whakaari'.\n\nSYNOPSIS: 'During a sightseeing trip to a remote island, 47 tourists and guides are trapped by a volcanic eruption off the coast of New Zealand in 2019. Minute-by-minute footage and personal accounts give testimony to the tragedy that will claim 22 lives.'\n\nWhat makes this so scary is the amount of 1st person footage there is and how we watch people reacting to an experience which will change their lives for ever. And for some it'll end their lives or leave scars, both physical and mental, which there is no recovering from.\n\nIt's harrowing at times as the awe of nature's wonders turns into mortal terror. How do escape the inescapable? How do you face your own mortality in that moment?\n\nIt's a tremendously powerful documentary but it should come with a warning as some of the scenes you witness and hear are not for the faint of heart. Those who survived suffered the most terrible of injuries.\n\nTragic and terrifying.\n\n8/10",
    "date": "2023-05-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "As \"The Volcano: Rescue From Whakaari\" (2022 release; 98 min) opens, we are introduced to a small community on the North Island of New Zealand. Thirty miles off the coast lies Whakaari, or \"White Island\", one of the most active volcanoes in the world, and a popular tourist attraction. It is \"December 9, 2019\" as tourists arrive on the island... At this point we are less than 10 min into the movie.\n\nCouple of comments: this is the latest documentary from director Rory Kennedy, who just earlier this year made the excellent \"Downfall: The Case Against Boeing\". Here she reflects on that fateful day in December, 2019, when a group of tourists visiting Whakaari find themselves trapped when the volcano erupts. Let me admit up front that I had not heard of this tragedy before seeing this. A couple of things struck: first and foremost, the beauty of that island (someone remarks \"it's like landing on the moon\"), resulting in absolutely stunning photography (and immediately wanting to add this island to my \"bucket list\" of places to visit). But also this: there is a reason why the island is called \"the most active volcano in the world\", as this type of eruption apparently happens with regularity (as in: also in 2016, also in 2013, etc.). It is telling that after the 2019 eruption, the island was closed permanently to visitors, Along the way, we get lots of talking heads, including tourists who survived, first responders, etc.\n\n\"The Volcano: Rescue From Whakaari\" had a brief US theatrical release, and then started streaming on Netflix, where I caught it. In and of itself there is nothing \"revolutionary\" about this disaster documentary, but watching the footage of this far flung location, literally at the end of the world, makes this worthwhile. Of course don't take my word for it, so I readily encourage you to check it out and draw your own conclusion.",
    "date": "2023-02-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "A bunch of people travel to an ACTIVE volcano and then are amazed that such things erupt. The result is not good and sad, but the fact they ventured onto this ticking time bomb is an exercise in bad judgement, not drama. Hard pass.",
    "date": "2023-02-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very good watch, very moving, with the exception of the Maori leader - his plugs were self indulgent and added nothing to the documentary other than to sign as the obligatory iwi pay-out had occurred.",
    "date": "2023-01-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Touching and hard to grasp. Very emotional reports and shocking footage.",
    "date": "2023-01-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Something beautiful and terrible…and you can’t take your eyes away from it. A truly remarkable & intense story.",
    "date": "2023-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Compelling story of rescue and loss after the 2019 volcanic eruption of Whakaari off the coast of New Zealand.",
    "date": "2022-12-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Interesting to see a tragedy of this magnitude from the direct victims and with audiovisual support of the hisotira, good narrative and not based solely on the pain or loss of the victims but more on what it means to have such a dangerous tourist attraction open to the public and without the least security measures.",
    "date": "2022-12-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Spoilers: I'm a retired newsman so like the justdafacksmam approach. And the production was well done in sound, cinematography, scenery, including the island and volcano, narration and editing to bring all the threads together. Since no one said, there are lawsuits pending",
    "date": "2022-12-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This documentary was really good. The entire crew did an excellent job on this documentary. This true story about the Whakaari volcano erupting while tourists were on the island was dramatic, intense, and tragic. It's about fighting to survive and hoping you make it out alive. If you're a Netflix member, you should watch this documentary sometime. It's a must see.",
    "date": "2022-12-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I'm not crying.... you're crying.\n\nSuch a horrific tragedy that happened. \n\nThe bravery of the survivors , pilots, boat captions will touch your heart.",
    "date": "2022-12-19"
  }
]