[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Considero la 2a parte de la saga no es tan emocionante como la primera ya que la sopresa de de la trama se develó en la 1a parte, pero pienso que al dejar el desenlace para la 3a parte, atrapa al cineasta para querer ver la 3a parte muy pronto",
    "date": "2025-11-23"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "This is clickbait and does not have an ending. Don't waste your time.",
    "date": "2025-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Having watched the first movie, I was looking forward to the sequel.\nIt did not disappoint. Great characters and lots of action.\nNeed number 3 now. Hurry up.",
    "date": "2025-11-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Loved the first film, waited years, excitedly told friends the second was coming out, then - crushing disappointment.",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thought it was a brilliant sequel and was a shame to see bad reviews. It deserves an immense amount of credit and I’d say it is almost equal to the first! If anything I loved the 2nd more due to the amount of epic intense and engaging fight scenes that 2nd one has! It adds perfect drama to set up for the 3rd (hopeful) movie. I think the plot was well done- despite other people’s criticisms- because it perfectly added Qwyn which was a great character to add and introduced another key villain to beat later on. Each event was also perfectly designed like the nuclear reactor being a trap to lure and capture the immortals. Quite honestly I never write any reviews but it kills to see negativity despite an outstanding first and second film! Great actors, great plot- and an understandable, sequential build and 2 great films so far! Credit to the hard work put in and I really hope that it gets the 3rd movie it deserves! We all need an ending!",
    "date": "2025-10-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Awaiting the next Movie 😆",
    "date": "2025-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Entertainment is what it's not here, being just another forgettable and irritating thing in the Netflix catalog, ending all the charisma that this franchise had in the first film, making us hope that \"the old guard\" in its second time, retires for good.",
    "date": "2025-10-20"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "May be the most ridiculous inane drivel I've ever had the misfortune of wasting an hour on",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The most dreadful diatripe. Why do I not check rotten tomatoes before watching movies.",
    "date": "2025-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A God awful jumbled mess. The perfume gig must have run out.",
    "date": "2025-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Didn’t make it payments the first ten minutes.",
    "date": "2025-10-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Whoever thought violent action sequences could be so tedious.  Contrived plot as a weak framework for a serious of violent, but silly, scenes.",
    "date": "2025-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The first movie was good the sequel was boring and I could not finish it.",
    "date": "2025-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Felt like they didn't care about this sequel. A waste of good actors and a flimsy script based on passing their immortality around.",
    "date": "2025-09-26"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Bad script. Even for an action film. Bad acting because of it. Even from good actors. Nothing to carry the performances. No character development.  \nOverall a very disappointing sequel. Shame.",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Old guard 2 was okay. I expected more because I did throughly enjoy the first movie. However, I found myself pausing and  re-watching certain scenes because I was not paying attention. The action is really good but the plot was a little mediocre. If you need something to put on , I would recommend this watch.",
    "date": "2025-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I was pretty bummed at the reviews. I almost didn't watch it but really glad I did. I've seen soooo many crap movies the last few years (that have gotten way better reviews) so this isn't fair. I liked this one a lot. I loved the first one more but still enjoyed myself. Charlize is more relatable in the one. I'm thinking the story line will be explained in the third one because there were holes but the reviews definitely don't give it the credit it deserves.",
    "date": "2025-09-10"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Story does moves forward from 1st part, loved it .. wating for next part",
    "date": "2025-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "It seemed very good, a lot of action, the plot held at suspense for all the time, final surprises, a good movie I wait for the third part of the saga.",
    "date": "2025-09-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "What a disappointment from an original source so rich with backstory and exposition. As good and rip-roaring the first offering was this sequel only served to make me long for its quality \n\nIf 3 comes in rapid fashion delving into the subjects Brierly touched on here I'll reconsider this as they needed three hours to give the viewer a greater understanding of why",
    "date": "2025-09-05"
  }
]