[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I really don’t understand the critics and I don’t really care. I never read a review before I watch something. This film if very emotional and heartbreaking. I loved the narrative and the shocing twist of events. I highly recommend it. RT 17% vs audience score of 87% that is all you need to support my review and to enjoy a beautiful film.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Started off slow and unsure of the story line. The ending and knowing the story had me in tears.",
    "date": "2025-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Bad dont like thats all i have to say",
    "date": "2025-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Worst movie ever. Tearjerker. the description on the movie doesn't come close to what it's actually about. Follows two different stories with twists and turns. It also seems like it's a rom com but it's far from it. And it's basically a set up to be an organ donor.",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is one of my favorite movies. I love how it was structured and think the acting was excellent. I saw it twice. It is sad but it does have a happy ending. It's a sleeper hit on Netflix.",
    "date": "2025-02-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a true story which made it so much sadder. I loved it . What is Rotten Tomatoes thinking? I will never listen to them again. It was so heart warming and so heart breaking . I would have added more st the ending but I always think that. Beautiful story. Must see",
    "date": "2025-02-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I initially thought what a nice funny romantic movie. I initially thought Jorge would be the one passing away. \n  I could see life as a young man in Chris having fun with your buddies and brother’s being the jokester. Later having the Steve’s of your Father wanting for you to do better in the interest of you being able to support yourself later in life. \nI enjoyed seeing both Jorge and Chris falling in Love and building their relationships. \n  I was blind sided by the real results which brought me to weep as I thought what if something this tragic ever happened to my boy’s. \n  This movie definitely reopens the Thanks we should give to God for this shot period of time we have here with each other. To be able to Love our spouses, kids, and friends as if tomorrow is not promised. \n   Geez, this movie was hard to watch…painful at the same time Beautiful 🙏🏼🙏🏼🙏🏼 Thank You God for everything, my wife, my Family and this time here on earth.",
    "date": "2025-02-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Absolutely the worst acting I have ever witnessed.",
    "date": "2025-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "What if I started this review telling you how I liked the main characters in this movie. How they were likable and easy on the eyes.\nBut then jumped to the Gabriel House in Jacksonville, and how it was created by the real-life Jorge Bacardi after he received life-saving surgery?\nYou'd probably get annoyed because you'd wonder what one story has to do with the other. \n2 HEARTS is a lot like that: 2 seemingly unrelated stories that jump back and forth without any reason as to why they're connected. Is she the daughter of Jorge who's now in college? Is he the illegitimate son of the Bacardi fortune. Did they get killed by Jorge's limo?\nThe ending will probably cause lots of tears... that is if you get to it. And it's there that you'll learn why the writers & director are telling you these vacuous romantic tales. \nFor me, the ends didn't justify the means. This is poor storytelling with underdeveloped characters, no goals/motivations/desires explored and I'll be d@mned if I could ever find a theme because, well, the characters have no arc. \nI don't know if the story is more powerful if you know the real true story behind the movie's inspiration. I didn't until the end and I still find this story unsatisfying. Just because it's base on a true story doesn't mean that you can be boring. Not really worth your time.",
    "date": "2024-12-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Amazing feel good movie about the importance of being selfless and loving unselfishly. Chris transcended life and   His portrayal was moving. Brilliantly made and create jerker - love the roles performed by all. Not a dry eye here ! Thanks for making a brilliant movie",
    "date": "2024-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it! Very emotional at times so it must be seen without any distractions. Very nice movie",
    "date": "2024-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This movie appears in its beginnings to be a lightweight nearly Hallmark style romcom, until it takes a serious turn in its final third, and this third act redeems the project. And at its conclusion, it makes a compelling and useful statement. The directing and script are is choppy but the movie has, per its title, plenty of heart.",
    "date": "2024-05-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Quando anche una storia vera non basta a rendere un film guardabile.\nInterpretazioni veramente scadenti ed esagerate in ogni espressione, aiutate nel disastro da una regia che crea qualcosa di molto vicino ad una soap opera anni '90.\nAnche la sceneggiatura è piena di banalità e di luoghi comuni, la costruzione dei personaggi tende a renderli piuttosto antipatici; specialmente il giovane protagonista.\nUltimo ma non meno importante, il doppio finale è un trucco utilizzato troppe volte, la maggior parte delle quali a sproposito; questa è una di quelle.\nAlcune sequenze sono veramente imbarazzanti.",
    "date": "2023-12-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "This is a heartfelt movie that touches on all the things you'd ever want it to. I also helped make it...",
    "date": "2023-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "No originality, no authenticity. Just rotten.",
    "date": "2023-07-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Really bad. Starts as another boring american college teenager movie with a side boring romance. But 40 minutes to the end manages to get worse. I felt I was on a 15th century ship stuck with no wind in the middle of the ocean. Neverending torture.",
    "date": "2023-07-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Bad movie, no script and no sense.",
    "date": "2023-06-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "What a beautiful film, congratulations to Jacob Elordi as always charismatic and a great actor since his last works A Barraca do Beijo and Euphoria, who gives himself to each character, this film has the vibe of The Fault in Our Stars and How I was before you , you know the end of the story but you care so much about the characters who take you on an emotional and captivating journey , every moment makes it worthwhile and for every sentence that makes you reflect on life .",
    "date": "2023-05-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Just carry a flipping donor card or I will make you sit through this film. You have been warned.",
    "date": "2023-05-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "At first I thought it was just another movie, but it wasn't, I get from the depths of my incredible feelings, knowing that they all exist and that it is a true story was even more emotional and significant. Yes I recommend it James Welch Henderson Arkansas Feb. 1/ 2023",
    "date": "2023-02-02"
  }
]