[
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "A very well made documentary.  My heart aches for Kerri . I cannot even imagine what she has been thru. A terrible horrible situation fir everyone involved.  I hope she stays strong.  My thoughts are with her and if course the vutcims families .",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A solid and interesting documentary with a rather unique perspective.",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Pretty boring not impressed",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This Netflix documentary is all about her.  It is a nothingburger. \n\nThis probably appeals to a certain demographic, but it is essentially about BTK's whiney daughter.  Very boring. She's trying to make a living off of his story.  She's looks exactly like him and seems to be a narcissist.  Just go away Kerri.",
    "date": "2025-10-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Really enjoyed this. Whilst I often moan about the length of some series’s, I could’ve easily have done with this being longer in series format.",
    "date": "2025-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It comes from such a vulnerable place with a daughter talking about what her father has done and how awful all of it was but it was put together great it always makes me sad when you get the other side of a crime or serial killers but I'm just glad she didn't let it ruin her life",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The daughter needs to get over it.. she wasn’t the victim… RIP the actual victims of BTK",
    "date": "2025-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This crime documentary was great. The entire crew did a great job on telling the story about the BTK killer and how his daughter feels about who he really was. It was very dramatic, shocking, and sad. If you haven't seen this documentary yet, check it out sometime. It's worth watching.",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A sober, daughter-centric retelling that lands a few powerful moments but doesn’t uncover much new. Skye Borgman’s pacing and archival work are solid, and Kerri Rawson’s perspective gives it heart. If you want emotional fallout over fresh facts, it’s worth a watch. Otherwise, it’s fine, not essential.",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Disappointed in this, no new ground covered or really even a decent interview with his daughter.  I suppose if you knew nothing about BTK it does cover the basics but that's about it. \nWhy is she estranged from her mother?\ndoes she speak to her brother?\nThey hinted at more discoveries with her help all through the doc but it was just nothing.",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "this show should really be called “BTK’s Daughter: Attention Seeker”.  it primarily just focuses on her talking about how her life is a “lie” and how she’s angry at people who tried to make a spectacle of her fathers crimes, all while she gives interviews and writes books doing the same thing",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This was really well done. A sensitive portrayal of a person that's a victim in her own right, just trying to process and figure out how to move forward with a sense of self. Like many people with unhealthy family dynamics, a parent with secrets, and parents with mental illness, this shows someone coming to terms with who they are despite the person who she grew up with, and who she thought he was. It's unimaginable what it's like to live with that, but on a national scale, geez. I like that the victims families are also acknowledged, even if they didn't participate. \n\nWhen that neighbor yelled at her saying she doesn't have to go through this on a daily basis, was such an ignorant statement. I'm sure it's hard to live there, but she can move away and have no further association. No matter where Raders' family moves they are still his family, this affects every part of their lives, and will affect their children as well.",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "BTK is always intriguing to me. I moved away from Wichita when the murders started. There’s many documentaries about this and there’s always a bit more to learn. It’s a good synopsis and that poor daughter brings some insight.",
    "date": "2025-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Boring and unnecessary. I am really sorry for the daughter from the bottom of my heart and it’s not her fault, that this so called documentary is such a waste of time.",
    "date": "2025-10-10"
  }
]