[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Excellent! This is prime example of how profits trump safety. Very informative. They should do one on PG&E next.",
    "date": "2024-03-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie. This documentary exhibits the evils of profit over humanity. What a shame that Boeing's common sense culture of safety first, with their employees' ability to have a voice in that culture ... was overtaken by McDonnell Douglas' reckless windbags who valued greed over human lives. Those two crashes didn't just kill all the passengers and devastate their families. You can bet the rushed, obnoxious workplace atmosphere that overtook Boeing's factories deeply affected their more conscientious employees. Mind blowing that the final graphics of the movie showed Boeing still trying to deflect blame long after the Congressional hearings had come and gone. Narcissism at its best!",
    "date": "2024-02-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "this was really well made and really good to watch, love it",
    "date": "2024-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "One can document a disaster in many ways. Machinery, Workers or basic procedures but not every time the ugly side of large cooperates gets exposed. Downfall gives a precise idea about what's broken about the never ending chase behind capital or profits. This doc is a slap on the face of most multinational companies who tries to do more with less and end up making irreversible messes. In a world where systematic greed has started exerting authority while in it's death bed this clever documentary is a much needed good bye note. Excellent audio and visuals. Detailed and methodical Downfall is a wake up call.",
    "date": "2023-07-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Important and clear explanation as to why the CEO and board of Boeing are very lucky not to be behind bars and why the $2.5 billion penalty was a disgusting joke. This is the epitome of a corporate crime.",
    "date": "2023-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "An absolutely appalling display of corporate greed and disregard for human life. Both the CEO and COO of Boeing should be tried for murder.",
    "date": "2022-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A meticulous investigation of the facts surrounding the 737MAX disaster.",
    "date": "2022-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "It's just too complicated and boring.",
    "date": "2022-05-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Indonesian not a country with stupid Pilot, LOL",
    "date": "2022-04-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great Doco regarding Boeing. FFA was once a respected authority where its counterparts around the world used ton follow its lead on nearly everything. Not anymore. Any time a company is driven by profit as a mission statement is eventually fails",
    "date": "2022-04-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great details on the issues with the plane and the effects of Boeing's culture.",
    "date": "2022-04-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This film really sums up what really happened in this case. Because a lot of people don't understand what's really going on. I applaud The Wall Street Journal, because they dared to find out what really happened, while other media blamed the pilot's competence.\n\nI am very surprised that a company as big as Boeing could ignore the safety of its passengers, as well as the FAA's indecisiveness in making decisions.",
    "date": "2022-03-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Yet another example of corporate greed callously disregarding human life.\n\nI'd heavily recommend this to frequent flyers, or not recommend it all depending on their personality type. And if this doesn't make you sell your Boeing stock in disgust, I am not sure what will...",
    "date": "2022-03-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I hadn't heard about any of this and found the film very interesting and certainly an eye opener.",
    "date": "2022-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Competently compiled with a skillfully told narrative, this is worth a watch. Depending on who you are, it may or may not be surprising. Even if you are the latter, the exact way in which things unfold will keep your interest. The short-sighted corporate profiteering at any cost will likely leave you a mixture of sad and angry, depending on your mood.",
    "date": "2022-03-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It's a great piece into a tragic disaster. The prevention that should have happened, the burial of knowledge, and the corruption of process, this is the true downfall of Boeing. \nJust try and gleam over the part where Airbus seems to be totally infallible, as it starts sounding a little like an Airbus commercial instead of a documentary about a serious tragedy.",
    "date": "2022-03-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Overall this docu had good information.  Unions are 'not' the answer by any stretch.  Boeing got caught with it's pants down plain and simple.  The Boeing employees are held ransom by the idiot bean counters at the top, DESTROYING the culture of Boeing, DESTROYING the philosophy of SAFETY FIRST.  \n\nBy not being honest with the FAA, who would have REJECTED a system with a SINGLE POINT OF FAILURE plus not having monitoring of the entire system which would have shown the DEFECT of the airplane's altitude drastically off, Boeing greedy SOBs at the top are THE PEOPLE TO BLAME.  \n\nThis includes the entire BOARD for Boeing at the time, as well as now.   I hope the families sue / have sued the LIVING F****  OUT OF BOEING.   I hope AMERICA and the WORLD sees the obvious of how everything will go to SH**  VERY QUICKLY when MONEY/GREED IS NUMBER ONE - AND REGARDING THE BUILDING OF 'AIRPLANES'.....THIS IS A TRULY DEADLY MISTAKE. The CEO and the BOARD should be in PRISON FOR LIFE, FOR TAKING LIVES WITHOUT REGARD FOR SAFETY OF PASSENGERS.\n\nThe one thing I didn't appreciate was - with all the info - what were the SPECIFICS on HOW the STUPID MCAS SYSTEM WAS FIXED.   Thanks !  Not.",
    "date": "2022-03-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Special Effects: 1,0/Sound Effects: 0,5/Acting: 0,5/Story: 1,5",
    "date": "2022-03-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Pre-med students struggling with MCAT, while pilots struggling with MCAS.\n\nA new documentary on Netflix showcasing the Boeing's long-run corporate conspiracy. \n\nThis is what I want out of a documentary: lots of information delivered but broken down into small bits that a noob can understand, while being time-efficient. In just shy of an hour and a half, I completely understood the message while learned a good basic of the cause of the event. There's barely any bs from the interviewees that elongated the runtime. Everyone added something meaningful to the whole picture. \n\nMy only small problems are that it could be a bit boring at times, and the last 15 minutes dragged a bit. \n\nOverall, a simple yet informative documentary that effectively demonstrated the corruptness of a mega-corporation. 9/10",
    "date": "2022-02-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Shocking facts. They make it up somehow for the families of the victims who have never seen justice. This is a must-watch eye opener.",
    "date": "2022-02-25"
  }
]