[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It seems young actors never get their due .No critic ev n mentions Washingtons name.i think he's a solid actor.\nI would give it a 68%",
    "date": "2025-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Interesting idea as it takes place in Greece (not too many films from Hollywood are filmed in Greece) but badly conceived and badly written and executed.\nSince I am Greek I can guarantee you that very few people in Greece speak near perfect English like the characters in this film do and even more so in the Greek province where at least half of the film takes place. If you add to that, a storyline that gets increasingly less believable as the film progresses, you end up with the good ole \"what could have been\" but wasn't.",
    "date": "2025-06-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "It could be a lot better. He messed up a lot somewhere.",
    "date": "2025-03-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Apart from an outlandish stunt towards the end, a very feasible thriller where the hero, a brave Everyman, stumbles across a sinister political plot. Exciting action.",
    "date": "2025-03-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A tourist’s nightmarish scenario turned into a decent thriller, mainly dependently driven by John David Washington’s performative emotional roller coaster in a diegetic process including responsivity when the plot eventually convolutes its wavering aim alongside attempting timely provocation. (B)",
    "date": "2025-03-16"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Literally the worst movie of all time. Couldn’t stand the lack of dialogue and emotion. I don’t even know how this is a movie. Waste of two hours",
    "date": "2025-02-06"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Movie kinda half-assed everywhere that counts. And Washington actually like spaz the entire time it’s very weird and I wonder if the director made him use strange mannerisms and expressions the entire time or it was just him. 2 stars because it was still fun to watch with lots of action",
    "date": "2025-02-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "El inicio me parece muy bueno, porque te da demasiada intriga con el tema del porqué lo persiguen, pero después de pasar buscando dónde estar seguro durante 1 hora se vuelve bastante pesada y solo quieres que termine ya.\nEl final me parece que se alejaron mucho de la realidad con el protagonista, aguantando demasiado daño físico y sin sentido.\nSe pone bastante aburrida y el final no me parece que valga la pena.",
    "date": "2025-02-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Not as bad as people have reviewed. And DEFINITELY better than Challengers. 3 stars better than Challengers.",
    "date": "2025-01-05"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "John David Washington plays the \"wrong place at the wrong time\" character really well.",
    "date": "2024-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This was not John Denzel's best performance..I don't know if it was the lack of dialogue or stumbling around acting hurt ..Or just the plot was bad.",
    "date": "2023-06-23"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Tense and atmospheric. It's also refreshing to see a movie depicting realistic fight damage.",
    "date": "2023-06-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Early on in the movie, our careless protagonist gets himself and his girlfriend in a car accident, in a totally preventable tragedy. Then the movie devolves further into a series of endless nonsensical events. Fast-forward and there were a couple of plot twists in the last 30 minutes, but they all fell flat because it was already too late to save this poorly written and scripted movie. It's a messy plot and storyline that is full of holes. It just doesn't make sense or add up. There are too many unbelievable and ridiculous coincidences and events throughout the movie, especially towards the end. They are almost laughable. In the last 20 minutes, our protagonist turns into some type of superhuman vigilante. Then suddenly and abruptly you have a lousy ending. Oh, and John David Washington is a terrible actor.",
    "date": "2023-02-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Simple and unpleasant. There is no reason this film should contain that much talent.",
    "date": "2022-12-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Entertaining, some plot twist were a bit too twisty but I mean, that's the genre and I'm all for it. I wouldn't suggest to watch it if you're feeling down, so beware. I truly loved the photography more than the cinematography, the colours and juxtaposition used for the protagonist and the antagonists, the scenery palette were gorgeous.",
    "date": "2022-09-29"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "After being shot, stabbed, and finally dropping onto a car from a car garage like batman my suspension of disbelief that a regular guy could survive this movie ran thin.",
    "date": "2022-07-31"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The protagonist couple in \"Beckett\" (John David Washington as the title character and Alicia Vikander as April) are so nauseatingly cute in the first 10 minutes of this film, I nearly stopped watching. Their conversations were so full of silly double entendres, under-the-table knee bumps, and sly grins, I kept thinking: Are people really this annoying when they're in love? In a cafe scene, Beckett looks into April's's eyes and says, \"I'm having a love attack.\" Excuse me while I vomit.\n\nThankfully, something horrible happens before the introductory scenes can drag on any longer. Driving at night on a narrow mountain road after a day of sightseeing in Greece, Beckett and April plunge down an embankment, rolling the car and crashing into an abandoned house. Beckett survives; April does not.\n\nBeckett tells the cops that he thinks he saw a woman and a red haired boy in the house. Big mistake. He saw something he shouldn't have seen, and political intrigue ensues. It turns out that the boy he saw is the kidnapped nephew of a major political figure in Greece, and the corrupt cops are in on it. Beckett must be killed, since he is a witness. Returning to the scene of the accident, Beckett is shot at by a woman who is accompanied by one of the cops who interviewed him. He spends the rest of the movie running from bad guys and trying not to get killed. It's the stereotypical \"wrong man\" scenario. \n\n\"Beckett\" is beautifully filmed, with glorious shots of the rocky Greek countryside. The interior and city scenes are impressive, too, with vivid colors and lighting. Cinematographer Sayombhu Mukdeeprom makes it look like a Hitchcock movie, and that's not a bad thing. \n\nWashington, who was so strong in \"BlacKk Klansmen,\" tries hard here, and he's pretty convincing. Of course, he has to mysteriously develop kick-ass physical abilities, ala Liam Neeson, as he flees from his enemies, but that's to be expected in a chase film. After all, could Cary Grant really climb Mount Rushmore? Of course. Otherwise, there would be no movie. Still, considering the beating that Beckett takes–shot, stabbed, his arm broken, and surviving two car wrecks–the implausibility factor is pretty high.\n\nVarious Greek locals, who unanimously seem to distrust cops, help Beckett as he tries to reach  the U.S. Embassy in Athens. They're all interesting, colorful people, and they add a lot to the story. \n\nI've made a couple of Hitchcock references (there's even a scene on a train), and his influence is evident here. Once we get into the action, not a scene is wasted, and the suspense is palpable.\n\nNo, \"Beckett\" is not at the level of \"The Man Who Knew Too Much\" or \"North by Northwest,\" but it holds its own as a chase movie. The biggest problem is that the complex political aspect of the plot is not clearly delineated. I got lost trying to figure it out. \n\nNot that it matters. What holds your attention is watching a good guy having the worst day of his life and surviving it.",
    "date": "2022-05-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I usually know the cinema of their ex boyfriend Guadagnino, an director overrated that destroy with one remake a good name of original Suspiria, then i was really surprise to see that this film of Filomarino, is pretty good and well drirected.\nPlot, actors and political contest, bear the protagonist to be involved in a conspiracy that led him to face a several villains.\nOne politcal drama that confirm that expectations and more over isn't classic rubbish that you can find on netflix. Very good.",
    "date": "2022-03-20"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Movie is watchable,has some pretty greek locations from the beginning to the end.It's an achievement from typical background.Movie has a tone that is very pleasing it's like in the summer love story vibe.Other than the story flaws you can predict what he is goinna do.He's gonna be that lone american hero in an unknown country.I don't know why those people did not just slid him.He can not even understand the language.If that cop told him the people in the hose were safe thats could have been the end.",
    "date": "2022-03-13"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "What the hell was going on? The plot was extremely predictable and implausible, the characters were generic idiots, the dialogue was ludicrously fake at times, and the action was silly throughout. Then the pacing was dragged out, the acting was very mediocre, the cinematography and visual effects were average at best, and the soundtrack was forgettable. However, the costumes, makeup, sets, and props were fine, and there was some good variation due to the travelling.",
    "date": "2022-03-04"
  }
]