[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A funny & fun family friendly kids movie. Very rewatchable!",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Honestly I feel like the film isnt meant to be \"good\" its just an oldie that's a goodie",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It was as amazing I remember it being 30 years ago! Brought my son with me to enjoy a classic.",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Some of these critics must be more dead inside than stretch, fatso and stinky.\n\nIf you fail to see the magic in movies this isn’t one for you.\n\nIt’s a fantastic take on Casper the friendly ghost with a cracking cast, beautiful movie with great memories.\n\n‘Can I keep you?’",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great family Halloween movie",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I love it, it's pure nostalgia for me, I understand it's not the best movie ever but I still enjoy it very much",
    "date": "2025-10-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Filme mais ou menos, o roteiro é fraco, as cenas são mais ou menos, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-10-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Can’t believe all the bad reviews. Quite frankly I’m insulted 😂 such a classic and nostalgic movie for me",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Still a 10/10 for me! A classic! Must see in theaters this Halloween!",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love so much this movie. Casper is my favourite ghost ever",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved this movie 30 years ago. Loved it just as much this time around. Took the family we had a blast. The special effects still hold up.",
    "date": "2025-10-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Casper is a complicating movie, i mean it can have it's heartwarming moments with the father-daughter relationship with Dr. James Harvey and his daughter Kathleen (or Kat for short) with the latter having a good relationship with the main character and decent gags, unfortunately at the same time there are a couple of things that drag this movie down like the jokes, the cliqued antagonist and the unnecessary pop-culture references. Outside of Christina Ricci and Bill Pullman it also has cast like Eric Idle, Brad Garrett, Joe Alaskey (may he rest in peace) and Ben Stein along with some surprising cameos like Dan Aykroyd, Fred Rogers, Clint Eastwood, Jess Harnell and unfortunately Mel Gibson, anyways my personal recommendation is that if want to watch something spooky & fun then maybe check it out if not your'e probably better of watching \"The Nightmare Before Christmas\" sure Casper not the best film that came of 1995 but it's certainly not that terrible either.",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Thirty years ago, critics didn’t like it — even I thought it was just so-so. But compared to today’s unimaginative and repetitive movies, it’s now a charming, wholesome, state-of-the-art  (even to today’s standards) piece of entertainment with impressive special effects. Bill Pullman feels underused in the film, but Christina Ricci and Casper make a great duo. A great family movie.",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "THIS MOVIE IS PRETTY MEDIOCRE, ONE THING I HAVE TO SAY IS THE ANIMATION ISNT DATED",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Fun, cute and family oriented. Not much else.",
    "date": "2025-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love Casper always has been one great movie to watch !!Happy 30th Anniversary Casper the friendly ghost",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The Casper kissing angle was weird. Overall it was just ok",
    "date": "2025-10-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved it! So glad it was brought back. Such a fond childhood memory that I was able to share with my 6 year old!",
    "date": "2025-10-10"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The rare opportunity to see a 30 year old movie for the first time on the big screen! The FX hold up well and Christina Ricci makes the whole thing work despite a bit off a messy third act.  Fun cameos caught me by surprise.",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Holds up really well: the story, the effects, the acting. Was good to see it on the big screen.   Went with my mom and nephews to see it.  This shows what a good family film can be when theres jokes for everyone: times when the adults laughed with jokes that went over the kids heads and times when they laughed.  Film holds up well",
    "date": "2025-10-09"
  }
]