[
  {
    "user": "David Nusair",
    "rating": 1.5,
    "text": "...almost inherently compelling subject matter that’s slowly-but-surely squandered by filmmaker Hensleigh...",
    "date": "2024-09-22"
  },
  {
    "user": "Joshua Polanski",
    "rating": null,
    "text": "The action itself is, technically speaking, good. But the stakes of the action are contrived, with cartoonish insurance agency antagonists who may as well have stepped out of a children’s movie like Sonic the Hedgehog or Detective Pikachu.",
    "date": "2024-07-19"
  },
  {
    "user": "Aaron Phillips",
    "rating": null,
    "text": "The Ice Road all the right variables for an interesting film, layered with tension and suspense which is only aided by the casting...Ultimately though, the film’s dialogue is very poor, the performances aren’t great...It’s safe to skip this one.",
    "date": null
  },
  {
    "user": "Cris Kennedy",
    "rating": null,
    "text": "Liam Neeson is, as ever, a stoic and credible leading man. Like his character in this and every other recent film, he is dependable and the kind of bloke you're happy to spend some time with.",
    "date": null
  },
  {
    "user": "Keith Garlington",
    "rating": null,
    "text": "“The Ice Road” taps into much of what makes Neeson such a fun and engaging action star while also following that overused formula that makes many of his movies feel like more of the same.",
    "date": null
  },
  {
    "user": "Cody Dericks",
    "rating": null,
    "text": "It maintains a decent cruising speed allowing it to rise above some of the more forgettable options that find their way onto streaming platforms.",
    "date": null
  },
  {
    "user": "Guillermo Courau",
    "rating": null,
    "text": "One of those [films] one has the feeling of having seen more than twenty years ago. And more than once. [Full review in Spanish]",
    "date": null
  },
  {
    "user": "Emiliano Basile",
    "rating": null,
    "text": "The film works and makes time pass pleasantly moment. [Full review in Spanish]",
    "date": null
  },
  {
    "user": "Víctor López G.",
    "rating": null,
    "text": "An hour and a half that you'll forget very quickly, but that will manage that keep you in suspense by trade.",
    "date": null
  },
  {
    "user": "Blai Morell",
    "rating": null,
    "text": "A joyous B-movie with a 90s scent. [Full Review in Spanish]",
    "date": null
  },
  {
    "user": "James Croot",
    "rating": null,
    "text": "Even Liam Neeson's very particular set of skills can't save this preposterous action-thriller from sinking into a shallow puddle of cliches and contrivances.",
    "date": null
  },
  {
    "user": "Sarah Ward",
    "rating": null,
    "text": "Even Neeson can't make the long list of cliches that fill The Ice Road's script entertaining, not that he seems to be trying all that hard.",
    "date": null
  },
  {
    "user": "Sergio F. Pinilla",
    "rating": null,
    "text": "[The film's] existentialism leaves room for a kind of humanism that feeds the tension. [Full review in Spanish]",
    "date": null
  },
  {
    "user": "Matthew Toomey",
    "rating": null,
    "text": "The Ice Road starts promisingly but lacks the stamina to go the full distance.",
    "date": null
  },
  {
    "user": "Peter Gray",
    "rating": null,
    "text": "Will find an audience who'll be readily satisfied by its predictable nature and by-the-numbers temperament, but the heyday of Neeson expressing his \"particular set of skills\" has truly passed.",
    "date": null
  },
  {
    "user": "Jim Schembri",
    "rating": null,
    "text": "What is beyond any sensible discussion is that the latest Liam Neeson action movie falls squarely and soundly into the third type of Liam Neeson action movie. That is, it is a slightly above average Liam Neeson action movie.",
    "date": null
  },
  {
    "user": "Grant Watson",
    "rating": null,
    "text": "There is absolutely a market and a place for this sort of simple, populist action, and The Ice Road does an efficient job of hitting that sweet spot.",
    "date": null
  },
  {
    "user": "John Noonan",
    "rating": null,
    "text": "...emotional self-sacrifices to moustache-twirling baddies and seemingly invincible hitmen, we've seen these tropes a thousand times... if you can plug into that part of your brain, then a fun time is on the cards.",
    "date": null
  },
  {
    "user": "James Bartlett",
    "rating": null,
    "text": "It's cracking B-movie fare ultimately, and Neeson, as ever, does his best to sell it.",
    "date": null
  },
  {
    "user": "David Fear",
    "rating": null,
    "text": "The ratio of exposition-heavy dialogue to things-a-real-person-would-say lines is roughly 20 to 1. Any bit of visual wit that manages to slip through feels accidental.",
    "date": null
  }
]