[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "⸻\n\nRating: ★★★★☆ (4/5)\n\nI absolutely love this movie — it never gets old! The lead actor who plays the star sniper has completely won me over; I’m in love with his performance. His father’s character is also amazing and really adds to the story. I’ve watched this movie over and over again. The only downside for me is Danay Garcia’s character — I didn’t care for her attitude in the film. But overall, it’s a great watch!",
    "date": "2025-06-03"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Might be some of the worst acting ever, and God awful casting, but strangely watchable. Kinda wanted it to get better!!",
    "date": "2024-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Dårlig historie, dårligt skuespil, og dårligt skrevet karekterer. Det eneste gode var teknologien omkring de våben der var med og scener med det.",
    "date": "2024-03-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Terrible movie. Dialogue is bad, acting is bad. It's so predictable. Waste of time",
    "date": "2023-12-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "It was like watching a TV movie, but with the nudity and sex scenes...",
    "date": "2020-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Not quite as expected",
    "date": "2020-05-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Loved this. Action and the usual suspects. These movies keep getting better with every release. Great acting",
    "date": "2020-05-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Was really hoping that it'd offer more thrill but it turned out to be just an average experience. Not much of action either. One star less for really uncalled for sex/nude scenes. So 2 stars overall.",
    "date": "2020-04-10"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "This had a tiny kernel of a plot at some point, but then instead of developing it and putting some effort into it they decided to go with Bad Script, Bad Wardrobe, and Bad Acting.",
    "date": "2019-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I once used this new type of super high-tech state of the art target seeking bullet on my objective but the rabbit survived because it was wearing a Kevlar bullet-proof vest. He ran off and began bonking his wives. Bastard. How realistic is that? Maybe as real as this film.",
    "date": "2019-07-02"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "The music for the film doesn't have a signature and the script still loses its grasp on past characters, but this is almost nothing worth being disappointed over. The script in this feature handles much more material as opposed to past sequels. The camerawork is great to look at, along with having Tom Berenger and Billy Zane finally reunite once again is the greatest feat of them all.\n\nFor my full review of Sniper: Ultimate Kill (2017), check it out on this IMDB link: https://www.imdb.com/review/rw4432558/?ref_=ur_urv",
    "date": "2018-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Yep because the opening scene was oh so necessary. I expected better considering there were two main actors. \nPiece of shyte. If you have to fill it with full on bonk scenes to get an audience, then you know it's crap.",
    "date": "2017-10-14"
  }
]