[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I will always love this movie. I know it's hoity toity in every way you could think of, but I don't care! You always find yourself always getting into it. Don't forget to watch Titanic II!",
    "date": "2025-11-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "All time film that can make you sad, happy, and angry all at the same time.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This movie is so long.",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I love the titanic facts and the movie has a lot of real historic stuff in it the one thing I don’t like about this movie is that the movie is not long enough I feel like the titanic movie should be longer",
    "date": "2025-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Fun, watchable, but ultimately, like its namesake, a bit bloated and a little too full of itself.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Titanic is more than a historical drama or a romance; it's a cinematic landmark that perfectly balances spectacle and emotion. A powerful, moving film that deserves its status as a classic.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "★★★★½\n\nTitanic is James Cameron’s insane, glorious, 195-minute love letter to doomed romance, human hubris, and the sheer power of big-budget filmmaking, and somehow every single minute of it still works like gangbusters twenty-eight years later.\n\nThis isn’t just a disaster movie; it’s a time machine. From the moment that sweeping aerial shot glides over the pristine ship in 1912, accompanied by James Horner’s heartbreaking flute motif, you’re completely gone. The recreation of the ship itself is so obsessive, so jaw-droppingly perfect, that you can smell the fresh paint and feel the Atlantic wind. Cameron makes you fall in love with every detail (the grand staircase, the third-class party below deck, the wireless room frantically sending CQD) so that when the iceberg hits and the water starts rising, the loss feels personal.\n\nLeonardo DiCaprio and Kate Winslet at 22 and 21 years old deliver two of the most electric, lived-in performances in blockbuster history. Jack and Rose aren’t just pretty faces; they’re class warfare, freedom vs. cage, life vs. slow death by etiquette, and their chemistry is so palpable you can practically feel the steam on the fogged-up Renault in the cargo hold. Every stolen glance, every \"I’m flying\" moment, every quiet \"You jump, I jump\" promise lands like a gut punch.\n\nThen the last hour hits and Cameron goes full merciless god: the water rising, the band playing \"Nearer My God to Thee,\" the mother reading to her children in steerage, the old couple holding each other in bed, the 1,500 souls slipping beneath the waves while Rose floats on that door… it’s still one of the most overwhelming cinematic guttings ever filmed.\n\nIt loses half a star only because some of the modern-day framing scenes with Old Rose feel a little corny now, and a couple of lines (\"Party of the century!\") make you wince. But honestly? Who cares.\n\nFour and a half stars: one for the romance that defined a generation, one for the most spectacular disaster sequence in film history, one for the technical wizardry that still looks flawless, and one because every single time \"My Heart Will Go On\" swells over those final credits, grown adults turn into sobbing teenagers again.\n\nTitanic isn’t just a movie. It’s the reason half the planet knows what an iceberg warning sounds like.  \n9/10. The ship may have sunk, but this film sails forever. 🚢🌊❤️",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Winner of 11 Oscars and the 4th highest-grossing film of all time, Titanic (1997), an immortal icon of cinema history and one of the best movies of all time.",
    "date": "2025-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Too long and very formulaic.",
    "date": "2025-11-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I have to say that the movie itself lags. There's not much you can do with a movie that is about a ship that sinks. They tried to make an interesting story, but it just turned into a cheesy romance, which adds to the movie's lag. Plus, the characters themselves were, in my opinion, unlikable.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Rude Yankees using perverse robot technology, to dig into a sunken ship. Finding a nude drawing. Then comes an old woman, who survived the shipwreck. And it's her. Personally I would have left everything down there, and I also prefer men. So, it would have been extremely more interesting to see a nude drawing of Dicaprio. There's also this unbelievable class gap, that of course let the working class people drown. While there's still a chance for the capital owners to survive. The scene with Dicaprio tied up, and the water's rising, I feel is a cheap, suspence thing. I find it also a bit strange that the couple couldn't hold on to the raft together. All in all, it's not inspiring to me.",
    "date": "2025-10-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I was inconsolable for days",
    "date": "2025-10-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I watch titanic at least once every year. It is a classic movie that is based on true events along with a whole love story with it. Absolute must see and makes me cry every time",
    "date": "2025-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A love story that was essentially a one night stand. Entertaining enough and the crash/sinking of the ship was done well.",
    "date": "2025-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Rewatchable because of its greatnes when it comes to special effects, scenography and emotions. The fictive story is however quite silly with clumpsy references to real people such as Rose owning a picasso and the characters hanging out with all of the most prominent figures abord the ship.",
    "date": "2025-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "9.5/10 The film's occasionally clunky dialogue draws some questionable looks, but that's the biggest problem I got. With that out of the way, I say this movie was James Cameron at his peak. With his deep passion and huge ambitions, he crafted a work so timeless, grand, and spellbinding that it still stood nearly 30 years later as a giant in the world of blockbuster filmmaking. It may not be perfect, but it's still a work of great excellence. It's something I don't see Hollywood making ever again.",
    "date": "2025-08-31"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Unpopular opinion but I think this movie was excruciatingly boring to the point I couldn't finish it maybe its just cause I'm not the right audience",
    "date": "2025-08-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "To making it count. And this movie sure did.",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "One of the all time best movies ever made!",
    "date": "2025-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Titanic is probably my all time favourite movie, I love-love and though tragic but this is one of the greatest love stories.",
    "date": "2025-08-22"
  }
]