[
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Well it's better than the loud house movie, that's something",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Not bad, but not good",
    "date": "2025-09-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Funny in 1 hour and 25 minutes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Rated TV-G!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Bello guarda anche tu ❤️",
    "date": "2025-03-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The final battle was really cool, otherwise this just exists",
    "date": "2025-01-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The first movie of 2025 with my niece. She loved it, so I like it! Fun for sure. I learned a few things or two. Not as quite good as The Loud House, but it will do.",
    "date": "2025-01-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The most mediocre movie I have ever seen",
    "date": "2024-09-24"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A very interesting take on animations oriented for young adults and teenagers",
    "date": "2024-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I felt like the characters in this movie could feel the happiness and difficulties that they faced in real life.",
    "date": "2024-08-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved this movie and I think its a must watch for everyone hands down, No. 1 favourite movie absolute masterpiece",
    "date": "2024-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The movie stinks of rotten tomatoes.",
    "date": "2024-06-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Me & My Pikachu: A epic adventure in Mexico with our favorite giant family The casagrandas ( were obviously not taking about the louds though Casagrands makes a better movie the Lincoln Loud did during his adventures in Scotland ( Me: If you understand what we're taking about )\n\nStory: 9/10\nAnimation: 10/10\nCharacters: 10/10\nOverall: 10/10",
    "date": "2024-04-17"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It's fine it's average",
    "date": "2024-04-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Fun, decently paced, some moral story, interesting characters, a few laughs.",
    "date": "2024-04-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It Was A Good Movie But The Poop Jokes Are Not Funny! I Liked The Final Battle Though Overall Good Movie But Not Funny",
    "date": "2024-04-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Wow a trash Nickelodeon movie....",
    "date": "2024-03-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Alright movie not a fan but funny",
    "date": "2024-03-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Majestic continue this masterpiece",
    "date": "2024-03-27"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This based on a tv series spin from the same name is very funny, stick with the same series humor like you expect too and even has same Hispanic legends and lore plus heritage you learn form it like the tv series which also nice. Do like that end the series with movie cause gives a Ronnie Anne a good arc and she is with her Mom which didn’t get enough of in tv series. Even the movie is about Ronnie Anne and growing up but it does give you a two subplot to tie it together with Bobby and his flat paper Mache of his Dad taking selfie for his father cause of have to stay there and which would more explanation but if u paying attention and know the show and then you why he his there. Second subplot the two brothers try a practice a game for the “Festive Of Lights” in the small town in Mexico and of course they use that to defeat the bad guy and later of course you see it play out. The movie does good job for its running time setting up the plot and moving forward pretty well and the animation looks really great and that her turning 12 like Lincoln Loud but only difference you him growing up in his small town but this works cause when you see her again in the original you get good understanding what has been going with her. I would like a season 4 but the movie makes me proud that we get a good ending and experience more of everyone personality especially Ronnie Anne’s Mom María and got know her better. All in all definitely recommend if like show like I did then go watch it now! I give a A+👍🏽👍🏽👍🏽👍🏽",
    "date": "2024-03-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I really loved it! It's a masterpiece compared to the loud house movie",
    "date": "2024-03-25"
  }
]