[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Bastante bastante inapropiada, aún más cochina, asquerosa, por favor elimínenla de todos los sitios",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Grown Ups 2 is not as good as the first and has no plot but is a funny movie.",
    "date": "2025-11-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It’s either 5 stars or 1 star. Both signify a truly cinematic experience unlike any other.",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "that movie is so good it makes me want to watch every day all day long if 10 stars was an option I would use it",
    "date": "2025-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wish they would make a third one but understand why they might choose not to with the death of their young actor.",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Silly but couldn't help but to laugh.  The characters dressed up at the party was so fun and funny.",
    "date": "2025-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Ppl are just haters, I love every Adam Sandler movie.",
    "date": "2025-09-16"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "You know you're in for some top-tier cinema when a CGI deer pees in Adam Sandler's mouth in the first two minutes. Obviously this isn't a great movie. But, there are a lot of likable and comedic actors here. They're all having fun on screen together so it can be a good time. The movie is telling so many jokes that there are inevitably a few that land. It's pretty dumb, but isn't that kind of the whole point?",
    "date": "2025-08-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "There really isn’t much of a plot but my god is it funny like if you don’t like this movie you just don’t have a good sense of humor.",
    "date": "2025-08-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Grown Ups 2 takes everything fun about the first movie and cranks it up. From the bus driver and the fake toilet in Kmart (“Get out of me!”) to the rock quarry jump where Kevin James lands on David Spade (“I was inside you”), it’s just wall-to-wall ridiculousness. It’s the kind of movie you watch with friends when you want to laugh at dumb jokes, awkward moments, and people doing stuff you’d never get away with in real life. I love all Adam sandler movies, I could watch it a hundred times and still crack up every single time.",
    "date": "2025-08-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "POINTLESS !!!\n\nEven tho Grown Ups 2 (2013) is only a comedy there was absolute no point for it. The jokes are really plank with the college and parents jokes is just terrible and the movie comedy has nothing to offer unless you just like the characters like the first movie has a great cast but other then that is just doesn’t offer anything. 2/10 some jokes would give a chuckle but nothing else",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Extremely fun. Comedy is the strongest point",
    "date": "2025-08-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I love Adam Sandler but dear god was this a low even for his standards",
    "date": "2025-07-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Wtf? Not funny in the least bit and actually disturbing at some points. The deer pissing on a naked teen in the shower? Maya Rudolph calling an infant her lover? The weird ass slapping scene? Turned the movie off 1/3 of the way through whoever wrote this is a weirdo and should probably be on a list somewhere.",
    "date": "2025-07-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Good movie and the movie fun and good comedy.",
    "date": "2025-07-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This movie is a huge mess compared to the original, at least the first had a central story, because this movie fails on that note by being all over the place, even though this is a mess it’s still a laughable mess, hitting some of the same comedic notes of the original, overall a fun, comedically messy movie",
    "date": "2025-07-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Although it is a good comedy, it doesn't impress me that much, it keeps you entertained but it seems like a bit of an absurd movie, although the message is understood and the plot needs more work but it is an excellent movie in general.",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "It is a fairly entertaining comedy film, although with somewhat sensitive content, it is clearly not a film for everyone, but it cannot be denied that the film is very well made and achieves its objective, which is to get a laugh when watching it with friends or family.",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "It's a very funny and entertaining movie with a lot of comedy, funny scenes, and if it's from Adam Sandler, you know the movie is going to be very funny.\nCarlos Jimenez",
    "date": "2025-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The film in my point of view, seeing that it is a comedy film clearly has to have jokes, some jokes are grotesque or unpleasant for sensitive people,The movie itself is quite good to relieve boredom in my opinion, without taking all the jokes to heart, I recommend it. \n\n~Kevin",
    "date": "2025-07-15"
  }
]