[
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "This movie is what you would call mid. I don't think there was anything special about it. Love the dragon though.",
    "date": "2025-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Beautiful, sweet and hilarious",
    "date": "2025-08-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Some viewers have called Wish Dragon a rip-off of Aladdin because both stories feature a magical being who grants three wishes. But that comparison misses what makes Wish Dragon so special and unique.\nFirst, the film is deeply rooted in Chinese culture and folklore, with its story set in modern-day Shanghai and featuring a wish dragon from a teapot rather than a genie from a lamp. The characters’ motivations and backgrounds are shaped by the realities of contemporary China, from family expectations to socioeconomic divides, making the story feel fresh and authentic.\nWhile the wish-granting premise is familiar, Wish Dragon takes it in a new direction. The protagonist, Din, doesn’t just want wealth or romance—he’s driven by a genuine desire to reconnect with his childhood friend, Li Na. The film’s focus on friendship, sacrifice, and kindness gives it a different emotional core than Aladdin, which centers more on romance and personal gain. The dragon, Long, isn’t just a comedic sidekick; his journey is about learning the true meaning of life and friendship after centuries of selfishness.\nThe humor, vibrant animation, and action sequences are all top-notch, but what really makes Wish Dragon shine is its heart. The film explores what really matters in life—loyalty, compassion, and the bonds we share with others—in a way that feels genuine and moving. Even if the plot has some similarities to Aladdin, the execution, setting, and themes make it stand out as its own story.\nIn short, calling Wish Dragon a rip-off of Aladdin is an oversimplification. It’s a beautifully animated, funny, and touching film that uses a classic fairy-tale structure to tell a story that’s uniquely its own—and that’s why it’s so good.",
    "date": "2025-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Brilliantly written and completed with incredible performances from Jimmy Wong and Jon Cho, Wish Dragon is an impressive debut feature from up-and-coming animation juggernaut(and future John Lasseter) Chris Applehans.",
    "date": "2025-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This was a great kids’ film. Highly recommend for your little ones.",
    "date": "2025-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wish Dragon has been stuck in my brain for more than a year and I loved it. Recommend so that it'll increase a chance of Wish Dragon sequel.",
    "date": "2025-06-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The Wish Dragon film was quite entertaining with a good storyline. \nDin's mum was rather aggressive!\nOverall worth a watch.",
    "date": "2025-06-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Aladin with an Asian twist. A heartwarming film that should be considered one of Sony’s best.",
    "date": "2025-02-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Basically just a mechanism to deliver high end billboard ads to children to make them feel like poor peasants that will never be of any value unless they can buy watches and other bulls***",
    "date": "2025-01-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It's an amazing movie 🎥🍿\nAll of you must watch . Well it's worth it and you will not regret spending alomost 2 hours .\nSo , it's a must watch film with a very deep lesson inside it ...",
    "date": "2025-01-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Great elements but they don’t seem to go together so well \nI wanted this movie to be so much better than it was",
    "date": "2024-12-18"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Funny movie, but I don't like that it is a pure plagiarism of Disney's Aladdin.  I don't like the original Aladdin by the way so any remakes are welcome.",
    "date": "2024-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The story is very similar. The characters are nice and the main characters are very beautiful/cute. Nice animation. Some plot holes in the story, all he does is waste his wishes. Overall a nice movie to watch.",
    "date": "2024-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Very Solid Movie",
    "date": "2024-09-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "It's not that bad of a movie although it is a direct knockoff of Aladdin.",
    "date": "2024-07-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Cute movie. Reminiscent if Aladdin with worse wishes and a twist ending. Good flight scenes and a fair ending that wasn't overplayed.",
    "date": "2024-06-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "It was a decent kids film with great romance",
    "date": "2024-05-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I absolutely loved this movie and is also now one of my comfort movies! I loved the humour in it and it has also gotten me so emotional. I need more movies like this and NEED A PART TWO NOW 💜💜💜",
    "date": "2024-03-24"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "The movie was great, but it's actually just Aladdin but in the modern day, and the Chinese",
    "date": "2023-12-31"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Es un copia de aladdin bien hecha wl humor me gusto y la animación también y los personajes son carismáticos y villano meh el dragón es gracioso y una buena historia es un 8.5 de 10",
    "date": "2023-10-25"
  }
]