[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Prety cool movie. The Amell brothers are great actors. Im gonna have to watch the 1st one, I've not seen it.",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "So much budget, so many awesome CGI effects... and then they come up with this stupid mini dog from Super? What the heck?\n\nGood actors, somehow... Too bad, I liked the first movie.",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Follow up to the original code 8. This time Connor has to protect a little girl with a special power who also witnesses some shady business by people in power. About the same as the original, cool but still just average 🍿🍿🍿/5 on Netflix",
    "date": "2025-10-09"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This movie was just as awesome and compelling as the first one! I had so much fun watching it, I highly recommend it for superhero and action fans!",
    "date": "2025-03-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "El punto fuerte de esta segunda parte es tal vez lo que haga que mucha gente a la que le encanto la primera se sienta decepcionada: acá esta mas claro quienes son los buenos y los malos, cosa que en la anterior no pasaba, y es todo mas lineal; pero a su vez tiene mejor ritmo y es mucho mas pochoclera, se siente todo mas Hollywood, va mas a la accion y a los bifes. Buena secuela que cumple en general pero para ver sin tanta expectativa.",
    "date": "2025-01-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Code 8 Part II - 7/10. Got an opportunity to see a special screening of this film (which I didn’t know at the time would be the actual world premiere). And also, ironically, I never saw the original, so I went into this film with no sense of knowing what kind of movie it would be. Part 2 revolves around the concept of X-Men like mutants who live amongst people in a not so distant future, and in this future, police brutality and corruption involves robotic dogs and unfair drone surveillance. Overall, for a Canadian film, this is some good work in making an original sci-fi thriller with a socio political story. The performances are okay, and the VFX is good, but I think the overall message through the sci-fi elements is what helps elevate the film to be better than your run of the mill dystopian thriller.",
    "date": "2024-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Very nice video. I like it",
    "date": "2024-10-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Wow, nice movie👍👍👍",
    "date": "2024-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Code 8 Part 2 is a decent sequel that builds upon the intriguing concept and plot of the first film. The action is good, and the characters are well-developed. The dynamic between the two protagonists, Connor and Garrett, is one of the highlights of the film. Stephen and Robbie Amell, being cousins, have great chemistry, and they play off of each other well. \n\nSirena Gulamgaus as Pavani, a young, very powerful, and grieving girl, held her own sharing scenes with the Amells. Her character seems to not only serve as central to the plot but, also, a second chance for Connor. \n\nThe film also explores some interesting themes, such as abuse of power, community, class systems, prejudice and discrimination against people with abilities, and how those “powered” individuals are not only treated as second class, but used and manipulated.  Overall, Code 8 Part 2 is a solid action sci fi movie with a lot to offer fans of the genre.",
    "date": "2024-09-09"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The Good - 1) The themes and political intrigue is engaging and interesting, even if the premise is a bit basic. 2) The actor who plays Puravina is really good and I wouldn't be surprised if this is just a stepping stone role for her. 3) I was not expecting the ending to go off the way it did. It hammered home the intended idea behind the movie and is not a simple \"Superpowered vs non-superpowered\" ending, but has more behind it which I appreciate. 4) There were a couple scenes, especially one in the beginning that were very suspenseful and I was left on the edge of my seat.\n\nThe Bad - 1) I was left a bit bored by it and it was very slow to start with barring the \"hide and seek\" sequence. 2) This movie felt like just more of the same compared to part 1 rather than doing anything more with it. 3) I wish this movie had ended on a sadder note. They're setting up a 3rd movie, I believe, but I wish it ended in a way that was bleaker to set things to come if that is the case. If not, then I do not understand some of the dropped information comes into play\n\nOverall - A serviceable streaming movie. It has some great ideas and honestly, this world is interesting but the movies writing seems to be missing the mark except for it's heavy tones on police violence which are done to good effect",
    "date": "2024-09-02"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A very good film that is useful to me and to many people, as it is consistent and complete in almost all respects",
    "date": "2024-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Great movie :) thoroughly enjoyed it. Perfect mix of action and dialogue. Definitely recommend",
    "date": "2024-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It's not a bad movie, it's just that the first one was very good and had more action. The second part was more drama like movie..however, I will definitely watch a third part...",
    "date": "2024-07-12"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Code 8 part ll very good series",
    "date": "2024-07-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is my best film ever",
    "date": "2024-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I think that fans of action and thriller films will love this movie very much. I recommend it",
    "date": "2024-06-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I think this is the best movie, so everyone watch it.",
    "date": "2024-06-26"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "A slight downgrade from Part 1. Not bad, but not as engaging or entertaining as the first. A bit forced.",
    "date": "2024-06-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The acting was good however i prefer the first film as in the second film the story line changes a lot to make the police bad .",
    "date": "2024-06-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The first one was better, acting was off in this one.",
    "date": "2024-06-02"
  }
]