[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I've never seen a movie repeatedly get worse as it progresses as much as this one did. \n\nIt's so bad it feels intentional. Lilly Collins is a bad as she's always been, Simon Pegg is interesting until the last 10 minutes, when he suddenly drops any sign of range you would have thought he got on this movie. \n\nI saw this movie in a streaming platform in Spain called Filmin and it made me so angry I cancelled my yearly subscription.",
    "date": "2025-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I saw this one with zero expectations and just cause I was bored but ended up liking the film more than I thought, the scenes with Lily and Simon were my favorites and ejoyed a lot the suspense surrounding the big revelation",
    "date": "2025-03-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The script is really basic, full of clichés. The situations are inconsistent, unjustified, and it truly is a low-quality movie.",
    "date": "2024-12-12"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Horrible. The actress is the worst,",
    "date": "2024-11-02"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Not as bad as everyone makes it seems. One of the better movies I picked out from impulse at Dollar Tree.",
    "date": "2024-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I enjoyed the suspense and the gradual unfolding of the details of the story, all of which climaxed in an ending that was plausible but not obvious.\nThe acting was good and the story was original. I'm not a of fan of horror movies, preferring ones that have you on the edge of your seat but without a lot of gore and silly apparitions type stuff.",
    "date": "2024-09-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Started off interesting. I could tell what the ending was going to be and who Morgan was midway through the movie. I only continued to keep watching it so I could prove my self right.",
    "date": "2024-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "All the slickness of the movie couldn't cover up the unnecessary side plots or the holes in the story. It did keep our attention throughout, but was not really satisfying. Plus, it's a bit tough to have empathy for stinking rich people's problems.",
    "date": "2024-08-27"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "The premise was captivating enough but there were too many strikes to call it a good movie. The lead actress's performance was flat...she was so stern and demanding the entire movie. The plot was extremely implausible. There is no character development, just a long sequence of attempted 'gotcha' moments before the movie ends. And the movie does nothing meaningful with the supporting characters...I questioned why they even existed.",
    "date": "2024-08-19"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This could have been executed better. They had a good idea on their hands but did not tell the story in an entertaining way.",
    "date": "2024-06-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "She composes herself quite nicely after finding a changed up man in the cellar? LOL",
    "date": "2024-06-23"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Really really bad, terrible acting by the main actress.",
    "date": "2024-06-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Simplesmente o pior filme que vi na vida. Deveriam apagar todas ás cópias existentes da terra e fingir que isso nunca aconteceu. Obrigado.",
    "date": "2024-06-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Tan tan malisima que podría llegarse a pensar que es una parodia de algun verdadero thriller.",
    "date": "2024-06-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I first couldn't bring myself to watch it because the 'bad guy' looks like Garth from Wayne's World. I just finished it and the hair actually got more ridiculous to the point of being distracting. Acting was not so great, particularly the lead female. It passed the time but I would not recommend.",
    "date": "2024-06-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "INHERITANCE is a decent flick with a fascinating idea, albeit extremely improbable, the screenplay felt somehow wanting; it \"could have\" made use of various situations and characters for considerably better development. And, it should be pointed out that, while some of the reviews felt there were descrepencies in the  acting (which I felt was fine), I saw the actual difficulty in the screenplay itself and the direction — not in anyone's acting at all.",
    "date": "2024-05-27"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Not good, not bad. it's alright,  it passed the time.",
    "date": "2024-04-28"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "There isn't a side to root for. Both the antagonist and protagonists are awful people.  I actually found myself cheering on the bad guy because he had a personality.",
    "date": "2024-04-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "quite interesting story line. the resolution part seemed quite rushed and not well played out.",
    "date": "2024-03-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Lily Collins, Simon Pegg, the whole cast were phenomenal in this. This was a thriller with mystery and eerie parts that also contain a twist at the end. I am in shock!",
    "date": "2023-08-21"
  }
]