[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This second one was just as funny as Death to 2020. It's like a yearbook of I can't believe that happened horror stories. Laurence Fishburn's narration is hysterical. Cristin Milotti stole the show however as the MAGA/conspiracy loving suburban mom on house arrest. Very funny.",
    "date": "2023-02-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "A complete waste of time, my goodness.... My blood pressure is still elevated by all this BS.... I was expecting some good laughs but there was hardly any!",
    "date": "2022-02-22"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "\"Death to 2021\" is not funny, and for something like this, that is not a good thing.",
    "date": "2022-02-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This second one was just as funny as Death to 2020. It's like a yearbook of I can't believe that happened horror stories. Laurence Fishburn's narration is hysterical. Cristin Milotti stole the show however as the MAGA/conspiracy loving suburban mom on house arrest.",
    "date": "2022-01-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "*Philomena Cunk and Charlie Brooker. Screenwipe and Cunk Of Britain are brilliant and aimed at a BB2 audience. \nThis is modeled on Screenwipe end of year review on events but aimed at an American Netflix viewer and has been dumbed down to its ankle socks, we know the topic targeted  are dumb as ****  Charlie used to play up to their stupidity by remarking how clever they are normally but this is just irritating, loud and vulgar. ''Just Like an American Netflix Viewer''",
    "date": "2022-01-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Hopefully I would find more humor in this a few years down the road but it didn't even feel much like a retrospective at this point. I also generally prefer comedy to leave me feeling elevated and pleasant, not frustrated and angry, haha. 3.5/10",
    "date": "2022-01-13"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This was complete trash. It tried so hard to be funny but wasn't at all. It was trying to talk about real news stories through fictional characters but they couldn't even get the real news stories parts right so it just landed completely flat. They basically just exaggerated reality into something that was completely unrecognizable.",
    "date": "2022-01-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Worse than the last year's special (which felt like perhaps Charlie Brooker was more involved in). Very American centric and features lots of Netflix self-promotion. The cast is good though and glad they kept Diane Morgan. Mildly entertaining to watch in the background.",
    "date": "2022-01-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "great as last year's installment - love these satirical mockumentaries",
    "date": "2022-01-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "- Not that funny\n- Several of the characters provided no comical value",
    "date": "2022-01-07"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Just a very poor production. The humor was grade school level.",
    "date": "2022-01-07"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "If you liked Don't Look Up, you'll like this film. I thought the characters were great.",
    "date": "2022-01-06"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Wasnt funny. Extremely one sided and terrible expose of 2021",
    "date": "2022-01-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved it ... Hugh Grant is hilarious... he didn´t act though he played himself in 25 years.",
    "date": "2022-01-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Worse than Death to 2020. No new ideas.",
    "date": "2022-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Silly but funny. It's pretty merciless when it comes to idiots like vaccine deniers and Trump supporters, hence the angry one-star reviews.",
    "date": "2022-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Some absolutely genuine laugh out loud moments that obviously go right over the heads of the nincompoops that the show so deftly skewers. It's called S-A-T-I-R-E, folks. Look it up. Great casting (Really, how can you go wrong with the always wonderful Tracey Ullman?), great writing that should cause some people to take pause, look in the mirror, and reflect on how utterly ridiculous - and frightening - the state of the world has become. \"Just askin' questions, folks!\"",
    "date": "2022-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Wow. I did not think it was possible to make something this unfunny and call it comedy.",
    "date": "2022-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Give it a miss     .",
    "date": "2022-01-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Terrible comedy. Not funny at all. And way too biased of an opinion",
    "date": "2022-01-02"
  }
]