[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Critics, guys, this is NOT a 100% film/documentary. It is a well made, well shot story of brazen scammers and highlights the gullibility of the general public who want to 'get rich quick'. Almost to brazen to believe. But it's true. Reminded me of the excellent BBC4 series \"Storyville\". That's high praise.",
    "date": "2024-02-04"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "My new fetish is watching all those crypto-bro goes-to-jail documentaries. Bitconned is a little bit boring, but the promise is satisfying. They all like Scorsese movies. First, they thrive, then they fail hard. Perfect story.",
    "date": "2024-01-30"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Putrid doc about putrid people. Don't bother watching. Tl;dr. Bitcoin is a scam, don't buy any.",
    "date": "2024-01-18"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Wannabe criminal idiot who got off scot-free. We'll see his face and name in the news again when they catch him for commiting another crime. You only throw so many \"friends\" under the bus and this movie sends the wrong message to viewers.",
    "date": "2024-01-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Good movie that is current with the times. If you want something modern and fast paced.. Watch this....",
    "date": "2024-01-11"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This crime documentary was really good. The entire crew did an excellent job on bringing this crime story to life. The man responsible, Ray Trapani, is just a greedy, selfish person with no respect for anything and will step on anyone to get what he wants. He got off with no jail time, which is wrong. He probably bought off the court because he knows that he wouldn't last long in jail. He's a coward and he knows it. If you haven't seen this documentary yet, check it out sometime. It'll show you how corrupt Trapani is and that people like him should never be trusted.",
    "date": "2024-01-10"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Lol do you know how to spell ?? In the first screen there are banker boxes 📦  on the shelves and someone has an issue with spelling. I couldn't take it seriously after that.  I understand typos but in a movie 🎬  like really no one noticed that",
    "date": "2024-01-09"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Buen documental con un grado de impunidad por parte de la autoridades y el mundo de las criptomonedas que es tan fácil para las estafas que ausuta.",
    "date": "2024-01-08"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The wrong movie made that sends the wrong message to people. It is amazing that our form of entertainment now includes stories about the glorification of criminals and a broken justice system. What a waste!",
    "date": "2024-01-08"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "\"How to be a total DOUCHEBAG and pretend you're smart and flash money around to become a bigger douchebag scamming people of millions.... what a bunch of lame kids.....Nothing but....wannabees",
    "date": "2024-01-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I thought this was about a typical bitcoin con. A collect and spend the more gullible, get rich quick investors discretionary incomes. It's not as much that, but more of a by the steps, first person bio-version of a wan tent kid then adult classical scammer. Ray Trapani was a more extreme version of me and a lot of people I knew and grew up with. We wanted financial freedom at a young age by either legitimate, which was our first choice, or by weighed-risk, semi-legal methods. If it weren't for Ray's drug habit, he'd of probably succeeded with making his vision legitimate. He was definitely high when deciding to make up extreme company bios and a fictional CEO. Still, he had a blast with the wealth he created. He enjoyed the hi-life at a young age. Pretty good watch as a documentary, and a heck of an achievement for someone of his limited education and experience. Just saying...",
    "date": "2024-01-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I was truly torn by this documentary.  It did not paint Ray Trapani as a saint but he is such a narcissistic sociopath that I was enraged by his criminal \"wink and nod\" about what he did - no contrition - and as someone with a childhood ambition of being a criminal, his mother comments  are disgraceful.",
    "date": "2024-01-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Well paced documentary. Detailed but not boring.",
    "date": "2024-01-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very well-done documentary, perhaps so polished that it defeats its purpose. It shows the broiler room mentality from crypto con-artists in such an alluring manner that it seems like a puff-piece, not a scathing documentary. The sad thing is the film made the main characters look so cool that people will look at the them, one in particular, with admiration rather than contempt.",
    "date": "2024-01-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "the main guy ray funny and chill as hell.",
    "date": "2024-01-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Good insight behind the true scenes of cryptocurrencies. I and other colleagues of mine have also been victims of such machinations. I am in favor of increasing the prison sentences for such people and pawning their \"property\" until the fraud amount has been repaid. I hate all this guys, hope that they will earn no more money with that and want to stop this whole currency thing.",
    "date": "2024-01-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Definitely enjoyed this film, likeable protagonist, well shot and decent true story.",
    "date": "2024-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Another doc glorifying crime. Let's all pretend this story is so cool. Main character is an absolute full of himself rubbish talking mug. I don't understand how anyone would give time of the day for that guy.",
    "date": "2024-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Está película me parece super buena señal las recomiendo muchísimo me gustó mucho está súper buenísima noticia desaprovechar la oportunidad de mirarla",
    "date": "2024-01-03"
  }
]