[
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Sorry but the BEST actors in the movie were Frankies and Cleo's actors. The girl who played Cleo killed it, while Frankie's actor the motions and the obliviousness was so good. I thought Draculaura Looked cute, the actor was adorable. I can't comment on her acting because we didn't see much of her. Deuce I liked his hair, but the snakes looked weird on his face. Not natural, the rest of the actors did okay. I feel like they could have done better but they didn't do horrible imo. I do get that most people will hate this movie but remember it's for the new generation and honestly most of us grew up with Camp Rock and High School musical which were silly and cringe but we loved it. Let's have the new generation enjoy their own silly and cringey movies. Therefore I think this is worth the watch. It's entertaining, funny, and teaches children acceptance.",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Can’t recommend something less. The budget was so cheap, absolutely HORRENDOUS. Why take something so good and HAVE to ruin it with a live action. Who made this and actually thought “yeah now that’s a top selling movie” - actual embarrassment not a movie. Pure laziness. If you’re gonna make a live action then make it GOOD. Don’t embarrass yourself. I’ve seen people dress up better for Halloween as the monster high, than what these thought was absolute class.",
    "date": "2025-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "The new life action movies have completely ruined monster high. Monster High is a FICTIONAL very FICTIONAL place. No one has ever looked at monster high before this movie was made and decided it needed changing, Changing Draculaura to a half witch makes no sense, her personality changing along with Frankie’s. Poor CGI, Poor quality of a movie over all. If you want to watch monster high watch the original movies, with more substance.",
    "date": "2025-09-14"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "THIS WAS LAUGHABLY BAD. Genuinely terrible! Me and my older sister attempted to watch this and just had to turn it off through the middle of it because it was just that corny. There is so much wasted potential, I was super excited when I heard that there was a monster high movie coming out and to my utter disappointment I was faced with this slop of a movie. I recommend you watch this with your friends if you want to laugh because my is it just horrible! Lmao I had to make an entire account on this site just to leave a review on this very specific movie.",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I would like to say its HORRIBLE but also since its monster high i dont know what to say.\nFirst cast isnt the greatest yes they are good actors but the characters design is BAD instead of re-making the original monster high thcharacters they could have created a new generation or the monster high \"kids\" or just kept the ORIGINAL characters \nSecondly why is cleo and deuce over? They are literally the best couple in monster high and have many moments dedicated for each other but you decided to put clawbeen who has NO interest in dating and let her date deuce cuz why? There is no reason to change the WHOLE story if you are gonna change the WHOLE story might as well change ALL the characters.\nThirdly i dont mind the new design but i do mind the new personalities. Bring back their old personalities and a bit of their old designs too. Too much has changed. \nFour. The effects are bad. Characters designs bad. Clawbeen aint a slay like before and bring back to original please. As a fan of the G1 monster high bring back the old monster high. I personally dont mind the body types but i do mind the story line about everything. Music isnt bad and the dancing is something. But all i care about and from the reviews on tiktok. We clearly enjoyed the old version more.\nThis was disappointing but for respect. 1.5 stars. Cuz at the end of the day the company of monster high still keeps the G1 dolls alive",
    "date": "2025-02-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Desde el desconocimiento absoluto al fandom que representa tengo que decir que me gusto bastante. Buen ritmo, historia simple pero entretenida, colorida, pocas canciones para ser un musical pero pegadizas. La estética me parece que estuvo genial, conozco de vista a los personajes nomas pero cumplio para ser una película modesta. Esperaba algo liviano y divertido que me haga pasar un buen rato, es exactamente lo que obtuve.",
    "date": "2025-01-23"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Uma obra do século XXI. Em seu ambiente horripilante o roteiro nos leva por reviravoltas regadas por músicas que nos ajuda a contar a história com coreografias muito boas. Uma aventura que nos mostra que podemos ser quem somos.",
    "date": "2025-01-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I love watching these movies I hope they continue making these.... I'm currently wondering what happens after 3 and 4 like does clawdeen, Frankie and draclaura go t college and does clawdeen, and duce continue their relationship????",
    "date": "2024-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It was horrid. Not at ALL true to the original storyline. I grew up watching all the monster high movies and this was nothing like any of those movies. I would never let my children watch such a bad movie.",
    "date": "2024-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I'd see the first and second movie 6 in a row, and I'd have to say wow these movies are so good . And I'd really enjoyed seeing the dance choreography rewatching them the cast and crew did such a incredible job with these two films. Brovo 👏 These films are awesome.",
    "date": "2024-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "My son and I loved this movie and have watched it many times. Definitely recommend!",
    "date": "2024-09-30"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "absolutely awful and a joke of a movie.",
    "date": "2024-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A musical... and a bit cringe. Does not feel like they did reasearch on MH before writing this.",
    "date": "2024-06-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Incroyable j'ai adoré le premier film.Les personnage sont intéressants.🥰🥰🥰🥰🥰",
    "date": "2024-05-20"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The producer and cast really outdid themselves with this movie. This movie is actually my favorite movie EVER! It has outstanding graphics, really good songs, and an amazing plot! What I love about this movie is that it teaches viewers about being their true selves and how its beautiful. I highly recommend this movie!!!! It is so amazing and so inspirational!!",
    "date": "2024-03-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "now this is a musical.",
    "date": "2024-03-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "didnt like it at all. yes, it is a reboot, but they completely ruined the characters. awful.",
    "date": "2024-03-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "THE worst Movie ever what is this.",
    "date": "2024-02-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "The movie seems so hastily made. The makeup couldn't be any worse. The plot is the classic about accepting a different person and the songs seem so out of place every time.",
    "date": "2024-01-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Roteiro bom, personagens cativantes, figurino e maquiagem PERFEITOS!! Destaca-se pra mim as cenas engraçadas, o enredo que me prende na história e as músicas, em especial \"True Monster Hearth\", \"No apologies\" e \"Coming out of the dark\"! Porém,  o filme poderia ter sido mais desenvolvido ( tem menos de uma hora e meia ), além de que essa coisa do celular ficou meio repetitiva. Tipo, no final eles tavam TODOS fazendo live..? Um só fazendo ia ser top mas mds precisava ser todos? Além d q o final n foi mto emocionante, podiam ter dado mais tensão e aventura. Mas adorei esse filme, quero mto olhar o 2!!",
    "date": "2024-01-20"
  }
]