[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I loved this \"come back\" movie for Lindsay, it’s a cute corny Christmas movie that is influenced by \"Overboard\" with Goldie Hawn and Kurt Russel. A rich girl falls and hits her head, forgetting who she is, and the handsome blue collar man \"saves\" her in more ways than one. If you love rom coms and Christmas movies this is perfect! Don’t take it too serious, just enjoy the movie and you’ll love it!",
    "date": "2025-12-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "WE 👏LOVE👏THIS👏MOVIE👏 SAY IT!\nSAY IIIIIIIT!!!\nif you cannot like this, you won’t be Merry Christmas.",
    "date": "2025-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Bref, c'est un film de Noël ! J'ai aimé le duo Lohan-Overstreet.",
    "date": "2025-04-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very cute movie with very predictable ending; somewhat like a Hallmark movie, but much, much better. I cannot watch a Hallmark movie, but this cast and writing makes it well worth the watch. Very fun and so great to see lindsay lohan, She is as adorable as ever!",
    "date": "2025-01-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Filme: Uma Quedinha de Natal\t\tAssistido:  5-12-24\nElenco: @lindsaylohan @chordoverstreet @oliviamonetperez @jackwagnerofficial @instageorgey \nModelo: #natalino #romance #comédia\nDuração: 1h 35m \tAno: 2022\nMinha opinião: Este filme de Lindsay de Natal acredito ser o melhor dela até hoje. O seu rosto esta com aquele botox, onde não vemos expressão facial, ou quando sorri estica tudo. Kkkkk. E como sempre, quando falamos de filme de Natal tem sempre uma estória de amor acontecendo. Claro que existe suas exceções como “Esqueceram de Mim”. Aqui temos Sierra que depois de esquecer de quem é se torna Sarah (Lohan), cheia de frescura onde nunca fez nada. Temos seu namorado Tad, também um cara cheio de frescura. E nomomento que ele vai pedir a mão de Sierra e neste momento ela escorrega e cai montanha a abaixo e bate sua cabeça e esquece tudo. E salva por Jake (Chord)  que é pai de Avy (Perez) que fez o pedido ao Papai Noel que seu pai encontre um novo amor, pois ele é viúvo. Será que seu pedido será atendido? E no tempo que ela passa na pousada de Jake ela ajuda na pousada, fazendo de tudo que nunca fez. E gosta desta nova experiência e nesse momento ela se aproxima da Avy e Jake. Mas quando tudo parecia acontecer ela é encontrada pelo seu pai e Tad e relembra de quem é. Mas agora ela esta mudada. E deixa Tad e vive feliz com Jake e Avy.\nRoteiro e enredo este filme foi muito legal. Um roteiro simples, ingênuo, mas funcional.\nVale apena assistir? Sim recomendo neste momento natalino.\nNota: 7",
    "date": "2024-12-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is a great Christmas movie, the movie looks wonderfully, the story is heartwarming and flows well, I think this is the best Christmas movie I have  seen this year so far. 10/10 .",
    "date": "2024-12-05"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "My grandmother watches nothing but Hallmark movies and this is as bad as they get. Lohan was super asson. Gordon Bombay couldn't even lace up the skates and save this",
    "date": "2024-12-02"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "It's a heart warming film, with a cast who put in performances such that you do care about them.\n\nYes, you can see the whole story coming right at you, but who cares. You watch this film because you want a seasonal boost of cheer.\n\nOne thing....was expecting the Santa character to close out the final scene with sled and reindeers coming up and through the screen at the audience. Cliche, yes, but it would have put a bow on the top!",
    "date": "2024-11-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The first 15 minutes, before Lindsay's skiing accident, might seem silly to you but don't turn it off.  The movie brought a tear to my eye by the end.  Very cute; very sweet; an uplifting Christmas rom-com for the whole family, kids included.",
    "date": "2024-11-24"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "More people should watch this movie, but it's pretty rough.",
    "date": "2024-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This sweet story makes you dream away from the screen to the slopes of the Alps! Lindsay Lohan plays the role of Sierra/Sarah to perfection, and the Mean Girl reference is the cherry on top.\n\nA classic sweet, romantic Christmas movie where love can bloom in just 4 days and the whole town can gather on Christmas Eve. If you can look past realism and logic, the movie is definitely worth watching and will get you 100% in the Christmas spirit!",
    "date": "2024-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This was a nice movie. It had some elements I liked, but again it was just a bit of a basic Christmas movie. Glad I watched it, but wouldn’t watch it again. Loves the Mean Girl reference though.",
    "date": "2024-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "I watched this movie because, like Tony Medley, my favorite movie is Freaky Friday. I consider Lohan to be a modern day Audrey Hepburn. But unfortunately this movie is no 1953 Roman Holiday.",
    "date": "2024-11-15"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "As Christmas movies go, it captured the magic, whimsy and family cheerful vibes one might expect. It's a step-up production and charm wise from your typical Hallmark Christmas movie. In large part, the production / directing team makes a basic premise a chill and fun watch that helps you escape into a simpler time, and Lindsay Lohan's charisma, star power and sweetness elevates the good-natured feel. The light-hearted repertoire and physical comedy is good for the whole family. A shoutout to Tad (played by George Young), as the superficial fiancé. He made his snooty character likeable in the most \"Chad\" like way and his comedic delivery was great. I do have to note that the main couple's chemistry was a bit lackluster with just a few glances that hinted the audience. There isn't really any twists and turns, and the story is quite predictable, but if there's good vibes, that's kind of all that matters in an enjoyable Christmas movie. Otherwise, the movie is a worth a watch for the holidays.",
    "date": "2024-11-09"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Very sweet and funny",
    "date": "2024-08-30"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A really great movie. Lindsay Lohan was terrific as was the rest of the cast. Great scenery and a nice story. This is a very enjoyable 90 minutes, do not miss it.",
    "date": "2024-05-08"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Lindsay's comeback!! I loved it. Heartwarming and she is back in her full form.",
    "date": "2024-02-16"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It doesn't work on any level (acting, directing, script...).",
    "date": "2024-02-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Horrible but so bad it's funny. Has enough heart warming feel good \"Christmas\" vibes to keep it entertaining",
    "date": "2024-01-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I thought this was a great feel good Christmas movie.  A little predictable, probably, but sometimes that's a good thing.  This is one of those times. It brought just the right dash of intrigue, heartbreak, and tears of joy.",
    "date": "2023-12-27"
  }
]