[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Really liked this because i have been to this beautiful country, It's a good rom com movie with beautiful casts and have cover all the beautiful places across the vietnam. Hoi An, the beautiful place it to be over and over again.",
    "date": "2024-07-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "We decided to watch A Tourist’s Guide to Love because Rachael Leigh Cook is in it. It was nice to see her again. This is a pretty standard romantic comedy, but it is also a video brochure for Vietnam tourism. The country the story is set in plays almost as big of a part as any of the cast. It does seem like a beautiful place. Even though there are some elements of the plot that don’t make sense, some of the cast are better at acting than others, and it is easy to predict what is going to happen next, I still enjoyed watching A Tourist’s Guide to Love (and not just because of Rachael Leigh Cook).",
    "date": "2024-04-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It's a rom-com that offers nothing new as Leigh-Cook goes to Vietnam after a breakup. Predictable, yes. Awful, No.",
    "date": "2024-04-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Its awesome movie for travel lover must watch",
    "date": "2024-03-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Whole part of movie amazing,",
    "date": "2024-03-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Great movie to watch for a more times",
    "date": "2024-03-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "A beautiful Vietnamese travel AD.  There was absolutely no chemistry between the leads, and their acting was awful.  This could have been a fun ROMCOM but it missed every opportunity.  No laughs and no connection.",
    "date": "2024-03-07"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Its star deserves so much better than this Hallmark knockoff.",
    "date": "2024-02-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I not only fell in love with the characters but also the beautiful scenery.  It seemed to have fit so well together and I could've seen myself falling in love filming this movie. It was beautifully done!",
    "date": "2024-01-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Beautiful scenery, capable acting, chemistry between the two main characters with crisp dialogue and a swiftly moving plot. This one will surprise you. It's a sweet romance, a very big cut above a Hallmark movie. Enjoyable.",
    "date": "2024-01-05"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "It's a stupid and fun movie. Like the beer-bong equivalent of a romantic comedy with the Vietnamese travel agency as a sponsor.",
    "date": "2024-01-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Abysmal.  Boring.  Embarrassing.\nRachael Leigh Cook should be above movies like this.  Leave this trite script, overly predictable, schlock fest for the likes of Julia Roberts.  The movie fails to have any redeeming quality.  Lack of chemistry between every single actor.  The writing is PAINFUL.  It's just another really dumb, canned \"romance\" movie where a jilted white woman goes overseas to learn fortune cookie wisdom from a local hunk and be submissively led along into 'finding herself.' Borderline racist.  Skip this tripe.",
    "date": "2023-08-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This movie makes Hallmark movies look fast-paced by comparison.  This could have been an hour novella and a decent one at that.   The performances were believable, and the characters were likable, but the awkward dramatic pacing made it painful to watch.  The movie eventually found itself, but sadly, it just took too long.  I would have liked to see more emotional intensity at more critical points.",
    "date": "2023-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "This is a solid rom com that takes you into a beautiful world most people haven't seen before.",
    "date": "2023-08-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Ugh. Apologized to my wife for making her watch this.",
    "date": "2023-07-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A fun love story with beautiful scenes of Vietnam.",
    "date": "2023-06-01"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This is a cute movie giving light to Vietnam in a different lense than what we typically see in cinema. Enjoy the beautiful cinematography and follow along with the lead character, even if the love story isn't quite rounded out. A beautiful love letter to Vietnam from an American perspective not to take too seriously.",
    "date": "2023-05-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The movie's a worthy trip to Vietnam. I personally didn't expect much but was left pleasantly surprised and, although the ending was predictable, the whole remains a charming adventure through beautiful landscapes that should be explored in real life.",
    "date": "2023-05-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The movie is definitely Cheesy but absolutely fun and entertaining",
    "date": "2023-05-02"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie is basic, shallow, boring. A waste of time.",
    "date": "2023-04-30"
  }
]