[
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "It's so bad, it hurts.",
    "date": "2025-07-10"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "sooo cheesy but still a good watch to turn your brain off when your in a romance mood!",
    "date": "2025-05-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Definitely not the best Nicholas Spark film adaptation.",
    "date": "2025-02-05"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Filme: \tA Escolha\t\t\tAssistido: 21-01-25\nElenco: @teresapalmer @findthewalker @tomwelling @maggiegrace @alexandradaddario Tom Wilkison\nModelo: #romance #drama\nDuração: 1h 51m\tAno: 2016\nMinha opinião: Um filme gostoso de assistir e sentimos a química entre os atores Gabby (Palmer) e Travis (Wlaker), e eles dão toda a graça do filme e também ver o Super-Homem chifrudo também é cômico. E a ternura que transmite desde as brigas e discuções entre eles e isso se transforma em um amor tão forte que até mesmo quando Gabby fica em coma e todos falam para desistir o amor deles faz com que ela acorde e vivam felizes para sempre. O começo, temos o casal Gabby e Ryan (Tom) e o outro casal Travis e Mônica (Daddario). Mas tem que viajar para uma conferência e Monica também fica ausente por uns dias. E isso faz com que oportunidades Gabby e Travis se conhecerem emlhor graças ao cadela de Gabby e por Travis se veterinário e também vizinhos. Para rolar aquele clima e de se apaixonarem. Mas quando Ryan e Monica. Gabby e Travis confessam oque havia acontecido e quando Gabby vai embora Travis vai atrás e eles se casam. Tem 2 filhos, mas em uma noite Gabby sofre um acidente que a deixa em coma. Mas ela volta como em um milagre e todos vivem felizes para sempre.\nRoteiro e enredo genial, um roteiro simples, mas a magia dos atores Palmer e Walker fizeram toda a diferença neste filme, com foi de Bullock junto com Reeves em “A Casa do Lago” ou Kutcher com Peet em “De Repente é Amor”.\nVale apena assistir? Sim Com certeza. E Acompanhado é melhor.\nNota: 8,5",
    "date": "2025-01-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Terrible in every way.",
    "date": "2025-01-21"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Chihuahua puppies and bad wigs are the only thing that distracted me from the bad acting. The book was good, so I watched it.",
    "date": "2025-01-18"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "What an annoying woman, it's hard to believe that anyone would fall for her. Poor acting, lovely setting.",
    "date": "2024-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Alright, let’s be real here—at some point, we’ve all caved to the guilty pleasure that is a Nicholas Sparks movie. You can’t fault me for loving a good romance that grabs you by the feels and doesn’t let go. And when the mood calls for a solid cry session, I’m not above throwing on one of these heartstring-tugging flicks. The Choice fits that bill perfectly. It’s got all the classic Sparks hallmarks: emotional stakes, life-altering decisions, and just the right amount of drama to keep you hooked from start to finish.\n\nSo, here’s the deal: Teresa Palmer is an absolute powerhouse in this. She brings Gabby to life with a mix of vulnerability and strength that makes her super easy to root for. You can’t help but love her, and honestly, Palmer just radiates in every scene. Benjamin Walker? Not as big of a name, but he holds his own. There’s this quiet intensity he brings to Travis, and when he finally pours his heart out? Yeah, you feel it. It’s one of those performances that sneaks up on you.\n\nNow, let’s talk chemistry—because it’s all about that in these kinds of movies, right? Palmer and Walker totally sell it. From their flirty, awkward moments to those deep, emotional scenes, you can feel the sparks flying. It’s that kind of romance that has you saying, “Okay, I see you, Nicholas Sparks, I see what you’re doing here.”\n\nAnd just when you think it’s all smooth sailing, bam! The emotional rollercoaster kicks in, because of course, it’s a Sparks movie—there has to be a tear-jerking twist. Without giving too much away, Travis finds himself facing some pretty gut-wrenching decisions, and that’s where the film really hits its stride. You know the drama’s coming, but man, does it hit you hard when it does. You’ll be glued to your seat, tissues in hand, bracing yourself for the inevitable.\n\nSpecial shout-out to Tom Welling—who’s looking way more Superman than Clark Kent these days—and Tom Wilkinson, who plays Travis’ dad with the kind of gravitas only Wilkinson can deliver. And hey, South Carolina has never looked more gorgeous! The cinematography captures those sweeping landscapes so beautifully, it almost feels like a character in itself.\n\nAt the end of the day, The Choice knows exactly what it’s aiming for—and it nails it. It’s not out to reinvent the wheel, but it doesn’t have to. If you’re looking for a sweet, heartfelt romance with just enough drama to keep things interesting, this movie’s got you covered. It’s charming, it’s emotional, and it’s everything you want from a Nicholas Sparks adaptation. Go into it with your heart wide open, and you’ll walk away with all the feels.",
    "date": "2024-10-14"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "props to the lead actress for giving this horrible script her all.",
    "date": "2024-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Charming touching and heart felt. Beautiful photography too; makes me want to visit South Carolina.",
    "date": "2024-07-15"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "You know what you're feeling with a Sparks movie. Love the atmosphere, the characters and the story.",
    "date": "2024-03-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Out of the Nicholas Sparks films I have sat through so far, \"The Choice\" is easily the worst. Outside of just following a formula with forced sad events happening, the movie is also pretty boring. And even though it is boring, it is also a problem because the bedrock of the film's core romance is a result of cheating and dishonesty which makes it hard to root for the main couple. I will say I think the movie has some gorgeous scenic shots because of its setting but it was a chore to get through. I don't even think the movie is all that romantic and think genre fans deserve better. Overall, I think it's good February is over because after this movie I think I need a break from the Sparks cinematic universe.",
    "date": "2024-03-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Clichéd romance story, boy meets girl.",
    "date": "2024-03-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "This is my favorite movie ever anyone who rated it less than is trippin balls",
    "date": "2024-02-07"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "One of my favorite romantic comedies of all times. I must have seen it at least 8 times. It's not as corny as the Notebook. It is not an out of the ordinary story. This is what makes this movie good. A simple story. Beautiful talented actors. Easy dialogues. The proposal scene is epic. The last 15 minutes always put me into a coma. It's like there is a new story. And it's at odds with the light comedy genre. Hence a star off.",
    "date": "2023-12-04"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "After seeing the rating the critics gave this movie SURE tells me what type of person they are...Wonder WHY this movie is all over the the streams if it was like HOW they rated it.  SMH..",
    "date": "2023-10-25"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Not quite as predictable as a traditional Hallmark romantic movie. I was a surprised by the ending.",
    "date": "2023-08-20"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "I thought I watched a christian movie which tackles infedelity & a miracle waking up from a coma",
    "date": "2023-08-16"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The cheating woman trope wrapped in the romantic South. I didn't hate this one. Teresa Palmer and Benjamin Walker chemistry was interesting. Their stubbornness towards each other was adorable, but something was missing in their back and forth. I wasn't emotionally wrapped into this one, but it's not terrible.",
    "date": "2023-06-28"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "If you came here for beautiful scenery from North Carolina and a tear-jerking romantic plot, then you're in the right place.",
    "date": "2023-06-16"
  }
]