[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Good prequel to the first movie with an even more insane twist midway through that has the audience on their seat to see what will happen next.",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "ILOVE THIS MOVIE 🤩🎥👏👏 IS AWESOME 💯😎",
    "date": "2025-09-04"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I love the first movie, so I had to see this one as well. And it's good again. A beautifully told prequel, even filmed with the same actress. Some unanswered questions and key details from the first film are explained and complement the original very well. You also find out a lot more about Esther. There are again good twists and exciting moments. Since this is a prequel, the ending is of course predictable and you know how it will turn out if you've seen the first part. But that doesn’t make the film any less thrilling. Like the first part, as a horror film it isn’t very scary—more of a suspenseful mystery thriller and at times quite sad. I’m really positively surprised at how good this second part is.",
    "date": "2025-07-20"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Better than the original with a really fun new twist.",
    "date": "2025-06-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Girl the ending was so satisfying I had to lock in and left my cousin on FaceTime, imma need to see a part two cause the drama was going up!",
    "date": "2025-05-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Orphan: First Kill is a wonderfully hokey and batshit crazy follow-up to the original, especially once you get past its wild logical leaps and embrace its unique wavelength. While the premise of Isabelle Fuhrman reprising her role as a \"child\" now years older is a stretch, the film leans into its absurdity with a surprising twist that keeps things entertaining and delivers a deliciously deranged ride.",
    "date": "2025-05-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Una película que me quedo a deber mucho, una trama súper novelesca, donde el verdadero origen de la huérfana se siente tan vacío y con muchas expectativas",
    "date": "2025-04-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "The plot is actually good but the movie kinda looks cheap.",
    "date": "2025-03-25"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Dejando de lado la apariencia del personaje, la película es al menos es entretenida y lo que más me gustó al igual que su predecesora fue el giro que para nada te lo vez venir, en fin esta secuela no supera a la original pero es buena para pasar el rato.",
    "date": "2025-01-21"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "lixo lixo lixo lixo.",
    "date": "2025-01-08"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "While this is a prequel to the original Orphan film, I did not like this film because I do not feel there is enough of a horror component presented. While it is understandable to show the history of Esther through where she was before she got adopted, it just presented her as a psychotic murderer who was manipulative. That type of character can be seen in non-horror films. Isabelle Fuhrman nevertheless tried her best on the film, but I liked her in Orphan many miles more because in the first one, I felt the horror and the way she presented it in there was immaculate. In this one, I would consider more of a violent gore film between 2 equally insane characters.",
    "date": "2024-12-25"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "While not unentertaining,  this is a dumb film, full of plot holes and a truly unbelievable plot twist. I suppose the filmmakers are aware this is ridiculous beyond belief, and you will be too, if you make it beyond the crazy left turn this film takes.",
    "date": "2024-12-22"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Genuinely bad film. No idea how it scores in the 70s. The plot is completely preposterous (eg like they wouldn't do a DNA test) and full of terrible horror movie tropes that would have felt at home in the 80s. Acting was OK I guess, but this was awful compared to the first. The \"twist\" was initially interesting but they did nothing interesting with it and I nearly switched it off 10 mins from the end as it was so obvious what was going to happen (and so very frustrating to watch the stupidity on screen). Worst horror film of the year by a long margin.",
    "date": "2024-11-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The prequel that nobody wanted but was surprisingly fun. It tows the line between camp and serious",
    "date": "2024-11-03"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "This movie was super dumb with major plot holes",
    "date": "2024-10-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "First orphan movie I've watched.  A little skatty b.utt I enjoyed it. Read a little of my book b.utt 6.10.24 8.2/0. D.B.",
    "date": "2024-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I absolutely loved the original Orphan film so was excited to revisit the character in this prequel.\n\nAfter half an hour or so I was a tad underwhelmed as things felt fairly similar to that first film.\n\nHowever ... an absolutely deranged and outlandish twist sends things in a very bold direction which I thoroughly enjoyed. I was not expecting it at all and it made for a truly wild and intriguing second half of this film.\n\nI do think they could have played on this a little more and shortened the pre-twist antics to strengthen the post twist antics, but still, a real treat.\n\nThe de-aging technology or whatever they used worked really well on Isabella Fuhrman and didn't break the illusion at all. Julia Stiles was on fire in a very interesting role.\n\nOne criticism however is that for large sections of the film the picture had a smoky and murky quality which made certain sections seem out of focus and I really didn't enjoy this.\n\nOverall though this film is an absolute blast. Fans of the first Orphan film will love this I'm sure. Despite the fact that for a horror film its never particularly scary, the killer twist and deliciously deranged second half make for one hell of a ride.",
    "date": "2024-09-01"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "My word simply awful...terrible acting...plot holes aplenty and this recieved 71% positive reviews speaks volume of our current film expectations",
    "date": "2024-08-25"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "How on earth has this got 71% in 2024. Utterly terrible film, so many holes in the plot 🤦🏻‍♂️",
    "date": "2024-08-24"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "preposterous!  Didn't realise it was a prequel, but I won't be watching the first one!",
    "date": "2024-08-24"
  }
]