[
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Very well made movie for 2006.",
    "date": "2025-10-17"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Filme mais ou menos, o roteiro é fraco, as cenas são mais ou menos, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I shouldn't be emotional that one man (first responders or not) made it out alive. I should've been mourning the ENTIRE devastated city and its residents. Truly missed opportunity",
    "date": "2025-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Unbelievable what they went through. Glad to see how humans can come together.",
    "date": "2025-07-27"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A sentimental, visually stunning and very interesting mix of a disaster movie with a docudrama tribute to the real life tragedy by Oliver Stone. While some will feel like Nicolas Cage's and Michael Pena's performances were not utilized to it's fullest, as they spend the great majority of the movie lying in the dark under rubble, i sincerely disagree. Their performances are definetely one of the best things about this movie, and probably the only actual level of emotional this movie can get to someone that was not directly affected by 9/11, which is a big factor to consider while viewing this. The movie usually gets dragged down by Michael Shannon pointless and borderline tasteless character of Marine Seargent Dave Karnes, who bring nothing to the table other than to be the one guy who coincidentally spotted Officer Jimeno amongst the rubble, even though the movie could have easily just took a random guy to fill in the spot, and we would not have to sit through his needless background story. The family drama scenes also take a while to actually get good, but even then never reach the true level of emotion the movie actually wants to have. Despite all of this, World Trade Center still remains a inspirational and visually amazing tale of hope, fuelled by Oliver Stone immersive direction.",
    "date": "2025-07-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The film itself is unremarkable, with the most compelling aspect being the real story behind it. Unfortunately, such a story is inevitably constrained in adaptation, leaving most of the content between the beginning and the end unable to fully showcase the talents of Oliver Stone, Nicolas Cage, and the rest of the excellent cast.",
    "date": "2024-12-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Gut wrenching movie - it’s a very specific movie to the involvement of a couple guys - so don’t expect it to give you the full story. It’s amazing how much more of an emotional tug a movie can be when you know the real, full story.",
    "date": "2024-01-08"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "pretty damn cool however much of the movie is spent under the rubble with the protagonists. To be expected from a movie based on such an event but its not for everyone.",
    "date": "2024-01-04"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "I excpected it to be better.\nNic is ok but there are strong performances from Michael Peña and Maggie Gyllenhaal.\nThere are two good cameos and the setpieces are awasome.\nThe finale is one of the most satisfying I have ever seen.",
    "date": "2023-10-06"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I thought I was excellent..Nicholas Cage was great!",
    "date": "2023-09-20"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "While not as powerful as fellow 9/11 film United 93, World Trade Center is still a poignant drama with great performances from its actors and mercifully avoiding any \"inside job\" conspiracy theories given who the director is. I think the pacing would've been better if they kept the focus solely on these two police officers trapped in the WTC's wreckage (good job on I'm guessing a combination of production designers and VFX artists for how they designed its remains like something straight out of a post-apocalyptic film...which I suppose IRL it essentially was; I know some people who were half asleep and when they saw it on the news mistook it for a movie clip) and the attempts made to rescue them. But all in all, this is still a decent film that does a good job paying its respects to the victims of one of the most shocking terrorist attacks in history, even if I still prefer the aforementioned United 93's docudrama approach rather than this film's more conventional narrative structure.",
    "date": "2023-09-12"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Pretty good acting even though I'm not a Cage fan obviously the story line was there and didn't deviate from history and showed some street level things we may not have known good movie better than most thank you",
    "date": "2023-04-29"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "Nice tribute but not a great movie. Too motionless. Good acting",
    "date": "2022-12-12"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "A well done depiction of the events of 9/11, though it felt a bit loose in it's structure for an event so tense.",
    "date": "2022-08-22"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Simply awful. Cage at his typical worst hammy performance. Such a pity - a wonderful story that wasn't respected enough to get decent writers, director, or lead actor for.",
    "date": "2022-05-03"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A touching film about tragedy. However quick cuts between settings does not allow for the story to ever settle in before switching.",
    "date": "2022-04-07"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "I think had this movie been made later on, with more information and footage, it could've felt more like a 9/11 portrayal and less like just a standard heroic story.",
    "date": "2022-02-11"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Introduzione interessante, senza troppi fronzoli e per nulla teatrale; la prima parte di sviluppo è di qualità e senza dubbio la migliore dell'intero film.\nPurtroppo la scelta di Oliver Stone di dare un'impronta ottimista e positiva al film si rivela un'arma a doppio taglio, specialmente perchè a fronte di alcuni monologhi e scene di buoni sentimenti, vengono totalmente ignorati i personaggi che perdono la vita, le cui famiglie non sono mai considerate nel film.\nQuindi sorge spontanea la domanda, perchè tralasciare quasi totalmente questo aspetto?",
    "date": "2021-09-25"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Nice Depiction of just a few story elements on 911 that were put into this Film. Not everything. But serviceable enough to give a point of view, of this tragic event.",
    "date": "2021-09-11"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "I bumped into this on Netflix recently, and, reading the brief overview of it thought it might be worth watching.\nOh dear.....\nIt could have been a far better film if it hadn't focussed so much on one single squad.  I've read a lot of accounts of folks escaping from the towers, and of the mayhem, the tragedy, and the whole intensity of those few hours. All of that is missing.\n\nIts great up to the point of them being trapped under the rubble of the first collapse, then it just stops in its tracks and does nothing.\n\nI stopped the fim at that point, but went back to it a few days later, and tried to plow on. Yep, they missed a good trick there. Sorry, but there are better ways to do this sort of film....",
    "date": "2021-09-11"
  }
]