[
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "You dare play that Miley Cyrus song in my presence?! I expected better, Dog Man! I found it annoying when it was still new and its overexposure back in 2023 made me hate it even more. But I'm getting off-topic before I've even gone on-topic. This sorta-spin-off of the Captain Underpants movie is pretty fun. Vibrant animation that does a good job translating Dav Pilkey's art style to 3D (though I think it was executed better in that First Epic Movie; for whatever reason, the Spider-Verse approach towards framerates didn't really do it for me here), quite a good chunk of visual gags and some surprisingly good character arcs. Let's be honest, Pete Davidson and his clone son are the real stars of the show here. Dog Man himself is a likeable character but it's Petey who's getting the lion's share of character development. One moment near the ending is particularly powerful and can come off as providing reassurance to any insecure parents, fathers especially. It seems DreamWorks really had their minds focused on parenthood seeing how this film came out barely a few months after The Wild Robot. Of course, Dog Man doesn't reach the same heights as that film but I don't think it's trying to be, and not simply because this was made by a different team who might not have been aware of what Chris Sanders and his crew were cooking up. This isn't going to set the world on fire but Dav Pilkey fans are still likely to enjoy what is essentially another instance of \"books in movie form\" whilst those unfamiliar still get an entertaining action-comedy that's not afraid to embrace silliness, and is probably all the better for it.",
    "date": "2025-11-29"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "Me: I can see why this series is TreeHouse Inc's second most loved book serise next to Captain Underpants for what it's worth for all honesty \nStory: 5/10\nAnimation: 10/10\nCharacters: 4/10\nOverall: 6/10",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "this movie was good,not bad",
    "date": "2025-11-28"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Dog Man is a silly film with cute cartoon designs taken straight from the books one-to-one. Akin to its written works, the movie follows a wacky plot with simple characters and development. This is a fun movie for all ages and is another good addition to DreamWorks' adaptation list.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A DESPERCEBIDA e BOA animação da DreamWorks! \n\nQue nos traz uma adaptação muito fidedigna com seu material original, um bom humor de modo geral (mas nem sempre, pois ainda é uma animação infantil), um ritmo BEM FRENÉTICO (não no sentido ruim, bem condizente com seu universo), e também leves e sutis mensagens e reflexões sobre perdão, gratidão, e paternidade.\n\nMas.. com seus coadjuvantes sendo muito mais interessantes que o próprio personagem principal.",
    "date": "2025-11-22"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "A fun, energetic adaptation that kids will love — but it only occasionally rises above its simple origins. Enjoyable in bursts, but not especially memorable.",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "A delightful, exciting, colorful, and surprisingly heartfelt story that is great fun for the whole family.",
    "date": "2025-11-19"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Spectacular film for kids and adults. The films not afraid of it's stupid humour allowing it to thrive but also managing to keep serious unique themes in there to interest kids and adults alike. Essentially shows a child of divorce dealing with co parenting. Incredibly sweet and humorous film",
    "date": "2025-11-11"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "I didn’t really find the jokes funny and I think this film is really overrated",
    "date": "2025-11-06"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "My favorite movie and based on my favorite comic I REALLY RECOMMEND IT! Don't forget to subscribe Lambman butcher Studios on YouTube and follow on titktok",
    "date": "2025-10-31"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I recommend this movie to any kid to watch it",
    "date": "2025-10-29"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "World's greatest supa movie",
    "date": "2025-10-26"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "This animated movie was great. Pete Davidson, Peter Hastings, Lucas Hopkins Calderon, Lil Rey Howery, Isla Fisher, Ricky Gervais, and the rest of the cast did a great job in this movie. The story of the movie was entertaining and humorous. It's about a cop who is half man half dog taking down a bad cat. If you haven't seen this movie yet, check it out sometime. It's a great movie for an entire family.",
    "date": "2025-10-22"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "I am a die hard Dog Man fan, and this movie does not disappoint. At its face this movie is a comedy, but I like that this movie does get more into the tragedy of Dog Man and it doesn't sugarcoat Petey's backstory. It would be 5 stars but I do have a few nitpicks, mainly I feel like flippy was just kind of shoved in at the end to finish off Dog Man and Petey's arcs, but overall a very good and super fun movie",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "THIS MOVIE IS PEAK PERFECTION",
    "date": "2025-10-13"
  },
  {
    "user": "Anonymous",
    "rating": 3.0,
    "text": "The movie fine but it's nothing like the books.If they were going to do an adaptation, they should have just done a show that would have made them a lot more money.Well, you're probably a lot more greedy and since they're a big corporation illumination could have made a lot more money if they just made a show that was based off the books and the movie could have just been some like crappie spin-off. And this is a very poor way and terrible way to remake dog man, because it is one of my favorite book series. While I was in elementary",
    "date": "2025-10-05"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "Best Dreamworks movie ever 🐶",
    "date": "2025-10-04"
  },
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "HORRIBLE DIDN’T UNDERSTAND THE CONCEPT OF THE MOVIE WASTE OF MY TIME DON’T RECOMMEND AT ALL …",
    "date": "2025-09-28"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "No, just no. Maybe if you’re six years old",
    "date": "2025-09-21"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "Not bad for a film adaptation, but it could be a bit better, but other than that, it's pretty damn good.",
    "date": "2025-09-06"
  }
]