[
  {
    "user": "Anonymous",
    "rating": 1.0,
    "text": "Slow moving and boring.  Not DeNiro’s finest",
    "date": "2025-11-30"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I really enjoyed this.  It's  a feel good story with humor, plot and good actors.  A really sweet movie.",
    "date": "2025-11-17"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "Great movie! Robert DeNiro and Anne Hathaway were spectacular.",
    "date": "2025-11-14"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "La trama es buena pero es un poco lenta y larga",
    "date": "2025-11-10"
  },
  {
    "user": "Anonymous",
    "rating": 0.5,
    "text": "Filme fraco, o roteiro é fraco, as cenas são fracas, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
    "date": "2025-10-27"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "This very comfortable, friendly movie was a surprise gem. I'm a senior and that's probably part of it, but I have to think most people will like this, regardless of age. Enjoy!",
    "date": "2025-10-24"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "Pros: The dynamic, real sense of \"stakes\", and connection was great from an acting perspective. Here, it is a good study for theater and film. The problem with this movie is not with the actors so much as it is with script content. True, it is not easy being a CEO, but the script made accommodations for an otherwise persnickety protagonist (Jules) with behavior that is very much on the border if not crossing the border of being toxic in a world where we too often accept such behavior of \"leaders of business\" because of their \"genius\" (whatever that means). Had this film not had that as a big part of the character, it might have been better. Film does point out the problems, though, of too many people trying to please others for acceptance. We as a collective need to start doing less of this and be more of our true selves without this big need of making someone accept us whether it be a king or a peasant: we all sleep, eat, and potty the same way except maybe some do on gold seats.",
    "date": "2025-10-21"
  },
  {
    "user": "Anonymous",
    "rating": 4.5,
    "text": "I thought this was a great movie. Clean language for the most part, and a fun, relaxing way to spend an evening, not taking anything seriously!! Great Plot too!!",
    "date": "2025-09-19"
  },
  {
    "user": "Anonymous",
    "rating": 1.5,
    "text": "Comedy turning into a Drama.",
    "date": "2025-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "74%. 7/30/25. Hadn't seen rating. Enjoyed the film. Cute story about De Niro's character starting an intern role at a very typical tech start up from the time period and bringing his old-school nature to the company and getitng to know Jules, the founder, and providing her value as the company wants her to hire a CEO. Liked seeing their dynamic develop and them grow closer. Light, easy watch. Anders and Levine's characters are funny - Anders especially as the stay at home dad. 4/5 rewatch",
    "date": "2025-08-01"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I found myself smiling at various parts of this movie.  It was a break from the real world—I felt so relaxed watching it. I sincerely recommend it!",
    "date": "2025-07-30"
  },
  {
    "user": "Anonymous",
    "rating": 2.0,
    "text": "The characters needed more. More dialogue that taught us about them, more scenes that taught as about them, more development. Jules and Ben are not much more than their surface descriptions at the end of the movie. We dont get to learn much about Ben at all, and while Anne Hathaways's performance was incredible, the script gave her little too work with. \n\nBen has experience. This is a defining aspect of his character, if not his entire character, but the movie takes it nowhere. There are no significant moments where his unique perspective on life makes an impact on anyone else, and there where many opportunities for something like that. \n\nJules was interesting, but her dialogue still leaves the audience quesitoning, as if her story isn't fully realized.\n\nIt has potential. There are scenes where you can feel the heart and care put into this movie. The movie would come out to entertaining and mildly mediocre if it werent for the ending, where the most conflict that is presented in the movie is resolved in an absurd and unsatisfying way that contridicts its own message.\n\nJules is struggling with a man who cannot handle her success, and considers giving up her own company in a bid to save her marriage. The decision to keep the company reflects the idea that she is choosing herself over her husbands pride, and provides a nice, clean ending with all loose ends taken care of. Only for her to get back together with him in the end. This implies that he had nothing to do with the decision to find a new CEO in the first place, and makes the thesis of the movie muddled and confused.",
    "date": "2025-07-29"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "A fun movie to enjoy. Clever premise.",
    "date": "2025-07-23"
  },
  {
    "user": "Anonymous",
    "rating": 4.0,
    "text": "Not usually my type of flick, and definitely of the lighter fare, but I genuinely enjoyed it.",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "That ending!!! How disgusting! What just happened... ahhh... The movie is good... it represents well everything it proposes and I see that it is about how to continue life and stop worrying, it is relaxing and refreshing. But why does she forgive her husband?... She was going to lose everything for someone who is not worth it, do not misinterpret if I know that he helped her start the company taking care of the daughter they both have (something that is the responsibility of both the father and the mother... but he got over it), it is also true that... I don't know what else he did? There is the problem, there is nothing good about it... it is disappointing, it breaks its own message and it has a bittersweet taste but more bitter than sweet... if I watch it again maybe I will skip the ending.",
    "date": "2025-07-19"
  },
  {
    "user": "Anonymous",
    "rating": 2.5,
    "text": "The story line and scenes felt forced and predictable.",
    "date": "2025-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "De Niro is so charming and heart warming in this movie. Do you found yourself feeling bad about how your life is going? Watch him, and it will fill your heart with warm, hope in life, that can be found in true friendship and caring for others! He is amazing in this character!!!",
    "date": "2025-07-17"
  },
  {
    "user": "Anonymous",
    "rating": 3.5,
    "text": "In a cinematic landscape often crowded with overcomplicated plots and forced sentimentality, The Intern stands out for its simple, heartfelt narrative and surprisingly profound emotional core. Robert De Niro’s portrayal is nothing short of beautiful. What I appreciated most was how easy this film was to watch. Not in a mindless way, but in the sense that every scene felt natural, every line believable. There was no cheesy dialogue, no over-the-top emotional manipulation, Just genuine moments. The Intern is more than just a feel-good movie. It's a gentle reminder that our value doesn't disappear with age, that kindness still matters in the workplace, and that real mentorship is a two-way street.",
    "date": "2025-07-16"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "The trailer, and general endorsement of this film, may put you under the illusion that this is a film manoeuvred for cheap chuckles through the comedic experiences of a 70-year-old intern. \n\nInstead, you get one of the best feel-good movies ever! \nThe actual dynamic of the retired-intern is only used at the start. Instead, the story revolves around relationships between characters. \n\nIt sounds cliche, but this film will quite literally have you laughing to crying in the duration of the film. It’s perfect.  \n\nIt’s hard to put into words. It’s an absolute hidden gem. A must watch. 🍿",
    "date": "2025-07-14"
  },
  {
    "user": "Anonymous",
    "rating": 5.0,
    "text": "I only decided to watch because DeNiro is in it, and I’ve never watch a bad movie that he was in. This movie was so much better than I expected. I loved it.",
    "date": "2025-07-08"
  }
]